{
  "totalProducts": 131,
  "products": [
    {
      "id": "B0DDRLX7V4",
      "name": "HTC Vive Focus Vision — Mixed Reality and PC VR Headset + Controllers — Consumer Edition",
      "ratings": 34,
      "price": "$999.00",
      "image": "https://m.media-amazon.com/images/I/61NAu5qJiuL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "All-In-One VR Solution: The VIVE Focus Vision offers standalone and PC VR experiences. Harness the power of virtual reality with high-resolution displays, versatile tracking features, and immersive applications. Base station-free.     PC VR Gaming Headset: Immerse yourself in low-latency VIVEPORT andSteamVR gameplay. DisplayPort mode delivers lossless, high-fidelity visuals straight from your PC.(1)     Make Interactions Real: Connect in VRChat like never before. With built-in eye tracking and low-light hand tracking; plus face and body tracker support, movement in VR is intuitive and lifelike.(2)(3)     Immersive 5k Headset Display: The immersive display puts you right at the heart of the action with a 5K resolution of 2448 x 2448 pixels per eye, up to 120° field of view, and 90 Hz refresh rate.     Personalize Your Fit: Auto-IPD adjustment aligns the XR headset's lenses with the centers of your pupils, giving your eyes the clearest, most comfortable viewing experience.(4)     3D Spatial Audio: Hearing is believing. Get 3D audio with open-back, dual-driver speakers that minimize sound leakage, noise- and echo-cancelling mics, and a 3.5 mm audio jack.     Mixed Reality Environment: Scene understanding powered by a depth sensor lets you virtually interact with physical objects and surfaces in your environment.(5)",
      "details": {
        "brand": "HTC",
        "operatingSystem": "Windows",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "VIVE Focus Vision",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "Wi-Fi, USB, DisplayPort Mode compatible",
        "color": "Black",
        "ram": "N/A",
        "detail_item": "All-In-One VR Solution: The VIVE Focus Vision offers standalone and PC VR experiences. Harness the power of virtual reality with high-resolution displays, versatile tracking features, and immersive applications. Base station-free."
      }
    },
    {
      "id": "B0DDK1WM9K",
      "name": "Meta Quest 3S 128GB — Get Batman: Arkham Shadow and a 3-Month Trial of Meta Quest+ Included — All-in-One Headset",
      "ratings": 218,
      "price": "$37.99",
      "image": "https://m.media-amazon.com/images/I/416u-AxaIYL._SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Transform your reality and do everything you love in totally new ways. Welcome to Meta Quest 3S. Now you can get the Batman: Arkham Shadow* and a 3-month trial of Meta Quest+** (a combined $70 value) with purchase. Batman: Arkham Shadow available to play 10/22.     Explore thousands of unreal experiences with mixed reality, where you can blend digital objects into the room around you or dial up the immersion in VR.     Have more fun with friends in Quest. Whether you’re stepping into an immersive game with people from around the world, watching a live concert together in Meta Horizon or inviting everyone over to cast your play onto the TV.     Multi-tasking has never been this easy. Pull up multiple screens at once to browse the web, watch YouTube and direct message with friends — all while keeping your room in view.     Turn any room into your own personal theater. Dim the space around you and play shows and movies on a giant vibrant screen.     Access social media apps like WhatsApp, Instagram and Facebook Messenger so you can play while you stay in the group chat.     Move with ultimate wireless freedom and lightweight comfort when you get your heart pumping in virtual workouts or use your whole body to bust ghosts in your living room.",
      "details": {
        "brand": "N/A",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "Transform your reality and do everything you love in totally new ways. Welcome to Meta Quest 3S. Now you can get the Batman: Arkham Shadow* and a 3-month trial of Meta Quest+** (a combined $70 value) with purchase. Batman: Arkham Shadow available to play 10/22."
      }
    },
    {
      "id": "B0C8VKH1ZH",
      "name": "Meta Quest 3 128GB— Breakthrough Mixed Reality Headset — Powerful Performance",
      "ratings": 6.292,
      "price": "$449.99",
      "image": "https://m.media-amazon.com/images/I/31ImJ1TU01L._SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Dive into extraordinary experiences with a mixed reality headset that transforms your home into an exciting new playground, where virtual elements blend into your actual surroundings.     It’s the most powerful Quest yet*, featuring next-level performance with more than double the graphic processing power of Quest 2. (*Based on the graphic performance of the Snapdragon XR2 Gen 2 vs Meta Quest 2.)     Experience more immersion with dazzling visuals with the 4K+ Infinite Display (a nearly 30% leap in resolution from Quest 2) and rich 3D audio with enhanced sound clarity, bass performance and a 40% louder volume range than Quest 2     Reach out and touch virtual worlds with Touch Plus controllers that give you fine-tuned precision, realistic sensations and more intuitive interactions. You can even navigate without controllers with Direct Touch that follows your gestures, so you can use just your hands to find your way.     Explore the world’s best library of 500+ immersive apps and find your favorite content across gaming, fitness, wellness, entertainment, social experiences and more.     Get up to 2.2 hours of usage on average with the option to extend your battery life further with Battery Saver mode. Use the included 18W power adapter to fully charge your headset.* (*Battery life is dependent on various factors such as device settings, usage, age of battery, Bluetooth usage, and wireless conditions.)     Play what you love longer with maximum comfort. Personalize your fit with added customization and a redesigned slimmer profile compared to Quest 2.",
      "details": {
        "brand": "N/A",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "Dive into extraordinary experiences with a mixed reality headset that transforms your home into an exciting new playground, where virtual elements blend into your actual surroundings."
      }
    },
    {
      "id": "B07Y5NNP2B",
      "name": "HTC Vive Pro Focus Plus 6DOF VR Headset in Almond White Bundle Including VR Headset, Controllers, face Cushion, QC 3.0 Charger and USB Type-C Cable",
      "ratings": 17,
      "price": "$199.99",
      "image": "https://m.media-amazon.com/images/I/51vryWzoXYL.__AC_SY300_SX300_QL70_FMwebp_.jpg",
      "description": "",
      "details": {
        "brand": "HTC",
        "operatingSystem": "Windows 10",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "focus,vive",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "USB",
        "color": "White",
        "ram": "N/A",
        "detail_item": "N/A"
      }
    },
    {
      "id": "B0DF2LPZL3",
      "name": "VR Headset for Nintendo Switch & OLED Model Upgraded, Virtual Reality VR Glasses with Adjustable HD Lenses Comfortable Head Strap, 3D Goggles for Nintendo Switch OLED VR Games Cool Stuff for Kids Boys",
      "ratings": 11,
      "price": "$32.99",
      "image": "https://m.media-amazon.com/images/I/41irPS5r4ML._SY430_SX215_QL70_FMwebp_.jpg",
      "description": "【Fully Upgraded VR Glasses】This VR headset for Nintendo Switch / OLED Model has been upgraded adjustable lenses that increase the window of view by 20% and provide greater clarity. You can easily adjust the VR glasses left, right, front and rear to ensure perfect image alignment and an immersive visual experience. Free up your hands and let enjoying the virtual world to the fullest.     【Switch Professional Design】The upgraded Switch VR headset is compatible with Nintendo Switch and Nintendo Switch OLED versions, (Not for Switch lite version). HD standalone lens perfectly shows the true colors of the Switch screen. When you use it, we recommend you to remove the joystick, because it will be lighter and better meet your needs!     【Support Certain VR Games 】Our Switch VR headset only supports Super Smash Bros, Zelda, Super Mario Odyssey, Captain Toad, Five Nights at Freddy's, The Legend of Zelda: Tears of the Kingdom and Treasure Tracker in VR Mode (please upgrade to the highest version) or any other Switch VR game, and you can also watch VR videos on YouTube through your Switch. The perfect gift for family or friends who love Switch games. Note: Switch console is not included in the package.     【Quality Material】The VR goggles for Switch and Switch OLED are made of EVA and Polyester Lycra material, which is super lightweight and durable, releasing pressure while playing VR games. The elastic and soft headband can hold the VR goggles firmly on your head when you move, no need to worry about the headset falling off.     【Size Comfortable Fit】These VR glasses are made with a precise face fit and ergonomics to ensure comfortable wearing. Glass-friendly VR switch goggles are available even if you wear nearsighted glasses.",
      "details": {
        "brand": "N/A",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "【Fully Upgraded VR Glasses】This VR headset for Nintendo Switch / OLED Model has been upgraded adjustable lenses that increase the window of view by 20% and provide greater clarity. You can easily adjust the VR glasses left, right, front and rear to ensure perfect image alignment and an immersive visual experience. Free up your hands and let enjoying the virtual world to the fullest."
      }
    },
    {
      "id": "B0CHVQWW4P",
      "name": "XREAL Air 2 Pro AR Glasses|46° FOV, 130\" 120Hz HD Display, True Colors, Cinematic Sound, All-Day Comfort. Compatible with iPhone 16/15, Steam Deck, ROG, Mac, PC, Android & iOS",
      "ratings": 762,
      "price": "$419.00",
      "image": "https://m.media-amazon.com/images/I/319VbTVkXrL._SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Immersive Visuals, Zero Latency: Experience unparalleled clarity with XREAL Air 2 Pro, powered by SONY Micro-OLED panels. Enjoy industry-leading visuals with a 46° Field of View and a 120Hz refresh rate, delivering an astonishing visual experience right out of the box.     True-to-Life Colors, Crisp and Vivid: Each pair of glasses undergoes precise color calibration to ensure exceptional color accuracy with no distortion. Witness stunningly accurate and vibrant colors as if they were right in front of you.     Personal Cinema, Anywhere, Anytime: With 3 adjustable dimming levels, the one-touch Immersion Control button makes it easy to use the glasses in any lighting condition, whether indoors or outdoors.     Cinematic Sound: Directional Audio technology minimizes sound dispersion, ensuring privacy and reducing disturbances while delivering clear, immersive sound.     Unlock Spatial Display with XREAL Beam Pro: Pair your XREAL Air 2 Pro with XREAL Beam Pro to enjoy millions of 2D apps in a 3D space, expanding your spatial experience like never before.     All-Day Comfort, Zero Pressure, No Neck Pain: Designed with 1:1 weight distribution to significantly reduce pressure on your head and nose. Comes with zero-pressure nose pads in various sizes and a three-level temple adjustment for a perfect fit.     Flicker-Free, No Fatigue, Avoid Visual Damage from Myopia Adjustments: TÜV Rheinland Certified for Eye Comfort and Low Blue-Light, XREAL Air 2 Pro AR comes with prescription lens inserts (additional purchase), ensuring no headaches, no eye strain, and no myopia adjustments.     Plug and Play, Expanded Compatibility: Effortlessly connect to any device with USB-C video output, including iPhone 16/15, iPad, select Android smartphones, Steam Deck, ROG Ally, MacBook, Windows PCs, and more.",
      "details": {
        "brand": "N/A",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "Immersive Visuals, Zero Latency: Experience unparalleled clarity with XREAL Air 2 Pro, powered by SONY Micro-OLED panels. Enjoy industry-leading visuals with a 46° Field of View and a 120Hz refresh rate, delivering an astonishing visual experience right out of the box."
      }
    },
    {
      "id": "B0CKXXTH8R",
      "name": "TactSuit X40 - Immersive Haptic Vest for VR Gaming with 40 Feedback Motors, Supports Meta Quest, PS VR2, Steam VR, Audio-to-Haptics, Bluetooth & Wired Connectivity",
      "ratings": 31,
      "price": "$529.00",
      "image": "https://m.media-amazon.com/images/I/61epDrBN28S.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "40 Feedback Points - Experience powerful and sophisticated sensations delivered by 40 individually controllable feedback motors.     VR-Ready Haptic Suit - TactSuit is the only haptic suit that has been integrated into VR games. Enjoy fully immersive VR experiences with more than 250 VR titles.     Cross Platform Support via Dual Connectivity - TactSuit X40 can be connected to almost all devices via Bluetooth or audio jack. Enjoy the wireless freedom via Bluetooth pairing with PC, PC VR, and standalone VR. *Some devices support wired connection only.     One-Size-Fits-All - TactSuit X40 comes in one size, but it is designed to fit different shapes and sizes. Adjust the size using shoulder snap buttons and side straps for a perfect fit.",
      "details": {
        "brand": "bHaptics",
        "operatingSystem": "Windows 10, Windows 11, Oculus (specific to Oculus Quest 2), SteamVR",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "Bluetooth, Auxiliary",
        "color": "Black",
        "ram": "N/A",
        "detail_item": "40 Feedback Points - Experience powerful and sophisticated sensations delivered by 40 individually controllable feedback motors."
      }
    },
    {
      "id": "B0CBRLXHHF",
      "name": "Bioherm Charging Dock for Oculus Quest 2, Magnetic Charging Station for Meta Quest 2 VR Headset & Controllers, with 2 Rechargeable 2100mAh Batteries, USB-C Charger and Cable, Supports LED Indicator",
      "ratings": 582,
      "price": "$49.99",
      "image": "https://m.media-amazon.com/images/I/41i7TpIH-dL._SY430_SX215_QL70_FMwebp_.jpg",
      "description": "Simultaneously Charge Headset and 2 Controllers: Our magnetic rechargeable charging dock is specifically designed for elite gamers. The VR charging station for Quest 2 allows you to conveniently charge your headset and touch controllers at the same time. With a stable and safe charging mode, it only takes 4-5h to fully charge both the headset and controller.     LED Indicators and Easy Sleep Function: We have designed LED lights on our VR Charging Dock to indicate the charging status of the headset and touch controllers. The dock is blue when charging and turns green when fully charged. Additionally, we have included an adjustment button in the middle that allows you to easily turn off the indicator lights.     Save Money and Be Environmentally Friendly: Our charging dock for meta quest 2 includes controller covers and 2 custom rechargeable batteries that can be used over 1000 times. This not only saves you money from constantly replacing batteries but also promotes a more environmentally friendly approach. Reusable batteries are not only cost-effective but also safer for the environment.     Neat and Organized Gaming Setup: Keep your playroom clean and organized with our VR charging dock station. It provides a dedicated space to store your headset and touch controllers, ensuring they are always within reach and ready for your gaming sessions. Say goodbye to tangled wires and cluttered gaming areas.     All-in-One Set for Your Convenience: Our package includes everything you need to enhance your Quest 2 gaming experience. You will receive 1 Charging Dock for Quest 2, 4 magnetic USB-C headset connector, 2 rechargeable 2100mAh batteries, 1 USB-C adapter, 2 battery covers, and a welcome guide.PlayStation 5 Storage",
      "details": {
        "brand": "N/A",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "Simultaneously Charge Headset and 2 Controllers: Our magnetic rechargeable charging dock is specifically designed for elite gamers. The VR charging station for Quest 2 allows you to conveniently charge your headset and touch controllers at the same time. With a stable and safe charging mode, it only takes 4-5h to fully charge both the headset and controller."
      }
    },
    {
      "id": "B0CJT9JZ5K",
      "name": "Let's Explore VR Headset for Kids - STEM Gift Box | A Virtual Reality Family Friendly Adventure | Explore Wildlife with VR Headset for Phone",
      "ratings": 48,
      "price": "$99.99",
      "image": "https://m.media-amazon.com/images/I/81Ou3rHE4yL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "EXPLORE, DISCOVER & LEARN WITH LET'S EXPLORE WILDLIFE: Fully Immersive, 360 Degree, Virtual Reality, Educational Experience VR glasses. For Kids and Adults of all ages. Everything you need to explore nature and travel back to a prehistoric age without leaving your room. Pack includes a VR headset for phone, Magical Holographic Cube, watch it come to life in your hands with amazing Augmented Reality. Pack includes Full-Colour fact book, Sticker Book, Giant Poster, and Dinosaur Model.     SO REAL YOU WILL BELIEVE YOU ARE ACTUALLY THERE: Enter an immersive world of exploration and discovery with this virtual reality headset. Go on Safari, take a white water adventure, or why not travel back thousands of years to a time when Dinosaurs roamed our planet? With 16 amazing virtual reality experiences to enjoy, you’ll be entertained, educated, and amazed with our Let’s Explore Wildlife VR set.     WATCH THE HOLOGRAPHIC COME TO LIFE IN YOUR HANDS: Simply point your smartphone at our magical holographic cube and watch it come to life. Learn about creatures of the deep as you go on an immersive learning experience like no other. Proven to deliver five times the learning power of reading, this Augmented Reality Cube is sure to be a winner for parents and children alike. Each VR headset pack comes complete with 16 Augmented Reality Experiences.     16 INCREDIBLE VIRTUAL REALITY ADVENTURES: Go on a Safari in Africa and get up close and personal with Penguins, Big Cats, and more. Hold on to your stomach as you take a trip down the rapids on a White Water Safari. Travel back to prehistoric times as you come face to face with a T-Rex. With 16 amazing VR experiences to enjoy this pack is guaranteed to take you on an immersive journey like no other     VIRTUAL REALITY GOGGLES POWERED BY YOUR SMARTPHONE: The latest generation cell phone virtual reality (VR) Headsets are smart, comfy, and easy to use, complete with a fully adjustable headband. Compatible with - Minimum version of Android Android 10 or above / 2GHz CPU or faster / 2GB Memory or more. Minimum version of iOS iPhone 8 with iOS 11 software or above. Family-Friendly Educational Experiences for Ages 7+",
      "details": {
        "brand": "Let's Explore Oceans",
        "operatingSystem": "Android 10 or iOS 11 or later",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "LE-2024-WL",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "USB or other smartphone-compatible connection",
        "color": "Black",
        "ram": "N/A",
        "detail_item": "EXPLORE, DISCOVER & LEARN WITH LET'S EXPLORE WILDLIFE: Fully Immersive, 360 Degree, Virtual Reality, Educational Experience VR glasses. For Kids and Adults of all ages. Everything you need to explore nature and travel back to a prehistoric age without leaving your room. Pack includes a VR headset for phone, Magical Holographic Cube, watch it come to life in your hands with amazing Augmented Reality. Pack includes Full-Colour fact book, Sticker Book, Giant Poster, and Dinosaur Model."
      }
    },
    {
      "id": "B07HNW68ZC",
      "name": "Oculus Quest All-in-one VR Gaming Headset – 64GB",
      "ratings": 9.543,
      "price": "$449.00",
      "image": "https://m.media-amazon.com/images/I/31pEe2taIPL._SY300_SX300_QL70_FMwebp_.jpg",
      "description": "All-in-one VR: Simply set up the device with your Oculus mobile app and Oculus Quest has everything you need to explore VR, right out of the box     Insight tracking: Oculus Insight tracking system instantly reflects your movements in VR without the need for any external accessories     Touch controllers: Oculus Touch controllers precisely recreate your hands, their gestures and interactions, so every game is real enough to reach out and touch     Beyond room-scale: Oculus Quest works with your environment, so you can play standing or sitting, in spaces big or small     Oculus Quest requires your Facebook account to log in, making it easy to meet up with friends in VR and discover communities around the world.",
      "details": {
        "brand": "N/A",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "All-in-one VR: Simply set up the device with your Oculus mobile app and Oculus Quest has everything you need to explore VR, right out of the box"
      }
    },
    {
      "id": "B0DCG3G2X4",
      "name": "Fast VR Charging Dock for Meta Oculus Quest 3: LED Quest Charging Station for Oculus 2 Aceesories - RGB Controller Stand with 4 Rechargeable Batteries",
      "ratings": 22,
      "price": "$59.99",
      "image": "https://m.media-amazon.com/images/I/71AUD34gjTL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "【RGB Charger for Oculus Quest 3/2 Aceesories 】 Easy to charge Quest 3 or Quest 2 headset and 2pcs rechargeable 1100mAh batteries of Touch Controllers simultaneously, and store 2pcs batteries and hold two touch controllers (Don’t charger controller directly)     【Lightning Speed Charger】Fully charged batteries can last about 25+ hours of play time. Rechargeable 1100mAh controllers’ batteries save you from endless battery replacement, saving your money. Came with 15W USB-C charger adapter, Solid charging dock fully charge your VR headset about 3 hours and 4pcs Touch Controllers’ battery about 4 hours (If one battery charge need 2H)     【2 LED Ambient Light Modes】There are 2 Cool LED ambient light modes: ①Multi-Color Breathing Light ②Red solid Light. A touch button easy to turn on/off the led light. Its stylish design and colored lights add a sleek aesthetic to your VR display     【Clear LED Indicators】Built-in intelligent protection chip with over-charge protection. Headset Charging: Solid Red ambient Light, Fully Charged/Standby:-Multi-Color Breathing ambient Light. Battery charging: indicator red light, fully charged: Green light, Standby: light off     【What You Get】Package includes: 1 x charging station for Oculus 3/2, 4 x Rechargeable Batteries, 1 x USB A to USB C Cable, 1 x 15W charger adapter cable, 1 x User Manual. (Note:The 15W USB-C Charging adapter is included. Controllers don't wireless charge, the stand only hold touch controllers )",
      "details": {
        "brand": "Svetaecho",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "USB",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "【RGB Charger for Oculus Quest 3/2 Aceesories 】 Easy to charge Quest 3 or Quest 2 headset and 2pcs rechargeable 1100mAh batteries of Touch Controllers simultaneously, and store 2pcs batteries and hold two touch controllers (Don’t charger controller directly)"
      }
    },
    {
      "id": "B0B2WDLQQP",
      "name": "Sony Playstation VR Marvel's Iron Man Bundle, White: Playstation VR Headset, Camera, 2 Move Motion Controllers, VR Digital Code for PS4 PS5",
      "ratings": 186,
      "price": "$210.99",
      "image": "https://m.media-amazon.com/images/I/71OVwWVSjTL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Become Iron Man with the Sony PlayStation VR Marvel's Iron Man VR Bundle. This bundle comes with a PlayStation VR headset, a PlayStation Camera, and two PlayStation Move motion controllers.     Pop in the included Marvel's Iron Man VR game disc into your PlayStation 4 console and put on the VR headset to become Iron Man. Use the PlayStation Move motion controllers to virtually replicate the Repulsor Jets that Iron Man uses and take to the skies. Battle Iron Man's foes, then go back to Tony Stark's garage to upgrade your armor and abilities.     Don the PlayStation VR headset to suit up as the Armored Avenger in an original Iron Man adventure!     Tony Stark has retired from making weapons and instead creates technology used to battle evil as Iron Man. After several years as a world-famous Super Hero, Tony is attacked by the mysterious Ghost, a hacker and anti-corporate activist who repurposes old Stark Industries weapons. In her efforts to topple his empire, Ghost attacks Stark’s corporate locations around the world, leading to ever-escalating stakes and a final showdown.     RIBVVII USW | QAWXOJ USW Compatible Platform: PlayStation 4, PlayStation 5.",
      "details": {
        "brand": "Sony",
        "operatingSystem": "Playstation",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "PlayStation",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "USB, HDMI",
        "color": "White",
        "ram": "N/A",
        "detail_item": "Become Iron Man with the Sony PlayStation VR Marvel's Iron Man VR Bundle. This bundle comes with a PlayStation VR headset, a PlayStation Camera, and two PlayStation Move motion controllers."
      }
    },
    {
      "id": "B0D67FQ67N",
      "name": "FEEBZ 3D VR Headset for Kids 2.0 + Android Remote - for iPhone & Android Phones | with 3D VR Videos & Apps Links | Virtual Reality Goggles Set for Beginners",
      "ratings": 2,
      "price": "$49.99",
      "image": "https://m.media-amazon.com/images/I/81w0PJ5JcoL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Compatibility - Feebz VR headset for iPhone & Android model 2.0 fits more phone models than any other VR model.     Free VR content - Our VR headsets come with VR apps & videos for iPhones and Android for beginners     Unique gift for kids - A great gift idea for boys & girls, perfect for birthdays, Christmas, or any special event     Beginners friendly – New to VR? We include a \"how to use\" tutorial link in the box     Immersive & comfortable - To deliver more immersive & comfortable VR experience, our virtual reality glasses are equipped with bigger lenses and face padding     Get yours today - As a bonus, we'll throw in a protective carrying case for your new VR goggles     An american company promise - Please inform us if our VR glasses gear fail to deliver a thrilling experience for any reason     What's virtual reality headset? Also called cell phone virtual reality (vr) headsets, 3D VR glasses, 3D goggles, VR goggles, VR sets, or VR head sets",
      "details": {
        "brand": "FEEBZ",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "FEEBZ 3D VR Headset for Kids 2.0",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "Bluetooth",
        "color": "Marine Blue",
        "ram": "N/A",
        "detail_item": "Compatibility - Feebz VR headset for iPhone & Android model 2.0 fits more phone models than any other VR model."
      }
    },
    {
      "id": "B07PTMKYS7",
      "name": "Oculus Rift S PC-Powered VR Gaming Headset",
      "ratings": 18.731,
      "price": "$269.78",
      "image": "https://m.media-amazon.com/images/I/31GuZSt+LmL._SX342_SY445_.jpg",
      "description": "Top VR gaming library: Blast, slash and soar your way through the top library in VR gaming. Oculus Rift S lets you play hundreds of games and exclusives already available in the Oculus store, with so much more to come.     Improved optics: Stare down the competition with next-generation lenses and a sharper display. Improved optics deliver bright, vivid colors and reduced “screen-door” effect.     Ergonomic design: Keep your head in the game thanks to a Halo headband redesigned with speed in mind. Rift S stays securely and comfortably in place with a quick twist of the fit wheel, so it can take-or double take-your fastest reactions.     Oculus touch controllers: Arm yourself with our updated Oculus touch controllers. Your slashes, throws and grab appear in VR with intuitive, realistic precision, transporting your hands and gestures right into the game.     Oculus insight tracking: take a step forward with Oculus insight. It translates your movements into VR No matter which way you're facing and provides room-scale tracking without external sensors.     Oculus Rift S requires your Facebook account to log in, making it easy to meet up with friends in VR and discover communities around the world.",
      "details": {
        "brand": "N/A",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "Top VR gaming library: Blast, slash and soar your way through the top library in VR gaming. Oculus Rift S lets you play hundreds of games and exclusives already available in the Oculus store, with so much more to come."
      }
    },
    {
      "id": "B0D9P5L2GC",
      "name": "3D VR Glasses Virtual Reality Headset for iPhone or Android Compatible 4.7-6.5 inch,Adjustable Virtual Reality 3D Glasses Headset Helmets with Controller, for Mobile Games & Movies",
      "ratings": 301,
      "price": "$23.98",
      "image": "https://m.media-amazon.com/images/I/61TbjOOd+6L._AC_SY300_SX300_.jpg",
      "description": "🌟【Remote Controller】Our virtual reality headset provide a control that connected to the phone via Remote Controller, then you can play and stop music , volume +/- directly. Put yourself right into the action with games & movies and more! (not include AAA battery)     🌟【Compatible Phone Models】Fits Almost Smartphones Supports smartphones with 4.7-6.5 inches screen– such as for iPhone 15/14/13/12/11/Pro/Max/Mini/Xs Max/XR/X/Xs, Samsung Galaxy A71/A50/A51/S22/S21/ S10/S9/S8/S8 Plus/S7/S7 Edge/S6/S6 Edge Note 10/3/4/5/8,LG g5 g4 g3 v20, und weitere Telefone wie Google Pixel/Pixel XL,HTC,Nexus, LG usw.     🌟【More Comfortable Wearing】VR headset comes with a fully adjustable head strap, eyesight protection system, and a soft nose piece to reduce pressure and ensure a comfortable experience. Coolest Gift For Boys & Girls.     🌟【Immersive 3D experience】Multi-function humanization design with removable absorption panel, Independent lens adjustment, PU leather comfortable & breathable headset mask with adjustable function, It balances immersion and clarity of view while providing you the most excellent virtual reality view to watch 360° video.     🌟【2K-HD High Quality】 Lenses with high-precision and high light-transmission ensure clear images and effectively dissipate eye fatigue and the feel of vertigo. The pupil-object distance is double-adjusted, which supports naked-eye viewing for users with myopia below 600°, and supports wearing myopia.",
      "details": {
        "brand": "aiMaKE",
        "operatingSystem": "iOS, Android",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "vryanJ07",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "White",
        "ram": "N/A",
        "detail_item": "🌟【Remote Controller】Our virtual reality headset provide a control that connected to the phone via Remote Controller, then you can play and stop music , volume +/- directly. Put yourself right into the action with games & movies and more! (not include AAA battery)"
      }
    },
    {
      "id": "B0DCV7MDNN",
      "name": "Hard Carrying Case Compatible with Meta Quest 3/ Quest 3S Mixed Reality Headset, VR Gaming Headsets Travel Storage Holder Bag for Touch Controllers and Accessories with Shoulder Strap&Pocket - Black",
      "ratings": 7,
      "price": "$21.99",
      "image": "https://m.media-amazon.com/images/I/41TJoNe3aPL._SX300_SY300_QL70_FMwebp_.jpg",
      "description": "For Meta Quest 3 Carrying Case Spacious Capacity: This VR carrying case is specially designed for Meta Quest 3/Quest 3S 128GB/256GB/512GB breakthrough mixed reality headset, controller, power adapter, charging cable and batteries. Keep all your essentials in one case without worrying about running out of space. size: 11.4*9.4 *4.3 inches     Meticulous Care of VR Storage Case: For Oculus quest 3 case with pre-cut foam slots inside, soft and sturdy protected quest 3/ 3s and accessories from impact and scratches. Each slot is tailor-made to fit your device perfectly. In addition, top cover with zipper mesh pocket not only adds extra storage space but also avoid your quest 3 accessories lost     Hard Case for Meta Quest 3 Fashion & Protection: Selected PU material, for VR oculus quest 3s organizer has stylish appearance and excellent protective properties, both in appearance and touch, you can feel VR headset pouch refinement and practicality     Convenient Design of VR Headset Case: For Meta Quest 3s headset protector container is designed with detachable shoulder strap and strong handle. You can choose the way based on personal preference and carrying needs, small and space saving easy on the go. Double zippers for opening and closing smoother, increases security of use, ensuring that for meta quest 3 accessories are not accidentally dropped     Storage Case for Meta Quest Suitable for Multiple Scenarios: Take it wherever and enjoy VR fun, this VR headset carrying case meets all your needs. Its portability and protective performance make it an ideal choice for travel, allowing you to easily set up your VR equipment everywhere. At the same time, PC virtual reality headsets holder is also an ideal companion for home and office, helping you maintain a tidy and organized space for work and entertainment",
      "details": {
        "brand": "N/A",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "For Meta Quest 3 Carrying Case Spacious Capacity: This VR carrying case is specially designed for Meta Quest 3/Quest 3S 128GB/256GB/512GB breakthrough mixed reality headset, controller, power adapter, charging cable and batteries. Keep all your essentials in one case without worrying about running out of space. size: 11.4*9.4 *4.3 inches"
      }
    },
    {
      "id": "B09M8TQ4Y5",
      "name": "Orzly VR Headset Designed for Nintendo Switch & Switch OLED Console with Adjustable Lens for a Virtual Reality Gaming Experience and for Labo VR - Black - Gift Boxed Edition",
      "ratings": 2.697,
      "price": "$29.61",
      "image": "https://m.media-amazon.com/images/I/61VScxO9oeL.__AC_SY300_SX300_QL70_FMwebp_.jpg",
      "description": "Dive into an immersive virtual reality experience with the Orzly VR headset, exclusively designed for Nintendo Switch! This innovative headset, crafted by our passionate London design team, transforms your Nintendo Switch into a virtual reality powerhouse. With its adjustable lens and head strap, the Orzly VR headset provides a comfortable and customizable fit for users of all ages, from 8 years and up.     Experience unparalleled immersion and enhanced gameplay. The Orzly VR headset offers a remarkably immersive virtual reality experience, transporting you into the heart of your favorite Nintendo Switch games. Whether you're exploring vast worlds, engaging in epic battles, or solving puzzles, the Orzly VR headset will elevate your gaming experience to new heights.     Designed to complement your Switch accessories and games. The Orzly VR headset seamlessly complements your existing Switch accessories and games, providing a comprehensive VR solution for your Nintendo Switch. With its sleek design and durable construction, the Orzly VR headset is built to withstand the rigors of everyday gaming.     Enhance your Switch console experience and be creative. The Orzly VR headset opens up a world of creative possibilities for Nintendo Switch users. Record stunning virtual reality gameplay footage for your YouTube channel, or share your virtual adventures with friends and family. The Orzly VR headset is your gateway to a boundless realm of virtual reality gaming.     Adjustable lens and head strap for optimal comfort. The Orzly VR headset features an adjustable lens that ensures sharp and focused viewing, while the adjustable head strap provides a comfortable fit for all head sizes. Whether you have a petite frame or a larger build, the Orzly VR headset will adapt to your needs. Solid construction for durability and longevity. Crafted with premium materials, the Orzly VR headset is built to last.",
      "details": {
        "brand": "Orzly",
        "operatingSystem": "[Inferred] Nintendo Switch OS or compatible OS",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "Orzly VR Headset",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "Wireless",
        "color": "Black",
        "ram": "N/A",
        "detail_item": "Dive into an immersive virtual reality experience with the Orzly VR headset, exclusively designed for Nintendo Switch! This innovative headset, crafted by our passionate London design team, transforms your Nintendo Switch into a virtual reality powerhouse. With its adjustable lens and head strap, the Orzly VR headset provides a comfortable and customizable fit for users of all ages, from 8 years and up."
      }
    },
    {
      "id": "B092LBLT7P",
      "name": "HTC Vive Pro 2 Headset Only",
      "ratings": 431,
      "price": "$663.99",
      "image": "https://m.media-amazon.com/images/I/416uQpvip+L._SX342_SY445_.jpg",
      "description": "Visualize in 5K clarity-bring out the finer details with combined 4896 x 2448 resolution. 5K resolution may be subject to processing compatibility     See more of your environment-a wide 120 Degree field of view (FOV) expands the VR viewing experience. The increased angle better aligns with the human eyes, letting you see more naturally     Experience seamless visuals-increase your visual comfort in graphics-intensive games and apps with a 120Hz refresh rate     Enjoy VR with hours on end comfort-industry-defining balanced construction and adjustability provide a comfortable Fit for VR sessions of any length and purpose. The headset fits a wide range of head sizes and vision types, even glasses     Find your sweet spot-minimize eye fatigue with the IPD adjustment dial. Interpupillary distance (ipd)-the distance measured in mm between the centers of eye pupils     Refer to attached User Manual and product guide PDF below",
      "details": {
        "brand": "N/A",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "Visualize in 5K clarity-bring out the finer details with combined 4896 x 2448 resolution. 5K resolution may be subject to processing compatibility"
      }
    },
    {
      "id": "B0CN91SDV3",
      "name": "APEXINNO VR Gun Stock Cover for Quest 3S Meta Quest 3 Controllers Accessories, Hard Controller Grips for Oculus Quest 3/3S Enhanced FPS Games Reality Holding Feels, Handle Shell Case Protector",
      "ratings": 137,
      "price": "$25.99",
      "image": "https://m.media-amazon.com/images/I/61CaucKaDHL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Specially Shape Design for Meta Quest 3/3S Controllers: The shape of the shell imitates the real thing, giving you more immerse gaming experience, and also could be amazing present for friends and families     Ensure Signal Tracking, with Wristband Hole: Doesn't obstruct any of the tracking sensors, will not affect game signal tracking. Grip bottom rope hole allows a wrist strap to pass through to better protect your controller     Provides Anti-Slip Protection: The beautifully designed protective cover offers effective protection for the touch controller during daily use, reducing the risk of stains or damage from impacts or scratches, while delivering a comfortable, high-quality feel     Premium Durable Material: Made of high quality plastic material, it gives you great hand feel. It is not easy to scratch and damage and give great protection to controller from droping. Durable connect and easy to clean     Easy to Install, Fit Many FPS Games: The protective case cover is compatible with multiple FPS Game using, enhance shooting experience. Such as Arizona Sunshine, Arena, Superhot VR, Resident Evil 4, Contractors VR, Echo VR, Zombieland (Note: product package does not include controllers)     Stylish and Cool Design: The gun sleeve features a creative and unique design that enhances players' immersion in VR games. Its innovative and meticulous craftsmanship accurately replicates the appearance and details of real objects, creating a gaming experience that feels as if you are truly in the real world",
      "details": {
        "brand": "APEXINNO",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "Auxiliary",
        "color": "Black",
        "ram": "N/A",
        "detail_item": "Specially Shape Design for Meta Quest 3/3S Controllers: The shape of the shell imitates the real thing, giving you more immerse gaming experience, and also could be amazing present for friends and families"
      }
    },
    {
      "id": "B0DHQSPC3W",
      "name": "VR Gunstock for Meta Quest 3 Controller Accessories Gun Stock for Quest 3S /Quest 2 FPS Gaming Customized Shape Sizes (Black)",
      "ratings": 3,
      "price": "$69.99",
      "image": "https://m.media-amazon.com/images/I/51JrItltqpL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Rapid-Access Dual-Point Sling:The adjustable shoulder strap positions the gunstock comfortably across your chest for easy access. When it’s time to jump back into action, just grab the stock and resume play instantly     Leather-Covered Cheek Pad: Provides stability for precise aiming, closely simulating real shooting posture. Fully adjustable to match your preferred height for a more authentic experience     True-to-Life Dimensions: The spacing between your hands and the length from shoulder stock to grip mirror real equipment, set at 11 inches and 14.5 inches respectively, with adjustable length options. This authentic design recreates the feel of holding an actual firearm, enhancing game immersion and avoiding the awkward, toy-like grip often found in VR setups     Adaptable Design for Any Gear: With six adjustable hand-tightened screws, you can easily customize the stock’s shape to fit your in-game posture. Whether using a sniper or shotgun setup, this flexibility lets you seamlessly adjust to any controller or shooting style     Quick Magnetic Attachment: Large magnetic surfaces with 4 magnets per side enable fast, effortless reattachment, allowing you to switch controllers quickly without needing to look—ideal for seamless, fast-paced gameplay",
      "details": {
        "brand": "VRMASTER",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "Wi-Fi",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "Rapid-Access Dual-Point Sling:The adjustable shoulder strap positions the gunstock comfortably across your chest for easy access. When it’s time to jump back into action, just grab the stock and resume play instantly"
      }
    },
    {
      "id": "B0DHH79YXQ",
      "name": "Carrying Case With Meta Quest 3S Storage - Shockproof EVA & Nylon, Grey, VR Cover Bag for Quest 3S Accessories, Suitable for Travel and Home Storage",
      "ratings": 1,
      "price": "$24.99",
      "image": "https://m.media-amazon.com/images/I/81YdXORdfGL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "【Perfect Fit for Quest 3S】: Designed specifically for the Meta Quest 3S, this storage case provides a snug fit for your VR headset and accessories, keeping everything secure and well-protected. slightly larger for Meta Quest 3     【Ultra-Durable EVA & Nylon Material】: Made from high-qualityPremium EVA Hard Shell & Water-Resistant Nylon, the case offers a sturdy and lightweight solution, providing long-lasting protection for your Meta Quest 3S.     【Shockproof Protection】: The shock-absorbing design safeguards your device against accidental drops, bumps, and scratches, ensuring your Quest 3S stays in perfect condition.No more worrying about your headset getting damaged in transit     【Organized Storage Space】: Features dedicated compartments to keep your Meta Quest 3S, controllers, and cables neatly stored, reducing the risk of scratches and tangling during transport.     【Portable & Travel-Friendly】: With a comfortable carrying handle, Perfect for travel, home storage, or daily protection,making it ideal for travel or simply keeping your VR gear organized at home.     【Note】: Cover Slightly larger to Meta Quest 3",
      "details": {
        "brand": "N/A",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "【Perfect Fit for Quest 3S】: Designed specifically for the Meta Quest 3S, this storage case provides a snug fit for your VR headset and accessories, keeping everything secure and well-protected. slightly larger for Meta Quest 3"
      }
    },
    {
      "id": "B0CS2TBCTF",
      "name": "Face Cushion Cover for Oculus Quest 3 Face Pad with Lens Covers Protectors Washable VR Silicone Covers for Meta Quest 3 Accessories",
      "ratings": 69,
      "price": "$9.89",
      "image": "https://m.media-amazon.com/images/I/71gF2xwliUL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Enhanced VR Immersion: Enjoy a snug and comfortable fit during long gaming sessions with the Quest 3 face pad. Its soft and plush material ensures a gentle touch against the skin, providing a significantly more comfortable gaming experience compared to the original foam cushion.     Skin-Friendly VR Experience: Specifically crafted to address skin irritation concerns, this silicone VR cover is compatible with Meta Quest 3. The high-quality silicone material ensures a soft, sweat-proof experience, preventing light leakage and enhancing your VR immersion without leaving unsightly sweat stains.     Multi-Proof Lens Cover: Alongside the face pad, enjoy a simple yet efficient lens cover that safeguards your lenses from dust, scratches, and sun damage. Ensure your lenses remain in pristine condition, preserving the visual quality of your VR experience.     Easy Installation and Cleaning: The silicone face cover is hassle-free to install and offers easy removal for cleaning, ensuring a sanitary experience, especially when shared among multiple users.     Ideal Gift for VR Enthusiasts: With its durability, hygiene, and comfort-enhancing features, this VR cover stands as an ideal gift for family and friends who enjoy immersive VR experiences.",
      "details": {
        "brand": "AMZDM",
        "operatingSystem": "Oculus Quest (proprietary)",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "FPQ3B",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "Black",
        "ram": "N/A",
        "detail_item": "Enhanced VR Immersion: Enjoy a snug and comfortable fit during long gaming sessions with the Quest 3 face pad. Its soft and plush material ensures a gentle touch against the skin, providing a significantly more comfortable gaming experience compared to the original foam cushion."
      }
    },
    {
      "id": "B0DHQVSD65",
      "name": "VR Gunstock Accesorries for Quest 2 Meta Quest 3/Quest Pro/Quest 3S Gun Stock Customizes Shape Length FPS Gams Gear Controllers Accessories",
      "ratings": null,
      "price": "$69.98",
      "image": "https://m.media-amazon.com/images/I/61NgoxzTE-L.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Quick Magnetic Attachment: The large magnetic surfaces with 4 magnets on each side allow fast, easy reattachment of controllers, enabling smooth, uninterrupted gameplay for Quest 3 users. Perfect for quick transitions during fast-paced VR sessions     Flexible, Customizable Design: Featuring six hand-tightened screws, this stock can be adjusted to suit any in-game posture, whether for sniper or shotgun setups. Adapt easily to any controller style and elevate your VR experience     Realistic Dimensions: With true-to-life spacing, this Quest 3 gun stock mimics real equipment with 11-inch and 14.5-inch adjustable length options. This design enhances immersion, ensuring a natural feel that avoids the toy-like grip often found in VR accessories     Adjustable Leather-Covered Cheek Pad: Enhance aiming stability with this leather-covered cheek pad, fully adjustable for personalized height. It closely simulates real shooting posture, adding realism to every shot     Rapid-Access Two-Point Sling: The adjustable shoulder strap keeps the Quest 3 gun stock comfortably across your chest, making it easy to grab when you’re ready to jump back into action. Quick to access, ideal for intense gameplay",
      "details": {
        "brand": "SUPERVR",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "Wi-Fi",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "Quick Magnetic Attachment: The large magnetic surfaces with 4 magnets on each side allow fast, easy reattachment of controllers, enabling smooth, uninterrupted gameplay for Quest 3 users. Perfect for quick transitions during fast-paced VR sessions"
      }
    },
    {
      "id": "B07Q3NCJYP",
      "name": "VR Headset Compatible with iPhone & Android - Universal Virtual Reality Goggles for Kids & Adults - Virtual Reality Headset for Kids - Your Best Mobile Games 360 Movies w/New 3D VR for iPhone (Red)",
      "ratings": 3.243,
      "price": "$25.99",
      "image": "https://m.media-amazon.com/images/I/71cCETgUlyL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "FOR KIDS & ADULTS - This premium virtual reality headset for kids and adults is the perfect present for holidays Compatible with smartphones and other mobile phone devices with a 4\"-6.3” screen to bring you a immersive visual 360 experience.     VR SMARTPHONE COMPATIBILITY - Compatible with smartphones with a gyro sensor (almost all models) and with a 4\"-6.3” screen.     ADVANCED VR GAMING TECHNOLOGY - VR headset offers FD and OD adjustments (wide field of vision) to expand the viewing angle and perfectly match focal distance and unilateral myopic alignment for reduced distortion to ensure an optimal viewing experience.     Experience your best mobile games 360 movies w/ soft & comfortable new 3D VR glasses!     EXCLUSIVE VR CONTENT & ONLINE SUPPORT - The VR headset (viewer) is delivered with our special free VR content list of VR games & VR experiences. Compatible with google cardboard apps that don't require a button, and many other VR apps & adventures that can be found on the applications stores.",
      "details": {
        "brand": "BNEXT",
        "operatingSystem": "Android",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "galaxy",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "Wireless",
        "color": "Red",
        "ram": "N/A",
        "detail_item": "FOR KIDS & ADULTS - This premium virtual reality headset for kids and adults is the perfect present for holidays Compatible with smartphones and other mobile phone devices with a 4\"-6.3” screen to bring you a immersive visual 360 experience."
      }
    },
    {
      "id": "B08H8X48X9",
      "name": "Bill Nye's VR Science Kit - Virtual Reality Kids Science Kit, Book and Interactive STEM Learning Activity Set (Full Version - Includes Goggles) - for Ages 8 and Up",
      "ratings": 1.837,
      "price": "$59.99",
      "image": "https://m.media-amazon.com/images/I/81bJkAnnWUL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "WINNER OF THE TOTY \"STEAM TOY OF THE YEAR AWARD\" - Join Bill Nye is his virtual reality lab in an ultimate immersive learning experience!     LEARN, EXPERIENCE, PLAY! - From chemistry to physics, this unique educational toy delivers core scientific values that foster a fundamental and healthy understanding of basic scientific concepts.     STEP-BY-STEP VIDEOS - Enter augmented reality as pictures turn to video right on the page! Develop the skills and confidence to perform science experiments, then enter Bill Nye's virtual reality lab to see science in action!     VR GOGGLES INCLUDED - Includes a pair of hands-free goggles to create an immersive learning experience. Compatible with all smart phones with access to Google Play store and Apple iOS app store. All smart phone mobile devices have been tested to fit into the goggles, including “max” and plus size phones. Goggles not compatible with tablets.     WHAT'S IN THE BOX? - This 50 piece set includes everything you need, like beakers, measuring cups, baking soda, paint brush and much more to dive in and experience the projects right out of the box, making it an ultimate kids VR toy set! (NOTE: some additional household items required)",
      "details": {
        "brand": "N/A",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "WINNER OF THE TOTY \"STEAM TOY OF THE YEAR AWARD\" - Join Bill Nye is his virtual reality lab in an ultimate immersive learning experience!"
      }
    },
    {
      "id": "B0CJLBVWY5",
      "name": "DEVASO Upgraded VR Headset for Nintendo Switch & Switch OLED, Switch Virtual Reality Glasses with Adjustable HD Lenses and Comfortable Head Strap, Labo VR Kit 3D Goggles for Switch Accessories",
      "ratings": 164,
      "price": "$32.99",
      "image": "https://m.media-amazon.com/images/I/713mxWjaA1L.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "【Upgraded Switch VR headset】The headset is upgraded with adjustable lens, viewing window is improved by 20% and higher definition, you can adjust switch lens left/right and forward/backward to allow the image to align for you, which will bring you a batter immersive visual experience. Switch VR headset would be big surprise for your friend, family or yourself.     【Designed for Switch & Switch OLED】The upgraded swith VR headset is compatible with nintendo switch and nintendo switch OLED version, not for switch lite vertion. When using, we recommend to remove joy cons because it would be more light weight for you.     【Support Certain VR Games】Turn on VR mode and experience Super Mario Odyssey, Breath of the Wild, Super Smash Bros, Spice and Wolf, Captain Toad, LABO VR or other Switch VR games, and you can also watch VR videos on youtube through Switch. (Please note: Set the game to VR mode before playing.)     【Premium Material】The VR goggle for Switch & Switch OLED is made of EVA and Polyester Lycra materials, super light weight and durable, which help your skin breath and decrease the pressure when playing VR games.     【Fun for everyone】The adjustable head strap of VR switch headset fits everyone’s head. Even though wearing myopia glasses, the glass-friendly VR switch goggle is available. If you have any questions, please feel free to contact us, We will reply you within 24 hours!",
      "details": {
        "brand": "DEVASO",
        "operatingSystem": "Nintendo Switch OS",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "DEVASO Upgraded VR Headset",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "Orange&Blue",
        "ram": "N/A",
        "detail_item": "【Upgraded Switch VR headset】The headset is upgraded with adjustable lens, viewing window is improved by 20% and higher definition, you can adjust switch lens left/right and forward/backward to allow the image to align for you, which will bring you a batter immersive visual experience. Switch VR headset would be big surprise for your friend, family or yourself."
      }
    },
    {
      "id": "B0D9M7T1M9",
      "name": "FEEBZ 3D VR Headset for Kids 2.0 - for iPhone & Android Phones | with 3D VR Videos & Apps Links | Virtual Reality Goggles Set for Beginners",
      "ratings": 22,
      "price": "$39.99",
      "image": "https://m.media-amazon.com/images/I/81bGMZNa0PL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Compatbility - Feebz VR headset for iPhone & Android model 2.0 fit more phone models than any other VR model     Free VR content - Our VR headsets come with VR apps & videos for iPhones and Android for beginners     Unique gift for kids - A great gift idea for boys & girls, perfect for birthdays, Christmas, or any special event     Beginners friendly – New to VR? We include a \"how to use\" tutorial link in the box     Immersive & comfortable - To deliver more immersive & comfortable VR experience, our virtual reality glasses are equipped with bigger lenses and face padding     Get yours today - As a bonus, we'll throw in a protective carrying case for your new VR goggles     An american company promise - Please inform us if our VR glasses gear fail to deliver a thrilling experience for any reason",
      "details": {
        "brand": "FEEBZ",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "Powder Blue",
        "ram": "N/A",
        "detail_item": "Compatbility - Feebz VR headset for iPhone & Android model 2.0 fit more phone models than any other VR model"
      }
    },
    {
      "id": "B07PRDGYTW",
      "name": "Oculus Quest All-in-one VR Gaming Headset – 128GB",
      "ratings": 6.548,
      "price": "$529.99",
      "image": "https://m.media-amazon.com/images/I/71D9OsZmWxL.__AC_SY300_SX300_QL70_FMwebp_.jpg",
      "description": "All-in-one VR: No PC. No wires. No limits. Oculus quest is an all-in-one gaming system built for virtual reality. Now you can play almost anywhere with just a VR headset and controllers.     Oculus touch controllers: arm yourself with the award-winning Oculus touch controllers. Your slashes, throws and grab appear in VR with intuitive, realistic Precision, transporting your hands and gestures right into the game     Easy set up: the world is your arcade. Set up is easy whether you're at home or someplace new. Oculus quest works with your environment, so you can play standing or sitting in spaces big or Small.     Incredible VR games: stop watching games and step into them. Whether you're dodging spells or slashing through enemy hordes, you've never been this close to the action.     Guardian helps keep you safe: explore the universe without tripping over the coffee table. The Oculus Guardian system is designed to help you avoid nearby objects while you're in-game.     Oculus Quest requires your Facebook account to log in, making it easy to meet up with friends in VR and discover communities around the world.",
      "details": {
        "brand": "Meta",
        "operatingSystem": "Android",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "301-00171-01",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "Bluetooth",
        "color": "Black",
        "ram": "N/A",
        "detail_item": "All-in-one VR: No PC. No wires. No limits. Oculus quest is an all-in-one gaming system built for virtual reality. Now you can play almost anywhere with just a VR headset and controllers."
      }
    },
    {
      "id": "B0BZ35BG6V",
      "name": "Head Strap Compatible with Oculus Quest 2,Meta Quest 2 Accessories Adjustable Elite Strap Replacement for Enhanced Comfort Support and Gaming Immersion in VR (Comfort Head Strap only)",
      "ratings": 689,
      "price": "$19.15",
      "image": "https://m.media-amazon.com/images/I/61DIzX6jpKL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "【Reduce facial pressure】Adopt the gravity-balanced and distributed design,this elite strap replacement for oculus quest 2 makes its gravity evenly distributed in different positions of the head,further reducing facial pressure,the back wing-shaped wide bracket can offer larger head support than original while preventing slippage,it can be freely adjusted to the most comfortable state,making your device fit your head better,increasing your gaming immersion.     【Superior Side Straps】The Oculus/Meta head strap is made of upgraded polymer material,which is eco-friendly and has extreme toughness and stability,15,000+ Bending Test ensures durability and long lasting,never need to worry that the side strap will snap,enhance the wearing experience and thus make the VR process more enjoyable.     【Easy Size Adjustment】The size of the Oculus 2 elite strap can be adjusted with a round rotary knob and the fastening screw will stay locked automatically,easy to adjust to the best.This head strap has larger head support which fits head circumference 17.7-29.5inch,suitable for both adults and children,and children can easily use and adjust it by themselves.     【Premium PU Leather Cushions】Equipped with skin-friendly PU leather pads at each support point,the upgraded head pad with 80mm width 15mm thickness is more soft,breathable and absorbent,which can relieve the heat in the back of the head when playing games.The high-grade comfortable PU leather cushion with a smooth surface is very easy to clean,just wipe with a damp cloth,no any maintenance worries.     【Lightweight and Portable】 The whole head strap weighs only 226g,can fit in the official carrying case and most carrying cases on the market,very easy for storage and carry when traveling.",
      "details": {
        "brand": "VZNEK",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "USB",
        "color": "Comfort Head Strap only",
        "ram": "N/A",
        "detail_item": "【Reduce facial pressure】Adopt the gravity-balanced and distributed design,this elite strap replacement for oculus quest 2 makes its gravity evenly distributed in different positions of the head,further reducing facial pressure,the back wing-shaped wide bracket can offer larger head support than original while preventing slippage,it can be freely adjusted to the most comfortable state,making your device fit your head better,increasing your gaming immersion."
      }
    },
    {
      "id": "B0DGVZ1YZC",
      "name": "Bundle of Meta Quest 3 512GB— Breakthrough Mixed Reality — Powerful Performance (Renewed Premium) + Meta Quest Link Cable - Virtual Reality Headset Cable for Quest - 16FT (5M) - PC VR",
      "ratings": 129,
      "price": "$42.99",
      "image": "https://m.media-amazon.com/images/I/21XWp3XpyGL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Dive into extraordinary experiences with a mixed reality headset that transforms your home into an exciting new playground, where virtual elements blend into your actual surroundings.     Expand your library. Access 1,000+ PC-based VR titles in the Meta Quest Rift library Compatible gaming PC required, not included. See the Meta Quest website for PC specifications.     It’s the most powerful Quest yet*, featuring next-level performance with more than double the graphic processing power of Quest 2. (*Based on the graphic performance of the Snapdragon XR2 Gen 2 vs Meta Quest 2.)     Maintain your range with an extra long, 16ft (5m) construction that gives you space to move in VR, even when connected to your PC. (Packaging may vary) Meta Quest packaging will continue to carry the Oculus name and logo during the transition to our new branding.     Experience more immersion with dazzling visuals with the 4K+ Infinite Display (a nearly 30% leap in resolution from Quest 2) and rich 3D audio with enhanced sound clarity, bass performance and a 40% louder volume range than Quest 2     Keep your experience flowing smoothly. Capable of up to 5Gbps, the Link Cable has all the capacity you need for a premium VR experience     Reach out and touch virtual worlds with Touch Plus controllers that give you fine-tuned precision, realistic sensations and more intuitive interactions. You can even navigate without controllers with Direct Touch that follows your gestures, so you can use just your hands to find your way.",
      "details": {
        "brand": "Meta",
        "operatingSystem": "Android (Custom)",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "Quest 3",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "USB",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "Dive into extraordinary experiences with a mixed reality headset that transforms your home into an exciting new playground, where virtual elements blend into your actual surroundings."
      }
    },
    {
      "id": "B0BQXDFLJ6",
      "name": "HTC Vive XR Elite Virtual Reality Headset + Controllers",
      "ratings": 180,
      "price": "$779.95",
      "image": "https://m.media-amazon.com/images/I/312d2bErf0L._SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Lightweight XR. A sleek headset that goes where you go.     Finely tuned viewing. Adjustable IPD and diopter dials for the most natural and clearest visual experience.     Fun and imagination amplified. Crisscrossing realities with vibrant, high-resolution XR passthrough.     Beyond standalone VR. Connect to your VR-ready PC and enjoy low-latency, high-fidelity PC-VR gaming.     Balanced and clear. Powerful speakers deliver crisp, immersive audio.",
      "details": {
        "brand": "N/A",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "Lightweight XR. A sleek headset that goes where you go."
      }
    },
    {
      "id": "B0CKXF1DGD",
      "name": "Relohas Deluxe 5 in 1 Silicone Accessories for Meta Quest 3, VR Protective Case Set for Oculus Quest 3, Controller Grip Cover, VR Shell Cover, Face Cover, Gifts for Christmas & Halloween (Light Blue)",
      "ratings": 99,
      "price": "$24.99",
      "image": "https://m.media-amazon.com/images/I/614PYO1FxIL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "✔ There is a detailed ▶▷▶INSTALLATION VIDEO about the FACE COVER, SHELL COVER and Controller Cover at the ▶▷▶end of the product pictures. After installing it CORRECTLY, it can completely AVOID falling off. If you have any questions, please contact us.     🎮【Deluxe Accessories For Meta Quest 3】: This budget-friendly starter accessory kit is specially designed to elevate your gaming experience and is perfectly compatible with Meta Quest 3.     🎮【Adjustable Grip Cover】Straps are made of high quality PU leather, which are adjusted according to the size of the hand, flexible. Extending the bottom of the grip cover 1.0cm than other brand suitable for all kinds of people. The unique snap design to prevent the handle from being thrown out during gameplay.     🎮【VR Shell Protective Cover】Device's shell is dustproof, anti-scratch and waterproof, with soft material like a newborn baby. Built-in crash design helps to absorb shocks or collisions, with multiple heat sink ports to dissipate heat perfectly.     🎮【Lens Protective Cover】VR lens cap protects your VR headset from scratches, pollution and dust, and will not pop out easily. It will be firmly attached to Quest 3, use more worry-free.     🎮【Never block the signal】We have upgraded VR silicone accessories, and precise opening can effectively avoid the problem of signal blockage. We have a dedicated team to play games with this accessory. Once it is found to be blocked, we will improve it again. We are committed to bringing better game experience to customers and making better products.     🎮【What You Get】1*VR Shell Cover+2*Controller Grips Cover+1*Face Cover+1*Lens Protective Cover+ 10*Disposable Eye Cover and 24 hours service from Relohas.",
      "details": {
        "brand": "Relohas",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "1832 x 1920",
        "modelName": "Meta Quest 3",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "Blue",
        "ram": "N/A",
        "detail_item": "✔ There is a detailed ▶▷▶INSTALLATION VIDEO about the FACE COVER, SHELL COVER and Controller Cover at the ▶▷▶end of the product pictures. After installing it CORRECTLY, it can completely AVOID falling off. If you have any questions, please contact us."
      }
    },
    {
      "id": "B0C9JBVY64",
      "name": "Compatible with Oculus Quest 2 Face Bracket Replacement,VR PU Leather Face Pad Protective for Meta Quest 2,Sweat-Proof Comfortable Face Cover Cushion VR Accessories",
      "ratings": 251,
      "price": "$14.99",
      "image": "https://m.media-amazon.com/images/I/71pOhXRV0YL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "【FITNESS FACIAL INTERFACE REPLACEMENT】This upgraded facial interface bracket for oculus quest 2 is equipped with air vents design to improve air circulation and reduce fogging.It’s effective at reducing pressure and extending your game time.     【ANTI-LIGHT LEAK】The added nose pads prevent light leaks, prevent steam from rising up and obscure your vision, and provide a wider field of view and a tighter fit to enhance your VR gaming experience.     【RELIEF FACE PRESSURE】 The VR face pad accessory is soft enough to help relieve pressure for the Oculus Quest 2 face cushion, and fits securely over your glasses without causing any pressure or irritation. This mask replacement designed for Oculus Quest 2 is also helpful for glasses players.     【UNIQUE DESIGN 】The facial interface frame are 3D shape,easy to install.no folds after installation like others that perfect fit to face,can reduce head pressure and you won’t feel oppressive even after use for a long time.     【COMPATIBLE WITH】The Upgraded replacement facial interface Set compatible with Oculus Quest 2 Accessories.Our face cover is made of PU leather, no need special care.wipe it with wet cloth or just wash it with water can make it clean easily.",
      "details": {
        "brand": "AODELAN",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "VR Face Cover",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "Black VR Face Pad",
        "ram": "N/A",
        "detail_item": "【FITNESS FACIAL INTERFACE REPLACEMENT】This upgraded facial interface bracket for oculus quest 2 is equipped with air vents design to improve air circulation and reduce fogging.It’s effective at reducing pressure and extending your game time."
      }
    },
    {
      "id": "B09Z7KGTVW",
      "name": "Meta Quest Pro",
      "ratings": 870,
      "price": "$37.99",
      "image": "https://m.media-amazon.com/images/I/21QgvFpuTTL._SY430_SX215_QL70_FMwebp_.jpg",
      "description": "Meta Quest Pro unlocks new perspectives in work, creativity, and collaboration.     Multitask with ease with multiple resizable screens so you can organize tasks, work on new ideas or message with your friends.     World class counter balanced ergonomics and our sleekest design let you wear the headset for longer in premium comfort.     High resolution mixed reality passthrough uses full-color sensors to let you see and engage with the physical world around you, even as you connect, work and play in virtual spaces.     Share your true emotions and reactions with real time natural avatar expressions. Meta Avatars translate your natural facial expressions into VR so you can bring your true personality to meetings and gatherings with friends.     Meta Quest Touch Pro Controllers translate instinctive hand gestures and detailed finger actions directly into VR with self-tracking cameras and precision controls. Multi-point, advanced haptics make virtual interactions feel entirely real.     See VR through a whole new lens. Pancake lenses, increased pixel density, local dimming and quantum dot technology combine to deliver striking visual clarity playing games, connecting with friends, reading or multitasking.",
      "details": {
        "brand": "N/A",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "Meta Quest Pro unlocks new perspectives in work, creativity, and collaboration."
      }
    },
    {
      "id": "B0D3LRH8G4",
      "name": "Pro XR/AR Glasses — 135\" 120Hz 1000Nits UltraClarity Display, Harman Audio, Myopia Adjustments, Electrochromic Film, Video Glasses for iPhone 16/15/Android/Mac/PC/Steam Deck/Gaming Consoles",
      "ratings": 356,
      "price": "$499.00",
      "image": "https://m.media-amazon.com/images/I/61llo3qmKeL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "【BIGGER, BETTER, & BRIGHTER - Experience A Display Like No Other!】 Unlock a private 135” 120Hz Full HD UltraClarity screen with a peak brightness of 4000 nits, perceived brightness higher than 1000 nits (the only glasses to reach this level), designed for fully engrossing visual immersion. That’s 15” bigger than VITURE One, 2X the refresh rate, and 120% brighter!     【UltraClarity WITH NO BLURRY EDGES】- Edge-to-edge clarity, making even small text readable on the glasses’ giant display. Plus, VITURE Pro XR Glasses are anti-glare, anti-ghost, and anti-motion sickness!     【MYOPIA ADJUSTMENTS ON THE LATEST MICRO-OLED PANEL FOR UltraClarity】- Nearsighted? No problem! Experience the newest Micro-OLED panel, uniquely equipped with myopia adjustments by VITURE. Tailored viewing in sharper focus on VITURE Pro, all for easy comfort and Next-Level CLARITY!     【NEXT-GEN TECH: ENHANCED ELECTROCHROMIC FILM — Block Almost 100% External Light for UltraClarity】- As the world's first XR Glasses with electrochromic film, we’re taking it up a notch by blocking almost 100% of external light with a touch of a button. Lens shades are no longer needed for enjoying an immersive XR experience like no other before!     【UltraFreedom: ABSOLUTE PRIVACY, EVERYWHERE】- Stay fully immersed and truly incognito: No visible content on the outer lenses and no sound-bleed disturbance for those around you to those around you thanks to our stunning stereo soundscape engineered in partnership with HARMAN — with our exclusive tech, enjoy complete and effortless privacy!     【SGS A+ HIGHEST EYE-CARE CERTIFIED】 - Though VITURE Pro XR Glasses offer the highest brightness option in the market, they are A+ (the most premium performance) certified by SGS to cause less eye strain than your phone and even traditional screens like a computer monitor.     【GAME, STREAM, & WORK ANYWHERE, ANYTIME】 - VITURE has led the way in the XR industry since the beginning, and our latest glasses are equally designed for gamers and working professionals alike. With a sharper display than ever, you can seamlessly switch from playing your favorite games or watching your favorite shows to working on next week’s big presentation all on the same device.",
      "details": {
        "brand": "VITURE",
        "operatingSystem": "iOS, Android，macOS, Windows, Nintendo Switch, PlayStation, XBox",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "Pro Xr Glasses",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "USB",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "【BIGGER, BETTER, & BRIGHTER - Experience A Display Like No Other!】 Unlock a private 135” 120Hz Full HD UltraClarity screen with a peak brightness of 4000 nits, perceived brightness higher than 1000 nits (the only glasses to reach this level), designed for fully engrossing visual immersion. That’s 15” bigger than VITURE One, 2X the refresh rate, and 120% brighter!"
      }
    },
    {
      "id": "B099VMT8VZ",
      "name": "Meta Quest 2 — Advanced All-In-One Virtual Reality Headset — 128 GB",
      "ratings": 75.786,
      "price": "$39.99",
      "image": "https://m.media-amazon.com/images/I/61GhF+JUXGL._AC_SY300_SX300_.jpg",
      "description": "Experience total immersion with 3D positional audio, hand tracking and easy-to-use controllers working together to make virtual worlds feel real.     Explore an expanding universe of over 500 titles across gaming, fitness, social/multiplayer and entertainment, including exclusive releases and totally unique VR experiences.     Enjoy fast, smooth gameplay and immersive graphics as high-speed action unfolds around you with a fast processor and immersive graphics.     Travel universes in blockbuster fantasies, scare yourself witless in horror adventures or squad up with friends to save the universe.     Come together in incredible social spaces and multiplayer arenas as you take in live events with friends and family, find your new workout crew or join adventures with fellow players.     Be truly free to explore in VR With a wireless headset, intuitive controls, a built-in battery, easy setup and no PC or console needed.     Play without worries by setting your designated play space and get alerts if you move outside it.",
      "details": {
        "brand": "Meta",
        "operatingSystem": "Oculus",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "899-00187-02",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "Wi-Fi",
        "color": "White",
        "ram": "N/A",
        "detail_item": "Experience total immersion with 3D positional audio, hand tracking and easy-to-use controllers working together to make virtual worlds feel real."
      }
    },
    {
      "id": "B08HK24JSD",
      "name": "Oculus Quest 2 — Advanced All-in-One Virtual Reality Headset — 64 GB (UK Model)",
      "ratings": 6.287,
      "price": "$29.99",
      "image": "https://m.media-amazon.com/images/I/31m9KbCvs0L._SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Next-level Hardware - Make every move count with a blazing-fast processor and our highest-resolution display.     All-In-One Gaming - With backward compatibility, you can explore new titles and old favourites in the expansive Quest content library.     Immersive Entertainment - Get the best seat in the house to live concerts, groundbreaking films, exclusive events and more.     Easy Setup - Just open the box, set up with the smartphone app and jump into VR. No PC or console needed. Requires wireless internet access and the Oculus app (free download) to set up device.     Premium Display - Catch every detail with a stunning display that features 50% more pixels than the original Quest.",
      "details": {
        "brand": "N/A",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "Next-level Hardware - Make every move count with a blazing-fast processor and our highest-resolution display."
      }
    },
    {
      "id": "B0DDWH41HB",
      "name": "Meta Quest 3 512GB — The Most Powerful Quest — Ultimate Mixed Reality Experiences — Get Batman: Arkham Shadow and a 3-Month Trial of Meta Quest+ Included",
      "ratings": 3.174,
      "price": "$37.99",
      "image": "https://m.media-amazon.com/images/I/41XBK+o41AL._SX342_SY445_.jpg",
      "description": "Enjoy the ultimate way to experience everything you love. Now you can get Batman: Arkham Shadow and a 3-month trial of Meta Quest+ included** (a combined $70 value) when you buy any Meta Quest 3 512GB.* Batman: Arkham Shadow available to play 10/22.     Unlock new ways to work, play, relax and connect with mixed reality, where you can blend digital objects into your physical space. Turn anywhere into the ultimate personal theater, create a home gym in your living room or get immersed in out-of-this-world games.     With the most powerful Quest yet,* every experience looks sharper, plays faster and runs smoother. Enjoy life-like graphics, rich spatial audio and more storage for all your apps and games.     With 4K + Infinite Display*, feel like you’re actually exploring locations around the world or stepping into realistic games with a wider, taller, expansive field of view. *Two displays (2064x2208 resolution per eye) combined with Meta’s Infinite Display optical stack. See website for more information on Infinite Display.     Put on Quest to watch shows and movies play on a giant vibrant screen, anywhere you want — whether you’re at home or on a plane.     Play, train and explore for longer with premium comfort. The slim, wireless design distributes weight evenly for a lighter feel.     Navigate your way. Use your hands to swipe through content and type on a virtual keyboard. Pick up Touch Plus Controllers for fine-tuned precision and realistic sensations.",
      "details": {
        "brand": "N/A",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "Enjoy the ultimate way to experience everything you love. Now you can get Batman: Arkham Shadow and a 3-month trial of Meta Quest+ included** (a combined $70 value) when you buy any Meta Quest 3 512GB.* Batman: Arkham Shadow available to play 10/22."
      }
    },
    {
      "id": "B09B8DQ26F",
      "name": "Meta Quest 2 — Advanced All-In-One Virtual Reality Headset — 256 GB",
      "ratings": 21.635,
      "price": "$17.98",
      "image": "https://m.media-amazon.com/images/I/31f1MuRSNyL._SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Meta Quest is for ages 13+. Certain apps, games and experiences may be suitable for a more mature audience. Keep your experience smooth and seamless, even as high speed action unfolds around you with a super-fast processor and high-resolution display. (Packaging may vary) Meta Quest packaging will continue to carry the Oculus name and logo during the transition to our new branding.     Experience total immersion with 3D positional audio, hand tracking and haptic feedback, working together to make virtual worlds feel real.     Explore an expanding universe of over 250 titles across gaming, fitness, social/multiplayer and entertainment, including exclusive blockbuster releases and totally unique VR experiences.     Travel universes in blockbuster fantasies, scare yourself witless in horror adventures or collaborate with colleagues in innovative workspaces.     Come together in incredible social spaces and multiplayer arenas as you take in live events with friends and family, find your new workout crew or join quests with fellow adventurers.     Be truly free to roam in VR With a wireless headset, intuitive controls, a built-in battery, easy setup and no PC or console needed*",
      "details": {
        "brand": "N/A",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "Meta Quest is for ages 13+. Certain apps, games and experiences may be suitable for a more mature audience. Keep your experience smooth and seamless, even as high speed action unfolds around you with a super-fast processor and high-resolution display. (Packaging may vary) Meta Quest packaging will continue to carry the Oculus name and logo during the transition to our new branding."
      }
    },
    {
      "id": "B07NLKHJ4X",
      "name": "PlayStation VR Headset + Camera Bundle [Discontinued] (Renewed)",
      "ratings": 235,
      "price": "$169.00",
      "image": "https://m.media-amazon.com/images/I/31SLOxVdX0L._SY300_SX300_QL70_FMwebp_.jpg",
      "description": "Ever Expanding Library of Games - PlayStation is committed to continuously delivering new worlds of unexpected gaming experiences through PlayStationVR.     Plug and Play - Getting into PlayStationVR couldn't be easier     Just plug the PSVR headset and your PlayStation Camera into any PlayStation4 system and you're ready to go.     Lightweight Headset Design     The PlayStationVR headset will make you forget that you are wearing one, keeping you free from distraction as you explore new gaming worlds.",
      "details": {
        "brand": "N/A",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "Ever Expanding Library of Games - PlayStation is committed to continuously delivering new worlds of unexpected gaming experiences through PlayStationVR."
      }
    },
    {
      "id": "B0C1Q9X8VH",
      "name": "PlayStation VR2 Horizon Call of The Mountain™ Bundle (PSVR2)",
      "ratings": 1.172,
      "price": "$593.64",
      "image": "https://m.media-amazon.com/images/I/61jPxZuLTzL.__AC_SY300_SX300_QL70_FMwebp_.jpg",
      "description": "PlayStation VR2 Sense technology: Eye tracking. Headset feedback. 3D Audio. Highly intuitive controls – Haptic Feedback, Adaptive Triggers and Finger Touch Detection     Cutting-edge performance     4K HDR visuals     110º field of view     Advanced graphical rendering",
      "details": {
        "brand": "PlayStation",
        "operatingSystem": "PlayStation proprietary operating system",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "PSVR2",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "Bluetooth",
        "color": "PlayStation VR2 Bundle (PSVR2)",
        "ram": "N/A",
        "detail_item": "PlayStation VR2 Sense technology: Eye tracking. Headset feedback. 3D Audio. Highly intuitive controls – Haptic Feedback, Adaptive Triggers and Finger Touch Detection"
      }
    },
    {
      "id": "B0D9R3YVZ6",
      "name": "Sony mocopi 3D Mobile Motion Capture for VR and 3D Content Creation",
      "ratings": 9,
      "price": "$449.99",
      "image": "https://m.media-amazon.com/images/I/41wMr0vCWML._SY300_SX300_QL70_FMwebp_.jpg",
      "description": "PORTABLE MOTION CAPTURE: With mocopi, you can capture your full-body 3D motion anywhere you want with six comfortable, light-weight sensors. Plus two extension bands to prioritize upper-body or lower-body focused tracking.     MOTION CAPTURE MADE EASY: Motion capture is easy using your compatible smartphone. Pair the sensors with your phone, attach and calibrate the sensors, select your avatar and backdrop, and record your motion.     INTERIOR OR EXTERIOR USE: Dustproof and water-resistant, mocopi enables you to record indoors or head outside to create 3D motion content.     IOS AND ANDRIOD COMPATIBLE: Use your compatible iOS or Android phone (see specs) with the mocopi app or use the SDK (software development kit) to create custom uses.     LIGHT-WEIGHT AND COMPACT DESIGN: The small and sleek sensors fit comfortably on various parts of your body and enable a full motion-capture experience without the fuss of full-body suits or complicated wearables.     MOCOPI APP: Simple to run from a compatible smartphone. Complete the end-to-end movie process from content creation, motion data-logging, recording, saving and, finally, transferring. The smartphone app allows you to import avatar data and will help you choose the perfect background.     IN THE BOX: 6x Sensors, Head band, 2x Wrist band, 2x Ankle band, Waist clip, Charging case, 2x Extension band, User manual",
      "details": {
        "brand": "N/A",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "PORTABLE MOTION CAPTURE: With mocopi, you can capture your full-body 3D motion anywhere you want with six comfortable, light-weight sensors. Plus two extension bands to prioritize upper-body or lower-body focused tracking."
      }
    },
    {
      "id": "B0DJ6MP5TW",
      "name": "Silicone Cover Set Compatible with Meta/Oculus Quest 3S: Controller Grips Cover - Facial Interface Cover - Protective Lens Cover - VR Shell Cover",
      "ratings": null,
      "price": "$29.99",
      "image": "https://m.media-amazon.com/images/I/41-dtG1C1FL._SY430_SX215_QL70_FMwebp_.jpg",
      "description": "【Silicone Cover Accessories Compatible With Meta Quest 3s】The silicone cover set includes: 1x Facial Interface Cover, 1x VR Headset Shell Cover, 2 x Controller Grip Cover, 5 x Disposable Eye Cover, 1x Lens Protector, 2x Joysticks Cover, 1 x Cleaning cloth. Ensuring full protection for your Oculus Quest 3S.     【Immersive Gaming Experience】The protective cover set safeguarding Meta Quest 3S from scratches, drops, and damage. The silicone cover offers a comfortable and secure wearing experience, allowing you to dive deeper into virtual reality gaming for an immersive gaming experience.     【Excellent Controller Protection】The controller grips with adjustable hand knuckle straps to fit various hand sizes, so you can focus on the task and not worry about the Quest 3S controller flying out of your hands.     【Enhanced Comfort of Face Cover】The quest 3s face cover is crafted from soft, breathable rubber, it helps maintain a clean VR gaming environment by preventing sweat on your Meta Quest 3S. Ensuring a comfortable and irritation-free gaming experience during long VR games.     【Disposable Eye Cover】Durable non-woven fabric it protects the part of the skin that comes into direct contact with vr equipment from sweat, sebum, cosmetics, and dirt. The ergonomically designed eye mask is soft and breathable. Protect personal hygiene. No need to worry about sharing your VR headset with others.     【Lens Protector Cover Compatible with Meta Quest 3S】Scratch-proof, and sun-proof, Effectively prevent the lens from aging.",
      "details": {
        "brand": "N/A",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "【Silicone Cover Accessories Compatible With Meta Quest 3s】The silicone cover set includes: 1x Facial Interface Cover, 1x VR Headset Shell Cover, 2 x Controller Grip Cover, 5 x Disposable Eye Cover, 1x Lens Protector, 2x Joysticks Cover, 1 x Cleaning cloth. Ensuring full protection for your Oculus Quest 3S."
      }
    },
    {
      "id": "B0CS2TBCTF",
      "name": "Face Cushion Cover for Oculus Quest 3 Face Pad with Lens Covers Protectors Washable VR Silicone Covers for Meta Quest 3 Accessories",
      "ratings": 69,
      "price": "$9.89",
      "image": "https://m.media-amazon.com/images/I/71gF2xwliUL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Enhanced VR Immersion: Enjoy a snug and comfortable fit during long gaming sessions with the Quest 3 face pad. Its soft and plush material ensures a gentle touch against the skin, providing a significantly more comfortable gaming experience compared to the original foam cushion.     Skin-Friendly VR Experience: Specifically crafted to address skin irritation concerns, this silicone VR cover is compatible with Meta Quest 3. The high-quality silicone material ensures a soft, sweat-proof experience, preventing light leakage and enhancing your VR immersion without leaving unsightly sweat stains.     Multi-Proof Lens Cover: Alongside the face pad, enjoy a simple yet efficient lens cover that safeguards your lenses from dust, scratches, and sun damage. Ensure your lenses remain in pristine condition, preserving the visual quality of your VR experience.     Easy Installation and Cleaning: The silicone face cover is hassle-free to install and offers easy removal for cleaning, ensuring a sanitary experience, especially when shared among multiple users.     Ideal Gift for VR Enthusiasts: With its durability, hygiene, and comfort-enhancing features, this VR cover stands as an ideal gift for family and friends who enjoy immersive VR experiences.",
      "details": {
        "brand": "AMZDM",
        "operatingSystem": "Oculus Quest (proprietary)",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "FPQ3B",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "Black",
        "ram": "N/A",
        "detail_item": "Enhanced VR Immersion: Enjoy a snug and comfortable fit during long gaming sessions with the Quest 3 face pad. Its soft and plush material ensures a gentle touch against the skin, providing a significantly more comfortable gaming experience compared to the original foam cushion."
      }
    },
    {
      "id": "B0DHQVSD65",
      "name": "VR Gunstock Accesorries for Quest 2 Meta Quest 3/Quest Pro/Quest 3S Gun Stock Customizes Shape Length FPS Gams Gear Controllers Accessories",
      "ratings": null,
      "price": "$69.98",
      "image": "https://m.media-amazon.com/images/I/61NgoxzTE-L.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Quick Magnetic Attachment: The large magnetic surfaces with 4 magnets on each side allow fast, easy reattachment of controllers, enabling smooth, uninterrupted gameplay for Quest 3 users. Perfect for quick transitions during fast-paced VR sessions     Flexible, Customizable Design: Featuring six hand-tightened screws, this stock can be adjusted to suit any in-game posture, whether for sniper or shotgun setups. Adapt easily to any controller style and elevate your VR experience     Realistic Dimensions: With true-to-life spacing, this Quest 3 gun stock mimics real equipment with 11-inch and 14.5-inch adjustable length options. This design enhances immersion, ensuring a natural feel that avoids the toy-like grip often found in VR accessories     Adjustable Leather-Covered Cheek Pad: Enhance aiming stability with this leather-covered cheek pad, fully adjustable for personalized height. It closely simulates real shooting posture, adding realism to every shot     Rapid-Access Two-Point Sling: The adjustable shoulder strap keeps the Quest 3 gun stock comfortably across your chest, making it easy to grab when you’re ready to jump back into action. Quick to access, ideal for intense gameplay",
      "details": {
        "brand": "SUPERVR",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "Wi-Fi",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "Quick Magnetic Attachment: The large magnetic surfaces with 4 magnets on each side allow fast, easy reattachment of controllers, enabling smooth, uninterrupted gameplay for Quest 3 users. Perfect for quick transitions during fast-paced VR sessions"
      }
    },
    {
      "id": "B09GK6Z3VB",
      "name": "Adjustable VR Headset for Nintendo Switch & OLED - Upgraded HD Lenses, 3D Glasses Compatible with Original & OLED Switch Models, Switch VR Kit",
      "ratings": 2.135,
      "price": "$27.99",
      "image": "https://m.media-amazon.com/images/I/71GJ0uwXe1L.__AC_SY300_SX300_QL70_FMwebp_.jpg",
      "description": "【Upgraded Adjustable Lenses】: Compatible with Nintendo Switch & Switch OLED, the OIVO newly-released switch virtual reality VR headset is upgraded with adjustable lens, which you can adjust switch oled lens left/right and forward/backward to allow the image to align for you. With virtual reality headset for switch OLED, No any issues with the focus or alignment when playing switch VR games.     【Support Certain VR Games】: Only the games including Zelda, Super Smash Bros. Captain Toad, Super Mario Odyssey, LABO VR, Spice & Wolf VR support VR mode(Please upgrade to the highest version). There will be more VR games coming up on switch, and switch VR goggles make the experience even better. Switch OLED VR headset would be big surprise for your friend, family or yourself.     【Immersive Visual Experience】: Before enjoying VR, please remove the film from the lens. Playing switch oled VR games with VR 3D headset goggle is all together a new experience and fun, will let you step into an amazing 3D world, which will bring you a brand-new immersive visual experience. It would be better to take off the joy cons when playing games with nintendo switch vr headset. You can also enjoy Youtube VR videos that are more immersive.     【Premium Material】: The VR goggle for Switch & Switch OLED is made of EVA and Polyester Lycra materials, which help your skin breath and decrease the pressure when playing VR games. You don’t need to hold the switch OLED comparing to cardboard options. The inner layer of vr goggles for switch OLED that touches your face is soft when using VR switch vr headset compatible with nintendo switch.     【Ergonomic Design】: The adjustable headband of VR switch headset fits everyone’s head. Even though wearing myopia glasses, the glass-friendly VR switch goggle is available. Switch VR headset specifically made for the switch and switch OLED as you can tell from all switch VR goggle cutouts for the air vents, speakers, USB port, volume and power buttons. The fixed points makes switch more tight with velcro in vr headset for switch OLED.",
      "details": {
        "brand": "OIVO",
        "operatingSystem": "Nintendo Switch OS",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "Switch VR Headset",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "USB",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "【Upgraded Adjustable Lenses】: Compatible with Nintendo Switch & Switch OLED, the OIVO newly-released switch virtual reality VR headset is upgraded with adjustable lens, which you can adjust switch oled lens left/right and forward/backward to allow the image to align for you. With virtual reality headset for switch OLED, No any issues with the focus or alignment when playing switch VR games."
      }
    },
    {
      "id": "B0CJXVPQF8",
      "name": "RayNeo Air 2 AR Glasses - Smart Glasses with 201\" Micro OLED, Ultra-fast 120Hz, 600nits Brightness, 1080P XR Glasses, Compatible with iPhone 15 Android/iOS/Consoles/PC/Steam Deck/ROG/Mac",
      "ratings": 228,
      "price": "$249.00",
      "image": "https://m.media-amazon.com/images/I/51OnO5BqZuL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "【Brilliant Clarity and Efficiency】: Experience Sony's Next-Gen Micro OLED with 600 nits, 120Hz, and 1080p, for sharper, richer visuals with low power use.     【Wide Compatibility】: (Note: For Pixels, Android phones without DP output, and iPhones with a lightning port, an additional accessory may be required.) Compatible with iPhone 15/15 Pro Max, Switch, Steam Deck, PS4 Slim/PS5, Xbox Series X/S, ROG Ally, MacBook, iPad.     【Ultra-Light, Ultra-Thin, Ultra-Cool】: Just 76g, RayNeo air 2 glasses are lighter and thinner than others, with a cool appearance boasting the most stylish AR glasses design.     【Face Comfort model 2.0】: 9-level adjustment for nose bridge and arms, ensuring the perfect fit and ideal viewing comfort.     【Whisper Mode 2.0 with Phase Cancellation Tech】: Experience clear, crisp audio with advanced pickup capabilities. Enjoy enhanced listening quality coupled with exceptional privacy protection, ensuring your conversations remain confidential.",
      "details": {
        "brand": "N/A",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "【Brilliant Clarity and Efficiency】: Experience Sony's Next-Gen Micro OLED with 600 nits, 120Hz, and 1080p, for sharper, richer visuals with low power use."
      }
    },
    {
      "id": "B07YLD3SHM",
      "name": "Playstation VR Bundle Five Game Pack",
      "ratings": 684,
      "price": "$4498",
      "image": "https://m.media-amazon.com/images/I/41Df69PrL2L._SY430_SX215_QL70_FMwebp_.jpg",
      "description": "Bundle includes Playstation VR headset, Playstation camera, Demo disc 3.0, vouchers for: ASTRO Bot Rescue mission, Everybody's golf VR, Playstation VR worlds, Skyrim VR, Resident Evil 7     Playstation VR aim controller is compatible with the elder scrolls V: Skyrim VR.     Playstation dual shock wireless controller, Playstation move motion controllers, Playstation gold wireless headset, and playstation platinum wireless headset are compatible with Astro Bot rescue mission, everybody's golf VR, playstation VR worlds.",
      "details": {
        "brand": "N/A",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "Bundle includes Playstation VR headset, Playstation camera, Demo disc 3.0, vouchers for: ASTRO Bot Rescue mission, Everybody's golf VR, Playstation VR worlds, Skyrim VR, Resident Evil 7"
      }
    },
    {
      "id": "B0CFRMSZW4",
      "name": "Meta Quest 3-512GB Headset (Oculus) (VR)",
      "ratings": 532,
      "price": "$937.49",
      "image": "https://m.media-amazon.com/images/I/412BHgkgNvL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "815820024095",
      "details": {
        "brand": "Meta Quest",
        "operatingSystem": "Android",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "Bluetooth",
        "color": "Black",
        "ram": "N/A",
        "detail_item": "815820024095"
      }
    },
    {
      "id": "B0CD9QXWJ6",
      "name": "Professor Maxwell's VR Atlas - Virtual Reality Kids Science Kit, Book and Interactive Geography STEM Learning World Travel Activity Set (New Edition)",
      "ratings": 54,
      "price": "$69.99",
      "image": "https://m.media-amazon.com/images/I/716jb4bDowL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "THE ULTIMATE IMMERSIVE VR / AR LEARNING EXPERIENCE - A comprehensive 144 page, interactive, illustrated world atlas, combining world travel with hands-on projects and activities as we emark on hundreds of landmarks, destinations, cities, cultures, currency and cusine from around the world in stunning virtual reality, making this the most comprehensive learning toy on the planet!     IMMERSIVE INTERACTIVE CONTENT - Each page comes alive in both augmented and virtual reality to give you an immersive educational toy experience. Watch as the Colosseum builds itself in AR on the page, then trigger a hotspot and go inside to have a look around for yourself in virtual reality. Imagine learning about Japan, then doing an Origami project. Or digging out your very own T.rex fossil (included) after learning about Dinosaur Provencial Park in Alberta.     MORE THAN JUST GEOGRAPHY - It’s not just about the geography, but the history and science behind it. Explore the topography of deserts and mountains, discover the talletst buildings and longest bridges, and even the oceanography of the reefs as we explore the wonders of the world, one country at a time! Discover the population of each country, and the currency they use, or how they say \"hello\" in the local language and more!     VR GOGGLES INCLUDED - Includes a pair of hands-free goggles to create an immersive learning experience. Download the free mobile app in the Apple or Google store and use any smartphone to get started!     MATERIALS INCLUDED - The kit includes a complete set of materials to engage in hands-on play, including 3D puzzles, a scratch map to track your travels, your very own passport and stamps, along with dozens of games and activities to foster both a tangible and digital learning environment!",
      "details": {
        "brand": "N/A",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "THE ULTIMATE IMMERSIVE VR / AR LEARNING EXPERIENCE - A comprehensive 144 page, interactive, illustrated world atlas, combining world travel with hands-on projects and activities as we emark on hundreds of landmarks, destinations, cities, cultures, currency and cusine from around the world in stunning virtual reality, making this the most comprehensive learning toy on the planet!"
      }
    },
    {
      "id": "B0D49WRMF5",
      "name": "Pimax Crystal Light - Local Dimming with Controllers - High-Resolution Virtual Reality Headset for PC Gaming",
      "ratings": 3,
      "price": "$1,119.00",
      "image": "https://m.media-amazon.com/images/I/51waeAdpdxL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "HIGH-RESOLUTION DISPLAY - Immerse in lifelike visuals and vibrant colors with the impressive 2880x2880 pixels per eye. Every detail rendered with remarkable clarity for an exceptional viewing experience.     GLASS ASPHERIC LENSES - Delight in exceptional clarity thanks to high-resolution lenses and advanced mini LED panels, ensuring every detail is vivid and lifelike.     FIXED FOVEATED RENDERING 2.0: Elevate your PCVR experience with FFR 2.0, by optimizing graphic rendering and focusing on critical areas of vision, this technology ensures a significant increase in frame rate, delivering smoother gameplay and heightened immersion.     MULTIPLE REFRESH RATES OPTION: Choose from 60/72/90/120 Hz to match your computer's graphics card, ensuring smooth visuals tailored to your preference, whether mid-grade or high-performance, for an optimal virtual reality experience.     LOCAL DIMMING: Experience deeper blacks and enhanced contrast with cutting-edge local dimming technology. This feature brings out the finest details in every scene, elevating your virtual reality experience to new heights of realism and immersion.     30 DAYS FULL WARRANTY: Rest assured with our warranty, which provides a 30-day return window for hassle-free returns and exchanges to your local warehouse. In case of any issues, our dedicated customer service is ready to assist, ensuring that your purchase is protected and your satisfaction guaranteed.",
      "details": {
        "brand": "Pimax",
        "operatingSystem": "Windows",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "Crystal Light",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "USB",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "HIGH-RESOLUTION DISPLAY - Immerse in lifelike visuals and vibrant colors with the impressive 2880x2880 pixels per eye. Every detail rendered with remarkable clarity for an exceptional viewing experience."
      }
    },
    {
      "id": "B0D3X57LTF",
      "name": "Upgraded VR Headset for Nintendo Switch & Switch OLED Model, Switch VR Games Glasses with Adjustable HD Lenses and Head Strap with Rotary Button, Labo VR Kit 3D Goggles for Switch Accessory",
      "ratings": 9,
      "price": "$44.99",
      "image": "https://m.media-amazon.com/images/I/71hYxOmhD+L._AC_SY300_SX300_.jpg",
      "description": "Adjustable HD Lenses: This lightweight Nintendo Switch VR headset features wide-range, high-definition lenses that can be adjusted front, back, left, and right to ensure clear and focused vision, even for nearsighted users. The lenses are also fog-resistant for uninterrupted gameplay.     One-Step Wearing Method: The rotary button on the adjustable head strap makes putting on and taking off the headset a breeze, and the overall design is incredibly lightweight for comfortable extended wear.     Compatible with Switch and Switch OLED: This VR headset is compatible with both the original Nintendo Switch and the Switch OLED models (not compatible with the Switch Lite). It supports specific Nintendo Switch VR games in VR mode, including Super Mario Odyssey, The Legend of Zelda: Breath of the Wild, Super Smash Bros, Spice and Wolf, Captain Toad, LABO VR or other Switch VR games, and you can also watch VR videos on youtube through Switch.     Premium Materials: The VR goggle for Nintendo Switch and Switch OLED is crafted from EVA and Polyester Lycra, making it ultra-lightweight and durable. The high-quality sponge eye mask, nose pad, and back padding reduce pressure during gameplay, keeping your skin and neck comfortable for an immersive gaming experience.     Suitable for Everyone: This Switch VR headset is designed to fit all head shapes and sizes, making it an ideal gift for friends, family, or yourself. If you have any questions, please feel free to contact us, and we will reply you within 24 hours!",
      "details": {
        "brand": "LXFEIFANTECH",
        "operatingSystem": "Nintendo Switch",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "Upgraded VR Headset",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "Black&White",
        "ram": "N/A",
        "detail_item": "Adjustable HD Lenses: This lightweight Nintendo Switch VR headset features wide-range, high-definition lenses that can be adjusted front, back, left, and right to ensure clear and focused vision, even for nearsighted users. The lenses are also fog-resistant for uninterrupted gameplay."
      }
    },
    {
      "id": "B0CQPQ659X",
      "name": "HTC Vive Ultimate Tracker 3 Pack + Dongle - VR Full Body Tracking - Compatible with SteamVR + Vive XR Elite Virtual Reality Headset",
      "ratings": 81,
      "price": "$599.99",
      "image": "https://m.media-amazon.com/images/I/31m4zqn0pML._SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Precision Virtual Reality Tracking: Meet the VR tracker for standalone devices. Use a VIVE Wireless Dongle to connect up to 5 VIVE Ultimate Trackers and effortlessly bring real-world movements into virtual or mixed reality.     Compatibility: Get full-body tracking on HTC VIVE XR Elite and VIVE Focus 3, with beta support for third-party PC VR headsets now available. through VIVERSE Discord.     Precision in every move. Meet the VR tracker for standalone devices. Use a VIVE Wireless Dongle to connect up to 5 trackers (1) and effortlessly bring real-world movements into virtual or mixed reality. (2)     Unlock a new dimension of movement and freedom. The first all-in-one positional tracker from HTC VIVE uses AI-powered self-tracking to redefine VR experiences.     Pinpoint accuracy in a compact form. VIVE Ultimate Tracker employs two wide-FOV cameras and computer vision for instant spatial recognition, keeping virtual and physical movements in sync. (2) Its sleek, balanced design offers optimal functionality and comfort throughout use.     Tracking when and where you want it.(4) PC optional, no base stations needed. Just plug a VIVE Wireless Dongle into your headset and enjoy low-latency connectivity. (1) With 6DoF inside-out tracking, maneuvering through even large-scale environments is a breeze. (5)     Add more for full-body precision. Try out new moves in the latest standalone and PC VR games (2) by adding three VIVE Ultimate Trackers and a single VIVE Wireless Dongle to your setup. Or pair 5 VIVE Ultimate Trackers to experience controller-free, full-body tracking. (1)",
      "details": {
        "brand": "N/A",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "Precision Virtual Reality Tracking: Meet the VR tracker for standalone devices. Use a VIVE Wireless Dongle to connect up to 5 VIVE Ultimate Trackers and effortlessly bring real-world movements into virtual or mixed reality."
      }
    },
    {
      "id": "B0CVVVXC8Z",
      "name": "Compatible with Apple Vision Pro Stand Holder Display Stand for Vision Pro 2024 Vr Headset",
      "ratings": 2,
      "price": "$19.99",
      "image": "https://m.media-amazon.com/images/I/61QMmLv027L.__AC_SY300_SX300_QL70_FMwebp_.jpg",
      "description": "Upgraded VR stand offers unparalleled stability and safety, tailored specifically for displaying and storing your Vision Pro VR headset and touch controllers. Boasting a unique sponge non-slip design and a robust textured base, this stand provides a secure platform for your VR headset strap and controllers.     Special made for Apple Vision Pro: The VR Stand is compatible with Vision Pro, providing a secure and convenient storage solution for your headset and controllers.     Handle Organizer Design：Solid double handle hooks on both sides for stability and no wobbling, now you can put VR headsets and controllers on an upgraded VR stand     Protect your VR headset's lenses: With our stable vertical stand, your VR headset is safely displayed with no contact on the lenses, sparing you any worry about scratches.Preserve the optimal condition of your VR equipment and enhance your virtual reality experience.     Package: 1*VR Stand and 1*User Manual. If you have any problem, please freely contact us.Note: the Vision Pro and touch controllers are not included.",
      "details": {
        "brand": "GOSETH",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "Upgraded VR stand offers unparalleled stability and safety, tailored specifically for displaying and storing your Vision Pro VR headset and touch controllers. Boasting a unique sponge non-slip design and a robust textured base, this stand provides a secure platform for your VR headset strap and controllers."
      }
    },
    {
      "id": "B0C9JBVY64",
      "name": "Compatible with Oculus Quest 2 Face Bracket Replacement,VR PU Leather Face Pad Protective for Meta Quest 2,Sweat-Proof Comfortable Face Cover Cushion VR Accessories",
      "ratings": 251,
      "price": "$14.99",
      "image": "https://m.media-amazon.com/images/I/71pOhXRV0YL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "【FITNESS FACIAL INTERFACE REPLACEMENT】This upgraded facial interface bracket for oculus quest 2 is equipped with air vents design to improve air circulation and reduce fogging.It’s effective at reducing pressure and extending your game time.     【ANTI-LIGHT LEAK】The added nose pads prevent light leaks, prevent steam from rising up and obscure your vision, and provide a wider field of view and a tighter fit to enhance your VR gaming experience.     【RELIEF FACE PRESSURE】 The VR face pad accessory is soft enough to help relieve pressure for the Oculus Quest 2 face cushion, and fits securely over your glasses without causing any pressure or irritation. This mask replacement designed for Oculus Quest 2 is also helpful for glasses players.     【UNIQUE DESIGN 】The facial interface frame are 3D shape,easy to install.no folds after installation like others that perfect fit to face,can reduce head pressure and you won’t feel oppressive even after use for a long time.     【COMPATIBLE WITH】The Upgraded replacement facial interface Set compatible with Oculus Quest 2 Accessories.Our face cover is made of PU leather, no need special care.wipe it with wet cloth or just wash it with water can make it clean easily.",
      "details": {
        "brand": "AODELAN",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "VR Face Cover",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "Black VR Face Pad",
        "ram": "N/A",
        "detail_item": "【FITNESS FACIAL INTERFACE REPLACEMENT】This upgraded facial interface bracket for oculus quest 2 is equipped with air vents design to improve air circulation and reduce fogging.It’s effective at reducing pressure and extending your game time."
      }
    },
    {
      "id": "B0CVXF3DKD",
      "name": "VR Headset for Smartphones with Bluetooth Controller, Ultra-Wide 120° Viewing Angle, Adjustable Focus and Eye Width, Aspherical Optical Lens, Good Heat Dissipation, 4.5-6.5 Inch Smartphone",
      "ratings": 35,
      "price": "$29.99",
      "image": "https://m.media-amazon.com/images/I/61tBziC1-6L.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "【With Bluetooth controller】Most VR headset on the market don't have a remote control. And you have to frequently take out your phone while wearing it and put it back into your VR box, which is cumbersome. The remote control is connected to your mobile phone via Bluetooth, and you can directly control the music play/pause and volume +/- with the VR headset's remote control, instantly immersing yourself in the action of games, movies, etc. I can. (AAA batteries not included). However, the controller only supports a few games, especially on IOS system. The remote control is suitable for iOS systems, but has limited functionality. (All remote controls of this type on the market are the same)     【2024 New Popular Design】The pads that come into direct contact with the face are made of eco-friendly materials that are soft to the touch and have good breathability, ensuring that they do not leave marks on the face even when worn for long periods of time. The newly designed 3-axis fixed headband stays in close contact with the head even when the headphones are removed, providing a truly sensory-free wearing experience. 　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　     【120 degree ultra wide angle, 1080P high resolution, aspherical optical lens】LAPORIO VR Headset provides an excellent wearing experience and excellent images. Our VR headset achieves a technical combination of 120 degree ultra-wide angle and 1080P high resolution, delivering an immersive VR video experience. At the same time, we specially selected aspherical optical lenses with anti-blue light and anti-magnetic radiation to eliminate the fatigue of long-time VR video viewing. Immerse yourself in a realistic 3D world while always protecting your health. 　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　     【Good Breathability and Heat Dissipation】While getting a VR experience, smartphones inevitably generate a lot of heat. For the first time, we have adopted a shell that not only ensures the airtightness of smarthone but also greatly enhances heat dissipation on the back of your smartphone in intense heat. At the same time, we have installed ventilation holes for smartphones on both sides of the VR headset, and the bracket for fixing smartphones has a hollow design. This prevents your phone from overheating causing the screen to freeze or become blurry when running VR software, giving you a smoother, more comfortable, and longer-lasting VR experience. 　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　     【Compatible with many models】We offer a smartphone insertion size of 16 x 8 cm, so it is compatible with almost all 4.7 to 6.5 inch smartphones on the market. We also dropped the headset configuration in favor of an environmental theme and weight savings. This means you have the freedom to use wired or wireless earphones for a more personal and customized VR experience.",
      "details": {
        "brand": "LAPORiO",
        "operatingSystem": "iOS, Android",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "Bluetooth",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "【With Bluetooth controller】Most VR headset on the market don't have a remote control. And you have to frequently take out your phone while wearing it and put it back into your VR box, which is cumbersome. The remote control is connected to your mobile phone via Bluetooth, and you can directly control the music play/pause and volume +/- with the VR headset's remote control, instantly immersing yourself in the action of games, movies, etc. I can. (AAA batteries not included). However, the controller only supports a few games, especially on IOS system. The remote control is suitable for iOS systems, but has limited functionality. (All remote controls of this type on the market are the same)"
      }
    },
    {
      "id": "B0BL33L984",
      "name": "DPVR E3C Virtual Reality Headset, VR Set for Business of Egg Seats Headset, VR Simulator Riders, Moto, Time Machine 6 Seats and VR Flying, VR Headsets Not for Personal User",
      "ratings": 7,
      "price": "$319.00",
      "image": "https://m.media-amazon.com/images/I/51bGoVuCJyL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Super Performance: DPVR E3 C virtual reality headset with 360° view, 110° FOV, 70Hz refresh rate, 16ms low latency, 2560 x 1440 resolution. Fast-Switch LCD, powered by 2.5K resolution high precision display. Supports glasses wearing.TUV low blue light certificated, better for eye for long time wearing.     Ergonomic Design: To ensure more realistic and highly comfortable VR headset, DPVR E3 C virtual reality set with a face liner, nose guard and soft face foam. 305g super lightweight, bring you an unprecedented experience. 54mm-74mm IPD self-adjusting. One-size-fits all head strap can be adjustable.     Three-in-One Cable: DPVR 3-in-1 5m / 16 feet long cable--One end with Type C to E3 C VR headset and the other end with one HDMI and two USB, one for charging and one for transmission. Can bend freely without breaking by using durable materials, having good flexibility, stretch resistance, and abrasion resistance. Super cost-effective will make you feel good value.     Application Areas: DPVR E3 C can be used as a wired broadcast solution that takes content from a single HDMI source and shares it out to many, to facilitate group training or presentations. Used as egg seats,simulator rides VR headset. Also for deep customization for B2B solutons: training, education, mediation, medical.     What You Will Have: Included Components 1*DPVR E3 C VR Headset, 1*3-in-1 5m Cable, 1*Back Foam Cushion, and 1*User Manual, Warranty Guide, Quality Certification. If you have any questions, please consult us immediately. Our customer service staff will provide you with 24-hour online professional services.",
      "details": {
        "brand": "DPVR",
        "operatingSystem": "Windows",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "DPVR E3-C",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "USB, HDMI",
        "color": "E3C Hard Strap",
        "ram": "N/A",
        "detail_item": "Super Performance: DPVR E3 C virtual reality headset with 360° view, 110° FOV, 70Hz refresh rate, 16ms low latency, 2560 x 1440 resolution. Fast-Switch LCD, powered by 2.5K resolution high precision display. Supports glasses wearing.TUV low blue light certificated, better for eye for long time wearing."
      }
    },
    {
      "id": "B07VPRVBFF",
      "name": "Valve Index VR Full Kit",
      "ratings": 301,
      "price": "$999.00",
      "image": "https://m.media-amazon.com/images/I/71ZgOpN805L.__AC_SY300_SX300_QL70_FMwebp_.jpg",
      "description": "Displays - Dual 1440 x 1600 LCDs, full RGB per pixel, ultra-low persistence global backlight illumination (0.330ms at 144Hz)     Ergonomic Adjustments - Head size, eye relief (FOV), IPD, speaker positions. Rear cradle adapter included.     Inter-pupillary Distance (IPD) - 58mm - 70mm range physical adjustment     Optics - Double element, canted lens design     NOTE - PC compatible with Valve Index is required",
      "details": {
        "brand": "Valve Index",
        "operatingSystem": "Windows",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "USB",
        "color": "Black",
        "ram": "N/A",
        "detail_item": "Displays - Dual 1440 x 1600 LCDs, full RGB per pixel, ultra-low persistence global backlight illumination (0.330ms at 144Hz)"
      }
    },
    {
      "id": "B0DCJXZNGB",
      "name": "VR Headset with Controller Adjustable 3D VR Glasses Virtual Reality Headset HD Blu-ray Eye Protected Support 5~7 Inch for Phone/Android White",
      "ratings": 8,
      "price": "$30.59",
      "image": "https://m.media-amazon.com/images/I/51RWaNg7PkL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Anti-blue light, comfortable to wear: VR Headsets Easy to set up and easy to use, just open a game or video that supports VR in your mobile phone, and then put your mobile phone into the 3D glasses headset to start your VR journey. Vr goggles adjust interpupillary and object distance to suit different vision, so you can adjust and enjoy clear images. Before putting in the phone, please remove the phone case, increase the video brightness, and then cancel the \"Auto Brightness Adjustment\"     Multiple Apps & Newly Upgraded 3D Technology: Find games or movie apps for VR in the app store, or watch movies, animations, panoramic concerts, VR games, etc. directly on Youtube. Image quality depends on the resolution of the phone and the quality of the video. With HD optimization and 3D gaming support, you'll get into gaming, movies, and more!     Compatible with All Smartphones: VR glasses are suitable for most non-curved smartphones with screen size of 5~7.0 inches     About the handle: Both IOS and Android users can use the handle (the IOS system needs to open a touch function), the handle is only suitable for some small games (simple forward, jump, remote sensing control direction), and can also be used as a Bluetooth mouse. If you don't understand, please contact us in time and we will answer you     Instructions for use: We provide user manuals in six languages (English, Japanese, German, French, Spanish, Italian) for VR and controllers. If you have any questions about the product, please contact us first.",
      "details": {
        "brand": "PUSABIYOU",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "VRG White",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "NFC",
        "color": "White-0930",
        "ram": "N/A",
        "detail_item": "Anti-blue light, comfortable to wear: VR Headsets Easy to set up and easy to use, just open a game or video that supports VR in your mobile phone, and then put your mobile phone into the 3D glasses headset to start your VR journey. Vr goggles adjust interpupillary and object distance to suit different vision, so you can adjust and enjoy clear images. Before putting in the phone, please remove the phone case, increase the video brightness, and then cancel the \"Auto Brightness Adjustment\""
      }
    },
    {
      "id": "B0CZ4JX9JW",
      "name": "Nikon NIKKOR Z 28-400mm f/4-8 VR Mirrorless Lens",
      "ratings": 25,
      "price": " ",
      "image": "https://m.media-amazon.com/images/I/71HT6qXA2+L._AC_SX300_SY300_.jpg",
      "description": "Covers a broad range of focal lengths—from 28mm to 400mm, with a 14.2x zoom.     A minimum focus distance of 0.2 m at the maximum wide-angle position and a maximum reproduction ratio of 0.35x at 28mm allows users to get closer to their subjects for dynamic expression.     A total length of approx. 5.57 in. (141.5 mm) and a weight of approx. 1.6 lbs (725 g)—the lightest lens in its class—make this an easy lens to carry and shoot hand-held.     Stable VR performance equivalent to a 5.0-stop increase in shutter speed effectively reduces blurring in dimly lit surroundings and with hand-held shooting. When paired with a compatible camera, Synchro VR can be activated to achieve up to 5.5-stop stabilization by combining in-camera VR and lens VR.     Support for linear MF drive enables smooth focusing, which is especially useful for video shooting.",
      "details": {
        "brand": "Nikon",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "Covers a broad range of focal lengths—from 28mm to 400mm, with a 14.2x zoom."
      }
    },
    {
      "id": "B0D9R3YVZ6",
      "name": "Sony mocopi 3D Mobile Motion Capture for VR and 3D Content Creation",
      "ratings": 9,
      "price": "$449.99",
      "image": "https://m.media-amazon.com/images/I/41wMr0vCWML._SY300_SX300_QL70_FMwebp_.jpg",
      "description": "PORTABLE MOTION CAPTURE: With mocopi, you can capture your full-body 3D motion anywhere you want with six comfortable, light-weight sensors. Plus two extension bands to prioritize upper-body or lower-body focused tracking.     MOTION CAPTURE MADE EASY: Motion capture is easy using your compatible smartphone. Pair the sensors with your phone, attach and calibrate the sensors, select your avatar and backdrop, and record your motion.     INTERIOR OR EXTERIOR USE: Dustproof and water-resistant, mocopi enables you to record indoors or head outside to create 3D motion content.     IOS AND ANDRIOD COMPATIBLE: Use your compatible iOS or Android phone (see specs) with the mocopi app or use the SDK (software development kit) to create custom uses.     LIGHT-WEIGHT AND COMPACT DESIGN: The small and sleek sensors fit comfortably on various parts of your body and enable a full motion-capture experience without the fuss of full-body suits or complicated wearables.     MOCOPI APP: Simple to run from a compatible smartphone. Complete the end-to-end movie process from content creation, motion data-logging, recording, saving and, finally, transferring. The smartphone app allows you to import avatar data and will help you choose the perfect background.     IN THE BOX: 6x Sensors, Head band, 2x Wrist band, 2x Ankle band, Waist clip, Charging case, 2x Extension band, User manual",
      "details": {
        "brand": "N/A",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "PORTABLE MOTION CAPTURE: With mocopi, you can capture your full-body 3D motion anywhere you want with six comfortable, light-weight sensors. Plus two extension bands to prioritize upper-body or lower-body focused tracking."
      }
    },
    {
      "id": "B07D7HPSFC",
      "name": "Oculus Go Standalone Virtual Reality Headset - 32GB - Xbox 360; Xbox",
      "ratings": 1.65,
      "price": "$61.99",
      "image": "https://m.media-amazon.com/images/I/31--ew3eufL._SY300_SX300_QL70_FMwebp_.jpg",
      "description": "Features 12345     Bullet feature 2     Bullet feature 3",
      "details": {
        "brand": "N/A",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "Features 12345"
      }
    },
    {
      "id": "B08CKJ8PHR",
      "name": "VR Headset for Phone with Controller | Virtual Reality Game System Compatible with iPhone and Android | Virtual Reality Goggles w/Remote Control for Android | 3D Glasses for Kids and Adults Blue",
      "ratings": 5.364,
      "price": "$34.99",
      "image": "https://m.media-amazon.com/images/I/61C9q7iBumL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "✅BONUS: REMOTE CONTROL FOR ANDROID PHONES – Atlasonix virtual VR glasses work with smartphones and mobile devices with 4”- 6.3” screens to bring you a totally immersive visual experience. Boasting HD optimization and 3D gaming support, you’ll put yourself right into the action with games, movies and more!     ✅IMPROVED VISUAL EXPERIENCE – Gaming and watching movies in 3D works best when proper your eyes properly align with the screen. That’s why our 3D headset offers FD and OD adjustments to expand the viewing angle and perfectly match focal distance and unilateral myopic alignment for reduced distortion.     ✅COMFORTABLE, EXTENDED WEAR DESIGN – Once you start gaming and watching 3D movies with Atlasonix, you’re never going to want to take it off. That’s why we offer a comfort-fit experience with a fully adjustable head strap, eyesight protection system, and a soft nose piece to reduce pressure.     ✅PERFECT GIFT FOR KIDS & ADULTS – The best thing about our headset is your ability to play virtual reality games wherever you may go.     ✅EXCLUSIVE VR CONTENT & ONLINE SUPPORT - Along with the more than 300 games, apps and VR adventures to be found on the web, we also provide a QR code with special VR content!",
      "details": {
        "brand": "Atlasonix",
        "operatingSystem": "Android",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "Bluetooth",
        "color": "Blue",
        "ram": "N/A",
        "detail_item": "✅BONUS: REMOTE CONTROL FOR ANDROID PHONES – Atlasonix virtual VR glasses work with smartphones and mobile devices with 4”- 6.3” screens to bring you a totally immersive visual experience. Boasting HD optimization and 3D gaming support, you’ll put yourself right into the action with games, movies and more!"
      }
    },
    {
      "id": "B0CNZV3D9V",
      "name": "Controller Grips Cover for Meta/Oculus Quest 3S / 3 VR Accessories, with Adjustable Knuckle Controller Straps & Easy Battery Opening Cover, Non-Slip Silicone Grips Covers, Not for charging dock",
      "ratings": 48,
      "price": "$18.99",
      "image": "https://m.media-amazon.com/images/I/61LSsPkMkkL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "UPDATED CONTROLLER COVER: ALAFLY controller grip cover is perfectly compatible with Meta Quest 3S 2024 / Meta Quest 3 2023, upgraded battery opening design, easy to replace the battery without removing the whole controller grip cover. (Note: The plastic battery pull tabs should be located under the batteries and not suitable for the charging dock.)     NO SIGNAL BARRIER: ALAFLY controller grip case is designed with precise cutouts according to the Quest 3S / Quest 3 signal holes, which does not affect the signal transmission and at the same time provides a high quality feel and exquisite appearance.     ANTI-SLIP TEXTURED DESIGN: ALAFLY for Oculus Quest 3S / Quest 3 controller grips cover is made of textured soft silicone material, which not only provides a comfortable grip and reduces hand pressure and discomfort during gameplay, but also enhances the friction between your hand and the grip to avoid slipping during playing, ensuring a firm grip on your controller and enhancing your VR gaming experience.     ADJUSTABLE WRIST STRAP: ALAFLY controller wrist strap is made of nylon velcro, which can be easily fixed and adjusted the length and tightness of the wrist strap to fit different hand sizes. It can provide a stable and secure grip for your family and friends to share the fun of VR together.     COMFORTABLE AND DURABLE: ALAFLY controller grip covers are designed for enhanced gaming comfort and enjoyable gaming experience, easy to install and remove. Package includes: 1 pair of controller grip covers with knuckle straps, 1 pair of battery compartment covers, and 2 spare plastic battery pull tabs. (Note: Batteries are not included!) If you have any questions about the products, please feel free to contact us.",
      "details": {
        "brand": "ALAFLY",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "Meta Quest 3S or Meta Quest 3",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "Black",
        "ram": "N/A",
        "detail_item": "UPDATED CONTROLLER COVER: ALAFLY controller grip cover is perfectly compatible with Meta Quest 3S 2024 / Meta Quest 3 2023, upgraded battery opening design, easy to replace the battery without removing the whole controller grip cover. (Note: The plastic battery pull tabs should be located under the batteries and not suitable for the charging dock.)"
      }
    },
    {
      "id": "B0DJ6MP5TW",
      "name": "Silicone Cover Set Compatible with Meta/Oculus Quest 3S: Controller Grips Cover - Facial Interface Cover - Protective Lens Cover - VR Shell Cover",
      "ratings": null,
      "price": "$29.99",
      "image": "https://m.media-amazon.com/images/I/41-dtG1C1FL._SY430_SX215_QL70_FMwebp_.jpg",
      "description": "【Silicone Cover Accessories Compatible With Meta Quest 3s】The silicone cover set includes: 1x Facial Interface Cover, 1x VR Headset Shell Cover, 2 x Controller Grip Cover, 5 x Disposable Eye Cover, 1x Lens Protector, 2x Joysticks Cover, 1 x Cleaning cloth. Ensuring full protection for your Oculus Quest 3S.     【Immersive Gaming Experience】The protective cover set safeguarding Meta Quest 3S from scratches, drops, and damage. The silicone cover offers a comfortable and secure wearing experience, allowing you to dive deeper into virtual reality gaming for an immersive gaming experience.     【Excellent Controller Protection】The controller grips with adjustable hand knuckle straps to fit various hand sizes, so you can focus on the task and not worry about the Quest 3S controller flying out of your hands.     【Enhanced Comfort of Face Cover】The quest 3s face cover is crafted from soft, breathable rubber, it helps maintain a clean VR gaming environment by preventing sweat on your Meta Quest 3S. Ensuring a comfortable and irritation-free gaming experience during long VR games.     【Disposable Eye Cover】Durable non-woven fabric it protects the part of the skin that comes into direct contact with vr equipment from sweat, sebum, cosmetics, and dirt. The ergonomically designed eye mask is soft and breathable. Protect personal hygiene. No need to worry about sharing your VR headset with others.     【Lens Protector Cover Compatible with Meta Quest 3S】Scratch-proof, and sun-proof, Effectively prevent the lens from aging.",
      "details": {
        "brand": "N/A",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "【Silicone Cover Accessories Compatible With Meta Quest 3s】The silicone cover set includes: 1x Facial Interface Cover, 1x VR Headset Shell Cover, 2 x Controller Grip Cover, 5 x Disposable Eye Cover, 1x Lens Protector, 2x Joysticks Cover, 1 x Cleaning cloth. Ensuring full protection for your Oculus Quest 3S."
      }
    },
    {
      "id": "B0CS2TBCTF",
      "name": "Face Cushion Cover for Oculus Quest 3 Face Pad with Lens Covers Protectors Washable VR Silicone Covers for Meta Quest 3 Accessories",
      "ratings": 69,
      "price": "$9.89",
      "image": "https://m.media-amazon.com/images/I/71gF2xwliUL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Enhanced VR Immersion: Enjoy a snug and comfortable fit during long gaming sessions with the Quest 3 face pad. Its soft and plush material ensures a gentle touch against the skin, providing a significantly more comfortable gaming experience compared to the original foam cushion.     Skin-Friendly VR Experience: Specifically crafted to address skin irritation concerns, this silicone VR cover is compatible with Meta Quest 3. The high-quality silicone material ensures a soft, sweat-proof experience, preventing light leakage and enhancing your VR immersion without leaving unsightly sweat stains.     Multi-Proof Lens Cover: Alongside the face pad, enjoy a simple yet efficient lens cover that safeguards your lenses from dust, scratches, and sun damage. Ensure your lenses remain in pristine condition, preserving the visual quality of your VR experience.     Easy Installation and Cleaning: The silicone face cover is hassle-free to install and offers easy removal for cleaning, ensuring a sanitary experience, especially when shared among multiple users.     Ideal Gift for VR Enthusiasts: With its durability, hygiene, and comfort-enhancing features, this VR cover stands as an ideal gift for family and friends who enjoy immersive VR experiences.",
      "details": {
        "brand": "AMZDM",
        "operatingSystem": "Oculus Quest (proprietary)",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "FPQ3B",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "Black",
        "ram": "N/A",
        "detail_item": "Enhanced VR Immersion: Enjoy a snug and comfortable fit during long gaming sessions with the Quest 3 face pad. Its soft and plush material ensures a gentle touch against the skin, providing a significantly more comfortable gaming experience compared to the original foam cushion."
      }
    },
    {
      "id": "B0DHQVSD65",
      "name": "VR Gunstock Accesorries for Quest 2 Meta Quest 3/Quest Pro/Quest 3S Gun Stock Customizes Shape Length FPS Gams Gear Controllers Accessories",
      "ratings": null,
      "price": "$69.98",
      "image": "https://m.media-amazon.com/images/I/61NgoxzTE-L.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Quick Magnetic Attachment: The large magnetic surfaces with 4 magnets on each side allow fast, easy reattachment of controllers, enabling smooth, uninterrupted gameplay for Quest 3 users. Perfect for quick transitions during fast-paced VR sessions     Flexible, Customizable Design: Featuring six hand-tightened screws, this stock can be adjusted to suit any in-game posture, whether for sniper or shotgun setups. Adapt easily to any controller style and elevate your VR experience     Realistic Dimensions: With true-to-life spacing, this Quest 3 gun stock mimics real equipment with 11-inch and 14.5-inch adjustable length options. This design enhances immersion, ensuring a natural feel that avoids the toy-like grip often found in VR accessories     Adjustable Leather-Covered Cheek Pad: Enhance aiming stability with this leather-covered cheek pad, fully adjustable for personalized height. It closely simulates real shooting posture, adding realism to every shot     Rapid-Access Two-Point Sling: The adjustable shoulder strap keeps the Quest 3 gun stock comfortably across your chest, making it easy to grab when you’re ready to jump back into action. Quick to access, ideal for intense gameplay",
      "details": {
        "brand": "SUPERVR",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "Wi-Fi",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "Quick Magnetic Attachment: The large magnetic surfaces with 4 magnets on each side allow fast, easy reattachment of controllers, enabling smooth, uninterrupted gameplay for Quest 3 users. Perfect for quick transitions during fast-paced VR sessions"
      }
    },
    {
      "id": "B0CZ4JX9JW",
      "name": "Nikon NIKKOR Z 28-400mm f/4-8 VR Mirrorless Lens",
      "ratings": 25,
      "price": " ",
      "image": "https://m.media-amazon.com/images/I/71HT6qXA2+L._AC_SX300_SY300_.jpg",
      "description": "Covers a broad range of focal lengths—from 28mm to 400mm, with a 14.2x zoom.     A minimum focus distance of 0.2 m at the maximum wide-angle position and a maximum reproduction ratio of 0.35x at 28mm allows users to get closer to their subjects for dynamic expression.     A total length of approx. 5.57 in. (141.5 mm) and a weight of approx. 1.6 lbs (725 g)—the lightest lens in its class—make this an easy lens to carry and shoot hand-held.     Stable VR performance equivalent to a 5.0-stop increase in shutter speed effectively reduces blurring in dimly lit surroundings and with hand-held shooting. When paired with a compatible camera, Synchro VR can be activated to achieve up to 5.5-stop stabilization by combining in-camera VR and lens VR.     Support for linear MF drive enables smooth focusing, which is especially useful for video shooting.",
      "details": {
        "brand": "Nikon",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "Covers a broad range of focal lengths—from 28mm to 400mm, with a 14.2x zoom."
      }
    },
    {
      "id": "B07HH1FHHX",
      "name": "VR Headset with Remote Controller,HD 3D VR Glasses Virtual Reality Headset for VR Games & 3D Movies, VR Headset for iPhone/Android phone Compatible 4.7-6 inch",
      "ratings": 444,
      "price": "$50.99",
      "image": "https://m.media-amazon.com/images/I/51yTzneBBUL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "★★We only make delicate product!★★VR headset for iPhone/Android phone Compatible 4.7-6 inch,3D glasses can turn mobile phones into cinemas/3D game halls.With Bluetooth remote controller, the effect is better.(PLEASE NOTE:Some software and games do not support the Bluetooth remote control.This is the reason of the software and has nothing to do with the product.The remote is only applicable to iOS 11.2.5 or lower due to the sealing of the iOS system)     ★★Upgraded Version of vr glasses★★With comfortable adjustable earphone, adjust headphones freely. 3D phase sound technology brings you immersion audition experience in three-dimensional space, good sound insulation effect and strong bass, easy experience of VR immersion in the world.     Using Japanese SLR optical PMMA material, the 45MM short focal length design brings a 100 degree wide angle of view, which is closer to the real angle of view of human eyes. Multi function humanized design, bottom button adjustable volume, fast forward, quick retreat, one key to answer the phone.     2 lenses are designed independently, pupil distance and object distance adjustment are available for myopic population. Our model supports naked eye viewing with myopia below 0-600 degrees and direct viewing with myopic glasses. After wearing it, please adjust the left (right) pupil distance to suit yourself.     Compatible with 4-6 inch size iPhone and Android phones;vr glasses for iPhone X 8 7 plus / 6s / 6/6 plus; Samsung s9/s8/s8 plus/s7/s7 Edge/s6/s6 Edge Note8/5/4/3; LG g6 g5 g4 g3 v20; and Daydream phones like Google Pixel/Pixel XL, Huawei Mate 9 Pro;Nexus 5, 6P;5;U11 etc.",
      "details": {
        "brand": "VR SHINECON",
        "operatingSystem": "iOS, Android",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "4351679442",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "Bluetooth",
        "color": "VR headphone plus handle",
        "ram": "N/A",
        "detail_item": "★★We only make delicate product!★★VR headset for iPhone/Android phone Compatible 4.7-6 inch,3D glasses can turn mobile phones into cinemas/3D game halls.With Bluetooth remote controller, the effect is better.(PLEASE NOTE:Some software and games do not support the Bluetooth remote control.This is the reason of the software and has nothing to do with the product.The remote is only applicable to iOS 11.2.5 or lower due to the sealing of the iOS system)"
      }
    },
    {
      "id": "B098JTDPQC",
      "name": "KIWI design Comfort Head Strap Accessories Compatible with Quest 2, Elite Strap Replacement for Enhanced Support, White/Black",
      "ratings": 25.886,
      "price": "$19.99",
      "image": "https://m.media-amazon.com/images/I/41-Ne4HZhvL._SY430_SX215_QL70_FMwebp_.jpg",
      "description": "Improved Side Straps: Our head strap boasts side straps made of upgraded polymer material, which is eco-friendly and incredibly strong. They can withstand over 10,000 bends without breaking, so you can focus on your game without worrying about strap failure     Comfortable and Convenient Design: The 52° adjustable hinge allows you to easily flip up the headset and check your surroundings without taking off the head strap. This feature is especially helpful for glasses wearers. Putting on and taking off the strap is a breeze thanks to this optimized design     Enhanced Head Support: KIWI design elite strap provides superior comfort and stability thanks to its larger head support that fits head circumferences of 17.7-29.5 inches. This enlarged head support cradles your head, making it easy to wear the headset for extended periods of time     Upgraded Cushions: The widened 46mm top strap pad and the thickened 16mm head cushion can effectively improve the comfort and reduce pressure when wearing the headset, and the soft PU leather surface makes it very easy to clean the cushions. Maintenance is simple and easy. All you need to do is to wipe the foams with a wet towel and a microfiber cloth came with the package during the game break session     Easy to Carry and Store: Our head strap is designed to fit in the official carrying case and most other cases on the market. This makes it simple to take on the go and store when you're not using it. Note: Be sure to detach the back bracket before storing it in the official elite strap carrying case",
      "details": {
        "brand": "N/A",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "Improved Side Straps: Our head strap boasts side straps made of upgraded polymer material, which is eco-friendly and incredibly strong. They can withstand over 10,000 bends without breaking, so you can focus on your game without worrying about strap failure"
      }
    },
    {
      "id": "B0747YTV7B",
      "name": "PlayStation VR Headset + Camera Bundle [Discontinued]",
      "ratings": 314,
      "price": "$177.00",
      "image": "https://m.media-amazon.com/images/I/41qvUfo6LwL._SY300_SX300_QL70_FMwebp_.jpg",
      "description": "Ever Expanding Library of Games - PlayStation is committed to continuously delivering new worlds of unexpected gaming experiences through PlayStationVR.     Plug and Play - Getting into PlayStationVR couldn't be easier. Just plug the PSVR headset and your PlayStation Camera into any PlayStation4 system and you're ready to go.     Lightweight Headset Design - The PlayStationVR headset will make you forget that you are wearing one, keeping you free from distraction as you explore new gaming worlds.",
      "details": {
        "brand": "N/A",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "Ever Expanding Library of Games - PlayStation is committed to continuously delivering new worlds of unexpected gaming experiences through PlayStationVR."
      }
    },
    {
      "id": "B076PW5K56",
      "name": "PlayStation VR - Skyrim Bundle [Discontinued]",
      "ratings": 899,
      "price": "$39.99",
      "image": "https://m.media-amazon.com/images/I/51X6qP43KfL._SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Bundle Includes PlayStation VR headset, PlayStation Camera, two PlayStation Move controllers, and Skyrim VR game.     A true, full-length open-world game for PS VR, The Elder Scrolls V: Skyrim VR reimagines the complete epic fantasy masterpiece with an unparalleled sense of scale, depth, and immersion.     Simply plug your PlayStation VR and PlayStation Camera into your PS4 system and transport yourself to new gaming worlds like never before.     Power Source: AC Adapter",
      "details": {
        "brand": "N/A",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "Bundle Includes PlayStation VR headset, PlayStation Camera, two PlayStation Move controllers, and Skyrim VR game."
      }
    },
    {
      "id": "B0BY6PZVV8",
      "name": "AMZDM Controller Grip for Oculus Meta Quest 2 Accessories Grips Cover for VR Touch Controllers Covers Protector with Non-Slip Joystick Covers 1Pair Black",
      "ratings": 1.254,
      "price": "$12.59",
      "image": "https://m.media-amazon.com/images/I/61gV8LUEHyL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Controller Protectors: AMZDM Controller Grips provide a bit of added protection around the main body of your Quest 2 to keep it safe and secure. Strapping the controllers to your hands enables you to let go of the controllers without dropping them, which makes gaming even more fun!     Comfortable and Reliable: The Quest 2 controller grips are also humainized design. Larger area of non-slip design adds friction against your palm while keeping your hand cool. Premium skin-friendly silicone for better grip control, allowing for comfortable use over long time while reducing strain or discomfort on the wrists. Come in a pair of thumb grips with a textured surface for super control feelings, less thumb fatigue.     Durable and Sweat Proof: These grip covers are made of premium silicone material with an unique non-slip pattern. They help your Quest 2 stay in the best condition while protecting the handles from sweat, dust and scratches. After long-time gaming playing, you could clean it by water or damp cloth with ease.     Adjustable and Convenient: The touch controller cover is crafted from vegan leather elastic knuckle straps, which has abrasion resistance, elasticity, and slip resistance. Comfortable and adjustable to fit big, average and small hands. Besides, 360°rotatable rivets increase flexibility that makes it easy to reach the top buttons.     Easy to Install and Remove: Specially designed for Oculus Quest 2 touch controllers, these grips have a perfect fit and install easily. They come in 2 securing grommets that keeps your controllers in place regardless of how intense the game becomes.",
      "details": {
        "brand": "AMZDM",
        "operatingSystem": "Oculus",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "AM01",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "Auxiliary",
        "color": "Black",
        "ram": "N/A",
        "detail_item": "Controller Protectors: AMZDM Controller Grips provide a bit of added protection around the main body of your Quest 2 to keep it safe and secure. Strapping the controllers to your hands enables you to let go of the controllers without dropping them, which makes gaming even more fun!"
      }
    },
    {
      "id": "B07QLRRQB3",
      "name": "Oculus Rift S PC-Powered VR Gaming Headset",
      "ratings": 919,
      "price": "$850.94",
      "image": "https://m.media-amazon.com/images/I/31Z-WdCcu9S._SY300_SX300_QL70_FMwebp_.jpg",
      "description": "Brand New in box. The product ships with all relevant accessories",
      "details": {
        "brand": "N/A",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "Brand New in box. The product ships with all relevant accessories"
      }
    },
    {
      "id": "B0BF511LMZ",
      "name": "5~7inch VRG Pro 3D VR Glasses Virtual Reality Full Screen Visual Wide-Angle VR Glasses Box for 5 to 7 inch Smartphone Eyeglasses with Remote Control (Black Basic)",
      "ratings": 75,
      "price": "$25.90",
      "image": "https://m.media-amazon.com/images/I/51E75h+Y3GL._AC_SY300_SX300_.jpg",
      "description": "【Suitable for Most Mobile Phones】: VR Headset with detachable large screen frame, large and small screen mobile phones are available (maximum support for 7 inch screen mobile phones).     【Adjustable for Everyone】: Independent lens adjustment, adjustable knob for pupil distance, object distance adjustment, myopic people available.     【Immersive 3D】: Our VR headset with 120 degree wide-angle lens, the immersion is better. Can be used together with the handle to experience panoramic immersive 3D world.     【Comfortable】: Removable sponge eye mask, soft and comfortable to wear, natural fit, easy to clean.     【Perfect Design】: Light body, the appearance is not only simple atmosphere, but also convenient to carry.",
      "details": {
        "brand": "NEWSTYP",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "VRGPRO",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "Bluetooth",
        "color": "Black Basic",
        "ram": "N/A",
        "detail_item": "【Suitable for Most Mobile Phones】: VR Headset with detachable large screen frame, large and small screen mobile phones are available (maximum support for 7 inch screen mobile phones)."
      }
    },
    {
      "id": "B0CVVVXC8Z",
      "name": "Compatible with Apple Vision Pro Stand Holder Display Stand for Vision Pro 2024 Vr Headset",
      "ratings": 2,
      "price": "$19.99",
      "image": "https://m.media-amazon.com/images/I/61QMmLv027L.__AC_SY300_SX300_QL70_FMwebp_.jpg",
      "description": "Upgraded VR stand offers unparalleled stability and safety, tailored specifically for displaying and storing your Vision Pro VR headset and touch controllers. Boasting a unique sponge non-slip design and a robust textured base, this stand provides a secure platform for your VR headset strap and controllers.     Special made for Apple Vision Pro: The VR Stand is compatible with Vision Pro, providing a secure and convenient storage solution for your headset and controllers.     Handle Organizer Design：Solid double handle hooks on both sides for stability and no wobbling, now you can put VR headsets and controllers on an upgraded VR stand     Protect your VR headset's lenses: With our stable vertical stand, your VR headset is safely displayed with no contact on the lenses, sparing you any worry about scratches.Preserve the optimal condition of your VR equipment and enhance your virtual reality experience.     Package: 1*VR Stand and 1*User Manual. If you have any problem, please freely contact us.Note: the Vision Pro and touch controllers are not included.",
      "details": {
        "brand": "GOSETH",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "Upgraded VR stand offers unparalleled stability and safety, tailored specifically for displaying and storing your Vision Pro VR headset and touch controllers. Boasting a unique sponge non-slip design and a robust textured base, this stand provides a secure platform for your VR headset strap and controllers."
      }
    },
    {
      "id": "B0DJ38R356",
      "name": "for Oculus Quest 3S/3/2 VR Sweat Guard, Disposable VR Face Cover for Meta Quest 3S/3/2 Headset, 60pcs VR Face Mask with Strong Absorbing Sweat",
      "ratings": 2,
      "price": "$16.99",
      "image": "https://m.media-amazon.com/images/I/41Myy6xMF-L.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Non-Sweat Anymore: Are you still frustrated by excessive sweat during you favorite VR games? The disposable face pad for quest 3 will bring you a surprise; Special material and structure make it absorb and lock in at least 3 ml moisture, keeping your face of VR area dry and improving your gaming experience;     Stretchable & Flexible: Whole body of the disposable quest 3 face pad has strong stretchable ability, and the maximum extension can reach 20 percent of its original area, which means quest 3 face cover can fit the face more perfectly and is suitable for more players with different face shapes; Note: Not fit for small kids;     Soft and Comfort: The disposable quest 2 face cover pad is made of high-quality cotton. It contains no any irritation parts and always brings you soft and comfort feelings; Therefore, it’s popular with almost all kinds of players, even though someone with sensitive face;     Let Face Have A Breath: A non-breathable mask may bring overheating and damage to your delicate face, we have taken this into consideration in deeply when developing the product; Our breathable quest 2 face pad replacement would let your face have some freedom of breathing;     Widely Comparison: Not only for meta/Oculus quest 3/2/1 headset, the quest 2 face cushion is also widely used for apple vision pro, HTC, Pico 4, PSVR 2 or other popular VR headset;",
      "details": {
        "brand": "CSHRUETEN",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "USB",
        "color": "White",
        "ram": "N/A",
        "detail_item": "Non-Sweat Anymore: Are you still frustrated by excessive sweat during you favorite VR games? The disposable face pad for quest 3 will bring you a surprise; Special material and structure make it absorb and lock in at least 3 ml moisture, keeping your face of VR area dry and improving your gaming experience;"
      }
    },
    {
      "id": "B08TB5J7KY",
      "name": "HP Reverb G2 VR Headset With Controller, Adjustable Lenses & Speakers from Valve, 2160 x 2160 LCD Panels, For Gaming, Ergonomic Design, 4 Cameras, Compatible With SteamVR & Windows Mixed Reality",
      "ratings": 397,
      "price": "$999.00",
      "image": "https://m.media-amazon.com/images/I/31NUe6ZAryL._SY300_SX300_QL70_FMwebp_.jpg",
      "description": "THE NO COMPROMISE VR HEADSET - Realistic visuals, soundscapes, and superb performance come together to form a more immersive experience     IT’S ALL INSIDE - Packaging includes HP VR Headset, 6m headset cable for desktop and mobile PCs, 2 motion controllers, 1 DisplayPort to mini-DisplayPort adapter, 1 Power Adapter, and easy set up instructions     EXCEPTIONAL VISUALS AND SOUND - Seeing and hearing is believing with high-quality resolution and fully immersive spatial audio with mura-free 2160 x 2160 LCD panels per eye     A HEADSET THAT ADJUSTS TO YOU - Flexible material, increased cushion size, and lenses that adjust to suit different eye distances, allow you to bask in your virtual world comfortably     MORE CAMERAS. BETTER TRACKING - With 4 built in cameras, and ergonomically designed controls, tracking more movement with the VR headset just got a whole lot easier",
      "details": {
        "brand": "N/A",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "THE NO COMPROMISE VR HEADSET - Realistic visuals, soundscapes, and superb performance come together to form a more immersive experience"
      }
    },
    {
      "id": "B0CJY1WC53",
      "name": "MVPTGRS VR Headset for Original Nintendo Switch & Switch OLED Model Upgraded, Virtual Reality Glasses with Adjustable HD Lenses and Comfortable Head Strap, Labo Kit, 4D Goggles",
      "ratings": 15,
      "price": "$32.99",
      "image": "https://m.media-amazon.com/images/I/81nWRccmtNL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "【Fully upgraded VR glasses】The Switch VR headset has upgraded adjustable lenses that increase the window of view by 20 percent and provide greater clarity. You can easily adjust the Switch's left, right, front, and rear lenses to ensure perfect image alignment and an immersive visual experience. For a truly immersive gaming experience that frees up your hands and lets you enjoy the virtual world to the fullest.     【Support Certain VR Games 】Our Switch VR headset only supports Super Smash Bros, Zelda, Super Mario Odyssey, Captain Toad, Five Nights at Freddy's, and Treasure Tracker in VR Mode (please upgrade to the highest version) or any other Switch VR game, and you can also watch VR videos on YouTube through your Switch. The perfect gift for family or friends who love Switch games. Note: Switch / Switch is not included in the package.     【Quality Material】The VR goggles for Switch and Switch OLED are made of EVA and Polyester Lycra material, which is super lightweight and durable, releasing pressure while playing VR games. The elastic and soft headband can hold the VR goggles firmly on your head when you move, no need to worry about the headset falling off. Give you a better gaming experience.     【Switch Professional Design】The upgraded Swith VR headset is compatible with Nintendo Switch and Nintendo Switch OLED versions, not for Switch lite versions. HD standalone lens perfectly shows the true colors of the Switch screen. When you use it, we recommend you to remove the joystick, because it will be lighter and better meet your needs!     【Size Comfortable Fit】These VR glasses are made with a precise face fit and ergonomics to ensure comfortable wearing. No matter how long you wear them, you can enjoy ultimate comfort. Glass-friendly VR switch goggles are available even if you wear nearsighted glasses.",
      "details": {
        "brand": "MVPTGRS",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "White&Blue",
        "ram": "N/A",
        "detail_item": "【Fully upgraded VR glasses】The Switch VR headset has upgraded adjustable lenses that increase the window of view by 20 percent and provide greater clarity. You can easily adjust the Switch's left, right, front, and rear lenses to ensure perfect image alignment and an immersive visual experience. For a truly immersive gaming experience that frees up your hands and lets you enjoy the virtual world to the fullest."
      }
    },
    {
      "id": "B0BRQMFDQ3",
      "name": "INIU Oculus Link Cable with Charging [16ft] for Meta Quest 3 Quest 2/Pro, Pico 4, PC VR, Steam VR, USB 3.0 High Speed Data Cable, USB C Charger Cord for VR Headset Accessories",
      "ratings": 1.442,
      "price": "$19.79",
      "image": "https://m.media-amazon.com/images/I/81txojoLtnL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "[From INIU--the SAFE Fast Charge Pro] Experience the safest charging with over 38 million global users. At INIU, we use only the highest-quality materials, so we do have the confidence to provide an industry-leading 3-year iNiu Care     [Designed for Oculus Quest 3/2/Pro] Our 2023 version features a separate USB-C charging port, enabling rapid 3A power delivery for uninterrupted gameplay. Use with a PD/QC fast adapter for optimal charging speed. Please note: This is a VR link cable and DO NOT use it to charge your phone, tablet, laptop, etc.     [SAFE Charging via SmartProtect2.0] Link cable built-in SmartProtect2.0 chip balances the electricity and data sync, controls the current for a safe battery range of around 78%, safe and sufficient power use is now in your Oculus.     [16FT/5M for Wider Range of Motion] Reaching 16ft/5m long USB A to USB C cable, plus the anti-wear FLYWEAVE coat, never worry about your freedom of movement or if it is damaged by a stampede(Cable length slightly affects transfer speed).     [Steady Your Game Connection] 90° USB-C hooks the VR glasses firmly, a flexible joint that is intact after 45000+ bend tests, plus a sticky buckle to secure the connection, all of these can up your game to the next level.     [What You Get] INIU 16ft/5m USB 3.0 link cable*1, Quick Start Guide*1, user manual*1, INIU industry-leading 3-year iNiu Care and technical support.",
      "details": {
        "brand": "INIU",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "DI401",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "USB",
        "color": "Black",
        "ram": "N/A",
        "detail_item": "[From INIU--the SAFE Fast Charge Pro] Experience the safest charging with over 38 million global users. At INIU, we use only the highest-quality materials, so we do have the confidence to provide an industry-leading 3-year iNiu Care"
      }
    },
    {
      "id": "B0DGD9P9YR",
      "name": "VR Headset for Smartphones, Ultra-Wide 120° Viewing Angle, Adjustable Focus and Eye Width, Aspherical Optical Lens, Good Heat Dissipation, 4.5-6.5 Inch Smartphone",
      "ratings": 3,
      "price": "$26.99",
      "image": "https://m.media-amazon.com/images/I/61T9VzcKxxL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "【120 degree ultra wide angle, 1080P high resolution, aspherical optical lens】LAPORIO VR Headset provides an excellent wearing experience and excellent images. Our VR headset achieves a technical combination of 120 degree ultra-wide angle and 1080P high resolution, delivering an immersive VR video experience. At the same time, we specially selected aspherical optical lenses with anti-blue light and anti-magnetic radiation to eliminate the fatigue of long-time VR video viewing. Immerse yourself in a realistic 3D world while always protecting your health.     【Good Breathability and Heat Dissipation】While getting a VR experience, smartphones inevitably generate a lot of heat. For the first time, we have adopted a shell that not only ensures the airtightness of smarthone but also greatly enhances heat dissipation on the back of your smartphone in intense heat. At the same time, we have installed ventilation holes for smartphones on both sides of the VR headset, and the bracket for fixing smartphones has a hollow design. This prevents your phone from overheating causing the screen to freeze or become blurry when running VR software, giving you a smoother, more comfortable, and longer-lasting VR experience.     【Compatible with many models】We offer a smartphone insertion size of 16 x 8 cm, so it is compatible with almost all 4.7 to 6.5 inch smartphones on the market. We also dropped the headset configuration in favor of an environmental theme and weight savings. This means you have the freedom to use wired or wireless earphones for a more personal and customized VR experience.     【2024 New Popular Design】The pads that come into direct contact with the face are made of eco-friendly materials that are soft to the touch and have good breathability, ensuring that they do not leave marks on the face even when worn for long periods of time. The newly designed 3-axis fixed headband stays in close contact with the head even when the headphones are removed, providing a truly sensory-free wearing experience.     [Pupil/Focus Adjustment] Focus and pupil distance can be adjusted separately. In addition, a hole is provided for passing through the earphone cable, so you can use your own Bluetooth earphones or wired earphones, and enjoy audio at the same time as the video, allowing you to enjoy a more realistic virtual reality. (Note: The main unit does not come with headphones.)",
      "details": {
        "brand": "LAPORiO",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "1920 × 1080",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "【120 degree ultra wide angle, 1080P high resolution, aspherical optical lens】LAPORIO VR Headset provides an excellent wearing experience and excellent images. Our VR headset achieves a technical combination of 120 degree ultra-wide angle and 1080P high resolution, delivering an immersive VR video experience. At the same time, we specially selected aspherical optical lenses with anti-blue light and anti-magnetic radiation to eliminate the fatigue of long-time VR video viewing. Immerse yourself in a realistic 3D world while always protecting your health."
      }
    },
    {
      "id": "B07YXQJ1S5",
      "name": "Marvel's Iron Man VR - PlayStation 4",
      "ratings": 2.64,
      "price": "$22.90",
      "image": "https://m.media-amazon.com/images/I/515FY-+8ctL._SX342_SY445_.jpg",
      "description": "Using two PlayStation Move motion controllers Fire up iron Man's repulsor jets and Blast into the skies with an arsenal of iconic iron man Gear at your fingertips     Face off against One of iron Man's greatest foes in high stakes, action-packed battles     Upgrade Tech in Tony stark's garage to customize iron Man's sleek armor and awesome abilities",
      "details": {
        "brand": "N/A",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "Using two PlayStation Move motion controllers Fire up iron Man's repulsor jets and Blast into the skies with an arsenal of iconic iron man Gear at your fingertips"
      }
    },
    {
      "id": "B0BJZC9XMM",
      "name": "VR Headset Compatible with iPhone & Android Phone Within 4.7-7.2inch Display Screen- Universal Virtual Reality Goggles- Soft & Comfortable Updated 3D Glasses (G12-White)",
      "ratings": 41,
      "price": "$18.99",
      "image": "https://m.media-amazon.com/images/I/51rCHPrmBuL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "HD Optical Resin Lenses: Unmatched clarity.     Custom Focal Adjustment: Iterpupillary distance and focal length.     Optimized field of View: provides the ultimate 360°experience.     Breathable leather lining,good for watching 3D movies or videos.     lightweight,comfortable, extended wear with ergonomic design.     Gift for kids or adult, a good present for birthday or anniversary.",
      "details": {
        "brand": "BASERY",
        "operatingSystem": "iOS",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "G12",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "Wi-Fi",
        "color": "G12-White",
        "ram": "N/A",
        "detail_item": "HD Optical Resin Lenses: Unmatched clarity."
      }
    },
    {
      "id": "B08WFS5BMY",
      "name": "HTC Vive Tracker (3.0)",
      "ratings": 1.716,
      "price": "$129.00",
      "image": "https://m.media-amazon.com/images/I/31i9yjkF--L._SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Full-Body Tracker: Track the physical presence of your entire body within the virtual environment. Capture full-body motions with as few as 3 trackers (Support for SteamVR BS1.0 and BS2.0).     VR Accessory Tracking: Enable the tracking of real-world objects and VR accessories to increase the realism of your simulation or training experience.     Light Weight: Lighter weight for easier handling, improved comfort, and more uses with your VR set. Your favorite VR tracker just got even more versatile (15% lighter than VIVE Tracker 2018).     Longer Lasting Battery: Work, train, and create for longer with up to 7.5 hours of battery life (Up to 75% longer than VIVE Tracker 2018).     Expand Your View: 240° field of view     Included in the Box: VIVE Tracker (3.0); Dongle; Dongle Cradle (USB-C); USB cable (USB-C)     Tracker compatibility may vary. Please check your product information prior to use.",
      "details": {
        "brand": "N/A",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "Full-Body Tracker: Track the physical presence of your entire body within the virtual environment. Capture full-body motions with as few as 3 trackers (Support for SteamVR BS1.0 and BS2.0)."
      }
    },
    {
      "id": "B0D1ZB1KJR",
      "name": "Bill Nye's Science Squad |Chem Lab VR - Virtual Reality Kids Science Kit, Book and Interactive Learning Activity Set | for Ages 8 and Up",
      "ratings": 5,
      "price": "$34.99",
      "image": "https://m.media-amazon.com/images/I/81sFNapeNkL.__AC_SY300_SX300_QL70_FMwebp_.jpg",
      "description": "IMMERSIVE LEARNING EXPERIENCE Dive into the wonders of science with the one and only Bill Nye “The Science Guy!” Grab your lab coat and step into Bill’s virtual lab where you’ll uncover the microscopic marvels of chemistry in stunning virtual reality. Get ready for hours of mind-blowing, explosive fun (and learning!)—just don’t be surprised if things get a little messy!     A NEW WAY TO PLAY Roll up your sleeves and get hands-on with your very own chemistry set, then strap on your VR goggles and immerse yourself in the unseen world of atoms and molecules all around you! Our innovative blend of physical play and immersive digital content creates hours of fun and exciting experiences!     GET MESSY, LEARN, REPEAT Create chemical reactions that explode into colorful fizzy eruptions, grow a crystal mountain, make your own glow stick and so much more! Kids will have an absolute blast doing their own experiments and discovering the STEAM principles behind them. Step-by-step instructions with pictures and videos ensure all projects are kid-friendly and safe while providing the fizzy, messy, gross fun that kids love!     WHAT’S IN THE BOX? This 23-piece chemistry set is loaded with all the tools and chemicals young scientists need to kickstart their learning adventure, including VR goggles and an interactive 44-page book packed with trusted lessons from Bill Nye! It’s the perfect gift for curious boys and girls that will spark the imagination and inspire a life-long love of learning! For ages 8 and up.     APP INCLUDED Download the app on your smartphone, put on the VR goggles, and step inside Bill Nye’s virtual lab in stunning VR! Compatible with all smartphones with access to Google Play store and Apple iOS App Store. All smartphone mobile devices have been tested to fit into the goggles, including “max” and plus size phones. Goggles are not compatible with tablets.",
      "details": {
        "brand": "N/A",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "IMMERSIVE LEARNING EXPERIENCE Dive into the wonders of science with the one and only Bill Nye “The Science Guy!” Grab your lab coat and step into Bill’s virtual lab where you’ll uncover the microscopic marvels of chemistry in stunning virtual reality. Get ready for hours of mind-blowing, explosive fun (and learning!)—just don’t be surprised if things get a little messy!"
      }
    },
    {
      "id": "B0DJ6MP5TW",
      "name": "Silicone Cover Set Compatible with Meta/Oculus Quest 3S: Controller Grips Cover - Facial Interface Cover - Protective Lens Cover - VR Shell Cover",
      "ratings": null,
      "price": "$29.99",
      "image": "https://m.media-amazon.com/images/I/41-dtG1C1FL._SY430_SX215_QL70_FMwebp_.jpg",
      "description": "【Silicone Cover Accessories Compatible With Meta Quest 3s】The silicone cover set includes: 1x Facial Interface Cover, 1x VR Headset Shell Cover, 2 x Controller Grip Cover, 5 x Disposable Eye Cover, 1x Lens Protector, 2x Joysticks Cover, 1 x Cleaning cloth. Ensuring full protection for your Oculus Quest 3S.     【Immersive Gaming Experience】The protective cover set safeguarding Meta Quest 3S from scratches, drops, and damage. The silicone cover offers a comfortable and secure wearing experience, allowing you to dive deeper into virtual reality gaming for an immersive gaming experience.     【Excellent Controller Protection】The controller grips with adjustable hand knuckle straps to fit various hand sizes, so you can focus on the task and not worry about the Quest 3S controller flying out of your hands.     【Enhanced Comfort of Face Cover】The quest 3s face cover is crafted from soft, breathable rubber, it helps maintain a clean VR gaming environment by preventing sweat on your Meta Quest 3S. Ensuring a comfortable and irritation-free gaming experience during long VR games.     【Disposable Eye Cover】Durable non-woven fabric it protects the part of the skin that comes into direct contact with vr equipment from sweat, sebum, cosmetics, and dirt. The ergonomically designed eye mask is soft and breathable. Protect personal hygiene. No need to worry about sharing your VR headset with others.     【Lens Protector Cover Compatible with Meta Quest 3S】Scratch-proof, and sun-proof, Effectively prevent the lens from aging.",
      "details": {
        "brand": "N/A",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "【Silicone Cover Accessories Compatible With Meta Quest 3s】The silicone cover set includes: 1x Facial Interface Cover, 1x VR Headset Shell Cover, 2 x Controller Grip Cover, 5 x Disposable Eye Cover, 1x Lens Protector, 2x Joysticks Cover, 1 x Cleaning cloth. Ensuring full protection for your Oculus Quest 3S."
      }
    },
    {
      "id": "B0CZKNRFDX",
      "name": "Hibloks 3 in 1 Handle Attachments Fit for Oculus Quest 3 Controller,VR Gorilla Tag Long Arms Grips for Meta Quest 3 Accessories,Beat Saber/Baseball/Golf Club,Enhance More Gaming Experiences",
      "ratings": 592,
      "price": "$24.99",
      "image": "https://m.media-amazon.com/images/I/31DAZW0ORCL._SY430_SX215_QL70_FMwebp_.jpg",
      "description": "【Enhanced VR Gaming Experience】: VR Gaming Expansion Handle Attachment Designed for Quest 3 Controller. When you hold it, you will have an immersive feeling, making the game more real and interesting     【3 Modes of Experience】 : 3-in-1 design Through simple disassembly and assembly, you can get three different types of game extension grips, which can be used by adults and children to play Gorilla Tag, Beat Saber, Golf Club, Baseball, Supernatural Get a better experience while gaming     【Easy to Install and Strong】 : The expansion handle adopts a quick-lock design for easy installation, and the controller fits and locks firmly. We also upgraded ABS reinforced plastic to provide the latest safety structure, which is sturdy and durable, and also adds double protection with a wrist rope, so you don't need to worry, risk of falling     【Lncrease Exercise】: This is good news for VR fitness enthusiasts. The length of each handle is increased by 8.3in and the weight is about 96g, allowing you to exercise better during the game. The whole bar is fully wrapped with sponge, easy to hold, non-slip and sweat-absorbent, there are different color patterns on the two extended handles, easy to distinguish the left controller and the right controller     【What You Get】: 2* extended handles, 2* controller link pieces, 2* protective ropes, 1* instruction manual and Hibloks7*24 friendly customer service, we can help you solve any problems you may encounter.Note：Please make sure your handle buckle is locked",
      "details": {
        "brand": "N/A",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "【Enhanced VR Gaming Experience】: VR Gaming Expansion Handle Attachment Designed for Quest 3 Controller. When you hold it, you will have an immersive feeling, making the game more real and interesting"
      }
    },
    {
      "id": "B0CS2TBCTF",
      "name": "Face Cushion Cover for Oculus Quest 3 Face Pad with Lens Covers Protectors Washable VR Silicone Covers for Meta Quest 3 Accessories",
      "ratings": 69,
      "price": "$9.89",
      "image": "https://m.media-amazon.com/images/I/71gF2xwliUL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Enhanced VR Immersion: Enjoy a snug and comfortable fit during long gaming sessions with the Quest 3 face pad. Its soft and plush material ensures a gentle touch against the skin, providing a significantly more comfortable gaming experience compared to the original foam cushion.     Skin-Friendly VR Experience: Specifically crafted to address skin irritation concerns, this silicone VR cover is compatible with Meta Quest 3. The high-quality silicone material ensures a soft, sweat-proof experience, preventing light leakage and enhancing your VR immersion without leaving unsightly sweat stains.     Multi-Proof Lens Cover: Alongside the face pad, enjoy a simple yet efficient lens cover that safeguards your lenses from dust, scratches, and sun damage. Ensure your lenses remain in pristine condition, preserving the visual quality of your VR experience.     Easy Installation and Cleaning: The silicone face cover is hassle-free to install and offers easy removal for cleaning, ensuring a sanitary experience, especially when shared among multiple users.     Ideal Gift for VR Enthusiasts: With its durability, hygiene, and comfort-enhancing features, this VR cover stands as an ideal gift for family and friends who enjoy immersive VR experiences.",
      "details": {
        "brand": "AMZDM",
        "operatingSystem": "Oculus Quest (proprietary)",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "FPQ3B",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "Black",
        "ram": "N/A",
        "detail_item": "Enhanced VR Immersion: Enjoy a snug and comfortable fit during long gaming sessions with the Quest 3 face pad. Its soft and plush material ensures a gentle touch against the skin, providing a significantly more comfortable gaming experience compared to the original foam cushion."
      }
    },
    {
      "id": "B0DHQVSD65",
      "name": "VR Gunstock Accesorries for Quest 2 Meta Quest 3/Quest Pro/Quest 3S Gun Stock Customizes Shape Length FPS Gams Gear Controllers Accessories",
      "ratings": null,
      "price": "$69.98",
      "image": "https://m.media-amazon.com/images/I/61NgoxzTE-L.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Quick Magnetic Attachment: The large magnetic surfaces with 4 magnets on each side allow fast, easy reattachment of controllers, enabling smooth, uninterrupted gameplay for Quest 3 users. Perfect for quick transitions during fast-paced VR sessions     Flexible, Customizable Design: Featuring six hand-tightened screws, this stock can be adjusted to suit any in-game posture, whether for sniper or shotgun setups. Adapt easily to any controller style and elevate your VR experience     Realistic Dimensions: With true-to-life spacing, this Quest 3 gun stock mimics real equipment with 11-inch and 14.5-inch adjustable length options. This design enhances immersion, ensuring a natural feel that avoids the toy-like grip often found in VR accessories     Adjustable Leather-Covered Cheek Pad: Enhance aiming stability with this leather-covered cheek pad, fully adjustable for personalized height. It closely simulates real shooting posture, adding realism to every shot     Rapid-Access Two-Point Sling: The adjustable shoulder strap keeps the Quest 3 gun stock comfortably across your chest, making it easy to grab when you’re ready to jump back into action. Quick to access, ideal for intense gameplay",
      "details": {
        "brand": "SUPERVR",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "Wi-Fi",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "Quick Magnetic Attachment: The large magnetic surfaces with 4 magnets on each side allow fast, easy reattachment of controllers, enabling smooth, uninterrupted gameplay for Quest 3 users. Perfect for quick transitions during fast-paced VR sessions"
      }
    },
    {
      "id": "B07YXQJ1S5",
      "name": "Marvel's Iron Man VR - PlayStation 4",
      "ratings": 2.64,
      "price": "$22.90",
      "image": "https://m.media-amazon.com/images/I/515FY-+8ctL._SX342_SY445_.jpg",
      "description": "Using two PlayStation Move motion controllers Fire up iron Man's repulsor jets and Blast into the skies with an arsenal of iconic iron man Gear at your fingertips     Face off against One of iron Man's greatest foes in high stakes, action-packed battles     Upgrade Tech in Tony stark's garage to customize iron Man's sleek armor and awesome abilities",
      "details": {
        "brand": "N/A",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "Using two PlayStation Move motion controllers Fire up iron Man's repulsor jets and Blast into the skies with an arsenal of iconic iron man Gear at your fingertips"
      }
    },
    {
      "id": "B07NMYQ3C9",
      "name": "Nintendo Labo Toy-Con 04: VR Kit -Switch Japanese Ver.",
      "ratings": 284,
      "price": "$149.99",
      "image": "https://m.media-amazon.com/images/I/51X8JcGQSIL._SX300_SY300_QL70_FMwebp_.jpg",
      "description": "",
      "details": {
        "brand": "N/A",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "N/A"
      }
    },
    {
      "id": "B08WFS5BMY",
      "name": "HTC Vive Tracker (3.0)",
      "ratings": 1.716,
      "price": "$129.00",
      "image": "https://m.media-amazon.com/images/I/31i9yjkF--L._SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Full-Body Tracker: Track the physical presence of your entire body within the virtual environment. Capture full-body motions with as few as 3 trackers (Support for SteamVR BS1.0 and BS2.0).     VR Accessory Tracking: Enable the tracking of real-world objects and VR accessories to increase the realism of your simulation or training experience.     Light Weight: Lighter weight for easier handling, improved comfort, and more uses with your VR set. Your favorite VR tracker just got even more versatile (15% lighter than VIVE Tracker 2018).     Longer Lasting Battery: Work, train, and create for longer with up to 7.5 hours of battery life (Up to 75% longer than VIVE Tracker 2018).     Expand Your View: 240° field of view     Included in the Box: VIVE Tracker (3.0); Dongle; Dongle Cradle (USB-C); USB cable (USB-C)     Tracker compatibility may vary. Please check your product information prior to use.",
      "details": {
        "brand": "N/A",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "Full-Body Tracker: Track the physical presence of your entire body within the virtual environment. Capture full-body motions with as few as 3 trackers (Support for SteamVR BS1.0 and BS2.0)."
      }
    },
    {
      "id": "B08X2Z2MZ9",
      "name": "Bill Nye's VR Space Lab - Virtual Reality Kids Science Kit, Book and Interactive STEM Learning Activity Set (Full Version - Includes Goggles)",
      "ratings": 532,
      "price": "$59.99",
      "image": "https://m.media-amazon.com/images/I/91UX02d7GBL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "THE ULTIMATE IMMERSIVE LEARNING EXPERIENCE - Join Bill Nye “The Science Guy” and go into the depths of space and time with a 96 page interactive book. Explore the science behind our planet, solar system, galaxy, universe, and more as each spread comes to life in 128 unique virtual and augmented reality experiences!     LEARN, PLAY, EXPERIENCE! - This layered learning experience provides the prime opportunity to absorb information across various channels and mediums, ensuring improved retention of knowledge!     TANGIBLE PLAY - Explore hands-on learning through 15 physical crafts and activities incorporated throughout the book!     WHAT'S IN THE BOX? - The 85 piece set includes all the materials you need to accomplish games, activities, puzzles, crafts and more to foster play through learning with this interactive educational science kit for kids.     VR GOGGLES INCLUDED - Includes a pair of hands-free goggles to create an immersive learning experience. Compatible with all smart phones with access to Google Play store and Apple iOS app store. All smart phone mobile devices have been tested to fit into the goggles, including “max” and plus size phones. Goggles not compatible with tablets.",
      "details": {
        "brand": "N/A",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "THE ULTIMATE IMMERSIVE LEARNING EXPERIENCE - Join Bill Nye “The Science Guy” and go into the depths of space and time with a 96 page interactive book. Explore the science behind our planet, solar system, galaxy, universe, and more as each spread comes to life in 128 unique virtual and augmented reality experiences!"
      }
    },
    {
      "id": "B0CSSPX56G",
      "name": "Upgraded VR Headset for Nintendo Switch & Switch OLED Model, Switch Virtual Reality Glasses with Adjustable HD Lenses and Adjustable Head Strap, Labo VR Kit 3D Goggles for Switch Accessories",
      "ratings": 25,
      "price": "$44.99",
      "image": "https://m.media-amazon.com/images/I/619wuI+pQlL._AC_SY300_SX300_.jpg",
      "description": "Upgraded Switch VR headset: The headset is upgraded with adjustable lens, viewing window is improved by 20% and higher definition, you can adjust switch lens left/right and forward/backward to allow the image to align for you, which will bring you a batter immersive visual experience. Switch VR headset would be big surprise for your friend, family or yourself.     Designed for Switch & Switch OLED: The upgraded swith VR headset is compatible with nintendo switch and nintendo switch OLED version, not for switch lite vertion. When using, we recommend to remove joy cons because it would be more light weight for you.     Support Certain VR Games: Turn on VR mode and experience Super Mario Odyssey, Breath of the Wild, Super Smash Bros, Spice and Wolf, Captain Toad, LABO VR or other Switch VR games, and you can also watch VR videos on youtube through Switch. (Please note: Set the game to VR mode before playing.)     Premium Material: The VR goggle for Switch & Switch OLED is made of EVA and Polyester Lycra materials, super light weight and durable, which help your skin breath and decrease the pressure when playing VR games.     Fun for everyone:The adjustable head strap of VR switch headset fits everyone’s head. Even though wearing myopia glasses, the glass-friendly VR switch goggle is available. If you have any questions, please feel free to contact us, We will reply you within 24 hours!",
      "details": {
        "brand": "DEVASO",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "1280 × 720",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "Upgraded Switch VR headset: The headset is upgraded with adjustable lens, viewing window is improved by 20% and higher definition, you can adjust switch lens left/right and forward/backward to allow the image to align for you, which will bring you a batter immersive visual experience. Switch VR headset would be big surprise for your friend, family or yourself."
      }
    },
    {
      "id": "B019D9F2XS",
      "name": "Mini Virtual Reality Glasses for Smartphone Foldable VR Headset Compliant with iPhone & Android Cell Phone Vr Games and 3D Movies",
      "ratings": 345,
      "price": "$15.99",
      "image": "https://m.media-amazon.com/images/I/71SymXcIXbL.__AC_SY300_SX300_QL70_FMwebp_.jpg",
      "description": "Turn any 4-6\" iPhone/Android smartphone into a virtual reality headset     Enjoy immersive 360 videos, VR games, 3D movies and much more!     Works with over 300 iOS & Android apps, download for free « Homido Center » your mobile VR portal app     Custom designed VR lenses, 100° FOV, minimal distortion and light reflection     Light, foldable, fits in the pocket!",
      "details": {
        "brand": "homido",
        "operatingSystem": "iOS, Android",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "Wireless",
        "color": "White, Black",
        "ram": "N/A",
        "detail_item": "Turn any 4-6\" iPhone/Android smartphone into a virtual reality headset"
      }
    },
    {
      "id": "B0D1Z3WTZX",
      "name": "Professor Maxwell's VR Dinosaurs - Virtual Reality Kids Science Kit, Book and Interactive STEM Learning Activity Set (New Edition) - for Ages 7 and Up",
      "ratings": 26,
      "price": "$49.99",
      "image": "https://m.media-amazon.com/images/I/81XkbIWtqpL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "IMMERSIVE LEARNING EXPERIENCE – Virtual reality brings this 40-page book to life! Explore the science behind how the largest land animals that ever lived ruled the world with over 30 immersive activities.     LEARN, PLAY, EXPERIENCE! - This layered learning experience provides an opportunity to absorb information across various learning stages and mediums, ensuring improved retention of knowledge!     STEP-BY-STEP VIDEOS - Enter augmented reality as pictures turn to video right on the page! Develop the skills and confidence to perform science experiments, then enter Professor Maxwell's virtual reality lab to see science in action!     WHAT'S IN THE BOX? - This 60-piece set includes everything you need to foster play through learning, including VR goggles!     VR GOGGLES INCLUDED - Includes a pair of hands-free goggles to create an immersive learning experience. Compatible with all smartphones with access to Google Play store and Apple iOS app store. All smart phone mobile devices have been tested to fit into the goggles, including “max” and plus size phones. Goggles not compatible with tablets.",
      "details": {
        "brand": "N/A",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "IMMERSIVE LEARNING EXPERIENCE – Virtual reality brings this 40-page book to life! Explore the science behind how the largest land animals that ever lived ruled the world with over 30 immersive activities."
      }
    },
    {
      "id": "B0CRKYLQTY",
      "name": "Nufar VR Gaming Sign, VR Kid Room Gift, Sign For Virtual Reality｜Vintage Wall Decor Aluminium Sign 8\"\" x 12\"\",24ja05cC16",
      "ratings": 1,
      "price": "$8.99",
      "image": "https://m.media-amazon.com/images/I/51w7+Kk7MVL._AC_SX300_SY300_.jpg",
      "description": "✔ [PEFECT SIZE]: 12x8 Inches     ✔ [ALUMINUM CRAFTSMANSHIP]: Made with high-quality aluminum, ensuring a lightweight yet durable sign that outlasts traditional tin signs.     ✔ [APPLICABLE SCENARIOS]: Vintage designs coupled with humorous warnings make it perfect for various public spaces, from restrooms to bars.     ✔ [Easy Installation]: Comes ready-to-hang, making it a breeze to place in your desired location for maximum visibility.     ✔ [LAMINATED PROTECTION]: With lamination, graphics are protected from weather and abuse to preserve a fresh look. Graffiti can be cleaned off too. Clear UV laminate resists chemicals, UV rays, water, and abrasion.",
      "details": {
        "brand": "Nufar",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "24ja05cC16",
        "ram": "N/A",
        "detail_item": "✔ [PEFECT SIZE]: 12x8 Inches"
      }
    },
    {
      "id": "B08RCQX7BC",
      "name": "Adjustable Head Strap Compatible with Quest 2 VR Headset, Elite Strap Replacement for Enhanced Support and Comfort VR",
      "ratings": 878,
      "price": " ",
      "image": "https://m.media-amazon.com/images/I/515ttbrwBxL.__AC_SY445_SX342_QL70_FMwebp_.jpg",
      "description": "",
      "details": {
        "brand": "N/A",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "N/A"
      }
    },
    {
      "id": "B0CVVVXC8Z",
      "name": "Compatible with Apple Vision Pro Stand Holder Display Stand for Vision Pro 2024 Vr Headset",
      "ratings": 2,
      "price": "$19.99",
      "image": "https://m.media-amazon.com/images/I/61QMmLv027L.__AC_SY300_SX300_QL70_FMwebp_.jpg",
      "description": "Upgraded VR stand offers unparalleled stability and safety, tailored specifically for displaying and storing your Vision Pro VR headset and touch controllers. Boasting a unique sponge non-slip design and a robust textured base, this stand provides a secure platform for your VR headset strap and controllers.     Special made for Apple Vision Pro: The VR Stand is compatible with Vision Pro, providing a secure and convenient storage solution for your headset and controllers.     Handle Organizer Design：Solid double handle hooks on both sides for stability and no wobbling, now you can put VR headsets and controllers on an upgraded VR stand     Protect your VR headset's lenses: With our stable vertical stand, your VR headset is safely displayed with no contact on the lenses, sparing you any worry about scratches.Preserve the optimal condition of your VR equipment and enhance your virtual reality experience.     Package: 1*VR Stand and 1*User Manual. If you have any problem, please freely contact us.Note: the Vision Pro and touch controllers are not included.",
      "details": {
        "brand": "GOSETH",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "Upgraded VR stand offers unparalleled stability and safety, tailored specifically for displaying and storing your Vision Pro VR headset and touch controllers. Boasting a unique sponge non-slip design and a robust textured base, this stand provides a secure platform for your VR headset strap and controllers."
      }
    },
    {
      "id": "B0B4VS43P5",
      "name": "VR Facial Interface and Foam Replacement Set for Oculus Meta Quest 2 | Removable Facial Interface Frame & Foam Face Covers Replacement & Anti-Leakage Nose Pad & Lens Cover",
      "ratings": 743,
      "price": "$16.97",
      "image": "https://m.media-amazon.com/images/I/61yizwTDvBL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "【Enhance the Comfort of your Oculus Quest 2 and make your Quest 2 shareable but Private use】 TechKen face cover for Oculus quest 2 is made is made of PU leather with inside sponge foam, and thus to give soft and comfortable feeling when wearing with the device. The PU leather will also prevent sweat so it will keep your quest 2 clean. Most important, a set of extra facial cover interface makes the oculus quest 2 shareble without touching with others.     【Resilient | Vent | Soft Facial Interface Bracket for Quest 2】Based on the original Quest 2 foam interface bracket, this VR facial interface bracket for oculus quest 2 add ventilation and exhaust holes so heat will be easily exported so to protect the device. Soft PU leather and the foam inside makes the bracket soft and well fit to any face shapes, giving a comfortable feeling. It give a possibility to wear meta quest 2 when you have to wear glasses.     【Anti-leakage Pad & Lens Protection】 Silicon nose pad is already set to the bracket, and it fits to any sizes of noses and does great to provent lights from somewhere so makes a more immersive gaming experience during gaming. A extra lens cover is also included. Cover the lens when you don't use your meta quest so to provent from daily scratches and duest.     【Fit most Sized faces】 Special soft and silicon nose pad allows TechKen face cover bracket for Quest 2 to fit most sized faces and noses.     【Package include】1 * Facial Interface Bracket for Oculus Quest 2 (noce pad and soft foam interface included) + 1 * VR Lens Cover for Oculus Quest 2",
      "details": {
        "brand": "TechKen",
        "operatingSystem": "Android",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "辅助",
        "color": "Set1 1Pad",
        "ram": "N/A",
        "detail_item": "【Enhance the Comfort of your Oculus Quest 2 and make your Quest 2 shareable but Private use】 TechKen face cover for Oculus quest 2 is made is made of PU leather with inside sponge foam, and thus to give soft and comfortable feeling when wearing with the device. The PU leather will also prevent sweat so it will keep your quest 2 clean. Most important, a set of extra facial cover interface makes the oculus quest 2 shareble without touching with others."
      }
    },
    {
      "id": "B084QP747Q",
      "name": "Nikon NIKKOR Z 24-200mm VR | Compact all-in-one telephoto zoom lens with image stabilization for Z series mirrorless cameras | Nikon USA Model",
      "ratings": 382,
      "price": "$796.95",
      "image": "https://m.media-amazon.com/images/I/71FmdWDOF2L.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Lens features Nikon technologies including Aspherical Lens Elements, ED Glass Elements, ARNEO Coat and Fluorine Coat     Lens features built-in Vibration Reduction image stabilization     The customizable, clickless control ring offers quick and quiet access to most used camera settings     Image Stabilization: Optical     Mounting Type: Nikon Z     Optical Zoom: 8.3",
      "details": {
        "brand": "Nikon",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "Lens features Nikon technologies including Aspherical Lens Elements, ED Glass Elements, ARNEO Coat and Fluorine Coat"
      }
    },
    {
      "id": "B01M4L36RJ",
      "name": "Nikon AF-S NIKKOR 70-200mm f/2.8E FL ED VR Lens",
      "ratings": 375,
      "price": "$1,357.03",
      "image": "https://m.media-amazon.com/images/I/61VizubhU6L.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Minimum Focus Distance- 3.6 feet (1.1 meter)     Diaphragm blades: 9. Format: FX/35 millimeter. Minimum Aperture: f/ 22     Focus distance indicator- 1.1 am to infinity     Accepts Filter Type: Screw-on     Compatible with new Z Nikkor lenses, over 360 F-mount Nikkor lenses and a variety of Nikon system Accessories",
      "details": {
        "brand": "Nikon",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "Minimum Focus Distance- 3.6 feet (1.1 meter)"
      }
    },
    {
      "id": "B07VZSDF3W",
      "name": "HTC VIVE SteamVR Base Station 2.0",
      "ratings": 1.53,
      "price": "$199.00",
      "image": "https://m.media-amazon.com/images/I/31r+LmSIrML._SX342_SY445_.jpg",
      "description": "Includes One base station and one power adapter per order     Fits standard threaded mounting points     Cord: 8' 2'' L     Compatible with Vive Pro, Vive Pro Eye, Vive Pro 2 and Vive Cosmos Elite headsets",
      "details": {
        "brand": "N/A",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "Includes One base station and one power adapter per order"
      }
    },
    {
      "id": "B09KZ99RJL",
      "name": "DEVASO VR Headset for Nintendo Switch & Switch OLED Model, 3D VR Glasses with Adjustable Lens for Virtual Reality Gaming Experience, Switch VR Labo Goggles Headset for Nintendo Switch",
      "ratings": 570,
      "price": "$32.99",
      "image": "https://m.media-amazon.com/images/I/71ns4ggwJTL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "【Immersive VR Game Experience】Special virtual reality vr glasses for Nintendo switch, playing switch oled VR games with VR 3D headset goggle is all together a new experience and fun, will let you step into an amazing 3D world. It will be a great surprise as a gift for friends, family or yourself.     【Adjustable Lenses】Adjustable power high-definition lens, suitable for all kinds of people with different eyesight, perfectly match focal distance and unilateral myopic alignment for reduced distortion to ensure an optimal viewing experience.     【Premium Material】Made of EVA and Oxford materials, super light weight and durable, no worry that your VR glass get mildew in wet weather, includes adjustable headstrap and more thick materials to touch your face, no need to grip the switch console near your head.     【Support Certain VR Games】: Turn on VR mode and experience Super Mario Odyssey, Breath of the Wild, Super Smash Bros, Spice and Wolf, Captain Toad, LABO VR or other Switch VR games, and you can also watch VR videos on youtube through Switch. (Please note: Set the game to VR mode before playing.)     【Ergonomic Headband Design】Adjust the size to fit for everyone's head, with heat dissipation and type C port holes,VR headset comes with a fully adjustable head strap, eyesight protection system, and a soft nose piece. If you have any questions, please feel free to contact us!",
      "details": {
        "brand": "DEVASO",
        "operatingSystem": "Switch",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "Bluetooth, USB",
        "color": "VR Headset",
        "ram": "N/A",
        "detail_item": "【Immersive VR Game Experience】Special virtual reality vr glasses for Nintendo switch, playing switch oled VR games with VR 3D headset goggle is all together a new experience and fun, will let you step into an amazing 3D world. It will be a great surprise as a gift for friends, family or yourself."
      }
    },
    {
      "id": "B0DBVKTVDD",
      "name": "KIWI design D2 3-in-1 Controller Charging Station for PSVR2 and PS5 with VR Display Stand and LED-Charging Indicator",
      "ratings": 56,
      "price": "$69.99",
      "image": "https://m.media-amazon.com/images/I/61zx3dKy7VL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "All-in-One Charging Solution: Charge both your PSVR2 and PS5 controllers simultaneously with a single, convenient station. No more clutter or multiple chargers—just plug in and power up with ease.     Space-Efficient Vertical Design: Save valuable space in your gaming setup with a vertical design that minimizes its footprint. This stand not only charges your controllers but also securely displays your PSVR2 headset, keeping your area tidy and organized.     Stable and Secure Construction: Designed for maximum stability, the station features a non-slip silicone base and a balanced structure that prevents tipping. Your headset and controllers stay securely in place, giving you peace of mind.     Fast and Reliable Charging: Equipped with a powerful 22.5W adapter, this station ensures fast and efficient charging for all your devices. Fully charge your controllers in just 1.5-2 hours, so you’re always ready for your next gaming session.     Real-Time LED Charge Indicators: Stay informed with built-in LED indicators that show the charging status of each controller in real-time. Know at a glance when your devices are fully charged and ready to go.",
      "details": {
        "brand": "KIWI design",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "USB",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "All-in-One Charging Solution: Charge both your PSVR2 and PS5 controllers simultaneously with a single, convenient station. No more clutter or multiple chargers—just plug in and power up with ease."
      }
    },
    {
      "id": "B0CK9G9R88",
      "name": "Bill Nye's Science Squad: Rocket Lab VR - Virtual Reality Kids Science Kit, Book and Interactive Learning Activity Set - for Ages 8 and Up",
      "ratings": 28,
      "price": "$44.99",
      "image": "https://m.media-amazon.com/images/I/91RhRF4SZdL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "IMMERSIVE LEARNING EXPERIENCE! Blast off with Bill Nye “The Science Guy” and discover the science behind how rockets work. Explore the planets and the amazing technology we use to study the cosmos in the included 40-page book. Orbit Earth, land on the Moon, and even travel beyond the solar system—all in spectacular virtual reality!     LEARN, PLAY, EXPERIENCE! This layered learning experience helps children absorb information across various learning stages, ensuring improved content retention!     TANGIBLE PLAY! Explore hands-on learning with your very own fully customizable rocket. Stand back and watch as your rocket blasts up to 50 feet into the air!     WHAT'S IN THE BOX? This activity set comes packed with everything a young rocket scientist needs to blast off on a learning adventure, including a 23-piece rocket kit, 40-page book, and VR goggles!     VR GOGGLES INCLUDED! Includes a pair of hands-free goggles to create an immersive learning experience. Compatible with all smartphones with access to Google Play store and Apple iOS App Store. All smartphone mobile devices have been tested to fit into the goggles, including “max” and plus size phones. Goggles are not compatible with tablets.",
      "details": {
        "brand": "N/A",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "IMMERSIVE LEARNING EXPERIENCE! Blast off with Bill Nye “The Science Guy” and discover the science behind how rockets work. Explore the planets and the amazing technology we use to study the cosmos in the included 40-page book. Orbit Earth, land on the Moon, and even travel beyond the solar system—all in spectacular virtual reality!"
      }
    },
    {
      "id": "B096DHS1BF",
      "name": "Unknown Product",
      "ratings": null,
      "price": "N/A",
      "image": "N/A",
      "description": "",
      "details": {
        "brand": "N/A",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "N/A"
      }
    },
    {
      "id": "B0DJ6MP5TW",
      "name": "Silicone Cover Set Compatible with Meta/Oculus Quest 3S: Controller Grips Cover - Facial Interface Cover - Protective Lens Cover - VR Shell Cover",
      "ratings": null,
      "price": "$29.99",
      "image": "https://m.media-amazon.com/images/I/41-dtG1C1FL._SY430_SX215_QL70_FMwebp_.jpg",
      "description": "【Silicone Cover Accessories Compatible With Meta Quest 3s】The silicone cover set includes: 1x Facial Interface Cover, 1x VR Headset Shell Cover, 2 x Controller Grip Cover, 5 x Disposable Eye Cover, 1x Lens Protector, 2x Joysticks Cover, 1 x Cleaning cloth. Ensuring full protection for your Oculus Quest 3S.     【Immersive Gaming Experience】The protective cover set safeguarding Meta Quest 3S from scratches, drops, and damage. The silicone cover offers a comfortable and secure wearing experience, allowing you to dive deeper into virtual reality gaming for an immersive gaming experience.     【Excellent Controller Protection】The controller grips with adjustable hand knuckle straps to fit various hand sizes, so you can focus on the task and not worry about the Quest 3S controller flying out of your hands.     【Enhanced Comfort of Face Cover】The quest 3s face cover is crafted from soft, breathable rubber, it helps maintain a clean VR gaming environment by preventing sweat on your Meta Quest 3S. Ensuring a comfortable and irritation-free gaming experience during long VR games.     【Disposable Eye Cover】Durable non-woven fabric it protects the part of the skin that comes into direct contact with vr equipment from sweat, sebum, cosmetics, and dirt. The ergonomically designed eye mask is soft and breathable. Protect personal hygiene. No need to worry about sharing your VR headset with others.     【Lens Protector Cover Compatible with Meta Quest 3S】Scratch-proof, and sun-proof, Effectively prevent the lens from aging.",
      "details": {
        "brand": "N/A",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "【Silicone Cover Accessories Compatible With Meta Quest 3s】The silicone cover set includes: 1x Facial Interface Cover, 1x VR Headset Shell Cover, 2 x Controller Grip Cover, 5 x Disposable Eye Cover, 1x Lens Protector, 2x Joysticks Cover, 1 x Cleaning cloth. Ensuring full protection for your Oculus Quest 3S."
      }
    },
    {
      "id": "B0CZKNRFDX",
      "name": "Hibloks 3 in 1 Handle Attachments Fit for Oculus Quest 3 Controller,VR Gorilla Tag Long Arms Grips for Meta Quest 3 Accessories,Beat Saber/Baseball/Golf Club,Enhance More Gaming Experiences",
      "ratings": 592,
      "price": "$24.99",
      "image": "https://m.media-amazon.com/images/I/31DAZW0ORCL._SY430_SX215_QL70_FMwebp_.jpg",
      "description": "【Enhanced VR Gaming Experience】: VR Gaming Expansion Handle Attachment Designed for Quest 3 Controller. When you hold it, you will have an immersive feeling, making the game more real and interesting     【3 Modes of Experience】 : 3-in-1 design Through simple disassembly and assembly, you can get three different types of game extension grips, which can be used by adults and children to play Gorilla Tag, Beat Saber, Golf Club, Baseball, Supernatural Get a better experience while gaming     【Easy to Install and Strong】 : The expansion handle adopts a quick-lock design for easy installation, and the controller fits and locks firmly. We also upgraded ABS reinforced plastic to provide the latest safety structure, which is sturdy and durable, and also adds double protection with a wrist rope, so you don't need to worry, risk of falling     【Lncrease Exercise】: This is good news for VR fitness enthusiasts. The length of each handle is increased by 8.3in and the weight is about 96g, allowing you to exercise better during the game. The whole bar is fully wrapped with sponge, easy to hold, non-slip and sweat-absorbent, there are different color patterns on the two extended handles, easy to distinguish the left controller and the right controller     【What You Get】: 2* extended handles, 2* controller link pieces, 2* protective ropes, 1* instruction manual and Hibloks7*24 friendly customer service, we can help you solve any problems you may encounter.Note：Please make sure your handle buckle is locked",
      "details": {
        "brand": "N/A",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "【Enhanced VR Gaming Experience】: VR Gaming Expansion Handle Attachment Designed for Quest 3 Controller. When you hold it, you will have an immersive feeling, making the game more real and interesting"
      }
    },
    {
      "id": "B0CS2TBCTF",
      "name": "Face Cushion Cover for Oculus Quest 3 Face Pad with Lens Covers Protectors Washable VR Silicone Covers for Meta Quest 3 Accessories",
      "ratings": 69,
      "price": "$9.89",
      "image": "https://m.media-amazon.com/images/I/71gF2xwliUL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Enhanced VR Immersion: Enjoy a snug and comfortable fit during long gaming sessions with the Quest 3 face pad. Its soft and plush material ensures a gentle touch against the skin, providing a significantly more comfortable gaming experience compared to the original foam cushion.     Skin-Friendly VR Experience: Specifically crafted to address skin irritation concerns, this silicone VR cover is compatible with Meta Quest 3. The high-quality silicone material ensures a soft, sweat-proof experience, preventing light leakage and enhancing your VR immersion without leaving unsightly sweat stains.     Multi-Proof Lens Cover: Alongside the face pad, enjoy a simple yet efficient lens cover that safeguards your lenses from dust, scratches, and sun damage. Ensure your lenses remain in pristine condition, preserving the visual quality of your VR experience.     Easy Installation and Cleaning: The silicone face cover is hassle-free to install and offers easy removal for cleaning, ensuring a sanitary experience, especially when shared among multiple users.     Ideal Gift for VR Enthusiasts: With its durability, hygiene, and comfort-enhancing features, this VR cover stands as an ideal gift for family and friends who enjoy immersive VR experiences.",
      "details": {
        "brand": "AMZDM",
        "operatingSystem": "Oculus Quest (proprietary)",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "FPQ3B",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "Black",
        "ram": "N/A",
        "detail_item": "Enhanced VR Immersion: Enjoy a snug and comfortable fit during long gaming sessions with the Quest 3 face pad. Its soft and plush material ensures a gentle touch against the skin, providing a significantly more comfortable gaming experience compared to the original foam cushion."
      }
    },
    {
      "id": "B0DHQVSD65",
      "name": "VR Gunstock Accesorries for Quest 2 Meta Quest 3/Quest Pro/Quest 3S Gun Stock Customizes Shape Length FPS Gams Gear Controllers Accessories",
      "ratings": null,
      "price": "$69.98",
      "image": "https://m.media-amazon.com/images/I/61NgoxzTE-L.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Quick Magnetic Attachment: The large magnetic surfaces with 4 magnets on each side allow fast, easy reattachment of controllers, enabling smooth, uninterrupted gameplay for Quest 3 users. Perfect for quick transitions during fast-paced VR sessions     Flexible, Customizable Design: Featuring six hand-tightened screws, this stock can be adjusted to suit any in-game posture, whether for sniper or shotgun setups. Adapt easily to any controller style and elevate your VR experience     Realistic Dimensions: With true-to-life spacing, this Quest 3 gun stock mimics real equipment with 11-inch and 14.5-inch adjustable length options. This design enhances immersion, ensuring a natural feel that avoids the toy-like grip often found in VR accessories     Adjustable Leather-Covered Cheek Pad: Enhance aiming stability with this leather-covered cheek pad, fully adjustable for personalized height. It closely simulates real shooting posture, adding realism to every shot     Rapid-Access Two-Point Sling: The adjustable shoulder strap keeps the Quest 3 gun stock comfortably across your chest, making it easy to grab when you’re ready to jump back into action. Quick to access, ideal for intense gameplay",
      "details": {
        "brand": "SUPERVR",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "Wi-Fi",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "Quick Magnetic Attachment: The large magnetic surfaces with 4 magnets on each side allow fast, easy reattachment of controllers, enabling smooth, uninterrupted gameplay for Quest 3 users. Perfect for quick transitions during fast-paced VR sessions"
      }
    },
    {
      "id": "B07NMYQ3C9",
      "name": "Nintendo Labo Toy-Con 04: VR Kit -Switch Japanese Ver.",
      "ratings": 284,
      "price": "$149.99",
      "image": "https://m.media-amazon.com/images/I/51X8JcGQSIL._SX300_SY300_QL70_FMwebp_.jpg",
      "description": "",
      "details": {
        "brand": "N/A",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "N/A"
      }
    },
    {
      "id": "B091MRTB13",
      "name": "PlayStation VR Marvel's Iron Man VR Bundle",
      "ratings": 556,
      "price": "$39.99",
      "image": "https://m.media-amazon.com/images/I/51PfD-yqxuS.__AC_SY300_SX300_QL70_FMwebp_.jpg",
      "description": "",
      "details": {
        "brand": "PlayStation",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "VR Iron Man Bundle Motion Controller",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "Bluetooth",
        "color": "Multicolor",
        "ram": "N/A",
        "detail_item": "N/A"
      }
    },
    {
      "id": "B08X2Z2MZ9",
      "name": "Unknown Product",
      "ratings": null,
      "price": "N/A",
      "image": "N/A",
      "description": "",
      "details": {
        "brand": "N/A",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "N/A"
      }
    },
    {
      "id": "B0BGW1GCPZ",
      "name": "Unknown Product",
      "ratings": null,
      "price": "N/A",
      "image": "N/A",
      "description": "",
      "details": {
        "brand": "N/A",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "N/A"
      }
    },
    {
      "id": "B0BRQMFDQ3",
      "name": "INIU Oculus Link Cable with Charging [16ft] for Meta Quest 3 Quest 2/Pro, Pico 4, PC VR, Steam VR, USB 3.0 High Speed Data Cable, USB C Charger Cord for VR Headset Accessories",
      "ratings": 1.442,
      "price": "$19.79",
      "image": "https://m.media-amazon.com/images/I/81txojoLtnL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "[From INIU--the SAFE Fast Charge Pro] Experience the safest charging with over 38 million global users. At INIU, we use only the highest-quality materials, so we do have the confidence to provide an industry-leading 3-year iNiu Care     [Designed for Oculus Quest 3/2/Pro] Our 2023 version features a separate USB-C charging port, enabling rapid 3A power delivery for uninterrupted gameplay. Use with a PD/QC fast adapter for optimal charging speed. Please note: This is a VR link cable and DO NOT use it to charge your phone, tablet, laptop, etc.     [SAFE Charging via SmartProtect2.0] Link cable built-in SmartProtect2.0 chip balances the electricity and data sync, controls the current for a safe battery range of around 78%, safe and sufficient power use is now in your Oculus.     [16FT/5M for Wider Range of Motion] Reaching 16ft/5m long USB A to USB C cable, plus the anti-wear FLYWEAVE coat, never worry about your freedom of movement or if it is damaged by a stampede(Cable length slightly affects transfer speed).     [Steady Your Game Connection] 90° USB-C hooks the VR glasses firmly, a flexible joint that is intact after 45000+ bend tests, plus a sticky buckle to secure the connection, all of these can up your game to the next level.     [What You Get] INIU 16ft/5m USB 3.0 link cable*1, Quick Start Guide*1, user manual*1, INIU industry-leading 3-year iNiu Care and technical support.",
      "details": {
        "brand": "INIU",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "DI401",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "USB",
        "color": "Black",
        "ram": "N/A",
        "detail_item": "[From INIU--the SAFE Fast Charge Pro] Experience the safest charging with over 38 million global users. At INIU, we use only the highest-quality materials, so we do have the confidence to provide an industry-leading 3-year iNiu Care"
      }
    },
    {
      "id": "B0CSSPX56G",
      "name": "Upgraded VR Headset for Nintendo Switch & Switch OLED Model, Switch Virtual Reality Glasses with Adjustable HD Lenses and Adjustable Head Strap, Labo VR Kit 3D Goggles for Switch Accessories",
      "ratings": 25,
      "price": "$44.99",
      "image": "https://m.media-amazon.com/images/I/619wuI+pQlL._AC_SY300_SX300_.jpg",
      "description": "Upgraded Switch VR headset: The headset is upgraded with adjustable lens, viewing window is improved by 20% and higher definition, you can adjust switch lens left/right and forward/backward to allow the image to align for you, which will bring you a batter immersive visual experience. Switch VR headset would be big surprise for your friend, family or yourself.     Designed for Switch & Switch OLED: The upgraded swith VR headset is compatible with nintendo switch and nintendo switch OLED version, not for switch lite vertion. When using, we recommend to remove joy cons because it would be more light weight for you.     Support Certain VR Games: Turn on VR mode and experience Super Mario Odyssey, Breath of the Wild, Super Smash Bros, Spice and Wolf, Captain Toad, LABO VR or other Switch VR games, and you can also watch VR videos on youtube through Switch. (Please note: Set the game to VR mode before playing.)     Premium Material: The VR goggle for Switch & Switch OLED is made of EVA and Polyester Lycra materials, super light weight and durable, which help your skin breath and decrease the pressure when playing VR games.     Fun for everyone:The adjustable head strap of VR switch headset fits everyone’s head. Even though wearing myopia glasses, the glass-friendly VR switch goggle is available. If you have any questions, please feel free to contact us, We will reply you within 24 hours!",
      "details": {
        "brand": "DEVASO",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "1280 × 720",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "Upgraded Switch VR headset: The headset is upgraded with adjustable lens, viewing window is improved by 20% and higher definition, you can adjust switch lens left/right and forward/backward to allow the image to align for you, which will bring you a batter immersive visual experience. Switch VR headset would be big surprise for your friend, family or yourself."
      }
    },
    {
      "id": "B07GQPWJQN",
      "name": "PlayStation VR - Creed: Rise to Glory + Superhot Bundle",
      "ratings": 354,
      "price": "$32.00",
      "image": "https://m.media-amazon.com/images/I/31iS4fHq+mL._SX342_SY445_.jpg",
      "description": "Winner of numerous VR Game of the Year awards, SUPERHOT VR is a title reimagined and redesigned from the ground up for VR and hand tracking controller     Phantom Melee Technology will make your avatar feel every punch, uppercut, and flurry through situational desynchronization, including fatigue, staggering, and knockouts in CREED: Rise to Glory     Bundle includes PlayStation VR headset, PlayStation Camera, Demo Disc 2.0, two PlayStation Move Motion controllers, CREED: Rise to Glory Blu Ray Disc and SUPERHOT VR game voucher",
      "details": {
        "brand": "N/A",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "Winner of numerous VR Game of the Year awards, SUPERHOT VR is a title reimagined and redesigned from the ground up for VR and hand tracking controller"
      }
    },
    {
      "id": "B0D1Z3WTZX",
      "name": "Unknown Product",
      "ratings": null,
      "price": "N/A",
      "image": "N/A",
      "description": "",
      "details": {
        "brand": "N/A",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "N/A"
      }
    },
    {
      "id": "B0CVVVXC8Z",
      "name": "Compatible with Apple Vision Pro Stand Holder Display Stand for Vision Pro 2024 Vr Headset",
      "ratings": 2,
      "price": "$19.99",
      "image": "https://m.media-amazon.com/images/I/61QMmLv027L.__AC_SY300_SX300_QL70_FMwebp_.jpg",
      "description": "Upgraded VR stand offers unparalleled stability and safety, tailored specifically for displaying and storing your Vision Pro VR headset and touch controllers. Boasting a unique sponge non-slip design and a robust textured base, this stand provides a secure platform for your VR headset strap and controllers.     Special made for Apple Vision Pro: The VR Stand is compatible with Vision Pro, providing a secure and convenient storage solution for your headset and controllers.     Handle Organizer Design：Solid double handle hooks on both sides for stability and no wobbling, now you can put VR headsets and controllers on an upgraded VR stand     Protect your VR headset's lenses: With our stable vertical stand, your VR headset is safely displayed with no contact on the lenses, sparing you any worry about scratches.Preserve the optimal condition of your VR equipment and enhance your virtual reality experience.     Package: 1*VR Stand and 1*User Manual. If you have any problem, please freely contact us.Note: the Vision Pro and touch controllers are not included.",
      "details": {
        "brand": "GOSETH",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "Upgraded VR stand offers unparalleled stability and safety, tailored specifically for displaying and storing your Vision Pro VR headset and touch controllers. Boasting a unique sponge non-slip design and a robust textured base, this stand provides a secure platform for your VR headset strap and controllers."
      }
    },
    {
      "id": "B0C18X1DM5",
      "name": "Unknown Product",
      "ratings": null,
      "price": "N/A",
      "image": "N/A",
      "description": "",
      "details": {
        "brand": "N/A",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "N/A"
      }
    },
    {
      "id": "B01M4L36RJ",
      "name": "Unknown Product",
      "ratings": null,
      "price": "N/A",
      "image": "N/A",
      "description": "",
      "details": {
        "brand": "N/A",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "N/A"
      }
    },
    {
      "id": "B08B3HTWLS",
      "name": "GOOVIS Young Meta -Universe None VR HMD Monitor with HD M-OLED Display, Portable Privacy Cinema for Movies, Compatible with Laptop PC Xbox Drone PS4 PS5 Nintendo Games Set-top Box Smartphone Black",
      "ratings": 28,
      "price": "$699.00",
      "image": "https://m.media-amazon.com/images/I/51eB-G9jUBL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "【Extraordinary Visual Effect】: With two 1920*1080 M-OLED displays, Meta -Universe None VR HMD Monitor.This head-mounted display provides brilliant color and brightness to the picture. Its extraordinary visual effect gives you realistic cinema experience, makes you feel like sitting in the center of a 800-inch cinematic screen.The definition is better than most other VR products. Leading technology bring in the smallest optical distortion 1.5%.     【Unlimited Mobile Entertainment】GOOVIS Young is your personal HD display, which meets multiple needs such as gaming, watching movies, EVF, social distancing, browsing. Suitable for laptop, tablet, drone, Xbox One, console, set-top box.Provide your own personal theater and enjoy anything you want.     【Lightweight】: The main body is only 7.05oz (200g), which is light and does not give any weight pressure to your head when you wear it. The adjustable head strap makes the VR headset closer to the face, which is designed to fit a wide range of head sizes.Enjoy high-efficient working in financial data and others.     【No Eye Strain】:With diopter adjustment, it meets the needs of person who has different eyesight prescription. Moreover, it can effectively lower your exposure to shortwave blue light with its twin M-OLED displays, which ensures that your eyes do not feel tired or strain after using it for a long time.Please adjust the right eye sight before using.For light leakage, we prepare special face cushion with different center and edge thickness, if need ,contact with us.     【Plug and Play】: The headset with USB-C interface, is suitable for most device, no need to install any app on it. Use our video adapter can connect to HDMI. for Iphone need to use our video adapter and Iphone lightning adapter to connect. For Astigmatism degree:please contact with us for making your own Astigmatic Lens,Easy To Install and remove: Directly mounted on the VR headset.",
      "details": {
        "brand": "Goovis",
        "operatingSystem": "Android",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "GOOVIS Young mobile personal cinema",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "Wired",
        "color": "Black",
        "ram": "N/A",
        "detail_item": "【Extraordinary Visual Effect】: With two 1920*1080 M-OLED displays, Meta -Universe None VR HMD Monitor.This head-mounted display provides brilliant color and brightness to the picture. Its extraordinary visual effect gives you realistic cinema experience, makes you feel like sitting in the center of a 800-inch cinematic screen.The definition is better than most other VR products. Leading technology bring in the smallest optical distortion 1.5%."
      }
    },
    {
      "id": "B08WFS5BMY",
      "name": "Unknown Product",
      "ratings": null,
      "price": "N/A",
      "image": "N/A",
      "description": "",
      "details": {
        "brand": "N/A",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "N/A"
      }
    },
    {
      "id": "B0D4584S5Z",
      "name": "Unknown Product",
      "ratings": null,
      "price": "N/A",
      "image": "N/A",
      "description": "",
      "details": {
        "brand": "N/A",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "N/A"
      }
    },
    {
      "id": "B09KZ99RJL",
      "name": "DEVASO VR Headset for Nintendo Switch & Switch OLED Model, 3D VR Glasses with Adjustable Lens for Virtual Reality Gaming Experience, Switch VR Labo Goggles Headset for Nintendo Switch",
      "ratings": 570,
      "price": "$32.99",
      "image": "https://m.media-amazon.com/images/I/71ns4ggwJTL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "【Immersive VR Game Experience】Special virtual reality vr glasses for Nintendo switch, playing switch oled VR games with VR 3D headset goggle is all together a new experience and fun, will let you step into an amazing 3D world. It will be a great surprise as a gift for friends, family or yourself.     【Adjustable Lenses】Adjustable power high-definition lens, suitable for all kinds of people with different eyesight, perfectly match focal distance and unilateral myopic alignment for reduced distortion to ensure an optimal viewing experience.     【Premium Material】Made of EVA and Oxford materials, super light weight and durable, no worry that your VR glass get mildew in wet weather, includes adjustable headstrap and more thick materials to touch your face, no need to grip the switch console near your head.     【Support Certain VR Games】: Turn on VR mode and experience Super Mario Odyssey, Breath of the Wild, Super Smash Bros, Spice and Wolf, Captain Toad, LABO VR or other Switch VR games, and you can also watch VR videos on youtube through Switch. (Please note: Set the game to VR mode before playing.)     【Ergonomic Headband Design】Adjust the size to fit for everyone's head, with heat dissipation and type C port holes,VR headset comes with a fully adjustable head strap, eyesight protection system, and a soft nose piece. If you have any questions, please feel free to contact us!",
      "details": {
        "brand": "DEVASO",
        "operatingSystem": "Switch",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "Bluetooth, USB",
        "color": "VR Headset",
        "ram": "N/A",
        "detail_item": "【Immersive VR Game Experience】Special virtual reality vr glasses for Nintendo switch, playing switch oled VR games with VR 3D headset goggle is all together a new experience and fun, will let you step into an amazing 3D world. It will be a great surprise as a gift for friends, family or yourself."
      }
    },
    {
      "id": "B07JZL5QK3",
      "name": "Unknown Product",
      "ratings": null,
      "price": "N/A",
      "image": "N/A",
      "description": "",
      "details": {
        "brand": "N/A",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "N/A"
      }
    },
    {
      "id": "B07PWJP96F",
      "name": "Unknown Product",
      "ratings": null,
      "price": "N/A",
      "image": "N/A",
      "description": "",
      "details": {
        "brand": "N/A",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "N/A"
      }
    },
    {
      "id": "B076Q313Y6",
      "name": "Unknown Product",
      "ratings": null,
      "price": "N/A",
      "image": "N/A",
      "description": "",
      "details": {
        "brand": "N/A",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "N/A"
      }
    },
    {
      "id": "B0DJ6MP5TW",
      "name": "Unknown Product",
      "ratings": null,
      "price": "N/A",
      "image": "N/A",
      "description": "",
      "details": {
        "brand": "N/A",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "N/A"
      }
    },
    {
      "id": "B0CZKNRFDX",
      "name": "Unknown Product",
      "ratings": null,
      "price": "N/A",
      "image": "N/A",
      "description": "",
      "details": {
        "brand": "N/A",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "N/A"
      }
    }
  ]
}
