{
  "totalProducts": 23,
  "products": [
    {
      "id": "B09F99Y93H",
      "name": "VssoPlor Wireless Mouse, 2.4G Slim Portable Computer Mice with Nano Receiver for Notebook, PC, Laptop, Computer (White and Gold)",
      "ratings": 22.375,
      "price": "$9.99",
      "image": "https://m.media-amazon.com/images/I/61C6OW3tLRL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "LOW POWER CONSUMPTION: Intelligent sleep mode can better extend battery life. It will enter auto sleep mode if you don't use it for 5 minutes to save battery and need to click it, the mouse will enter working mode again     STABLE CONNECTION: 2.4 GHz wireless provides stronger anti-interference ability, a faster transmission speed and a more reliable connection, working distances can up to 15 m, and high DPI can make it track more smoothly over most surfaces     WIDE COMPATIBILITY:Well compatible with Windows7/8/10/XP, Vista, Mac OS X 10.4 etc. Fits for desktop, laptop, PC, Macbook and other devices     ERGONOMIC & COMPACT DESIGN: USB-receiver stays in your PC USB port or stows conveniently inside the wireless mouse when not in use. The lightweight and simple features make the mouse perfect for the journey, office, home     WHISPER & SENSITIVE CLICKING: Smooth frosted surface and quiet clicks can bring a better user experience and free your worry about bothering others and keep you stay focused while working",
      "details": {
        "brand": "VssoPlor",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "2.4G Wireless",
        "color": "White and Gold",
        "ram": "N/A",
        "detail_item": "LOW POWER CONSUMPTION: Intelligent sleep mode can better extend battery life. It will enter auto sleep mode if you don't use it for 5 minutes to save battery and need to click it, the mouse will enter working mode again"
      }
    },
    {
      "id": "B0CHNVBBLF",
      "name": "SM900 White Wired Gaming Mouse with Honeycomb Shell,12800 DPI,7 Programmable Buttons,Lightweight Gaming Mice Ergonomic Computer Wired Mouse Gaming for Win/PC/Mac/Laptop Gamer",
      "ratings": 440,
      "price": "$14.99",
      "image": "https://m.media-amazon.com/images/I/61wmkh+azPL._AC_SY300_SX300_.jpg",
      "description": "6 Levels Adjustable DPI:SM900 is a powerful gaming mouse with excellent performance,It supports 6 levels adjustment DPI up to 12800.Rolling Rate max to 1000Hz,According user's preference setup different DPI and Rolling Rate suitable for games, office and many occasions     4 Mode Switch:SM900 wired mouse supports 4 modes switch, default 1 office mode and 3 gaming modes.Gaming modes need setup by macro software, according to the user's gaming preferences setup different button functions     Support Custom and Macro Program:SM900 lightweight wired mouse supports macro settings, user can reset the mouse buttons, DPI,modes, lighting effects.Customize personalized gaming mouse according to user preferences.This mouse is widely supported Windows 7,8,10,XP,,VISTA,MAC OS, etc, The USB interface is plug and play     3 Sided Honeycomb Shell design: SM900 Wired mouse more breathable, more sweat-absorbent and more comfortable!!!The gaming mouse is made of high quality ABS material and designed with ergonomic hollow perforated housing, Ergonomic Design reduce the weight and make the mouse more flexible and easier to be used for a long time without fatigue, and also enhance the heat dissipation features, very comfortable to use     14 RGB Rainbow Backlight:SM900 pc gaming mice has adjustable RGB lights that can be set to different effects according to user preferences. The brilliant lighting effects provide illumination in dark environments also increases the fun of using",
      "details": {
        "brand": "SOLAKAKA",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "wired",
        "color": "white",
        "ram": "N/A",
        "detail_item": "6 Levels Adjustable DPI:SM900 is a powerful gaming mouse with excellent performance,It supports 6 levels adjustment DPI up to 12800.Rolling Rate max to 1000Hz,According user's preference setup different DPI and Rolling Rate suitable for games, office and many occasions"
      }
    },
    {
      "id": "0380709244",
      "name": "The Mouse and the Motorcycle",
      "ratings": 4.804,
      "price": " ",
      "image": "https://m.media-amazon.com/images/I/51q6UlEfEsL._SY445_SX342_.jpg",
      "description": "",
      "details": {
        "brand": "N/A",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "N/A"
      }
    },
    {
      "id": "B0836GXKKB",
      "name": "Uiosmuph LED Wireless Mouse, G12 Slim Rechargeable Silent Mouse, 2.4G Portable USB Optical Computer Mice with USB Receiver and Type C Adapter (Matte Black)",
      "ratings": 70.868,
      "price": "$25.25",
      "image": "https://m.media-amazon.com/images/I/51KCV2cdDsS.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Rechargeable: Built-in rechargeable battery, no need change battery. Special soundless design for the right and left buttons, won’t disturb others.     Colorful Light: 7 different color changes randomly while in use, offering soothing lighting, creating cool and fancy atmosphere for work and play.     Energy Saving: The mouse will be in sleep mode in 8 mins of inactivity. And the LED light can be turned off by the bottom light switch.     Slim & Portable: About 4.4 x 2.2 x 0.79 inches, Suitable for travelling carry and it can be easily put into your laptop bag and ultra-space saving.     Widely Compatibility: Works with Windows 2000/XP/7/8/10/Vista, Mac with USB port or Type C port. Suitable for homes, offices, travel and more.",
      "details": {
        "brand": "Uiosmuph",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "USB",
        "color": "Matte Black",
        "ram": "N/A",
        "detail_item": "Rechargeable: Built-in rechargeable battery, no need change battery. Special soundless design for the right and left buttons, won’t disturb others."
      }
    },
    {
      "id": "B0C51J2ZXN",
      "name": "Razer Cobra Gaming Mouse: 58g, Gen-3 Optical Switches, Chroma RGB Lighting, 8500 DPI Sensor, PTFE Feet, Speedflex Cable - Black",
      "ratings": 1.011,
      "price": "$39.99",
      "image": "https://m.media-amazon.com/images/I/61N55jovDVL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "58G LIGHTWEIGHT DESIGN — Built to fit most grip styles, the mouse allows for fast, precise control and feels comfortable to use during long gaming sessions     GEN-3 OPTICAL MOUSE SWITCHES — Unrivalled durability and speed with switches that have an extended 90-million click lifecycle and eliminate double-clicking issues, boasting a blistering 0.2 ms actuation time without debounce delay     CHROMA LIGHTING WITH GRADIENT UNDERGLOW — Customize the mouse with 16.8 million colors and countless lighting effects, creating a more immersive gaming experience as the lights react dynamically with hundreds of Chroma-integrated games     PRECISE SENSOR ADJUSTMENTS — Fine-tune the mouse's sensitivity with precise adjustments in 50 DPI increments to achieve a truly tailored play style     SPEEDFLEX CABLE — Provides greater flexibility and is designed to produce minimal drag, perform quicker and more fluid swipes, and offer a higher degree of control     100 percent PTFE MOUSE FEET — Made from the highest grade of PTFE, the Cobra’s mouse feet on the front, rear, and sensor ring allows it to glide smoothly across any surface     1 SELLING PC GAMING PERIPHERALS BRAND IN THE U.S. — Source: Circana, Retail Tracking Service, U.S., Dollar Sales, Gaming Designed Mice, Keyboards, and PC Headsets, Jan. 2019- Dec. 2023 combined",
      "details": {
        "brand": "Razer",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "USB",
        "color": "Black",
        "ram": "N/A",
        "detail_item": "58G LIGHTWEIGHT DESIGN — Built to fit most grip styles, the mouse allows for fast, precise control and feels comfortable to use during long gaming sessions"
      }
    },
    {
      "id": "B07V83NMCV",
      "name": "Alienware Wired/Wireless Gaming Mouse AW610M: 16000 DPI Optical Sensor - 350 Hour Rechargeable Battery, 7 Buttons, 3-ZONE 16.8m AlienFX RGB Lighting, Edge-Free Design, Ergonomic, Dark Side of the Moon",
      "ratings": 1.576,
      "price": "$58.99",
      "image": "https://m.media-amazon.com/images/I/71u65w5IiEL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Power your way to victory: Game with confidence thanks to industry-leading power efficiency. With up to 350 hours of gameplay on a single charge of the lithium-ion battery, you can keep the fight going for weeks on end.     Attack with deadly precision: Move swiftly and precisely with the latest generation custom Alienware native 16,000 DPI sensor.     Control the battlefield: Wield greater precision while in the middle of combat with the custom, adjustable scroll wheel that allows you to switch between 12 and 24 steps per scroll wheel revolution.     Light it up: Fly your colors on the battlefield with fully customizable AlienFX RGB, giving you 16.8m color control via Alienware Command Center.     Personalize your arsenal: Switch up your gameplay instantly with seven buttons that are fully programmable thanks to the Alienware Command Center. Plus, stay one-step ahead of your opponents with pre-loaded tension on the main clicker mechanism for a controlled, crisp, tactile click feel.",
      "details": {
        "brand": "Alienware",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "Wireless, wired - USB",
        "color": "Dark Side of the Moon",
        "ram": "N/A",
        "detail_item": "Power your way to victory: Game with confidence thanks to industry-leading power efficiency. With up to 350 hours of gameplay on a single charge of the lithium-ion battery, you can keep the fight going for weeks on end."
      }
    },
    {
      "id": "B0D4PJ4G6Q",
      "name": "memzuoix 2.4G Wireless Mouse, 1200 DPI Computer Wireless Mouse with USB Receiver, Portable Wireless USB Mouse Battery Powered Cordless Mouse for Laptop, PC, Desktop, 5 Buttons (Matte Black)",
      "ratings": 19.17,
      "price": "$12.99",
      "image": "https://m.media-amazon.com/images/I/61PWW86mULL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "【Comfortable Hand-Feeling】 memzuoix 2.4G wireless mouse has modern contoured shape, sweat-resistant, and skin-friendly finish are for maximum comfort and support. The thoughtful ring and little finger rest provide extra comfort. The sturdy scroll wheel with rubber of usb mouse wireless makes sure that your hand will not slip when scrolling.     【Plug & Play Super Easy To Use】Really plug & play design, no drivers need to be installed. 2.4GHz wireless transmission technology provides a powerful and reliable connection up to 43.0ft. Portable design makes wireless usb mouse easy to store in a bag for traveling.Computer wireless mouse size: 4.19 x 2.63 x 1.5 inch.     【Energy Saving Design】Before using it, please remove the USB receiver(inside the battery compartment) and then install 2*AAA Dry Batteries(Not Included)!! The 'On/Off' switch design solves the trouble of changing battery frequently. Besides,mouse for computer wireless will turn to sleep mode in 7mins of inactivity for energy saving, can be easily activated by clicking any buttons.     【 Strong Durability & Multifunction】Wireless mouse battery powered passed 6,000,000 times keystroke test to guarantee extra durability. 2.4GHz wireless technology and professional chip ensure longer working distance.memzuoix wireless mouse is also constructed with 5 buttons with multifunctional functions to improve productivity and efficiency in daily work.     【Widely Compatible】Compatible with Windows 8/7/10/Vista/XP/2000, Mac, If you are using a Linux, because of the different needs of its kernel, you need to set related software of the requirements, this ergonomic mouse will be used normally. (NOTE!! Both forward and backward buttons are not recognized on Mac).     【USB Port Required】The memzuoix wireless mouse connects via a USB receiver and requires your computer to have a USB port.If your laptop doesn't have a usb port, you can use a hub to connect them.     【Widely Used】The wireless mouse is suitable for use in the office, home, school.Ergonomic wireless mouse is easy to carry, you can put it in the computer bag and take it to the coffee shop, library for office. It is also a good gift for family and friends on special days such as the school season and Christmas.",
      "details": {
        "brand": "memzuoix",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "USB",
        "color": "Matte Black",
        "ram": "N/A",
        "detail_item": "【Comfortable Hand-Feeling】 memzuoix 2.4G wireless mouse has modern contoured shape, sweat-resistant, and skin-friendly finish are for maximum comfort and support. The thoughtful ring and little finger rest provide extra comfort. The sturdy scroll wheel with rubber of usb mouse wireless makes sure that your hand will not slip when scrolling."
      }
    },
    {
      "id": "B0BGJT87N2",
      "name": "Razer Naga V2 HyperSpeed Wireless MMO Gaming Mouse: 19 Programmable Buttons - HyperScroll Technology - Focus Pro 30K Optical Sensor - Mechanical Mouse Switches Gen-2 - Up to 400 Hr Battery Life",
      "ratings": 862,
      "price": "$78.99",
      "image": "https://m.media-amazon.com/images/I/61YULkQowXL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "19 PROGRAMMABLE BUTTONS — Armed with ergonomically positioned buttons that provide an arsenal of commands at the fingertips for mapping out the essentials or going all out with advanced macros     RAZER HYPERSPEED WIRELESS (2.4 GHZ) AND BLUETOOTH — Unleash seamless, low-latency performance that's 25% faster than other wireless tech or switch to Bluetooth for longer hours of gaming     POWERED BY RAZER HYPERSCROLL TECHNOLOGY — Perform repeated commands rapidly or blaze through content in free-spin mode, or activate tactile mode for enhanced precision and satisfying feedback     LONG BATTERY LIFE — With up to 400 hours on Bluetooth and 250 hours of seamless low-latency gaming on Razer HyperSpeed Wireless (2.4GHz), last longer in the heat of battle with this mouse before having to replace its battery     FOCUS PRO 30K OPTICAL SENSOR — Razer’s brand-new sensor provides flawless tracking performance on a wider variety of surfaces including glass —supported by intelligent functions for enhanced aim and control     MECHANICAL MOUSE SWITCHES GEN 2 — With gold-plated contact points, the switches are less prone to degrading and have a longer lifespan of up to 60 million clicks     #1 SELLING PC GAMING PERIPHERALS BRAND IN THE U.S. — Source — Circana, Retail Tracking Service, U.S., Dollar Sales, Gaming Designed Mice, Keyboards, and PC Headsets, Jan. 2019- Dec. 2023 combined",
      "details": {
        "brand": "Razer",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "Bluetooth, USB",
        "color": "Black",
        "ram": "N/A",
        "detail_item": "19 PROGRAMMABLE BUTTONS — Armed with ergonomically positioned buttons that provide an arsenal of commands at the fingertips for mapping out the essentials or going all out with advanced macros"
      }
    },
    {
      "id": "B07F816PH9",
      "name": "Razer Mamba Elite Wired Gaming Mouse: 16,000 DPI Optical Sensor - Chroma RGB Lighting - 9 Programmable Buttons - Mechanical Switches",
      "ratings": 20.723,
      "price": "$57.00",
      "image": "https://m.media-amazon.com/images/I/61YTpIudkeL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Connectivity Technology: Usb",
      "details": {
        "brand": "Razer",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "USB",
        "color": "Classic Black",
        "ram": "N/A",
        "detail_item": "Connectivity Technology: Usb"
      }
    },
    {
      "id": "B0CP3HTHLZ",
      "name": "TECKNET Wireless Mouse (BT5.0/3.0 & 2.4G) Rechargeable 4800 DPI Silent Mouse 6 Buttons Bluetooth Mouse, USB A Mouse Wide Compatibility - Grey",
      "ratings": 11.45,
      "price": "$16.99",
      "image": "https://m.media-amazon.com/images/I/61MoSPeCRuL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Dual Device Connection: Connect two devices simultaneously using either Bluetooth(3.0/5.0) or USB A connection for a wireless mouse experience. Seamlessly switch between the connected devices with a simple slide of the switch button. This makes it an ideal choice for those seeking both a usb mouse and a bluetooth mouse. (PLEASE NOTE: The mouse is better suited for SMALL to MEDIUM-sized hands. However, if you have larger hands yet enjoy a smaller mouse, you might also like this one.)     Rechargeable Mouse: Say goodbye to constantly changing batteries. Our bluetooth mouse for laptop is rechargeable, taking only 1.5 to 2 hours to fully charge. Once fully charged, it provides around 3 months of usage (based on 2 hours of daily use). It's the perfect solution for those looking for a rechargeable wireless mouse. (A charging cable is included.)     6 Adjustable Level: This computer mouse offers 6 adjustable DPI levels (4800/3200/2400/1600/1200/800), allowing you to easily customize DPI to suit your preferences. Whether you need precise control for detailed work or swift movement for browsing, this wireless mouse for laptop has you covered.     Silent Operation: Enjoy a noiseless experience with this silent mouse. The wireless bluetooth mouse is designed to provide quiet operation, making it suitable for environments where silence is appreciated, such as libraries or offices.     Wide Compatibility: The wireless silent mouse is compatible with various systems including Windows/macOS/Chrome/Linux. It works seamlessly with laptop, computers and other devices, making it a versatile option for anyone in need of a wireless computer mouse. (Side buttons are not compatible with macOS)     36 MONTHS SUPPORT: If you encounter any problems in using the product, please feel free to contact our professional customer service team, enjoying TECKNET 36 Months Warranty (Registered Only)",
      "details": {
        "brand": "TECKNET",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "Wireless, USB A, Bluetooth",
        "color": "Grey",
        "ram": "N/A",
        "detail_item": "Dual Device Connection: Connect two devices simultaneously using either Bluetooth(3.0/5.0) or USB A connection for a wireless mouse experience. Seamlessly switch between the connected devices with a simple slide of the switch button. This makes it an ideal choice for those seeking both a usb mouse and a bluetooth mouse. (PLEASE NOTE: The mouse is better suited for SMALL to MEDIUM-sized hands. However, if you have larger hands yet enjoy a smaller mouse, you might also like this one.)"
      }
    },
    {
      "id": "B08NWY67DM",
      "name": "Mouse Hunt",
      "ratings": 3.234,
      "price": "$12.99",
      "image": "https://m.media-amazon.com/images/I/51J7YLn2ckL._SX300_SY300_QL70_FMwebp_.jpg",
      "description": "",
      "details": {
        "brand": "N/A",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "N/A"
      }
    },
    {
      "id": "B097F8H1MC",
      "name": "Razer Basilisk V3 - Ergonomic Wired Gaming Mouse",
      "ratings": 9.211,
      "price": "$43.99",
      "image": "https://m.media-amazon.com/images/I/61WeAIZSmrL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "10+1 Programmable Buttons For Limitless Configurations: Assign all your macros and secondary functions across 11 programmable buttons—including its acclaimed multi-function trigger—to execute essential actions like push-to-talk, ping, and more.     Razer HyperScroll Tilt Wheel For Smooth, Free-Spin Scrolling or Tactile Cycling: Speed through content with a scroll wheel that free-spins until it’s stopped, or switch to tactile mode for more precision and satisfying feedback that’s ideal for cycling through weapons or skills.     11 Razer Chroma RGB Lighting Zones For Customizable Lighting Effects and Full Underglow: Bask in the Razer Basilisk V3’s glory as you customize each zone from over 16.8 million colors and countless lighting effects, all while it reacts dynamically with over 150 Chroma-integrated games.     Iconic Ergonomic Design with Thumb Rest For Effortless Use and Long-lasting Comfort: Favored by millions worldwide, the mouse’s signature form factor perfectly supports your hand while its buttons are optimally positioned for quick and easy access.     Razer Optical Mouse Switches Gen-2 For Unrivalled Speed and Reliability: With zero unintended misclicks you can count on these switches to provide crisp, responsive execution at a blistering 0.2ms actuation speed for up to 70 million clicks.",
      "details": {
        "brand": "Razer",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "USB",
        "color": "Black",
        "ram": "N/A",
        "detail_item": "10+1 Programmable Buttons For Limitless Configurations: Assign all your macros and secondary functions across 11 programmable buttons—including its acclaimed multi-function trigger—to execute essential actions like push-to-talk, ping, and more."
      }
    },
    {
      "id": "B0BRTF2PGP",
      "name": "Asus ROG Keris Wireless AimPoint Gaming Mouse, Tri-mode connectivity, 36000 DPI sensor, 5 programmable buttons, ROG SpeedNova, Replaceable switches, Paracord cable, White",
      "ratings": 217,
      "price": "$71.99",
      "image": "https://m.media-amazon.com/images/I/61T1RDQiXKL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Perfect precision: 36,000 dpi ROG AimPoint optical sensor with 650 ips and 50 g acceleration rate, plus 1000 Hz polling rate     Tri-mode connectivity: Game with RGB on for up to 119 hours with low-latency 2.4 GHz RF, pair up to three devices via Bluetooth mode, or charge and play with wired USB     ROG SpeedNova wireless technology: Delivering low-latency, reliable wireless performance and an optimized power solution in the 2.4 GHz RF mode     Lightweight structure: Updated design with durable inner structure keeps mouse weight down to just 75 grams     Push-Fit Switch Socket II: Swappable switch design for easy customization; Keris AimPoint includes ROG Micro Switches and is compatible with other 3-pin mechanical and 5-pin optical micro switches     PBT L/R buttons: Feature a durable nonslip surface that resists wear or shine to ensure a consistent feel     Anti-slip ROG patterned mouse grip tape: Provides users with a more secure grip and an added bit of flair     Smooth and fast movements: ROG Paracord and 100% PTFE mouse feet",
      "details": {
        "brand": "ASUS",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "Bluetooth",
        "color": "White",
        "ram": "N/A",
        "detail_item": "Perfect precision: 36,000 dpi ROG AimPoint optical sensor with 650 ips and 50 g acceleration rate, plus 1000 Hz polling rate"
      }
    },
    {
      "id": "B0CPSPN896",
      "name": "Logitech Signature M550 Wireless Mouse - For Small to Medium Sized Hands, 2-Year Battery, Silent Clicks, Bluetooth, Multi-Device Compatibility - Rose",
      "ratings": 1.156,
      "price": "$24.30",
      "image": "https://m.media-amazon.com/images/I/61C6G7urgOL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Scroll smarter: With Logitech Signature M550 Wireless Mouse you get line-by-line precision for documents and super-fast scrolling for long web pages; simply switch modes with a flick of the SmartWheel     The optimal fit for your hand: This comfortable full size mouse is designed for larger hands, for the optimal fit     Upgrade your comfort: This work mouse provides long hours of comfort thanks to a contoured shape, soft thumb area, and rubber side grips that keep your hand snug and in place     Connect the way you like: Connect this cordless computer mouse in an instant via Bluetooth Low Energy or Logi Bolt USB receiver     Less noise, more focus: Whether working at the office or at home, Logitech Signature M550 is a quiet mouse, allowing you to enjoy 90 percent less click noise with SilentTouch technology*     24 month battery life: Work for up to 2 years on the single AA battery that comes with your multi-device mouse**     Works on multiple platforms: Experience seamless compatibility with Windows, macOS, Linux, ChromeOS, ipadOS, and Android operating systems with Logitech Signature 550 wireless Bluetooth mouse     Plastic parts in Signature M550 include certified post-consumer recycled plastic (Black: 65%****)",
      "details": {
        "brand": "Logitech",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "Bluetooth, USB",
        "color": "Rose",
        "ram": "N/A",
        "detail_item": "Scroll smarter: With Logitech Signature M550 Wireless Mouse you get line-by-line precision for documents and super-fast scrolling for long web pages; simply switch modes with a flick of the SmartWheel"
      }
    },
    {
      "id": "B0B1DKR8K8",
      "name": "VssoPlor Type C Wireless Mouse USB C Rechargeable Portable Quiet MacBook Mouse iPad Mouse USB and Type C Receiver Dual Mode Laptop Mouse for PC, Laptop, MacBook, Tablet-Black Gold",
      "ratings": 4.853,
      "price": "$19.99",
      "image": "https://m.media-amazon.com/images/I/51f4-q-YWEL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "【WIDE COMPATIBILITY】 Well compatible with Windows7/8/10/XP, Vista, Mac OS X 10.10 or later. Fits for all Type-C devices, tablets, cellphones, Macbook, Macbook Pro, iMac, iMac Pro, Chromebook and more     【RECHARGEABLE & QUIET CLICKING】Easily recharged through the included micro usb cable and built-in durable 300mAh lithium rechargeable battery. Smooth frosted surface and quiet clicks can bring a better user experience and free your worry about bothering others and keep you stay focused while working     【ADJUSTABLE DPI AND ERGONOMIC DESIGN】3 DPI lecvels (1000/1600/2400 DPI) allows you to change the cursor sensitivity easily and track more smoothly over a variety of surfaces. Contoured shape fits your hands perfectly, reducing hand fatigue     【EASY TO USE & CONVENIENT】PLUG and PLAY. The nano type-C and usb receiver is in the battery compartment of the mouse. Take it out and plug it into the port of the device separately. No additional drivers or software needed. You can switch between connected devices with a single button. Store the receiver in the battery compartment when you on the go     【SKIN-FRIENDLY & WARRANTY】Silent click mouse with classic design offers your hand maximum support and comfort. Every Vssoplor product includes 12-month warranty. Please buy with confidence",
      "details": {
        "brand": "VssoPlor",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "Wireless, USB",
        "color": "Black Gold",
        "ram": "N/A",
        "detail_item": "【WIDE COMPATIBILITY】 Well compatible with Windows7/8/10/XP, Vista, Mac OS X 10.10 or later. Fits for all Type-C devices, tablets, cellphones, Macbook, Macbook Pro, iMac, iMac Pro, Chromebook and more"
      }
    },
    {
      "id": "B07R22YVNP",
      "name": "KLO Rechargeable Bluetooth Mouse for MacBook/MacBook air/Pro/iPad, Wireless Mouse for Laptop/Notebook/pc/iPad/Chromebook (Black)",
      "ratings": 29.823,
      "price": "$11.85",
      "image": "https://m.media-amazon.com/images/I/5129PXUSSlL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "3DPI SWITCH:Using high-performance optical chips, up to 1600 dpi(800, 1200, 1600) accurately tracking,to meet different needs.     Adopt bluetooth 3.0/5.2 technology,built-in durable 500mAh Lithium polymer rechargeable battery,high cycle life, The charging time is about 1.5-2.5 hours, lasting use time, the Auto Switch Off function will help you save energy as your bluetooth mouse will switch off when your PC is turned off or the receiver is disconnected. If you do not use the mouse for eight minutes, it will go to sleeping mode, you can press the any button to weak it up. energy saving and extremely low power consumption.     It is compatible with Mac OS Windows /Win8/10/and is suitable for desktop/ipad/notebook/Mac Macbook Pro/Air/iMac and other devices.     Contoured shape, Ultra Thin and lightweight design, smooth surface ensure maximum comfort and support for your hand even after long working hours, The rubber scroll wheel makes sure that your hand will not slip when scrolling,This bluetooth mouse can meet your demand of daily office working and personal preference.     It is recommended to use the USB port of the computer to charge the mouse, or use a 5V 1A charger.",
      "details": {
        "brand": "KLO",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "Bluetooth Wireless USB",
        "color": "Black",
        "ram": "N/A",
        "detail_item": "3DPI SWITCH:Using high-performance optical chips, up to 1600 dpi(800, 1200, 1600) accurately tracking,to meet different needs."
      }
    },
    {
      "id": "B0CPLNPV6F",
      "name": "SM66 White Silent Dual Mode 2.4GHz Wireless Mouse, Adjustable 4800 DPI,Rechargeable Computer Mouse Wireless Office Mouse for PC Mac Laptop, Desktop",
      "ratings": 272,
      "price": "$16.89",
      "image": "https://m.media-amazon.com/images/I/51Udo0fWghL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "2.4G Wireless Dual-Mode:The SOLAKAKA SM66 wireless mouse is perfect for multi-functional use,support 2 mode BT and 2.4GHz wireless connection,3 devices save. supports connection for your Laptop,PC,Computer,Xbox,iPad,Mobile Phone.compatible with multiple systems including Windows,OS,Android,IOS,etc     Ergonomic Design, 5 DPI Adjustable:This Slim Ergonomic shape wireless mouse is designed with an asymmetrical and streamlined shell, offering a comfortable claw-grip using experience for right,left and medium,small hand, long-term use without fatigue. 5 DPI levels 4800,2400,1600,1200,800,user can press the DPI button at the bottom of the mouse. Easier and smoother. The ultra-thin design is mini and lightweight, perfect for traveling carry, and can be easily put into laptop bag, ultra-space saving     Silent Buttons:SM66 wireless mouse adopts a silent button design, which reduces 99% of button noise. It is very suitable for public places such as libraries and offices. It is the best choice for people who like quiet     PORTABLE and 10M LONG WORKING DISTANCE:2.4G Nano USB receiver is embedded in the computer mouse bottom for convenient portability. It is great as a travel mouse for a laptop. The remote mouse for laptop works great with the SOLAKAKA mouse combo and computer keyboard and mice accessories. The 10m,32ft long working distance ensures you can enjoy high-precision optical sensor performance on various surfaces     Rechargeable and Long Battery Life:With the built-in 500mAh rechargeable Lithiumion battery, you can charge the magic cute mouse by using the Type-C charger cable included. Using while charging is available. In addition, the rechargeable mouse uses smart power-saving technology, the great battery will enter sleep mode after 3 minutes of no-operation to save power and provide long time usage. You can wake it up by clicking any button     Friendly Tip: SM66 has a smart sleep mode, when it is not used for a few minutes, it will enter the power saving state, please move the mouse to wake it up!",
      "details": {
        "brand": "SOLAKAKA",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "Bluetooth",
        "color": "white",
        "ram": "N/A",
        "detail_item": "2.4G Wireless Dual-Mode:The SOLAKAKA SM66 wireless mouse is perfect for multi-functional use,support 2 mode BT and 2.4GHz wireless connection,3 devices save. supports connection for your Laptop,PC,Computer,Xbox,iPad,Mobile Phone.compatible with multiple systems including Windows,OS,Android,IOS,etc"
      }
    },
    {
      "id": "B0BZY54XX6",
      "name": "Wireless Mouse,Rechargeable Mouse Wireless 2.4G USB(Battery Level Visible) Ergonomic Computer Mouse,3 Levels DPI,Silent Wireless Mice for Laptop PC Computer(Black)",
      "ratings": 3.698,
      "price": "$12.99",
      "image": "https://m.media-amazon.com/images/I/51pn-LrKPjL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Enhanced Rechargeable Mouse: Upgrade with the battery indicator,clearly display the power source.this wireless mouse can be easily recharged for a long-lasting performance,No more worrying about replacing batteries     Ergonomic Design: this laptop mouse offers you a comfortable grip and a tranquil environment, reducing your fatigue and disturbance and improving your productivity and enjoyment.Our silent mouse is designed to fit comfortably in your hand and reduce hand fatigue     2.4GHz Wireless Connection: This cordless mouse provides stable and reliable wireless connetion,ensures efficient and smooth performance with minimal interference.connectivity up to 10 M away, allowing you to work or play without the hassle of cords     Easy to use&Silent click: Plug and play, The mouse features a silent click function that allows you to work discreetly without disturbing those around you.(Note：The USB receiver is stored on the bottom of the mouse.)     Wide Compatibility & Worry free service: This rechargeable mouse is compatible with almost devices with USB ports and most operating systems such as Windows 10/8/7/XP, Vista Linux and Mac OS. enjoys forty-five-day refund and twelve-month replacement policy",
      "details": {
        "brand": "Uineer",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "2.4GHz Wireless",
        "color": "Black",
        "ram": "N/A",
        "detail_item": "Enhanced Rechargeable Mouse: Upgrade with the battery indicator,clearly display the power source.this wireless mouse can be easily recharged for a long-lasting performance,No more worrying about replacing batteries"
      }
    },
    {
      "id": "B08SMQB6TF",
      "name": "HOTLIFE LED Wireless Mouse, Slim Rechargeable Silent Portable USB Optical 2.4G Wireless Bluetooth Two Mode Computer Mice with USB Receiver and Type C Adapter (Black)",
      "ratings": 10.753,
      "price": "$8.79",
      "image": "https://m.media-amazon.com/images/I/61U4Qj2jqmL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "【Led Wireless Mouse】: This wireless mouse Bluetooth with lights can give you more fun during office time. You can choose use the 2.4G wireless mouse when the mouse botton switch is on the 2.4G mode,or connect your laptop's Bluetooth to use the Bluetooth mouse, easy to switch,suitable for any occasion.     【Silent Mouse Rechargeable】: Noiseless click, no worrying about disturbing others beside you, let you concentrate on work. Built-in durable rechargeable battery, it can be easily charged using the included USB cable. 2 hours charging, you can use it for 8-10 days.     【Back to Desktop Button & DPI Adjustable】: Two buttons are after the mouse scrool wheel, the M button makes you back to the laptop desktop to deal other things when you are Browsing the website. 3 adjustable DPI level s( 800, 1200, 1600) to change the speed and sensitivity of your laptop mouse cursor freely.     【Wide Compatibility Mouse Wireless】An accurate USB mouse with an working distance of up to 10 meters（33 feet） which can enables fast data transmission without delays or dropouts,fit for the computer micro usb and type c port, never think about the usb port. Well compatible with Windows XP, Vista, 7, 8, and 10 / Vista / Windows ME for Mac OS,Also support Bluetooth connection, this led wireless + bluetooth mouse perfectly fits for desktop, laptop, PC, for Macbook, for iPad and other Bluetooth devices.     【Portable Mouse and Operation Notice】 Slim and lightweight, Size : 4.52 in * 2.35 in * 0.78 in, durable ergonomic mouse is perfect for travel. The USB receiver is stored inside the back of the mouse. No need for a driver, Plug and Play! Automatic sleep mode and wake-up mode are installed to save energy. ANY PROBLEM about the computer mice, you can contact us anytime.",
      "details": {
        "brand": "HOTLIFE",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "USB",
        "color": "Black",
        "ram": "N/A",
        "detail_item": "【Led Wireless Mouse】: This wireless mouse Bluetooth with lights can give you more fun during office time. You can choose use the 2.4G wireless mouse when the mouse botton switch is on the 2.4G mode,or connect your laptop's Bluetooth to use the Bluetooth mouse, easy to switch,suitable for any occasion."
      }
    },
    {
      "id": "B0C97CF6K2",
      "name": "Cute Bluetooth Mouse, 2.4 GHz Wireless Mice with USB Receiver for Laptop, iPad, Mac, Silent Cartoon Mouse Suitable for Children and Students (Kerry Bear)",
      "ratings": 376,
      "price": "$14.99",
      "image": "https://m.media-amazon.com/images/I/61kL1e5zG-L.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "❤ [Cute Wireless Mouse] - Our wireless mouse has a variety of cute cartoon pattern designs, suitable for young people and children.     ❤ [Dual Mode Mouse] - Bluetooth & 2.4G dual mode wireless mouse connection switch easily. Bluetooth wireless brings quick response, precise movement, stable connection & smoother tracking. 2.4G wireless transmission provide stable and reliable connection.     ❤ [Silent Wireless Mouse] - Special design, noiseless click sound when pressing buttons, which let you not worry about the mouse sound can disturbing others, especially at library or office.     ❤ [Durable Mouse] - Intelligent power saving, the mouse will automatically be in sleeping mode after 10 minutes inactivity, you can click any button to wake it up. Only 1 piece AA battery is required for power supply (not included in the package).     ❤ [Universal Compatibility Mouse] - FMOUSE M101 Mouse, with wireless receiver and Bluetooth inside, connect the mouse easily to your MacBook, iPad, Laptop or any Desktop devices, Mouse wireless well compatible with Windows, MacOS, iPadOS & Android.",
      "details": {
        "brand": "FMOUSE",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "Wireless, Bluetooth, USB",
        "color": "Kerry Bear",
        "ram": "N/A",
        "detail_item": "❤ [Cute Wireless Mouse] - Our wireless mouse has a variety of cute cartoon pattern designs, suitable for young people and children."
      }
    },
    {
      "id": "B0DJ8J5CZ8",
      "name": "Wireless Bluetooth Mouse, LED Rechargeable Ergonomic Mouse with Muitl Mode 2.4G Wireless USB +BT1+BT2, Portable Bluetooth Mouse for Mac Laptop PC Computer, Tilt Wheel 4-Way Scrolling Mice",
      "ratings": 1,
      "price": "$25.99",
      "image": "https://m.media-amazon.com/images/I/71sMgNzDACL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Multi-Device Connectivity with Easy Switching：Connect effortlessly with our wireless mouse that supports 2* Bluetooth connections and 2.4G wireless connection, which can link up to three devices—such as laptops, tablets, and smartphones—simultaneously. Easily switch between devices, making this mouse an adaptable companion for various tech environments. It is compatible with Windows, macOS, Chrome OS, and Android.     Effortless Navigation：Designed for convenience, this ergonomic mouse features a 4-way scroll wheel that enables smooth navigation in all directions. Coupled with dedicated forward and back buttons, you can browse through documents and web pages with enhanced efficiency, making your workflow more fluid.     Long-lasting Rechargeable Battery：The mouse is powered by a durable 650mAh rechargeable battery, providing up to 90 days(Without RGB light on) of usage on a single charge. The Type-C charging port allows for a quick and easy recharge in just 2 hours, ensuring that you stay productive without interruptions.     Stylish Feature & Quiet Operation: The dynamic RGB lighting at the tail that adds an attractive aesthetic to your setup. The silent clicking technology significantly reduces noise, providing a quiet workspace conducive to concentration and focus.     Ergonomic Design: Constructed from high-quality materials, this bluetooth mouse offers exceptional durability and longevity. The matte finish promotes a non-slip grip and an ergonomic fit that conforms to the natural contours of the hand, reducing strain on the wrist and fingers and making it suitable for prolonged periods of use.",
      "details": {
        "brand": "Doci",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "USB",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "Multi-Device Connectivity with Easy Switching：Connect effortlessly with our wireless mouse that supports 2* Bluetooth connections and 2.4G wireless connection, which can link up to three devices—such as laptops, tablets, and smartphones—simultaneously. Easily switch between devices, making this mouse an adaptable companion for various tech environments. It is compatible with Windows, macOS, Chrome OS, and Android."
      }
    },
    {
      "id": "B0CJNR6211",
      "name": "Wireless Gaming Mouse Honeycomb 2.4G USB Cordless Mouse RGB Rechargeable PC Game Mice with 7-Color LED Lights，3 Adjustable DPI for Windows Laptop Desktop Computers -White",
      "ratings": 199,
      "price": "$17.99",
      "image": "https://m.media-amazon.com/images/I/71qMt7XPSVL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "【LIGHTWEIGHT HONEYCOMB SHELL DESIGN】 The gaming mouse is made of high-quality ABS material and designed with an ergonomic hollow perforated housing, reducing weight and providing a comfortable grip even during long gaming sessions.     【WIRELESS FREEDOM & STABLE CONNECTION】 Connects wirelessly through 2.4G technology with the USB nano receiver, offering a stable connection with a range of up to 10m (33ft). No delays or dropouts, simply plug and play.     【VIBRANT RGB 7-COLOR BACKLIGHT】 The RGB gaming mouse features a flowing rainbow backlight that adds a visually stunning atmosphere to your workspace. Convenient switch to turn off the light when desired.     【3 DPI ADJUSTABLE & BATTERY RECHARGEABLE】 Adjust the mouse's DPI levels (1600-1200-800) for precise control. The built-in 600mAh lithium battery is rechargeable via USB-C cable, with a low battery indicator for timely charging.     【WIDE COMPATIBILITY】 Compatible with various devices such as PC, Mac Notebook, Laptop, Tablet, desktop, Computer, and more. Supports Windows 7/8/10/XP/VISTA/MAC OS, ensuring versatility.",
      "details": {
        "brand": "MELOGAGA",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "Wireless",
        "color": "Wireless_White",
        "ram": "N/A",
        "detail_item": "【LIGHTWEIGHT HONEYCOMB SHELL DESIGN】 The gaming mouse is made of high-quality ABS material and designed with an ergonomic hollow perforated housing, reducing weight and providing a comfortable grip even during long gaming sessions."
      }
    },
    {
      "id": "B011HMDZ0Q",
      "name": "Redragon M602 RGB Wired Gaming Mouse RGB Spectrum Backlit Ergonomic Mouse Griffin Programmable with 8 Backlight Modes, Up to 7200 DPI for Windows PC Gamers (Black)",
      "ratings": 31.116,
      "price": "$19.99",
      "image": "https://m.media-amazon.com/images/I/6177U5fDSwL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "* WIRED GAMING MOUSE; built for Gaming Computers - Ergonomic Redragon M602-RGB “Griffin” RGB Backlit Gaming PC Mouse up to 7200 DPI (user adjustable 800/1200/1600/2400/7200 DPI), 10G acceleration. The High-Precision Sensor delivers Pinpoint Accuracy while the Gaming Grade Micro Switches ensure longevity, greater durability and extreme responsiveness, giving you an even greater edge over your competition     * RGB BACKLIT PROGRAMMABLE PC GAMING MOUSE; 8 programmable buttons, 5 Memory Profiles each with distinct LED color option for quick identification. 8 different backlight modes. (Backlight can be disabled) The Redragon M602-RGB Gaming Mouse offers you total personalization for your Gaming Computer and Gaming Laptop     * ERGONOMIC GAMER MOUSE; Delivering an extremely comfortable and precise experience for Computer Games such as Fortnite Games, SIMS 4, Fallout 4, World of Warcraft, PUGB, Overwatch, Call of Duty or other First-Person Shooter. The ergonomic shape of the Redragon M602-RGB PC Gaming Mouse is built for comfort, fits naturally in your hand, the buttons are tuned to reduce click fatigue     * HIGH-END PC GAMING MOUSE FEATURES; The Redragon M602-RGB Mouse features; Weight Tuning, Anti-Skid Scroll Wheel, Durable smooth TEFLON feet pads for ultimate gaming control. 7 programmable buttons. Total 8 buttons. The Mouse works great with Redragon Gaming Mousepads & Keyboards. Comes with 6 foot, 3mm strong high-speed braided fiber cable and a gold-plated corrosion free USB connector for a reliable connection     * PC GAMING MOUSE COMPATIBILITY: Windows 10, Windows 8, Windows 7, Windows Vista, or Windows XP, Limited Mac OS support Works well with all major Gaming Computers Brands and Gaming Laptops MSI, Dell, Corsair, Alienware, Razer, Xbox One, Asus and others",
      "details": {
        "brand": "Redragon",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "USB",
        "color": "Black",
        "ram": "N/A",
        "detail_item": "* WIRED GAMING MOUSE; built for Gaming Computers - Ergonomic Redragon M602-RGB “Griffin” RGB Backlit Gaming PC Mouse up to 7200 DPI (user adjustable 800/1200/1600/2400/7200 DPI), 10G acceleration. The High-Precision Sensor delivers Pinpoint Accuracy while the Gaming Grade Micro Switches ensure longevity, greater durability and extreme responsiveness, giving you an even greater edge over your competition"
      }
    }
  ]
}