{
  "totalProducts": 24,
  "products": [
    {
      "id": "B09R9FD219",
      "name": "Amazon Essentials Disney | Marvel | Star Wars Men's Sherpa-Lined Pullover Hoodie Sweatshirt",
      "ratings": 230,
      "price": "$25.68",
      "image": "https://m.media-amazon.com/images/I/71jdXMr4W+L._AC_SX342_SY445_.jpg",
      "description": "",
      "details": {
        "brand": "N/A",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "N/A"
      }
    },
    {
      "id": "B0BXYPGKX6",
      "name": "Lenovo 300 Wireless Mouse – Computer Mouse for PC, Laptop with Windows – Ambidextrous Design – 2.4 GHz Nano USB Receiver – 12 Month Battery Life",
      "ratings": 259,
      "price": "$11.99",
      "image": "https://m.media-amazon.com/images/I/5154mpGektL.__AC_SY300_SX300_QL70_FMwebp_.jpg",
      "description": "Enhance Your On-the-Go Productivity: Introducing the Lenovo 300 Wireless Compact Mouse – your ultimate travel companion designed for professionals on the move. Ideal for business travelers, presenting executives, and individuals seeking heightened control and flexibility, this compact mouse is a must-have accessory to elevate your work style.     Pocket-Friendly Portability: Experience unmatched convenience with the Lenovo 300 Wireless Compact Mouse's compact design. Slip it effortlessly into your pocket or laptop bag, ensuring that wherever you go, enhanced control and precision are right at your fingertips. Embrace a clutter-free, organized lifestyle while maintaining top-notch productivity.     Precision at Your Command: Boasting an optical sensor with 1000 DPI resolution, this compact mouse delivers precision like never before. Seamlessly navigate through documents, presentations, and creative projects with unparalleled accuracy, enhancing your overall work efficiency and control.     Battery Life That Lasts: Bid farewell to battery concerns with the Lenovo 300 Wireless Compact Mouse. Equipped with a single AA battery, this powerhouse ensures a remarkable battery life of up to 12 months . Say goodbye to the hassle of frequent battery replacements and stay focused on what truly matters – your tasks, presentations, and projects.     Versatile Performance Anywhere: No matter where your journey takes you, the Lenovo 300 Wireless Compact Mouse adapts seamlessly to your needs. Its ergonomic design ensures comfort during prolonged use, while its wireless capabilities grant you freedom from tangled cords. Experience a responsive and intuitive interface, ensuring that precision and control are always within reach.",
      "details": {
        "brand": "Lenovo",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "USB",
        "color": "Frost Blue",
        "ram": "N/A",
        "detail_item": "Enhance Your On-the-Go Productivity: Introducing the Lenovo 300 Wireless Compact Mouse – your ultimate travel companion designed for professionals on the move. Ideal for business travelers, presenting executives, and individuals seeking heightened control and flexibility, this compact mouse is a must-have accessory to elevate your work style."
      }
    },
    {
      "id": "B09HM94VDS",
      "name": "Logitech MX Master 3S - Wireless Performance Mouse, Ergo, 8K DPI, Track on Glass, Quiet Clicks, USB-C, Bluetooth, Windows, Linux, Chrome - Graphite - With Free Adobe Creative Cloud Subscription",
      "ratings": 6.592,
      "price": "$99.99",
      "image": "https://m.media-amazon.com/images/I/61ni3t1ryQL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Any-surface tracking - now 8K DPI: Use MX Master 3S cordless computer mouse to work on any surface - even glass (1) - with the upgraded 8000 DPI sensor with customizable sensitivity.     Introducing quiet clicks: MX Master 3S Bluetooth mouse introduces Quiet Clicks - offering the same satisfying feel but with 90% less click noise. Sensor Technology: Darkfield high precision.     Install free Logi Options+ App to enable Logi AI Prompt Builder for your Logitech mice and keyboards.     Magspeed scrolling: A computer mouse with remarkable speed, precision, and near silence - MagSpeed scrolling is 90% faster , 87% more precise, and ultra quiet.     Ergonomic design : Work comfortably with a precision mouse featuring a silhouette crafted for a more natural wrist posture and optimally placed thumb controls.     Upgraded customization software : Customize buttons and optimize your workflow with App specific profiles in the improved Logi Options+ app.     FLOW cross-computer control : Work seamlessly on multiple computers or laptops, and transfer text, images, and files – between Windows & macOS.",
      "details": {
        "brand": "Logitech",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "Wi-Fi",
        "color": "Graphite",
        "ram": "N/A",
        "detail_item": "Any-surface tracking - now 8K DPI: Use MX Master 3S cordless computer mouse to work on any surface - even glass (1) - with the upgraded 8000 DPI sensor with customizable sensitivity."
      }
    },
    {
      "id": "B0DHCNGSXJ",
      "name": "acer Wireless Mouse for Laptop, 3 Adjustable DPI Computer Mouse Wireless with 2.4GHz with USB Mini Receiver, 6 Buttons, 1600 DPI Ergonomic Mouse, Compatible with iMac, PC, Desktop",
      "ratings": 276,
      "price": "$9.99",
      "image": "https://m.media-amazon.com/images/I/61uK4zuXByL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "[3 Adjustable DPI Settings] Enjoy seamless control with this computer mouse wireless, featuring 3 adjustable DPI settings: 800, 1200, and 1600. Whether you need graphic design accuracy or faster gaming speed, switch between DPI levels easily. Improve your workflow and enjoy precise control at your fingertips.     [Ergonomic Comfort Grip] The contoured design of the computer mice, fits the natural curve of your hand, providing long-lasting comfort. The rubber side grips ensure a secure hold, enhancing control and reducing fatigue while you easily navigate your iPad.     [Quick Navigation Buttons] This wireless computer mouse features forward and backward buttons, allowing you to navigate through web pages and folders quickly. Enhance your productivity by seamlessly moving between tasks with just a click.     [Exceptional Durability] Designed for lasting durability, the USB wireless mouse features buttons and a scroll wheel tested to withstand up to 10 million clicks, ensuring long-term reliability and consistent performance for uninterrupted productivity.     [Plug and Play] Just insert the USB-A receiver into your Windows, macOS, or Linux device for instant use—no drivers or software needed. The laptop mouse wireless lightweight, compact design makes it easy to carry.     NOTE: The AAA batteries are not included. The USB receiver is conveniently stored in the battery compartment at the back of the mouse.",
      "details": {
        "brand": "acer",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "USB",
        "color": "Black",
        "ram": "N/A",
        "detail_item": "[3 Adjustable DPI Settings] Enjoy seamless control with this computer mouse wireless, featuring 3 adjustable DPI settings: 800, 1200, and 1600. Whether you need graphic design accuracy or faster gaming speed, switch between DPI levels easily. Improve your workflow and enjoy precise control at your fingertips."
      }
    },
    {
      "id": "B004YAVF8I",
      "name": "Logitech M185 Wireless Mouse, 2.4GHz with USB Mini Receiver, 12-Month Battery Life, 1000 DPI Optical Tracking, Ambidextrous PC/Mac/Laptop - Swift Gray",
      "ratings": 33.728,
      "price": "$13.98",
      "image": "https://m.media-amazon.com/images/I/5181UFuvoBL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Plug-and-play wireless: Get a reliable connection from a convenient nano receiver that stays in your computer     1-year battery life: Go for a full year without a battery change (Battery life may vary based on user and computing conditions)     Logitech reliability: Made by the global leader for mice and backed by a 3-year limited hardware warranty     Contoured shape: Gives you more comfort and control     For Windows and Mac computers: No software or setup hassles-start using your mouse right away",
      "details": {
        "brand": "Logitech",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "USB",
        "color": "Swift Gray",
        "ram": "N/A",
        "detail_item": "Plug-and-play wireless: Get a reliable connection from a convenient nano receiver that stays in your computer"
      }
    },
    {
      "id": "B0CSPJP35M",
      "name": "Lenovo Bluetooth Silent Mouse (WL300) - 5 Button Computer Mouse with Silent Left & Right Click – Sculpted Grip, Microsoft Swift Pair, Up to 1600 DPI (Grey)",
      "ratings": 279,
      "price": "$19.99",
      "image": "https://m.media-amazon.com/images/I/517+8YaZ+gL._AC_SY300_SX300_.jpg",
      "description": "Sleek and Compact: Compact and lightweight, this mouse is ideal for on-the-go professionals and is powered by a single AA battery. Its design eliminates the hassle of tangled cables, providing the freedom to work in various environments     Uncompromised Quality: Built to withstand extensive use, the left and right buttons are engineered to last up to 3 million clicks. The scroll wheel is designed to endure up to 300,000 cycles, ensuring long-lasting durability and consistent performance     Sculpted Grip Bluetooth Mouse: Experience all-day comfort with a sculpted grip that conforms to your hand's natural contours, providing ergonomic support for extended periods of use. Effortlessly pair your device with Bluetooth 5.0 and Microsoft Swift Pair technology     Smooth Navigation: Maximize your workflow with a 5-button mouse featuring left click, right click, scroll click, forward, and backward buttons, coupled with an anti-slip scroll wheel. The precise optical sensor and 3-level DPI adjustment caters to various tasks, offering 800, 1200, and 1600 DPI     Silent Efficiency: Designed to work seamlessly on different surfaces such as wood, leather, fabric, paper, and resin, the WL300 offers silent left, right, and scroll wheel buttons, allowing for efficient and quiet operation",
      "details": {
        "brand": "Lenovo",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "Bluetooth",
        "color": "WL300 Grey",
        "ram": "N/A",
        "detail_item": "Sleek and Compact: Compact and lightweight, this mouse is ideal for on-the-go professionals and is powered by a single AA battery. Its design eliminates the hassle of tangled cables, providing the freedom to work in various environments"
      }
    },
    {
      "id": "B07GBZ4Q68",
      "name": "Logitech G502 HERO High Performance Wired Gaming Mouse, HERO 25K Sensor, 25,600 DPI, RGB, Adjustable Weights, 11 Programmable Buttons, On-Board Memory, PC / Mac",
      "ratings": 53.179,
      "price": "$37.00",
      "image": "https://m.media-amazon.com/images/I/61mpMH5TzkL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Hero 25K sensor through a software update from G HUB, this upgrade is free to all players: Our most advanced, with 1:1 tracking, 400-plus ips, and 100 - 25,600 max dpi sensitivity plus zero smoothing, filtering, or acceleration     11 customizable buttons and onboard memory: Assign custom commands to the buttons and save up to five ready to play profiles directly to the mouse     Adjustable weight system: Arrange up to five removable 3.6 grams weights inside the mouse for personalized weight and balance tuning     Programmable RGB Lighting and Lightsync technology: Customize lighting from nearly 16.8 million colors to match your team's colors, sport your own or sync colors with other Logitech G gear     Mechanical switch button tensioning: Metal spring tensioning system and pivot hinges are built into left and right gaming mouse buttons for a crisp, clean click feel with rapid click feedback     1 year hardware limited warranty. USB report rate: 1000Hz (1ms)     Microprocessor: 32-bit ARM. Use Logitech G HUB to save your settings to the on board memory on the mouse and take them with you. Your saved settings will work on any PC without additional software or any login required.",
      "details": {
        "brand": "Logitech G",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "USB",
        "color": "Black",
        "ram": "N/A",
        "detail_item": "Hero 25K sensor through a software update from G HUB, this upgrade is free to all players: Our most advanced, with 1:1 tracking, 400-plus ips, and 100 - 25,600 max dpi sensitivity plus zero smoothing, filtering, or acceleration"
      }
    },
    {
      "id": "B0BRTK8YPN",
      "name": "ASUS ROG Chakram X Origin Gaming Mouse, Tri-Mode connectivity (2.4GHz RF, Bluetooth, Wired), 36000 DPI Sensor, 11 programmable Buttons, Detachable Joystick, Paracord Cable, Black",
      "ratings": 1.21,
      "price": "$119.99",
      "image": "https://m.media-amazon.com/images/I/610zfFdTrwL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "ROG AimPoint optical sensor: Next-gen 36,000 dpi sensor with 8000 Hz polling rate for ultimate precision     Tri-mode connectivity: Flexibility with wired USB, low-latency 2.4 GHz RF, plus a Bluetooth mode to pair up to three devices     Programmable joystick: New detachable joystick available in different sizes for refined analog or digital linear controls     More control at your fingertips: Seven buttons and four-way directional joystick offer a total of 11 programmable buttons for versatile hotkey functions     Instantaneous DPI adjustments: DPI On-the-Scroll enables effortless on-the-fly in-game adjustments     Push-Fit Switch Socket II: Hot-swap compatibility with 3-pin mechanical switches and 5-pin optical micro switches enable variable click force and extend lifespan     Smooth and fast movement: Soft ROG Paracord and 100% PTFE mouse feet ensure fluid glide",
      "details": {
        "brand": "ASUS",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "Bluetooth",
        "color": "BLACK",
        "ram": "N/A",
        "detail_item": "ROG AimPoint optical sensor: Next-gen 36,000 dpi sensor with 8000 Hz polling rate for ultimate precision"
      }
    },
    {
      "id": "B015NBTMMC",
      "name": "TECKNET Wireless Mouse Rechargeable, 2.4G USB-A Silent Mouse, Quiet Click, 6 Adjustable 4800 DPI, Cordless Computer Mouse, Ergonomic Mouse for Laptop, 6 Buttons Mouse for Chromebook, Ergo Grip - Black",
      "ratings": 12.037,
      "price": "$13.99",
      "image": "https://m.media-amazon.com/images/I/61mhtlXbxJL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Rechargeable Mouse, Energy-Efficient - Equipped with a built-in 700 mAh battery, this wireless mouse could charge rapidly and get enough power for a full day of use in only 5 minutes, without any downtime during recharging. A full charge can last up to 90 days.     Less Noise, More Focus - Eliminate noise and distractions with 90% reduced click sound for enhancing your working Immersion.     Compact Design, Travel Friendly - With the dimension of 4.09*2.68*1.49 in, this compact wireless mouse provides more portability and a better travel experience.     Ergonomic Design, Comfort Grip - The contoured shape of this mouse is ergonomically designed to fit the natural curve of your hand, ensuring lasting comfort and productivity. Featuring rubber side-grips, it offers added thumb support for a superior working experience.     Advanced Optical Tracking - Featuring 6-level adjustable DPI (800/1200/1600/2400/3200/4800), this wireless mouse provides high-performance precision and smart cursor control on most surfaces.     Plug and Play - Simply plug the USB mini-receiver into your Windows, Mac, Chrome OS, or Linux computer and enjoy seamless connectivity up to 49 feet.     Notice - Please be aware that a Type-C charging cable is included. The USB receiver is stored at the back of the wireless mouse. Only compatible with USB-A port.",
      "details": {
        "brand": "TECKNET",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "USB, Rechargeable",
        "color": "Black",
        "ram": "N/A",
        "detail_item": "Rechargeable Mouse, Energy-Efficient - Equipped with a built-in 700 mAh battery, this wireless mouse could charge rapidly and get enough power for a full day of use in only 5 minutes, without any downtime during recharging. A full charge can last up to 90 days."
      }
    },
    {
      "id": "B015NBTAOW",
      "name": "TECKNET Wireless Mouse, 2.4G Ergonomic Optical Mouse, Computer Mouse for Laptop, PC, Computer, Chromebook, Notebook, 6 Buttons, 24 Months Battery Life, 2600 DPI, 5 Adjustment Levels",
      "ratings": 65.293,
      "price": "$8.49",
      "image": "https://m.media-amazon.com/images/I/71tqvuHgIlL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Compact Design, Travel Friendly - With the dimension of 4.09*2.68*1.49 in, this compact mouse provides more portability and a better travel experience. Only compatible with USB-A Port Devices.     Ergonomic Design, Comfort Grip - The contoured shape of this mouse is ergonomically designed to fit the natural curve of your hand, ensuring lasting comfort and productivity. Featuring rubber side-grips, it offers added thumb support for a superior working experience.     Advanced Optical Tracking - Featuring 5-level adjustable DPI (800/1200/1600/2000/2600), this mouse provides high-performance precision and smart cursor control on most surfaces. ( Glass surface is Not included )     24 Months Battery Life - Combined with a power-saving mode and on/off switch, this efficiently engineered mouse grants you up to 24 months of battery life.     Plug and Play - Simply plug the USB-A mini-receiver into your Windows, Mac, Chrome OS, or Linux computer and enjoy seamless connectivity up to 49 feet.     Notice - Please be aware that the AAA batteries are not included. The USB receiver is stored at the back of the mouse.",
      "details": {
        "brand": "TECKNET",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "Wireless, USB",
        "color": "Purple",
        "ram": "N/A",
        "detail_item": "Compact Design, Travel Friendly - With the dimension of 4.09*2.68*1.49 in, this compact mouse provides more portability and a better travel experience. Only compatible with USB-A Port Devices."
      }
    },
    {
      "id": "B0C4XXH2FV",
      "name": "Logitech MX Master 2S Bluetooth Edition Wireless Mouse – Use on Any Surface, Hyper-Fast Scrolling, Ergonomic, Rechargeable, Control Up to 3 Apple Mac and Windows Computers - Graphite",
      "ratings": 532,
      "price": "$69.79",
      "image": "https://m.media-amazon.com/images/I/519XaWc6D6L.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "With Logitech Flow, seamlessly control up to three computers with one mouse and copy-paste text, images and files between them.(1)     Darkfield High Precision tracking gives you flawless control virtually anywhere – even on glass(2) with up to 4,000 DPI     Just plug MX Master 2S into your computer using the micro-USB charging cable and get enough power for a full day of usage in three minutes only. A full charge can last up to 70 days.(3)     Scroll through long documents or web pages faster and easier with the speed-adaptive scroll wheel that auto-shifts from click-to-click to hyper-fast scroll and side-to-side scrolling with a stroke of your thumb.(4)     The perfectly crafted, hand-sculpted shape (5) supports your hand and wrist in a comfortable, natural position. Enjoy fine-motion control and a fluid experience thanks to well-positioned buttons and wheels.",
      "details": {
        "brand": "Logitech",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "2023 Model",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "Bluetooth",
        "color": "graphite",
        "ram": "N/A",
        "detail_item": "With Logitech Flow, seamlessly control up to three computers with one mouse and copy-paste text, images and files between them.(1)"
      }
    },
    {
      "id": "B005EJH6RW",
      "name": "Amazon Basics Responsive and Precise 3-Button Wired USB Computer Mouse with Scrolling and Tracking, Single, Black",
      "ratings": 84.458,
      "price": "$7.19",
      "image": "https://m.media-amazon.com/images/I/61Mzk2NljxL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Computer mouse for easily navigating a computer interface; click, scroll, and more     USB-A wired connection; if existing device only supports USB-C, an additional adapter will be required     High-definition (1000 dpi) optical tracking ensures responsive cursor control for precise tracking and easy text selection     3 buttons offer effortless fingertip control     Plug-and-go ready for instant use     Compatible with Windows and Mac OS     Product Dimensions: 4.3 x 2.4 x 1.4 inches (LxWxH) with 4.9-foot cable",
      "details": {
        "brand": "Amazon Basics",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "Wired",
        "color": "Black",
        "ram": "N/A",
        "detail_item": "Computer mouse for easily navigating a computer interface; click, scroll, and more"
      }
    },
    {
      "id": "B07GCKQD77",
      "name": "Logitech G Pro Wireless Gaming Mouse with Esports Grade Performance, Black",
      "ratings": 12.537,
      "price": "$54.29",
      "image": "https://m.media-amazon.com/images/I/51ySu55JzAL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Made with and for Pro Gamers: G Pro Wireless Gaming Mouse is the result of two years of work with professional esports gamers, combing advanced technologies in an ultra-lightweight design     Light-speed Wireless: Pro grade performance overcomes the traditional limitations of wireless latency, connectivity and power to deliver a rock solid, super-fast 1 millisecond report rate connection     Hero 25K sensor through a software update from G HUB, this upgrade is free to all players: Logitech's most accurate sensor yet with up to 25,600 DPI and 10X the power efficiency of previous generation for the ultimate in wireless gaming speed, accuracy and responsiveness. Microprocessor: 32-bit ARM     Ultra-lightweight: Innovative endoskeleton design creates a super-thin yet incredibly strong outer shell, enabling the body to weigh in at a remarkably light and maneuverable 80 grams.     Ergonomic ambidextrous design: Tournament ready mouse developed with Esports pros for maximum comfort, control and 50 million click durability. Four removable side buttons for supreme customization. Cable length: 1.80 meters     Note: Kindly refer user guide before use. Requirements-Windows 7 or later, macOS 10.11 or later, Chrome OS     1 year hardware limited warranty     Max. acceleration: >1.41 oz (40 g) . Tested on Logitech G240 Gaming Mouse Pad",
      "details": {
        "brand": "Logitech G",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "Wireless",
        "color": "Black",
        "ram": "N/A",
        "detail_item": "Made with and for Pro Gamers: G Pro Wireless Gaming Mouse is the result of two years of work with professional esports gamers, combing advanced technologies in an ultra-lightweight design"
      }
    },
    {
      "id": "B0BNV1BC52",
      "name": "Bzu Topographic Contour Extended Big Mouse Pad Large,XL Gaming Mouse Pad Desk Pad,31.5x11.8inch Long Computer Keyboard Mouse Mat Mousepad with 3mm Non-Slip Base and Stitched Edge for Home Office Work",
      "ratings": 1.003,
      "price": "$13.99",
      "image": "https://m.media-amazon.com/images/I/81TNxw1uucL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Softer Material - Gaming Mouse Pad Is Made Of High Quality Cloth Material, Optimized For Fast Moving While Maintaining Excellent Speed And Control During Gaming, Let You Keep Operate Wonderfully. And The Waterproof Surface Prevents Damage From Spilled Drinks Or Other Accidents     Extended Size - The Mouse Pad Is Large Enough, 11.8''X 31.5'' (30cm X 80cm), 3mm Thick. It Will Fit Your Desktop Perfectly And Provide Perfect Movement Space, Offers Plenty Of Room For Gaming Or Office Works All While Protecting Your Desk, Applies To All Types Of Mouse Keyboards And More     Non-Slip Rubber Base - This Large Mouse Pad Is Crafted With A Clever Rubber Base, Dense Slip-Resistant Shading Can Firmly Grip The Desktop To Provide Stable Operation Of The Mouse And Keyboard, It Can Effectively Prevent The Mouse And Keyboard From Sliding And Moving     Durable Stitched Edges - The Latest Stitching Technology Ensures That The Mouse Pad Will Not Wear Or Deform During Use.Stitched Frame Ensures It Doesn'T Fray Or Fall Apart Like Other Mouse Pads. Relax To Use It     Washable, Foldable & Portable - Easy To Clean, If You Accidentally Spill Drinks Or Other Food Over The Mouse Pad, You Can Simply Clean It With Your Cleaning Cloth. And The Lightweight, Durable Design Stands Up To Years Of Use, Easy To Carry",
      "details": {
        "brand": "BZU",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "Topographic Contour",
        "ram": "N/A",
        "detail_item": "Softer Material - Gaming Mouse Pad Is Made Of High Quality Cloth Material, Optimized For Fast Moving While Maintaining Excellent Speed And Control During Gaming, Let You Keep Operate Wonderfully. And The Waterproof Surface Prevents Damage From Spilled Drinks Or Other Accidents"
      }
    },
    {
      "id": "B0787D6SGQ",
      "name": "Amazon Basics Ergonomic 2.4 GHz Wireless Optical Mouse, DPI adjustable, Compatible with PC, Mac, Laptop - Black",
      "ratings": 24.753,
      "price": "$8.09",
      "image": "https://m.media-amazon.com/images/I/51TlYuAqbsL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "COMFORTABLE NAVIGATION: The wireless mouse is designed for smooth and easy computer interface navigation, and provides ease of use for prolonged periods without strain     EXCELLENT COMPATIBILITY: This ergonomic mouse for PC is compatible with Windows 7, 8, and 10     ROBUST WIRELESS CONNECTION: This laptop mouse has a stable 2.4 GHz connection that offers a 33-foot range to enable mobility and flexibility in your workspace setup     SECURE DATA TRANSMISSION: Featuring AES-128 encryption, this wireless computer mouse provides enhanced security for your data, delivering safe usage in any network environment     COMPACT DESIGN: This wireless mouse for laptops measures 4.1 x 2.9 x 1.5 inches, making it compact and easily portable",
      "details": {
        "brand": "Amazon Basics",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "2.4GHz Wireless",
        "color": "Black",
        "ram": "N/A",
        "detail_item": "COMFORTABLE NAVIGATION: The wireless mouse is designed for smooth and easy computer interface navigation, and provides ease of use for prolonged periods without strain"
      }
    },
    {
      "id": "B005EJH6Z4",
      "name": "Amazon Basics 2.4 Ghz Wireless Optical Computer Mouse with USB Nano Receiver, Black",
      "ratings": 57.555,
      "price": "$9.75",
      "image": "https://m.media-amazon.com/images/I/61YQeAUIboL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Smooth, precise and affordable wireless optical 3-button mouse with USB nano receiver for laptop, desktop and netbook PCs     2.4 GHz wireless (not Bluetooth) provides a powerful, reliable connection     Nano-receiver stays in the PC USB port or stows conveniently inside the wireless mouse when not in use (note: Receiver is stored within the mouse from production and needs to be removed upon setup)     Compatible with Windows 2000, XP, Vista, 7, 8, and 10     Easy installation - refer to user manual for instructions",
      "details": {
        "brand": "Amazon Basics",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "USB",
        "color": "Black",
        "ram": "N/A",
        "detail_item": "Smooth, precise and affordable wireless optical 3-button mouse with USB nano receiver for laptop, desktop and netbook PCs"
      }
    },
    {
      "id": "B094PS5RZQ",
      "name": "Razer DeathAdder Essential Gaming Mouse: 6400 DPI Optical Sensor - 5 Programmable Buttons - Mechanical Switches - Rubber Side Grips - Classic Black",
      "ratings": 11.987,
      "price": "$20.99",
      "image": "https://m.media-amazon.com/images/I/8189uwDnMkL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "HIGH-PRECISION 6,400 DPI OPTICAL SENSOR — Offers on-the-fly sensitivity adjustment through dedicated DPI buttons (reprogrammable) for gaming and creative work     DURABLE MECHANICAL SWITCHES — Supports up to 10 million clicks, backed by a 2 year warranty     RIDGED, RUBBERIZED SCROLL WHEEL FOR MAXIMUM ACCURACY — Small, tactile bumps increases grip and allows for more controlled scrolling in high-stakes gaming situations     5 PROGRAMMABLE BUTTONS — Allows for button remapping and assignment of complex macro functions through Razer Synapse     #1 SELLING PC GAMING PERIPHERALS BRAND IN THE U.S. — Source — Circana, Retail Tracking Service, U.S., Dollar Sales, Gaming Designed Mice, Keyboards, and PC Headsets, Jan. 2019- Dec. 2023 combined",
      "details": {
        "brand": "Razer",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "Wired",
        "color": "Classic Black",
        "ram": "N/A",
        "detail_item": "HIGH-PRECISION 6,400 DPI OPTICAL SENSOR — Offers on-the-fly sensitivity adjustment through dedicated DPI buttons (reprogrammable) for gaming and creative work"
      }
    },
    {
      "id": "B09NBWL8J5",
      "name": "Logitech G PRO X SUPERLIGHT 2 LIGHTSPEED Wireless Gaming Mouse, 8K Polling, Lightweight, LIGHTFORCE Hybrid Switches, HERO 2 Sensor, 888 IPS, 44,000 DPI, 5 Programmable Buttons,USB-C Charging, PC & Mac",
      "ratings": 960,
      "price": "$137.49",
      "image": "https://m.media-amazon.com/images/I/51VRu0zm1IL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Fast and Precise Wireless Gaming Mouse: A pro gaming icon—now faster and more precise; it is designed in collaboration with the world’s leading esports pros and engineered to win     Pro Precision: LIGHTFORCE hybrid optical-mechanical switches enable pro-level precision, reliability and ultralow latency optical actuation with a crisp, tactile click     Most Advanced Optical Sensor in Gaming: HERO 2 features tracking over 888+ IPS, up to 44,000 DPI and precise sensor calibration with zero smoothing, acceleration or filtering     Better Performance: Our championship-winning, wireless mouse—made even better; now with 4K polling, USB-C charging, 95-hour battery life (3) and POWERPLAY compatibility all at 60g     Zero-Additive PTFE Mouse Feet: Command a smooth glide and seamless connection to your game with Zero-additive PTFE mouse feet     Command a smooth glide and seamless connection to your game with Zero-additive PTFE mouse feet",
      "details": {
        "brand": "Logitech G",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "USB, Radio Frequency",
        "color": "Black",
        "ram": "N/A",
        "detail_item": "Fast and Precise Wireless Gaming Mouse: A pro gaming icon—now faster and more precise; it is designed in collaboration with the world’s leading esports pros and engineered to win"
      }
    },
    {
      "id": "B07FNJB8TT",
      "name": "Logitech MX Vertical Wireless Mouse – Ergonomic Design Reduces Muscle Strain, Move Content Between 3 Windows and Apple Computers, Rechargeable, Graphite",
      "ratings": 13.6,
      "price": "$76.00",
      "image": "https://m.media-amazon.com/images/I/61iiZ-gDYEL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Logitech MX Vertical Wireless Ergonomic Mouse is a great fit for medium to large size right hands     NATURAL HANDSHAKE POSITION: MX Vertical’s natural handshake position reduces muscular activity by 10 percent compared to a standard mouse – without any loss in overall performance.     57° VERTICAL ANGLE FOR IMPROVED WRIST POSTURE: MX Vertical’s unique 57° vertical angle reduces the pressure on your wrist, while your thumb is positioned comfortably on the thumb rest.     USER TESTED. ERGONOMIST-APPROVED: MX Vertical has been designed and tested with criteria set out by leading ergonomists – improve posture, lower muscle strain, and reduce wrist pressure.     ADVANCED OPTICAL TRACKING WITH CURSOR SPEED SWITCH: The 4000 DPI high-precision sensor results in 4x less hand movement and reduces fatigue. The cursor speed switch instantly adjusts DPI speed and accuracy with the touch of a button.     COMFORT FORM WITH TEXTURED SURFACE: MX Vertical is shaped for the human hand and smooth to the touch. Its unique form fits a variety of hand shapes and sizes, and the textured rubber surface assures a natural grip.     Uses FSC-certified paper for responsible packaging; Certified carbon neutral: the carbon impact of the product and packaging has been reduced to zero",
      "details": {
        "brand": "Logitech",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "USB",
        "color": "GRAPHITE",
        "ram": "N/A",
        "detail_item": "Logitech MX Vertical Wireless Ergonomic Mouse is a great fit for medium to large size right hands"
      }
    },
    {
      "id": "B098S48QWM",
      "name": "VssoPlor Wireless Mouse, 2.4G Slim Portable Computer Mice with Nano Receiver for Notebook, PC, Laptop, Computer (Black and Gold)",
      "ratings": 22.375,
      "price": "$7.98",
      "image": "https://m.media-amazon.com/images/I/51dsuumz6HL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "LOW POWER CONSUMPTION: Intelligent sleep mode can better extend battery life. It will enter auto sleep mode if you don't use it for 5 minutes to save battery and need to click it, the mouse will enter working mode again     STABLE CONNECTION: 2.4 GHz wireless provides stronger anti-interference ability, a faster transmission speed and a more reliable connection, working distances can up to 10 m, and high DPI can make it track more smoothly over most surfaces     WIDE COMPATIBILITY:Well compatible with Windows7/8/10/XP, Vista, Mac OS X 10.4 etc. Fits for desktop, laptop, PC, Macbook and other devices     ERGONOMIC & COMPACT DESIGN: USB-receiver stays in your PC USB port or stows conveniently inside the wireless mouse when not in use. The lightweight and simple features make the mouse perfect for the journey, office, home     WHISPER & SENSITIVE CLICKING: Smooth frosted surface and quiet clicks can bring a better user experience and free your worry about bothering others and keep you stay focused while working",
      "details": {
        "brand": "VssoPlor",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "2.4G Wireless",
        "color": "Black and Gold",
        "ram": "N/A",
        "detail_item": "LOW POWER CONSUMPTION: Intelligent sleep mode can better extend battery life. It will enter auto sleep mode if you don't use it for 5 minutes to save battery and need to click it, the mouse will enter working mode again"
      }
    },
    {
      "id": "B07Y1KKFBH",
      "name": "WisFox 2.4G Wireless Mouse for Laptop, Ergonomic Computer Mouse with USB Receiver and 3 Adjustable Levels, 6 Button Cordless Mouse Wireless Mice for Windows Mac PC Notebook (Grey)",
      "ratings": 5.658,
      "price": "$7.99",
      "image": "https://m.media-amazon.com/images/I/714+t9HR4GL._AC_SY300_SX300_.jpg",
      "description": "▶[COMFORTABLE ERGONOMIC DESIGN] WisFox Wireless Mouse is really well-built and still feels very light, with a clean design and sleek aesthetic. Contoured Shape for the ultimate comfort of use. Sweat-Resistant Coating to further elevate your experience. All in all, this is a comfortable, functional and satisfying laptop mouse for chromebook, home, work, or travel.     ▶[3 DPI LEVELS & 6 BUTTONS] 3 Adjustable DPI Settings, 800, 1200 and 1600. This computer mouse gives precision tracking on just about any surface, with a DPI button helping to change the sensitivity on the fly. Extra 2 Side Buttons ideal for both work and gaming. Plug and play directly with A RECEIVER STORED IN THE BATTERY COMPARTMENT, no any driver needed!     ▶[HIGH DURABILITY & STABLE SINGAL] 5 Million Times Keystroke Test to guarantee superb durability of this cordless mouse, together with advanced 2.4GHz wireless technology to ensure strong accurate connection to your computer, as well as a longer working distance of 33 feet. Easy and convenient. Go ahead, and enjoy being more productive with the USB mouse!     ▶[AUTO SLEEP MODE & SYMMETRIC DESIGN] Being impressively easy to use, this wireless mouse for chromebook also keeps energy efficiency in mind. It will enter auto power-saving mode after 1 minute of idling, or sleep mode after 8 minutes of idling. Double click to wake the ergonomic mouse up. Symmetric design makes it suitable for both right- and left-hander.     ▶[WIDE COMPATIBILITY & SERVICE] This wireless mice is highly compatible with Windows 7/8/10/XP, Vista 7/8, Linux, etc. Works well with laptop, desktop, PC, MacBook and other devices. WisFox is proud to offer 12-month warranty for every our product as well as 24/h service to all our customers. If you have any question, free feel to contact us for help!",
      "details": {
        "brand": "WisFox",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "Wireless, Radio Frequency",
        "color": "Grey",
        "ram": "N/A",
        "detail_item": "▶[COMFORTABLE ERGONOMIC DESIGN] WisFox Wireless Mouse is really well-built and still feels very light, with a clean design and sleek aesthetic. Contoured Shape for the ultimate comfort of use. Sweat-Resistant Coating to further elevate your experience. All in all, this is a comfortable, functional and satisfying laptop mouse for chromebook, home, work, or travel."
      }
    },
    {
      "id": "B0BHTB1NHJ",
      "name": "Amazon Essentials Disney | Marvel | Star Wars | Princess Women's Fleece Pullover Hoodie Sweatshirts (Available in Plus Size)",
      "ratings": 1.874,
      "price": "$22.60",
      "image": "https://m.media-amazon.com/images/I/9109e-cUgYL.__AC_SY445_SX342_QL70_FMwebp_.jpg",
      "description": "",
      "details": {
        "brand": "N/A",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "N/A"
      }
    },
    {
      "id": "B09JG4KJN5",
      "name": "Wireless Mouse, D-09 Computer Mouse USB Cordless Mice for Laptop, Ergo Grips, Lightspeed 5-Level 2400 DPI, 16 Months Battery, Portable for PC Mac Chromebook (Black)",
      "ratings": 10.114,
      "price": "$11.99",
      "image": "https://m.media-amazon.com/images/I/616YhNKtqML.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "【Less Muscle Strain Ergonomics】Advanced ergonomic computer mouse provides total comfort with 30° ergonomic handshake angel, contoured grips and premium matte finish.6 ʙᴜᴛᴛᴏɴs ᴅᴇsɪɢɴ - new added forward and backward buttons on the side which browses the web, and processs files more efficiently and conveniently.     【Faster Wireless Transmission Speed】 33FT/10M 2.4G wireless connection reduces all the interference and delays. Just plug the USB receiver into pc or laptop and your D-09 works instantly.No delay ,no interference. Mini usb receiver is stored back of the mouse,beside the battery.     【3X Less Hand Movement】800/1200/1600/2000/2400 DPI high precision sensor reduces muscle fatigue and boost your workflow. Cursor moves 3X faster than basic computer wireless mouse.     【1 AA Battery, 2X Longer】Only 1 AA battery lasts up to 18 months. It enters sleep mode after you leave for 8 minutes ,only click any button to recall. D-09 wireless computer mouse saves time and money by practically reducing the need to change batteries.     【Highly-Intergraded Body】Durable 50 Million clicks. Portable for travel use. Work with Windows laptop/MacBook/Chromebook/PC -Any Device with USB Ports. Side buttons are unavailable for Mac OS. Any problems, PLZ do not hesitate to let HOTWEEMS know.",
      "details": {
        "brand": "HOTWEEMS",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "USB",
        "color": "Black",
        "ram": "N/A",
        "detail_item": "【Less Muscle Strain Ergonomics】Advanced ergonomic computer mouse provides total comfort with 30° ergonomic handshake angel, contoured grips and premium matte finish.6 ʙᴜᴛᴛᴏɴs ᴅᴇsɪɢɴ - new added forward and backward buttons on the side which browses the web, and processs files more efficiently and conveniently."
      }
    },
    {
      "id": "B01BC4TXXC",
      "name": "TECKNET USB Wired Mouse, 6-Button Corded Mouse with 4 Adjustable DPI, Optical Computer Mouse with Ergonomic Design and 5FT Cord for Laptop, Chromebook, PC, Desktop, Mac, Notebook-Gray",
      "ratings": 11.492,
      "price": "$9.99",
      "image": "https://m.media-amazon.com/images/I/617YQvId+gL._AC_SY300_SX300_.jpg",
      "description": "【High Precision and Durability】: TECKNET Tru-Wave technology wired computer mouse provides precise, intelligent cursor control and tracking on many surface types, even on smooth surfaces with glass. Tested for over 6 million keystrokes, the wired mouse ensures responsive clicks and a longer lifespan for daily use.     【4 Adjustable DPI and 6 Buttons】: 4-level DPI settings (1000/1600/3200/6400) to meet your needs both in home and office. 6 buttons enable superior productivity and efficiency to meet all your computer needs. Moving quickly between documents or browsing your favorite Web sites is a breeze with large, easy-to-reach Back/Forward buttons.     【Ergonomic Design】: The shaped design and soft rubber grips conform to the hand and are designed to be comfortable to hold. The compact size enables it to be able to be taken wherever desired for use on the computer whether at home, at work or anywhere else.     【Plug and Play】: Simply plug in the USB cable to power your mouse, eliminates the trouble of replacing batteries. No software or downloads required. The 5FT of USB cable is the perfect length for a USB wired mouse and adapts to almost any computer setup with no lag.     【Wide Compatibility】：Compatible with Windows 2000,2003, XP, VISTA, 7, 8, 10, 11 and Chromebook, Mac (side buttons not work on Mac).",
      "details": {
        "brand": "TECKNET",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "Wired, USB",
        "color": "GRAY",
        "ram": "N/A",
        "detail_item": "【High Precision and Durability】: TECKNET Tru-Wave technology wired computer mouse provides precise, intelligent cursor control and tracking on many surface types, even on smooth surfaces with glass. Tested for over 6 million keystrokes, the wired mouse ensures responsive clicks and a longer lifespan for daily use."
      }
    }
  ]
}