{
  "totalProducts": 22,
  "products": [
    {
      "id": "B0CPSPN896",
      "name": "Logitech Signature M550 Wireless Mouse - For Small to Medium Sized Hands, 2-Year Battery, Silent Clicks, Bluetooth, Multi-Device Compatibility - Rose",
      "ratings": 1.156,
      "price": "$24.30",
      "image": "https://m.media-amazon.com/images/I/61C6G7urgOL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Scroll smarter: With Logitech Signature M550 Wireless Mouse you get line-by-line precision for documents and super-fast scrolling for long web pages; simply switch modes with a flick of the SmartWheel     The optimal fit for your hand: This comfortable full size mouse is designed for larger hands, for the optimal fit     Upgrade your comfort: This work mouse provides long hours of comfort thanks to a contoured shape, soft thumb area, and rubber side grips that keep your hand snug and in place     Connect the way you like: Connect this cordless computer mouse in an instant via Bluetooth Low Energy or Logi Bolt USB receiver     Less noise, more focus: Whether working at the office or at home, Logitech Signature M550 is a quiet mouse, allowing you to enjoy 90 percent less click noise with SilentTouch technology*     24 month battery life: Work for up to 2 years on the single AA battery that comes with your multi-device mouse**     Works on multiple platforms: Experience seamless compatibility with Windows, macOS, Linux, ChromeOS, ipadOS, and Android operating systems with Logitech Signature 550 wireless Bluetooth mouse     Plastic parts in Signature M550 include certified post-consumer recycled plastic (Black: 65%****)",
      "details": {
        "brand": "Logitech",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "Bluetooth, USB",
        "color": "Rose",
        "ram": "N/A",
        "detail_item": "Scroll smarter: With Logitech Signature M550 Wireless Mouse you get line-by-line precision for documents and super-fast scrolling for long web pages; simply switch modes with a flick of the SmartWheel"
      }
    },
    {
      "id": "B07NSSPV9S",
      "name": "Logitech G703 Lightspeed Wireless Gaming Mouse W/Hero 25K Sensor, PowerPlay Compatible, Lightsync RGB, Lightweight 95G+10G Optional, 100-25, 600 DPI, Rubber Side Grips - Black",
      "ratings": 7.103,
      "price": "$124.99",
      "image": "https://m.media-amazon.com/images/I/61-jAartdjL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Best Selling Wireless Gaming Gear Brand - Based on independent sales data (Oct ‘18 - Oct’19) of Wireless Gaming Keyboard, Mice, and PC Headset in units from: US, CA, CN, JP, KR, TW, TH, IN, DE, FR, RY, UK, SE, TR     Power play wireless charging: never worry about your battery life again. Add the power play wireless charging system to keep G703 and other compatible g mice charged while at rest and at play. . .power play wireless charging system sold separately     Hero 25K sensor through a software update from G HUB, this upgrade is free to all players: our most advanced, with 1: 1 tracking, 400 plus IPS, and 100-25, 600 max DPI sensitivity — Plus zero smoothing, filtering, or acceleration, and 10x power efficiency of previous Gen     Light speed wireless: pro-level responsiveness and connectivity for long lasting, high performance game play — with a weight of 95 g and battery life for up to 35 hours of continuous play with default light Sync RGB lighting.     Supreme comfort and quality: brings together comfort, durability, and performance with comfortable design, rubber side grips, 10 g optional weight, and 6 programmable buttons for a customizable gaming experience.     Advanced button technology: metal-spring button Tensioning keeps primary left and right buttons poised to trigger with less force, for exceptional button feel, response, and consistency every time     Note : In case of Wireless mouse, the USB receiver will be provided inside or along with the mouse     Dual-injected rubber side grips",
      "details": {
        "brand": "Logitech G",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "Bluetooth",
        "color": "Black",
        "ram": "N/A",
        "detail_item": "Best Selling Wireless Gaming Gear Brand - Based on independent sales data (Oct ‘18 - Oct’19) of Wireless Gaming Keyboard, Mice, and PC Headset in units from: US, CA, CN, JP, KR, TW, TH, IN, DE, FR, RY, UK, SE, TR"
      }
    },
    {
      "id": "B07HCXFQ8P",
      "name": "SteelSeries Rival 650 Quantum Wireless Gaming Mouse - Rapid Charging, 12,000 Cpi Dual Sensor, 256 Weight Configs, 8 Zone RGB Lighting",
      "ratings": 2.168,
      "price": "$63.99",
      "image": "https://m.media-amazon.com/images/I/71ZtSH66n4L.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Quantum Wireless technology allows accurate, reliable lag free performance on par with SteelSeries' top tier wired mice, while allowing you to remain untethered     24 plus hour battery life on a full charge or 10 hours from 15 minute rapid charge     SteelSeries' most advanced optical sensor, TrueMove3 plus, provides true 1 to 1 tracking, while a secondary depth sensor adjusts the lift off distance to control movement with esports precision and accuracy     Personalize with 256 unique center of gravity weight tuning configurations to fit your preferences     Ultra durable gaming switches guaranteed for 60 million clicks. Lift off distance-customizable, 0.5–2 millimeter",
      "details": {
        "brand": "SteelSeries",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "Wireless",
        "color": "Black",
        "ram": "N/A",
        "detail_item": "Quantum Wireless technology allows accurate, reliable lag free performance on par with SteelSeries' top tier wired mice, while allowing you to remain untethered"
      }
    },
    {
      "id": "B0CHNVBBLF",
      "name": "SM900 White Wired Gaming Mouse with Honeycomb Shell,12800 DPI,7 Programmable Buttons,Lightweight Gaming Mice Ergonomic Computer Wired Mouse Gaming for Win/PC/Mac/Laptop Gamer",
      "ratings": 440,
      "price": "$14.99",
      "image": "https://m.media-amazon.com/images/I/61wmkh+azPL._AC_SY300_SX300_.jpg",
      "description": "6 Levels Adjustable DPI:SM900 is a powerful gaming mouse with excellent performance,It supports 6 levels adjustment DPI up to 12800.Rolling Rate max to 1000Hz,According user's preference setup different DPI and Rolling Rate suitable for games, office and many occasions     4 Mode Switch:SM900 wired mouse supports 4 modes switch, default 1 office mode and 3 gaming modes.Gaming modes need setup by macro software, according to the user's gaming preferences setup different button functions     Support Custom and Macro Program:SM900 lightweight wired mouse supports macro settings, user can reset the mouse buttons, DPI,modes, lighting effects.Customize personalized gaming mouse according to user preferences.This mouse is widely supported Windows 7,8,10,XP,,VISTA,MAC OS, etc, The USB interface is plug and play     3 Sided Honeycomb Shell design: SM900 Wired mouse more breathable, more sweat-absorbent and more comfortable!!!The gaming mouse is made of high quality ABS material and designed with ergonomic hollow perforated housing, Ergonomic Design reduce the weight and make the mouse more flexible and easier to be used for a long time without fatigue, and also enhance the heat dissipation features, very comfortable to use     14 RGB Rainbow Backlight:SM900 pc gaming mice has adjustable RGB lights that can be set to different effects according to user preferences. The brilliant lighting effects provide illumination in dark environments also increases the fun of using",
      "details": {
        "brand": "SOLAKAKA",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "wired",
        "color": "white",
        "ram": "N/A",
        "detail_item": "6 Levels Adjustable DPI:SM900 is a powerful gaming mouse with excellent performance,It supports 6 levels adjustment DPI up to 12800.Rolling Rate max to 1000Hz,According user's preference setup different DPI and Rolling Rate suitable for games, office and many occasions"
      }
    },
    {
      "id": "B08SHCKVTG",
      "name": "Corsair Katar Pro XT Ultra-Light Gaming Mouse- 18k DPI PixArt Optical Sensor- RGB Scroll Wheel Lighting- 6 Programmable Buttons- Lightweight Paracord Cable,Black",
      "ratings": 959,
      "price": "$34.99",
      "image": "https://m.media-amazon.com/images/I/51xGoYAgAqL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Weighing just 73g, the KATAR PRO XT is extremely light and agile for hours of fast-paced FPS or MOBA gameplay.     The KATAR PRO XT’s compact, symmetric shape makes it great for claw and fingertip grip styles.     An 18,000 DPI optical sensor from PixArt, customizable in 1 DPI steps, offers the precision and high-accuracy tracking you need for victory.     CORSAIR QUICKSTRIKE buttons use a spring-loaded design, delivering zero gap between the left and right click buttons and their switches, so your clicks, shots, and spells are faster than ever.     A lightweight paracord cable reduces drag, enabling faster, tighter, and more precise mouse movements.",
      "details": {
        "brand": "Corsair",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "Wired",
        "color": "Black",
        "ram": "N/A",
        "detail_item": "Weighing just 73g, the KATAR PRO XT is extremely light and agile for hours of fast-paced FPS or MOBA gameplay."
      }
    },
    {
      "id": "B09F99Y93H",
      "name": "VssoPlor Wireless Mouse, 2.4G Slim Portable Computer Mice with Nano Receiver for Notebook, PC, Laptop, Computer (White and Gold)",
      "ratings": 22.375,
      "price": "$9.99",
      "image": "https://m.media-amazon.com/images/I/61C6OW3tLRL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "LOW POWER CONSUMPTION: Intelligent sleep mode can better extend battery life. It will enter auto sleep mode if you don't use it for 5 minutes to save battery and need to click it, the mouse will enter working mode again     STABLE CONNECTION: 2.4 GHz wireless provides stronger anti-interference ability, a faster transmission speed and a more reliable connection, working distances can up to 15 m, and high DPI can make it track more smoothly over most surfaces     WIDE COMPATIBILITY:Well compatible with Windows7/8/10/XP, Vista, Mac OS X 10.4 etc. Fits for desktop, laptop, PC, Macbook and other devices     ERGONOMIC & COMPACT DESIGN: USB-receiver stays in your PC USB port or stows conveniently inside the wireless mouse when not in use. The lightweight and simple features make the mouse perfect for the journey, office, home     WHISPER & SENSITIVE CLICKING: Smooth frosted surface and quiet clicks can bring a better user experience and free your worry about bothering others and keep you stay focused while working",
      "details": {
        "brand": "VssoPlor",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "2.4G Wireless",
        "color": "White and Gold",
        "ram": "N/A",
        "detail_item": "LOW POWER CONSUMPTION: Intelligent sleep mode can better extend battery life. It will enter auto sleep mode if you don't use it for 5 minutes to save battery and need to click it, the mouse will enter working mode again"
      }
    },
    {
      "id": "B07NSVMT22",
      "name": "Logitech G903 LIGHTSPEED Wireless Gaming Mouse W/ Hero 25K Sensor, PowerPlay Compatible, 140+ Hour with Rechargeable Battery and Lightsync RGB, Ambidextrous, 107G+10G optional, 25,600 DPI, Black",
      "ratings": 3.675,
      "price": "$61.91",
      "image": "https://m.media-amazon.com/images/I/61GTK3XJokL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Power play wireless charging: never worry about your battery life again. Add the power play wireless charging system to keep G903 and other compatible g mice charged while at rest and at play. Powerplay wireless charging system sold separately     Hero 25K sensor through a software update from G HUB, this upgrade is free to all players: Our most advanced, with 1:1 tracking, 400 plus ips, and 100 - 25,600 max dpi sensitivity plus zero smoothing, filtering, or acceleration     Light speed wireless: pro-grade 1 ms report rate, no cable drag, no compromises on weight or battery life; eSports professionals depend on lightspeed’s responsiveness and reliable Connectivity     140 Hour lipo battery: super-efficient system design results in almost 6x the battery life of previous Gen; lasts for up to 140 hours with light Sync RGB lighting, and up to 180 hours without",
      "details": {
        "brand": "Logitech G",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": ": LIGHTSPEED Wireless",
        "color": "Black",
        "ram": "N/A",
        "detail_item": "Power play wireless charging: never worry about your battery life again. Add the power play wireless charging system to keep G903 and other compatible g mice charged while at rest and at play. Powerplay wireless charging system sold separately"
      }
    },
    {
      "id": "B088NDL2G1",
      "name": "【Upgrade】 LED Wireless Mouse, Slim Silent Mouse 2.4G Portable Mobile Optical Office Mouse with USB & Type-c Receiver, 3 Adjustable DPI Levels for Notebook, PC, Laptop, Computer, MacBook (Black)",
      "ratings": 52.042,
      "price": "$9.99",
      "image": "https://m.media-amazon.com/images/I/61L5QT+J39L._AC_SY300_SX300_.jpg",
      "description": "【LED Design】The upgraded version mouse with the LED lights adds more fun to the boring office life. The bottom of the mouse has a switch, you can switch lights freely. Low-key or sparkle, switch in one second, suitable for any occasion.     【Rechargeable Optical Mouse】Built-in durable rechargeable battery, it can be easily charged using the included USB cable without replacing the battery. Just 2 hours charging, you can use it about 7-15 days. Standby time is very long, energy-saving features, automatic sleep mode and wake-up mode are installed to save energy. Turn off the mouse LED light when not in use to save power.     【Plug and Play】No need to install any driver, just plug the USB receiver into your laptop will the mouse start to serve. 2.4GHz wireless technology provides powerful and reliable connection, effective up to 10 meters of range. Advanced optical tracking technology with fast click and responsiveness. 3-Level adjustable DPI (800/1200/1600 DPI), freely to satisfy daily work. Equipped with USB-C to USB adapter, let you worry-free use of any device.     【Mute Click & Comfortable Hand-feeling】Silent click Mouse with classic design with anti-fingerprint finish offers your hand maximum support and comfort. Silent button reduces 90% noises, which makes it an ideal wireless mouse for office, conference room, cafe, library, bedroom, help you concentrate on your work, study without disturbing others besides you. Ultra-thin, ergonomic design, lightweight and convenient for carrying or traveling.     【Wide Compatibility】Well compatible with Windows XP, Vista, 7, 8, and 10 / Windows Vista / Windows Vista/ Windows ME etc, Fits for desktop, laptop, PC, Macbook and other devices. Please Note: If your laptop just with type-c port, You need connect the supplied USB-C to USB adapter to your laptop and plug the USB receiver in to it.",
      "details": {
        "brand": "OKIMO",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "USB",
        "color": "Black",
        "ram": "N/A",
        "detail_item": "【LED Design】The upgraded version mouse with the LED lights adds more fun to the boring office life. The bottom of the mouse has a switch, you can switch lights freely. Low-key or sparkle, switch in one second, suitable for any occasion."
      }
    },
    {
      "id": "B09GK3LTVC",
      "name": "Razer DeathAdder V2 X HyperSpeed: Award-Winning Ergonomic Design - Ultra-Fast Wireless - 235hr Battery Life - 7 Programmable Buttons - Gen 2 Mechanical Switches - 5G 14K DPI Optical Sensor",
      "ratings": 18.334,
      "price": "$59.99",
      "image": "https://m.media-amazon.com/images/I/31Y0XT5G62L.__AC_SY300_SX300_QL70_FMwebp_.jpg",
      "description": "Award-Winning Ergonomic Design: Trusted by over 13 million fans worldwide, the DeathAdder’s iconic shape has provided wins for countless pros more than any other mouse—including the three-time League of Legends world champ, Faker     Ultra-Fast Razer HyperSpeed Wireless: Featuring the same high-speed Razer HyperSpeed Wireless technology used in our top-tier gaming mice with an ultra-low latency wireless connection     Long Battery Life: With up to 235 hours of seamless low-latency gaming with Razer HyperSpeed Wireless (2.4GHz), and up to 615 hours with Bluetooth, the mouse can go for ages before its battery needs replacing     Razer Mechanical Mouse Switches Gen-2: Experience crisp and consistent execution with switches that have new gold-plated contact points, are less prone to degrading, and have a longer lifespan of up to 60 million clicks     Razer 5G Advanced 14K DPI Optical Sensor: Enjoy responsive, pixel-precise aim with an improved sensor that flawlessly tracks your movement with zero spinouts     7 Programmable Buttons: Have all the control you need with 2 unique quick-access edge buttons and 2 side buttons     Weight Balanced: Batteries are seated at an angle in the mouse to provide optimal weight distribution",
      "details": {
        "brand": "Razer",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "Bluetooth",
        "color": "Classic Black",
        "ram": "N/A",
        "detail_item": "Award-Winning Ergonomic Design: Trusted by over 13 million fans worldwide, the DeathAdder’s iconic shape has provided wins for countless pros more than any other mouse—including the three-time League of Legends world champ, Faker"
      }
    },
    {
      "id": "B0BGJT87N2",
      "name": "Razer Naga V2 HyperSpeed Wireless MMO Gaming Mouse: 19 Programmable Buttons - HyperScroll Technology - Focus Pro 30K Optical Sensor - Mechanical Mouse Switches Gen-2 - Up to 400 Hr Battery Life",
      "ratings": 862,
      "price": "$78.99",
      "image": "https://m.media-amazon.com/images/I/61YULkQowXL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "19 PROGRAMMABLE BUTTONS — Armed with ergonomically positioned buttons that provide an arsenal of commands at the fingertips for mapping out the essentials or going all out with advanced macros     RAZER HYPERSPEED WIRELESS (2.4 GHZ) AND BLUETOOTH — Unleash seamless, low-latency performance that's 25% faster than other wireless tech or switch to Bluetooth for longer hours of gaming     POWERED BY RAZER HYPERSCROLL TECHNOLOGY — Perform repeated commands rapidly or blaze through content in free-spin mode, or activate tactile mode for enhanced precision and satisfying feedback     LONG BATTERY LIFE — With up to 400 hours on Bluetooth and 250 hours of seamless low-latency gaming on Razer HyperSpeed Wireless (2.4GHz), last longer in the heat of battle with this mouse before having to replace its battery     FOCUS PRO 30K OPTICAL SENSOR — Razer’s brand-new sensor provides flawless tracking performance on a wider variety of surfaces including glass —supported by intelligent functions for enhanced aim and control     MECHANICAL MOUSE SWITCHES GEN 2 — With gold-plated contact points, the switches are less prone to degrading and have a longer lifespan of up to 60 million clicks     #1 SELLING PC GAMING PERIPHERALS BRAND IN THE U.S. — Source — Circana, Retail Tracking Service, U.S., Dollar Sales, Gaming Designed Mice, Keyboards, and PC Headsets, Jan. 2019- Dec. 2023 combined",
      "details": {
        "brand": "Razer",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "Bluetooth, USB",
        "color": "Black",
        "ram": "N/A",
        "detail_item": "19 PROGRAMMABLE BUTTONS — Armed with ergonomically positioned buttons that provide an arsenal of commands at the fingertips for mapping out the essentials or going all out with advanced macros"
      }
    },
    {
      "id": "B0CKN2NSYL",
      "name": "Redragon Wireless Gaming Mouse, MMO Gaming Mouse UP 16,000 DPI, 16 Macro Programmable Buttons, RGB Rechargeable Gaming Mouse with 12 Side Buttons, 70Hrs for PC Laptop MOBA FPS, M901P-KS",
      "ratings": 9.265,
      "price": "$35.99",
      "image": "https://m.media-amazon.com/images/I/61744B20AbL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "【High-performance Gaming Mouse】UP 16000 DPI provides high sensitivity and smoothing movements. Adjustable DPI(100-16000) and Polling Rate(125Hz-1000Hz) ensure this professional gaming mouse is suitable for gaming or daily work. Attached the 40G Acceleration gives you a greater edge over your competition     【Real Customizable】You can remap the 16 buttons through macro editing to meet your usage habits under different conditions. Equipped with 5 Memory Profiles to save your settings, and 2 working modes that can be switched with one click. Redragon MMO Mouse is customizable for Any Scenario, always be one step ahead of others     【Wireless & Rechargeable】Wireless Gaming Mouse gets rid of cable limits, making every move freer and smoother. The 1000mAh build-in battery ensures over 70Hrs(RGB OFF) standby time and can be used during wired charging, keeping the mouse always online     【Real RGB Gaming Mouse】16.8million color combinations bring an immersive gaming experience. 4 Lighting Modes can be easily switched to feed different gaming, and you also can adjust mouse lighting according to your preference using the software(download on redragonzone)     【Unique & Comfort Design】Ergonomic Design with Skin-friendly material, long gaming without fatigue or pain. The 12 side buttons can be remapped through macro editing, making keyboard combination functions realized through button clicks, allowing you to win efficiently in any game scenario",
      "details": {
        "brand": "Redragon",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "🅽🅴🆆 🅡🅔🅛🅔🅐🅢🅔",
        "color": "black",
        "ram": "N/A",
        "detail_item": "【High-performance Gaming Mouse】UP 16000 DPI provides high sensitivity and smoothing movements. Adjustable DPI(100-16000) and Polling Rate(125Hz-1000Hz) ensure this professional gaming mouse is suitable for gaming or daily work. Attached the 40G Acceleration gives you a greater edge over your competition"
      }
    },
    {
      "id": "B0CPLNPV6F",
      "name": "SM66 White Silent Dual Mode 2.4GHz Wireless Mouse, Adjustable 4800 DPI,Rechargeable Computer Mouse Wireless Office Mouse for PC Mac Laptop, Desktop",
      "ratings": 272,
      "price": "$16.89",
      "image": "https://m.media-amazon.com/images/I/51Udo0fWghL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "2.4G Wireless Dual-Mode:The SOLAKAKA SM66 wireless mouse is perfect for multi-functional use,support 2 mode BT and 2.4GHz wireless connection,3 devices save. supports connection for your Laptop,PC,Computer,Xbox,iPad,Mobile Phone.compatible with multiple systems including Windows,OS,Android,IOS,etc     Ergonomic Design, 5 DPI Adjustable:This Slim Ergonomic shape wireless mouse is designed with an asymmetrical and streamlined shell, offering a comfortable claw-grip using experience for right,left and medium,small hand, long-term use without fatigue. 5 DPI levels 4800,2400,1600,1200,800,user can press the DPI button at the bottom of the mouse. Easier and smoother. The ultra-thin design is mini and lightweight, perfect for traveling carry, and can be easily put into laptop bag, ultra-space saving     Silent Buttons:SM66 wireless mouse adopts a silent button design, which reduces 99% of button noise. It is very suitable for public places such as libraries and offices. It is the best choice for people who like quiet     PORTABLE and 10M LONG WORKING DISTANCE:2.4G Nano USB receiver is embedded in the computer mouse bottom for convenient portability. It is great as a travel mouse for a laptop. The remote mouse for laptop works great with the SOLAKAKA mouse combo and computer keyboard and mice accessories. The 10m,32ft long working distance ensures you can enjoy high-precision optical sensor performance on various surfaces     Rechargeable and Long Battery Life:With the built-in 500mAh rechargeable Lithiumion battery, you can charge the magic cute mouse by using the Type-C charger cable included. Using while charging is available. In addition, the rechargeable mouse uses smart power-saving technology, the great battery will enter sleep mode after 3 minutes of no-operation to save power and provide long time usage. You can wake it up by clicking any button     Friendly Tip: SM66 has a smart sleep mode, when it is not used for a few minutes, it will enter the power saving state, please move the mouse to wake it up!",
      "details": {
        "brand": "SOLAKAKA",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "Bluetooth",
        "color": "white",
        "ram": "N/A",
        "detail_item": "2.4G Wireless Dual-Mode:The SOLAKAKA SM66 wireless mouse is perfect for multi-functional use,support 2 mode BT and 2.4GHz wireless connection,3 devices save. supports connection for your Laptop,PC,Computer,Xbox,iPad,Mobile Phone.compatible with multiple systems including Windows,OS,Android,IOS,etc"
      }
    },
    {
      "id": "B08LDHYNW3",
      "name": "TECKNET Wireless Mouse, USB Cordless Computer Mouse with 8 Buttons, Ergonomic Design, High-Precision 5 Adjustable DPI for PC/Mac/Laptop",
      "ratings": 1.035,
      "price": "$11.99",
      "image": "https://m.media-amazon.com/images/I/613mEAkWBlL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "【2.4GHz Wireless Gaming Mouse】Our 2.4GHz wireless gaming mouse offers a more secure and precise experience compared to traditional FM radio systems, with an increased working distance of up to 10 meters.     【Plug & Play】No need to install a driver; simply plug the tiny USB Nano receiver into your PC, and the mouse will automatically connect. You can select your preferred cursor speed from 800, 1200, 1600, 2400, or 4800 DPI.     【Secret Weapon for Gaming】With our wireless gaming mouse, achieve a 500Hz return rate for instant transmission between your computer and mouse. Experience no delay and no frame skipping, allowing you to enjoy games more fluently and freely.     【Stable Connection】The wireless gaming mouse features Tru-Wave and Co-Link Technology. Tru-Wave technology provides precise, smart cursor control over many surface types. Co-Link technology ensures that once paired, there is no need to re-establish the connection after a signal loss or shutdown.     【Energy Efficient】The auto power-off function switches off the wireless mouse when the USB Nano receiver is disconnected or when the PC is switched off. This feature provides up to 12 months of battery life from just 2 AA batteries (not included).     【36 Months Support】If you encounter any problems in using the computer mouse wireless, please feel free to contact our professional customer service team, enjoying TECKNET 36 Months Warranty (Registered Only)",
      "details": {
        "brand": "TECKNET",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "USB",
        "color": "Black blue",
        "ram": "N/A",
        "detail_item": "【2.4GHz Wireless Gaming Mouse】Our 2.4GHz wireless gaming mouse offers a more secure and precise experience compared to traditional FM radio systems, with an increased working distance of up to 10 meters."
      }
    },
    {
      "id": "B0C97CF6K2",
      "name": "Cute Bluetooth Mouse, 2.4 GHz Wireless Mice with USB Receiver for Laptop, iPad, Mac, Silent Cartoon Mouse Suitable for Children and Students (Kerry Bear)",
      "ratings": 376,
      "price": "$14.99",
      "image": "https://m.media-amazon.com/images/I/61kL1e5zG-L.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "❤ [Cute Wireless Mouse] - Our wireless mouse has a variety of cute cartoon pattern designs, suitable for young people and children.     ❤ [Dual Mode Mouse] - Bluetooth & 2.4G dual mode wireless mouse connection switch easily. Bluetooth wireless brings quick response, precise movement, stable connection & smoother tracking. 2.4G wireless transmission provide stable and reliable connection.     ❤ [Silent Wireless Mouse] - Special design, noiseless click sound when pressing buttons, which let you not worry about the mouse sound can disturbing others, especially at library or office.     ❤ [Durable Mouse] - Intelligent power saving, the mouse will automatically be in sleeping mode after 10 minutes inactivity, you can click any button to wake it up. Only 1 piece AA battery is required for power supply (not included in the package).     ❤ [Universal Compatibility Mouse] - FMOUSE M101 Mouse, with wireless receiver and Bluetooth inside, connect the mouse easily to your MacBook, iPad, Laptop or any Desktop devices, Mouse wireless well compatible with Windows, MacOS, iPadOS & Android.",
      "details": {
        "brand": "FMOUSE",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "Wireless, Bluetooth, USB",
        "color": "Kerry Bear",
        "ram": "N/A",
        "detail_item": "❤ [Cute Wireless Mouse] - Our wireless mouse has a variety of cute cartoon pattern designs, suitable for young people and children."
      }
    },
    {
      "id": "B09NBV52FS",
      "name": "Wired Gaming Mouse [Breathing RGB LED] [Plug Play] High-Precision Adjustable 7200 DPI, 7 Programmable Buttons, Ergonomic Computer USB Mice for Windows/PC/Mac/Laptop Gamer",
      "ratings": 2.16,
      "price": "$16.99",
      "image": "https://m.media-amazon.com/images/I/61i6QyWUpQS.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "[Charming Breath RGB Backligh]:16 million color options for the backlight setting make your gaming mouse look cool.The RGB lights is more vibrant than basic light up mice.Turn it off when you unwanted.     [High-Precision DPI & Polling Rateh]:gaming mouse run flawlessly with optical sensor and avoids random clicks.adjust DPI 1200-7200,polling rate125-1000Hz to provide precise cursor movements for gameplay.     [Seven Programmable Buttons]:Mouse have 7 buttons,can set for more functions like rapid fire,macro etc.Software is initial setup.side buttons are default as forward,backward for efficiency surfing.     [Ergonomic Design,Less Fatigue]:The ergonomic contour makes gaming mice fit in any hands.Texture of mouse is a super-fine rubber that feels comfortable and less your fatigue during multiplayer sessions.     [Plug & Play, Build Quality]:As a plug-and-play wired mouse,easy to use and work with Windows,Mac OS,etc.You can feel the solid construction of all buttons.They are responsive,won’t squeak or get stuck.",
      "details": {
        "brand": "WEEMSBOX",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "USB",
        "color": "Black",
        "ram": "N/A",
        "detail_item": "[Charming Breath RGB Backligh]:16 million color options for the backlight setting make your gaming mouse look cool.The RGB lights is more vibrant than basic light up mice.Turn it off when you unwanted."
      }
    },
    {
      "id": "B07V83NMCV",
      "name": "Alienware Wired/Wireless Gaming Mouse AW610M: 16000 DPI Optical Sensor - 350 Hour Rechargeable Battery, 7 Buttons, 3-ZONE 16.8m AlienFX RGB Lighting, Edge-Free Design, Ergonomic, Dark Side of the Moon",
      "ratings": 1.576,
      "price": "$58.99",
      "image": "https://m.media-amazon.com/images/I/71u65w5IiEL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Power your way to victory: Game with confidence thanks to industry-leading power efficiency. With up to 350 hours of gameplay on a single charge of the lithium-ion battery, you can keep the fight going for weeks on end.     Attack with deadly precision: Move swiftly and precisely with the latest generation custom Alienware native 16,000 DPI sensor.     Control the battlefield: Wield greater precision while in the middle of combat with the custom, adjustable scroll wheel that allows you to switch between 12 and 24 steps per scroll wheel revolution.     Light it up: Fly your colors on the battlefield with fully customizable AlienFX RGB, giving you 16.8m color control via Alienware Command Center.     Personalize your arsenal: Switch up your gameplay instantly with seven buttons that are fully programmable thanks to the Alienware Command Center. Plus, stay one-step ahead of your opponents with pre-loaded tension on the main clicker mechanism for a controlled, crisp, tactile click feel.",
      "details": {
        "brand": "Alienware",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "Wireless, wired - USB",
        "color": "Dark Side of the Moon",
        "ram": "N/A",
        "detail_item": "Power your way to victory: Game with confidence thanks to industry-leading power efficiency. With up to 350 hours of gameplay on a single charge of the lithium-ion battery, you can keep the fight going for weeks on end."
      }
    },
    {
      "id": "B0BKL8VT9M",
      "name": "Arteck Multi-Device Wireless Bluetooth Mouse with Nano USB-A, USB-C Receiver Ergonomic Right Hand Silent Clicking Rechargeable Mouse for Computer Desktop PC Laptop Mac iPad and Windows 11/10 iPad OS",
      "ratings": 732,
      "price": "$25.99",
      "image": "https://m.media-amazon.com/images/I/61VYoya-47L.__AC_SY300_SX300_QL70_FMwebp_.jpg",
      "description": "Comfortable ergonomic design: Soft easy-to-grip thumb rest, promotes natural hand and wrist position allow you to navigate your mouse in a more comfortable way. This mouse fits for medium-large hands, not suitable for small hands.     3 Devices with A Single Clicking: This mouse is able to connect to 3 devices (2.4G USB-A Wireless + 2.4G USB-C Wireless + Bluetooth) at the same time. You can switch between 3 devices with a single button clicking.     Wide Compatibility: This mouse works with Computer / Desktop / PC / Laptop / Mac / iPad, Windows 11/10/8/7, iPad OS, Android. It can connect to your device via USB port or Bluetooth.     Long Life Rechargeable Battery: Rechargeable lithium battery with an industry-high capacity lasts for 4 months with single charge (based on 2 hours' non-stop use per day). Silent clicking allows you to work in the office, home, cafe, library without disturbing anyone around you.     What You Get: Arteck MD172 Wireless Mouse, one nano USB-A receiver, one nano USB-C receiver (both stored in the back of the mouse), USB-C charging cable, welcome guide, our 24-months warranty and friendly customer service.",
      "details": {
        "brand": "Arteck",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "USB-C Wireless, Bluetooth, USB-A Wireless",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "Comfortable ergonomic design: Soft easy-to-grip thumb rest, promotes natural hand and wrist position allow you to navigate your mouse in a more comfortable way. This mouse fits for medium-large hands, not suitable for small hands."
      }
    },
    {
      "id": "B00Z9V0NKC",
      "name": "BENGOO Gaming Mouse Wired, Ergonomic Gamer Laptop PC Optical Computer Mice with RGB Backlit, 4 Adjustable DPI Up to 3600, 6 Programmable Buttons for Windows 7/8/10/XP Vista Linux -Black",
      "ratings": 12.913,
      "price": "$9.00",
      "image": "https://m.media-amazon.com/images/I/61lCLrCtuhL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "【Speed DPI Switch】 Bengoo customizable RGB gaming mice, with 4 adjustable DPI speed Switch:1200-1600-2400-3600, you can control the speed more freely and easily. No need any driver, plug and play directly.     【Flexible Buttons】 Equipped with six buttons: Left button, Right button, Forward, Back, DPI button and Scroll wheel, meets for your demands excellently for different games, enables to switch fast while gaming.     【Lighting Colors】 Muti-colors lights greatly match your style, provide you fancy gaming environment and highlight your game atmosphere.     【Ergonomic Design】 Perfectly fits under your palm, skin-friendly material we take provides you a perfect hand feel, gives gamers the most comfortable gaming experienece and makes you feel free from fatigue.     【Wide Compatibility】 Support Windows XP, Vista, Windows 7, Windows 8. Adaptable for Notebook, PC, laptop, Computer, Macbook and so on.",
      "details": {
        "brand": "BENGOO",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "USB",
        "color": "black",
        "ram": "N/A",
        "detail_item": "【Speed DPI Switch】 Bengoo customizable RGB gaming mice, with 4 adjustable DPI speed Switch:1200-1600-2400-3600, you can control the speed more freely and easily. No need any driver, plug and play directly."
      }
    },
    {
      "id": "B0D2JGKRMM",
      "name": "Lenovo Yoga Pro Mouse - Tidal Teal",
      "ratings": 823,
      "price": "$36.99",
      "image": "https://m.media-amazon.com/images/I/51gSq4gwZmL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Ergonomic Design: The Yoga Pro is a full-sized mouse with perfect symmetry, a comfortable grip with soft material on the sides, and thumb rest placement that delivers an experience tuned for comfort and balance     Dynamic Performance: This computer mouse invites fluidity and dynamic performance into your workflow. With programmable side and top buttons, silent left and right buttons, and a configurable scroll wheel, it delivers true adaptability     Multi-Surface Tracking: Our blue optical sensor enables precision on almost any surface, promoting enduring focus. And with on-the-fly DPI (three stages) and adjustable via software up to 4000, you can further tailor your Yoga Pro to meet your changing needs     Rechargeable Bluetooth Mouse: Harness the energy of a long-lasting rechargeable battery and dual-device Bluetooth 5.1 pairing for seamless transitions. With less than a 2-hour charge for full battery, your mouse will last 2-3 months before needing its next power up     Connectivity Type: Bluetooth Low Energy / Bluetooth 5. Bluetooth Dual-Host Quick Pairing & Swift Pair. Multi-device switch and connect with the bottom pairing button. One-year long-term warranty",
      "details": {
        "brand": "Lenovo",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "Bluetooth",
        "color": "Tidal Teal",
        "ram": "N/A",
        "detail_item": "Ergonomic Design: The Yoga Pro is a full-sized mouse with perfect symmetry, a comfortable grip with soft material on the sides, and thumb rest placement that delivers an experience tuned for comfort and balance"
      }
    },
    {
      "id": "B07KNQRQ3P",
      "name": "ZERU Bluetooth Mouse,Rechargeable Wireless Mouse for Macbook Pro/Macbook Air,Bluetooth Wireless Mouse for Laptop/PC/Mac/iPad pro/Computer",
      "ratings": 27.651,
      "price": "$11.85",
      "image": "https://m.media-amazon.com/images/I/612hkjogX3S.__AC_SY300_SX300_QL70_FMwebp_.jpg",
      "description": "[BEST COMPATIBLE BLUETOOTH 4.0 CHIP] - Compatible with more than 99% Bluetooth devices. Connect Pad 10.2 2019, Pad 9.7 Inch 2018, Pad 9.7 2017, Pad Pro 12.9\" / 11.0\" / 10.5\"/ 9.7\", Pad Air 10.5 / Air 2, Pad mini 5/ 4, Phone 11 Pro Max, Phone 11 Pro, Phone 11, Phone Xs Max etc.( Note: Updated System to PadOS 13 and iOS 13 or above, and Turn on the ¡°Assistive Touch¡± ) PC, Macbook pro air 2012/¡­2017/2018/2019 laptop, notebook, Mac OS; Support Win7 Win8 Win10 Linux OS X or Android tablet.     【Skin-Friendly for Comfort】Silent click Mouse with classic design with anti-fingerprint finish offers your hand maximum support and comfort. The sturdy anti-slip rubber scroll wheel ensures that your hand will not slip when scrolling.     【Rechargeable Optical Wireless Mouse】Built-in durable 450mAh lithium rechargeable battery can last up to 500 hours after fully charged, and standby time is super long with auto sleep and wake mode. Easily recharged through the included USB cable, no need to change the battery.     【NOISE FREE】Quiet click sound when pressing buttons, which makes you away from worrying about bothering others, especially at home while other family members having rest, so that you can stay focused on your work.     QUALITY GUARANTEE: One year quality warranty for this bluetooth mouse from ZERU",
      "details": {
        "brand": "ZERU",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "Bluetooth",
        "color": "black",
        "ram": "N/A",
        "detail_item": "[BEST COMPATIBLE BLUETOOTH 4.0 CHIP] - Compatible with more than 99% Bluetooth devices. Connect Pad 10.2 2019, Pad 9.7 Inch 2018, Pad 9.7 2017, Pad Pro 12.9\" / 11.0\" / 10.5\"/ 9.7\", Pad Air 10.5 / Air 2, Pad mini 5/ 4, Phone 11 Pro Max, Phone 11 Pro, Phone 11, Phone Xs Max etc.( Note: Updated System to PadOS 13 and iOS 13 or above, and Turn on the ¡°Assistive Touch¡± ) PC, Macbook pro air 2012/¡­2017/2018/2019 laptop, notebook, Mac OS; Support Win7 Win8 Win10 Linux OS X or Android tablet."
      }
    },
    {
      "id": "B0CSDP755C",
      "name": "SM600 Honeycomb Shell Gaming Mouse Wireless,8000 DPI Tri-Modes BT5.1/2.4G Wireless/Type-C Wired Gamer Mouse with 2 Side Buttons, Macro Programmable and RGB Light for PC/Mac/Laptop,Green",
      "ratings": 1.256,
      "price": "$29.89",
      "image": "https://m.media-amazon.com/images/I/61DboHuc4+L._AC_SY300_SX300_.jpg",
      "description": "3 Mode connection:M600 PRO wireless gaming mouse adopts tri-mode connection,2.4G wireless,2 BT5.1,Type-C Wired connection.Users can save 4 devices same time,support PC,laptop,tablet,mobile phone,etc. Switch convenientand connection quick     Customized and Macro Proqram:SM600 gaming mouse with 7 programmable buttons. Users through the software to set the mouse buttons,DPl,mode,lighting effects,etc.SM600 Custom mouse greatly meets the DIY needs of game enthusiasts     Adjustable DPI and Rechargeable Battery:SM600 wireless mouse can be adjusted within 6 levels dpi(8000-4000-2400-1600-1200-800).Rate of return up to 1000Hz,even in intense games,achieve zero latency and no frame skipping. Built-in 600 mA lithium battery,with USB-C charqing cable,Low battery indicator will remind user to charge it with flashing redlight.it also supported recharged while charging     Lightweight and Honeycomb Shell:SM600 honeycomb mouse made of high quality.ABS material and designed with ergonomic hollow shell,Ergonomic Design reduce the weight and make the mouse more flexible and easier to be used for a long time without fatigue,and also enhance the heat dissipation features very comfortable to use.     14 RGB Rainbow Backlight:SM600 has beautiful RGB rainbow backlight.This wireless mouse is equipped with RGB lighting effects. Press the top button to switch light modes(rainbow light,Monochrome light,light off). Very cool lights especially when useing in the dark.",
      "details": {
        "brand": "SOLAKAKA",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "Bluetooth",
        "color": "green",
        "ram": "N/A",
        "detail_item": "3 Mode connection:M600 PRO wireless gaming mouse adopts tri-mode connection,2.4G wireless,2 BT5.1,Type-C Wired connection.Users can save 4 devices same time,support PC,laptop,tablet,mobile phone,etc. Switch convenientand connection quick"
      }
    },
    {
      "id": "B0CJNR6211",
      "name": "Wireless Gaming Mouse Honeycomb 2.4G USB Cordless Mouse RGB Rechargeable PC Game Mice with 7-Color LED Lights，3 Adjustable DPI for Windows Laptop Desktop Computers -White",
      "ratings": 199,
      "price": "$17.99",
      "image": "https://m.media-amazon.com/images/I/71qMt7XPSVL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "【LIGHTWEIGHT HONEYCOMB SHELL DESIGN】 The gaming mouse is made of high-quality ABS material and designed with an ergonomic hollow perforated housing, reducing weight and providing a comfortable grip even during long gaming sessions.     【WIRELESS FREEDOM & STABLE CONNECTION】 Connects wirelessly through 2.4G technology with the USB nano receiver, offering a stable connection with a range of up to 10m (33ft). No delays or dropouts, simply plug and play.     【VIBRANT RGB 7-COLOR BACKLIGHT】 The RGB gaming mouse features a flowing rainbow backlight that adds a visually stunning atmosphere to your workspace. Convenient switch to turn off the light when desired.     【3 DPI ADJUSTABLE & BATTERY RECHARGEABLE】 Adjust the mouse's DPI levels (1600-1200-800) for precise control. The built-in 600mAh lithium battery is rechargeable via USB-C cable, with a low battery indicator for timely charging.     【WIDE COMPATIBILITY】 Compatible with various devices such as PC, Mac Notebook, Laptop, Tablet, desktop, Computer, and more. Supports Windows 7/8/10/XP/VISTA/MAC OS, ensuring versatility.",
      "details": {
        "brand": "MELOGAGA",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "Wireless",
        "color": "Wireless_White",
        "ram": "N/A",
        "detail_item": "【LIGHTWEIGHT HONEYCOMB SHELL DESIGN】 The gaming mouse is made of high-quality ABS material and designed with an ergonomic hollow perforated housing, reducing weight and providing a comfortable grip even during long gaming sessions."
      }
    }
  ]
}