[
  {
    "id": "B0DFP17H38",
    "name": "SHEZI [Upgrade 4 in 1 Charging Cable, 60W [Full Chrager Only 0.8h][1GB Transfer Only 12s] Flat Silicone Multi Fast Charge Phone Cord with USB A/Type C/Light-ning for iPhone iPad Samsung, 5FT",
    "ratings": 13,
    "price": "$26.99",
    "image": "https://m.media-amazon.com/images/I/71-hxCuleiL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "Unique Liquid Silicone Material: Our usb c cable use the latest liquid silicone rubber as a material to make the cable softer, stronger, more resistant to dirt, is able to fully withstand stress and it feels incredibly soft between your fingers and is one of the strongest cables ever made. It won't get tangled even when tucked into a bag or pocket, making it perfect for carrying around.     4-in-1 Versatile Simplify Design: Our usb to usb c cable has different ports, including Light-ning/USB A/Type C connectors. Support to charge 99% phones available on the market. It's super handy to carry and meets all your demands on families, travel or work, business trips, and other occasions. ﻿     Fastest Charging in History: Our usb c to light-ning cable can charge your device at the fastest speed. Fully charge a iPhone 15 pro to 96%, a Switch to 90%, a Samsung S23 to 96%, a MacBook Pro to 86% and an iPad Pro to 89% in 35 minutes. NOTE: Please use a charger with the corresponding wattage or higher that our product could output maximum power.     Super Fast Data Transfer: Supports the USB 2.0 standard with unmatched data transfer speed up to maximum 480Mbps. This usbc cable is compatible with USB2 devices and transfer music, movies, or videos in seconds at maximum 480Mbps, 1GB files transfer only 12s.     Support CarPlay & Android Auto: This usb c to usb c cable 100% supports both Android Auto and Carplay which charging and navigating at the same time. Whether you have the usb c or light-ning port devices in your car, we can perfectly work for you. So no longer need to carry cables for each device, make you life more convenient.     Ultra High-Quality Assurance: This usb a to usb c cable has been tested to withstand at least 10,000 cycles of 90-degree bend and 10,000 plugging and unplugging lifespan which is 12 times stronger than all original cables, its zinc alloy cable housing is highly resistant to wear and scratches. You don't need to replace the charging cable within 3 years.     More Promise Less Concern: If you encounter any issues with your usb to light-ning cable, contact us via Amazon Message Center. Our dedicated customer support team is available to assist you with any questions or concerns you may have within 12 hours.",
    "details": {
      "brand": "SHEZI",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "USB",
      "color": "Green"
    }
  },
  {
    "id": "B0DC5LFDTL",
    "name": "65w USB C Fast Charger 3 Ports with Foldable Plug Adapter Compatible for MacBook Pro/air, Ipad Pro, Charge for iPhone 16/15, Samsung Galaxy S24/s23, Google Pixel, and More",
    "ratings": null,
    "price": "$29.99",
    "image": "https://m.media-amazon.com/images/I/6163K1Ng5GL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "65W Fast Charging Efficiency: Single C1 or C2 port to get an impressive 65W Max charging power, which can charge for MacBook Pro 13 inch (2024/2022/2020) or charger for iPhone 16 pro max at full speed , easily from 2% to 55% in 30 minutes, High-speed charging for compatible devices such as phones, tablets, and laptops     3 in 1 Versatile Charger: Acceron 65w 3 ports usb fast charger provides intelligent current distribution to ensure you get the best charge, which can charge 3 devices (phones, tablets, and laptops) simultaneously, Use one charger to charge more devices, say goodbye to multiple chargers     Travel Friendly, Compact Design: A foldable plug provides more portability and a better travel experience, which is durable, compact and portable, perfect for easy storage, The 6-foot long USB C cable allows you to use your electronic devices comfortably while charging quickly     Wide Compatibility: Perfected to work with both PD & QC, PPS charging protocols for seamless use with your tablets, laptops, smartphones, and all USB-charged devices at the same time. 65w 3 ports usb fast charger block is compatible with Macbook Series, Dell XPS Series, Google Pixelbook, Microsoft Surface Book, iPhone Series, Samsung Series, Google Pixel Series, iPad Series, Galaxy Tab Series, AirPods, Apple Watch, Nintendo Switch, and More     Safe, Stable, and Durable: Utilizing GaN technology, this 65w USB C charger 3 ports has built-in intelligent chip multiple protection system to protect your devices from damage, avoid overvoltage, overcharging, overheating, charge your Phone/iPad/MacBook and more devices quickly, safely and stably     What You Get: Acceron 65w 3 ports usb foldable fast wall charger*1 and 6ft usb c charging cable 100w*1, We offer 2-year warranty, while 24*7 friendly customer support ensures your pleasing shopping experience. If you have any questions, please do not hesitate contact us",
    "details": {
      "brand": "Acceron",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "USB",
      "color": "white"
    }
  },
  {
    "id": "B096BMJPL8",
    "name": "SAMSUNG Galaxy Watch 4 Classic 42mm Smartwatch with ECG Monitor Tracker for Health, Fitness, Running, Sleep Cycles, GPS Fall Detection, LTE, US Version, Silver",
    "ratings": 257,
    "price": "$351.98",
    "image": "https://m.media-amazon.com/images/I/71VNyRYDQeL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "BODY COMPOSITION ANALYSIS: Galaxy Watch4 Classic is the first smartwatch to off body composition data right on your wrist, On your own schedule, now you can get readings on body fat, skeletal muscle, body water, basal metabolic rate, and Body Mass Index*     BETTER SLEEP STARTS HERE: Wake up feeling refreshed and recharged with advanced sleep tracking; When you go to bed, your Galaxy Watch4 Classic sleep tracker starts monitoring your sleep and SpO2 levels continuously**     BE SMART ABOUT YOUR HEART: Take care of your heart with accurate ECG monitoring and keep an eye on possible atrial fibrillation, a common form of irregular heart rhythm; Share personalized readings with your doctor using the Samsung Health Monitor app on your compatible Galaxy phone***     MAKE EVERY WORKOUT COUNT: Get the most out of every exercise session with advanced workout tracking that recognizes 6 popular activities, from running to rowing to swimming, automatically in just 3 minutes****; Stay motivated by connecting to live coaching sessions via your smartphone or to dynamic Group Challenges with your friends     GO THE EXTRA MILE: Improve your runs with advanced running coaching technology; VO2 Max readings assess your oxygen levels to manage and track your heart and lung endurance*****     GOOGLE ON YOUR WRIST: Tap into the power and convenience of select Google services and apps right from your wrist; Pay for coffee; Get directions to the park; Use Bixby or Google Assistant for help on almost any topic; Stream your favorite tunes on YouTube******     EXTENSION OF YOUR PHONE: Galaxy Watch4 Classic works as an extension of your phone so you can do more while on the go; Talk, text, stream music and more just by tapping the watch on your wrist*******",
    "details": {
      "brand": "N/A",
      "operatingSystem": "android 6.0",
      "memoryStorageCapacity": "16 GB",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "Bluetooth, Cellular",
      "color": "N/A"
    }
  },
  {
    "id": "B08J3Y4W5J",
    "name": "SAMSUNG Galaxy Buds Live True Wireless Bluetooth Earbuds w/ Active Noise Cancelling, Charging Case, AKG Tuned 12mm Speaker, Long Battery Life, US Version, Mystic Red",
    "ratings": 9.348,
    "price": " ",
    "image": "https://m.media-amazon.com/images/I/71qsNVFefKL.__AC_SY300_SX300_QL70_FMwebp_.jpg",
    "description": "SOUND THAT ROCKS: The AKG-tuned 12mm speaker and enhanced bass tone play everything in studio-quality sound. An open design creates a live listening environment, suiting those who prefer a natural, spacious sound.Note : If the size of the earbud tips does not match the size of your ear canals or the headset is not worn properly in your ears, you may not obtain the correct sound qualities or call performance. Change the earbud tips to ones that fit more snugly in your ear.Specific uses for product : Music     NEW STYLE. NEW SOUND: Equal parts earbuds and ear bling, Galaxy Buds Live come in three colors you’ll want to rock all day     TURN DOWN DISTRACTIONS: Turn on Active Noise Cancellation to block out background noise on an airplane, train or bus. Tap again to let in surrounding live sounds— colleagues’ voices, flight announcements, street traffic—while still enjoying your favorite playlist or podcast     LONG-LASTING BATTERY: Long-lasting battery life with a case that doubles as a wireless charger     ALWAYS-ON ASSISTANCE: Use your always-on voice assistant to order coffee, send a message or search music hands free     Features including Active Noise Canceling are enabled through Bluetooth connection or the Galaxy Wearable app on Android, available through Google Play Store, and the Galaxy Buds app on iOS devices, available through the App Store",
    "details": {
      "brand": "SAMSUNG",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "Mystic Red"
    }
  },
  {
    "id": "B09CSXXXPG",
    "name": "Samsung Galaxy Watch4 44MM SM-R870 Aluminum Smartwatch GPS Only (Renewed)",
    "ratings": 1.101,
    "price": "$113.11",
    "image": "https://m.media-amazon.com/images/I/51klpVRtFCL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "Item Package Dimension- 6.7699999930946L X 4.2899999956242W X 2.399999997552H Inches     Item Package Weight - 0.29101018584 Pounds     Item Package Quantity - 1     Product Type - Wearable Computer",
    "details": {
      "brand": "SAMSUNG",
      "operatingSystem": "Wear OS",
      "memoryStorageCapacity": "16 GB",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "Bluetooth",
      "color": "N/A"
    }
  },
  {
    "id": "B09D341DB6",
    "name": "Samsung Galaxy Watch 4 Classic 42mm Smartwatch GPS Bluetooth WiFi - Black",
    "ratings": 220,
    "price": "$168.99",
    "image": "https://m.media-amazon.com/images/I/518aCQxkMJL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "1.2 \"(30.5mm) w/ Rotating Bezel, Super AMOLED, 396 x 396 pixels (~330 ppi density), 16M Colors, CPU: Dual-Core 1.15GHz, 247mAh Battery, Android Wear OS, One UI Watch 3, Bluetooth, Wi-Fi     The Galaxy Watch4 Classic uses red LEDs and infrared rays to calculate your SpO2 levels or the amount of oxygen in your blood.     Glass front (Gorilla Glass DX+), MIL-STD-810G compliant, 50m water-resistant (IP68), Compatible with standard 20mm straps, ECG certified, Blood pressure monitor     5 ATM / IP68 The water and dust resistance rating, Military-grade durability, Larger screen but lighter and thinner for more comfort.     GPS model Compatible with Bluetooth Connection with Device. Supports Samsung Pay.",
    "details": {
      "brand": "N/A",
      "operatingSystem": "Android",
      "memoryStorageCapacity": "16 GB",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "Bluetooth",
      "color": "N/A"
    }
  },
  {
    "id": "B0C7SDH3J6",
    "name": "SAMSUNG Galaxy Watch 4 46 mm Smartwatch w/Bonus Band (White), ECG Monitor Tracker for Health, Fitness, Running, Sleep Cycles, GPS Fall Detection & Bluetooth, US Version, Black",
    "ratings": 11,
    "price": "$192.99",
    "image": "https://m.media-amazon.com/images/I/61oaZoUWVWL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "BONUS BAND INCLUDED: Swap bands to match your mood or outfit; This bundle brings you (1) Galaxy Watch4 44mm smartwatch with a black band, plus (1) bonus band in white     BODY COMPOSITION ANALYSIS: Galaxy Watch4 Classic is the first smartwatch to off body composition data right on your wrist, On your own schedule, now you can get readings on body fat, skeletal muscle, body water, basal metabolic rate, and Body Mass Index*     BETTER SLEEP STARTS HERE: Wake up feeling refreshed and recharged with advanced sleep tracking; When you go to bed, your Galaxy Watch4 Classic sleep tracker starts monitoring your sleep and SpO2 levels continuously**     BE SMART ABOUT YOUR HEART: Take care of your heart with accurate ECG monitoring and keep an eye on possible atrial fibrillation, a common form of irregular heart rhythm; Share personalized readings with your doctor using the Samsung Health Monitor app on your compatible Galaxy phone***     MAKE EVERY WORKOUT COUNT: Get the most out of every exercise session with advanced workout tracking that recognizes 6 popular activities, from running to rowing to swimming, automatically in just 3 minutes****; Stay motivated by connecting to live coaching sessions via your smartphone or to dynamic Group Challenges with your friends     GO THE EXTRA MILE: Improve your runs with advanced running coaching technology; VO2 Max readings assess your oxygen levels to manage and track your heart and lung endurance*****     GOOGLE ON YOUR WRIST: Tap into the power and convenience of select Google services and apps right from your wrist; Pay for coffee; Get directions to the park; Use Bixby or Google Assistant for help on almost any topic; Stream your favorite tunes on YouTube******     EXTENSION OF YOUR PHONE: Galaxy Watch4 Classic works as an extension of your phone so you can do more while on the go; Talk, text, stream music and more just by tapping the watch on your wrist*******",
    "details": {
      "brand": "SAMSUNG",
      "operatingSystem": "Wear OS Powered by Samsung",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "Galaxy Watch 4",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "Bluetooth, Wi-Fi",
      "color": "N/A"
    }
  },
  {
    "id": "B0BKCLGL3N",
    "name": "Samsung Wireless Charger Fast Car Vehicle Charge (2022) (EP-H5300) - Black",
    "ratings": 126,
    "price": "$19.00",
    "image": "https://m.media-amazon.com/images/I/61mjW6NuAZL.__AC_SY300_SX300_QL70_FMwebp_.jpg",
    "description": "SAMSUNG Wireless Car Charger is great for most types of mobile phones that support wireless charging - even foldables! The Wireless Car Charger holds mobiles of various sizes, even mobiles covered in up to 3mm thick cases.     Power up with a quickness: Charge your mobile device wirelessly in your car with ease. The 9W Wireless Car Charger supports Samsung Galaxy Devices, and up to 7.5W for iPhones.     Automatically holds and releases your phone: Place your device on the charger and the clamp will close automatically to hold your phone securely. It safely releases your phone when the car is turned off.     Attaches to most types of air vents: The wireless car charger mounts tightly to car air vents of various sizes and shapes. Whether the vents are horizontal or vertical, it attaches easily and holds your phone firmly. The Wireless Car Charger is mounted on a car air vent. Above, there are two air vent icons, one horizontal and one vertical.     Rotates smoothly for both landscape and portrait views: The Wireless Car Charger rotates, so you can view your screen in landscape or portrait mode.",
    "details": {
      "brand": "SAMSUNG",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "wireless",
      "color": "Black"
    }
  },
  {
    "id": "B0B2HTRD53",
    "name": "SAMSUNG Galaxy Watch 5 40mm Bluetooth Smartwatch w/ Body, Health, Fitness and Sleep Tracker, Improved Battery, Sapphire Crystal Glass, Enhanced GPS Tracking, US Version, Pink Gold Bezel w/ Pink Band",
    "ratings": 9.258,
    "price": "$159.00",
    "image": "https://m.media-amazon.com/images/I/61Cmk-sFNWL.__AC_SY300_SX300_QL70_FMwebp_.jpg",
    "description": "ADVANCED SLEEP COACHING: Manage your overall sleep quality with an advanced sleep tracker that detects and analyzes sleep stages while you rest; Plus, Advanced Sleep Coaching helps you develop better sleep habits by analyzing your sleep patterns.Supported Application:Fitness Tracker,Blood Pressure Monitor,Multisport Tracker,Time Display,GPS. Connectivity technology:Bluetooth. Wireless comm standard:Bluetooth,802_11_AGNAC     BODY COMPOSITION ANALYSIS (BIA): Galaxy Watch5 provides body composition data right on your wrist; On your own schedule, you can now get readings on body fat, skeletal muscle, body water, basal metabolic rate and Body Mass Index (BMI)     IMPROVED SENSOR ACCURACY: Stay up to date on your wellness; Get an accurate heart rate thanks to an improved, curved Samsung BioActive Sensor that gets closer to your skin     AUTO WORKOUT TRACKING: Make the most of every adventure with Auto Workout Tracking — from running to rowing to swimming — automatically in just minutes, and manually tracking more than 90 exercises, including complex activities like HIIT     IMPROVED BATTERY and GALAXY CONNECTED EXPERIENCE: Meet the watch that goes as long as you do; Galaxy Watch5’s improved battery keeps up with your busiest day Do more with synced Galaxy devices that work in perfect harmony     SAPPHIRE CRYSTAL GLASS: Galaxy Watch5 can stand the test of the hardest days; Its sapphire crystal glass face is 1.6x stronger, resisting the problems that come with life’s daily routines     ENHANCED GPS: Get out there; Explore the great outdoors; Now you can wander all you want and still know where you are; Galaxy Watch5 features enhanced GPS with voice navigation right on your wrist",
    "details": {
      "brand": "SAMSUNG",
      "operatingSystem": "Android Wear 1.0",
      "memoryStorageCapacity": "1.5 GB",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "Bluetooth",
      "color": "N/A"
    }
  },
  {
    "id": "B0D6V9XH9Y",
    "name": "Voice for Samsung-Smart-TV-Remote-Control-Replacement, BN59-01385A Universal Remote Compatible for Samsung with Voice Function Frame Serif Crystal Solar UHD Neo QLED OLED 4K 8K TVs",
    "ratings": 5.8,
    "price": "$19.99",
    "image": "https://m.media-amazon.com/images/I/61H1SQRLbiL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "【Good Compatibility】Fit for Samsung Voice TV models in 2022 and beyond: S95B, QN95BD, QN95B, QN90B, QN900B, QN85B, QN800B, QN100B, Q80B, Q60B, LS03BD, LS03B, LS01B, BG970N etc. for Samsung Smart Monitor: LSP3B, G85SB, G7, G70B, G65B, M70B, M8.【Not solar charging feature】     【for Samsung Voice Remotes】Compatible with Samsung TV voice remote control models: BN59-01391A, BN59-01385A, BP59-00149A, BN59-01312A, BN59-01330A, TM2281E, TM2280E etc. Disney buttons are only available for TVs in 2022 and beyond     【Easy Pairing】①Turn on your TV and insert 2*AAA batteries in your new remote, then point it at the remote control sensor of the TV. ② Press and hold the “Return\" and \"Play/Pause\" button simultaneously and you will see the message \"Pairing Complete\" in your TV screen. (Note: batteries are not included)(Not solar charging feature)     【Voice Command & Channel Shortcuts 】Its voice search function enables you to easily search your favorite moives or shows by simply speaking into the remote. And you can swiftly open your favorite apps with just one click because of its pre-set shortcut buttons.     【Important Notes】Please confirm your Samsung TV allows voice funtion before placed order. Please feel free to contact us if you have any questions. We are committed to providing you with a satisfactory solution promptly.",
    "details": {
      "brand": "YOZZCANT",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "black"
    }
  },
  {
    "id": "B08DH43LWY",
    "name": "Samsung Galaxy Watch3 2020 Smartwatch (Bluetooth + Wi-Fi + GPS) International Model (Black, 45mm)",
    "ratings": 202,
    "price": "$159.99",
    "image": "https://m.media-amazon.com/images/I/61TQlPWrsIS.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "1.4 \"(34.5mm) Super AMOLED, 360 x 360px Resolution, 16M Colors, CPU: Dual-Core 1.15GHz, 340mAh Battery, Tizen OS, Bluetooth, Wi-Fi     The Galaxy Watch3 uses red LEDs and infrared rays to calculate your SpO2 levels or the amount of oxygen in your blood.     Sensors: Accelerometer, Barometer, Gyro Sensor, Light Sensor, Optical Heart Rate Sensor. The only smartwatch with a precise rotating bezel for navigating between apps     5 ATM/IP68 The water and dust resistance rating, Military-grade durability, Larger screen but lighter and thinner for more comfort.     International Model No Warranty in the US. Compatible with Android and iOS devices. Samsung Pay - Not Supported.",
    "details": {
      "brand": "N/A",
      "operatingSystem": "Android",
      "memoryStorageCapacity": "4000 MB",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "Wireless",
      "color": "N/A"
    }
  },
  {
    "id": "B0DHKQJ3HZ",
    "name": "USB C Car Charger 60W PD&QC3.0 Super Fast Car Charger Adapter JOYROOM Dual Port Car Phone Charger with 3.3ft 60W USB C Cable Fast Charging for iPhone 16 Samsung S24",
    "ratings": null,
    "price": "$19.99",
    "image": "https://m.media-amazon.com/images/I/71Qs1PO7TNL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "60W DUAL PORT CAR CHARGER FAST CHARGING: 60W(Max) super fast car charger usb c supports PD30W and QC3.0 30W high output and is compatible with PD3.0/QC3.0/AFC and FCP super fast charging protocol for all devices. JOYROOM USB c car charger, 10X faster than 2.4A charger, can rapidly charge iPhone 15 pro and Samsung Galaxy S23 from 0% to 80% in 35 minutes. Note: Best super fast charge partner 60W USB C-C Fast Charging Cable included.     EXTRA 3.3FT 60W USB C CABLE RIGHT FOR ALL Type C DEVICES: JOYROOM PD&QC 3.0 fast car charger adapter comes with 60W usb-C Nylon cable for you which support super fast charging for your Samsung Galaxy S23 S22 S21 Ultra/iPhone 16 Pro Max Plus     SMALLEST SIZE, FLUSH FIT: Tiny thumb-sized car charger fits most car cigarette lighters and barely protrudes past the edge of the outlet. It's JOYROOM smallest usb c car charger: lightweight and highly compact takes up no space in the car.     2024 New Upgraded cell car phone charger: JOYROOM All metal iPhone 15 pro max car charger is not only equipped with 3.3 ft 60w usb c cable, as well as the appearance of a soft LED colorful ambient light designed to help find the charging port more easily in the dark.     All Metal, Excellent Heat Dissipation: This dual port usb cigarette lighter adapter is designed with all-metal aluminum alloy, which not only has a textured appearance as well as more durable, but also the metal alloy material helps to improve the heat dissipation performance during the use of the car charger. Metal alloy car charger is safer than plastic car charger, reducing safety hazards.",
    "details": {
      "brand": "JOYROOM",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "USB C & Type C 60W Super Fast Car Charger",
      "color": "N/A"
    }
  },
  {
    "id": "B0CDTVG4FH",
    "name": "Samsung Galaxy Watch 6 (R940) 44mm Silver",
    "ratings": 84,
    "price": "$169.99",
    "image": "https://m.media-amazon.com/images/I/61qUlIbdsyL.__AC_SY300_SX300_QL70_FMwebp_.jpg",
    "description": "Original brand product.     Two-year warranty against factory defects.     Water resistance depth : 50.0 meters     Human interface input : touch screen     Connectivity technology : Bluetooth     Item dimensions : 19.69 inches     Item shape : Round",
    "details": {
      "brand": "SAMSUNG",
      "operatingSystem": "Android",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "Samsung Galaxy",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "Bluetooth, Wi-Fi",
      "color": "N/A"
    }
  },
  {
    "id": "B07S18XXL5",
    "name": "SAMSUNG 15m One Invisible Connect Cable for QLED 4K & The Frame TVs (Newest Model) - White - VG-SOCR15/ZA",
    "ratings": 197,
    "price": "$124.95",
    "image": "https://m.media-amazon.com/images/I/815+b0R0lYL._AC_SX300_SY300_.jpg",
    "description": "The Samsung One Invisible Connection Cable Minimizes Clutter And Uses A Single, Near-Invisible Cable To Connect Your Qled To External Devices, Including The Power Source. The Result Is A Seamless Surface That Hides Cables And Integrates Beautifully In Your Home.     Extended Cable Length For A Clean Look: With 15M, The One Connect Box Can Be Positioned Out Of View. Reimagine Your Tv Where You Want It, Not Where It Plugs In.     Blends With Your Home: One Cord. No Clutter. Say Goodbye To Messy Tangled Wires. Hide All Your Device Connections With The One Invisible Connection Cable, And Your Space Will Never Be The Same.     Compatibility: 2020 TVs: QN43LS03TAFXZA, QN50LS03TAFXZA, QN55LS03TAFXZA, QN65LS03TAFXZA, QN75LS03TAFXZA     Compatibility: 2021 TVs:QN43LS03AAFXZA, QN50LS03AAFXZA, QN55LS03AAFXZA, QN65LS03AAFXZA, QN75LS03AAFXZA, QN85LS03AAFXZA     Compatibility: 2022 TVs: QN43LS03BAFXZA, QN50LS03BAFXZA, QN55LS03BAFXZA, QN65LS03BAFXZA, QN75LS03BAFXZA, QN85LS03BAFXZA",
    "details": {
      "brand": "SAMSUNG",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "N/A"
    }
  },
  {
    "id": "B09MVD43NR",
    "name": "Samsung Type-C to Type-C 1.8m Cable (5A), Black",
    "ratings": 482,
    "price": "$16.50",
    "image": "https://m.media-amazon.com/images/I/51diQX3ktFL.__AC_SY300_SX300_QL70_FMwebp_.jpg",
    "description": "Type-C to Type-C 1.8m Cable (5A)     Samsung Type-C to Type-C 1.8m Cable (5A), Black     Package Dimensions: 2.6 L x 13.3 H x 5.4 W (centimeters)     Item Package Weight: 0.015873282877311184 pounds",
    "details": {
      "brand": "SAMSUNG",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "N/A"
    }
  },
  {
    "id": "B096BKYQ9S",
    "name": "SAMSUNG Galaxy Watch 4 Classic 42mm Smartwatch with ECG Monitor Tracker for Health, Fitness, Running, Sleep Cycles, GPS Fall Detection, Bluetooth, US Version, Silver",
    "ratings": 658,
    "price": "$199.99",
    "image": "https://m.media-amazon.com/images/I/613i4YaIFwL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "BODY COMPOSITION ANALYSIS: Galaxy Watch4 Classic is the first smartwatch to off body composition data right on your wrist, On your own schedule, now you can get readings on body fat, skeletal muscle, body water, basal metabolic rate, and Body Mass Index     BETTER SLEEP STARTS HERE: Wake up feeling refreshed and recharged with advanced sleep tracking; When you go to bed, your Galaxy Watch4 Classic sleep tracker starts monitoring your sleep and SpO2 levels continuously     BE SMART ABOUT YOUR HEART: Take care of your heart with accurate ECG monitoring and keep an eye on possible atrial fibrillation, a common form of irregular heart rhythm; Share personalized readings with your doctor using the Samsung Health Monitor app     MAKE EVERY WORKOUT COUNT: Get the most out of every exercise session with advanced workout tracking that recognizes 6 popular activities, from running to rowing to swimming, automatically in just 3 minutes     GO THE EXTRA MILE: Improve your runs with advanced running coaching technology; VO2 Max readings assess your oxygen levels to manage and track your heart and lung endurance     GOOGLE ON YOUR WRIST: Tap into the power and convenience of select Google services and apps right from your wrist; Pay for coffee; Get directions, Use Bixby or Google Assistant for help on almost any topic; Stream your favorite tunes on YouTube     EXTENSION OF YOUR PHONE: Galaxy Watch4 Classic works as an extension of your phone so you can do more while on the go; Talk, text, stream music and more just by tapping the watch on your wrist     LUXURIOUS DESIGN: Show off your style with a luxurious and timeless watch design that's great for any occasion. Personalize your look even more with a range of stylish watch faces and bands",
    "details": {
      "brand": "SAMSUNG",
      "operatingSystem": "android 6.0",
      "memoryStorageCapacity": "16 GB",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "Bluetooth, GPS",
      "color": "N/A"
    }
  },
  {
    "id": "B07VNBC9Z9",
    "name": "SAMSUNG Galaxy Watch Active 2 (40mm, GPS, Bluetooth) Smart Watch with Advanced Health Monitoring, Fitness Tracking, and Long lasting Battery, Pink Gold (US Version)",
    "ratings": 8.169,
    "price": "$49.95",
    "image": "https://m.media-amazon.com/images/I/51ZP44Ue2BL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "Better insights to reach your fitness goals get more out of every mile thanks to built-in pace coaching on the Galaxy Watch Active2; Its advanced sensors keep your pace to help you better achieve your run goals     Comfortably sleek the Galaxy Watch Active2 is light enough to wear anywhere comfortably; It comes in aluminum or stainless steel and with a variety of faces, bands and finishes so it goes with anything. Compatible Devices - Samsung Smartphone, Non-Samsung Android Smartphone (Android OS 5.0 and above RAM 1.5GB and above), iOS 9.0 and above iPhone 5 and above     Keep your beat; You can see if your heart rate is where you want it with Galaxy Watch Active2. Get automatically alerted if your watch detects a high or a low heart rate. This device and related software are not intended for use in the diagnosis of disease or other conditions, or in the cure, Mitigation, treatment or prevention of disease     Level up your downtime; Galaxy Watch active2’s built in sleep tracker offers valuable insights on how to get a better night’s sleep. It also monitors your stress level and helps you recently with the integrated calm app. This device and related software are not intended for use in the diagnosis of disease or other conditions, or in the cure, mitigation, treatment or prevention of disease",
    "details": {
      "brand": "SAMSUNG",
      "operatingSystem": "Android,Ios",
      "memoryStorageCapacity": "4 GB",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "Bluetooth",
      "color": "N/A"
    }
  },
  {
    "id": "B07VKQ58ZF",
    "name": "SAMSUNG Galaxy Watch Active 2 (44mm, GPS, Bluetooth) Smart Watch with Advanced Health Monitoring, Fitness Tracking, and Long Lasting Battery, Pink Gold (US Version)",
    "ratings": 3.373,
    "price": " ",
    "image": "https://m.media-amazon.com/images/I/51ZP44Ue2BL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "Better insights to reach your fitness goals get more out of every mile thanks to built-in pace coaching on the Galaxy Watch Active2. Its advanced sensors keep your pace to help you better achieve your run goals.     Comfortably sleek the Galaxy Watch Active2 is light enough to wear anywhere comfortably. It comes in aluminum or stainless steel and with a variety of faces, bands and finishes so it goes with anything.     Keep your beat. You can see if your heart rate is where you want it with Galaxy Watch Active2. Get automatically alerted if your watch detects a high or a low heart rate. This device and related software are not intended for use in the diagnosis of disease or other conditions, or in the cure, Mitigation, treatment or prevention of disease.     Level up your downtime. Galaxy Watch active2’s built-in sleep tracker offers valuable insights on how to get a better night’s sleep. It also monitors your stress level and helps you recently with the integrated calm app. This device and related software are not intended for use in the diagnosis of disease or other conditions, or in the cure, mitigation, treatment or prevention of disease.",
    "details": {
      "brand": "SAMSUNG",
      "operatingSystem": "Tizen 4.0",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "Galaxy Watch Active2",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "Bluetooth",
      "color": "N/A"
    }
  },
  {
    "id": "B09D2MR29Z",
    "name": "Samsung Electronics Galaxy Watch 4 Classic R890 46mm Smartwatch GPS WiFi (International Model) (Silver)",
    "ratings": 136,
    "price": "$179.99",
    "image": "https://m.media-amazon.com/images/I/51QxkF3YnyL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "Keep Crushing Your Day: Put the phone features you need right on your wrist and stay connected to calls, texts, notifications, and music streaming, all accessible with a simple tap     Google on Your Wrist: Tap into the power and convenience of select Google services and apps; Pay for coffee, get directions to the park, use Google Assistant or Bixby, and stream from YouTube Music     Fashion Meets Function: Sleek, lightweight and customizable, Galaxy Watch 4 is made to move with you while working out and matches your mood and outfit with bands plus a variety of faces.     Samsung Galaxy Watch4 Classic SM-R890 46MM     Compatible with Android Phones Running Android 6.0 and Above. NOT compatible with iOS.",
    "details": {
      "brand": "SAMSUNG",
      "operatingSystem": "Android",
      "memoryStorageCapacity": "16000 MB",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "gps",
      "color": "N/A"
    }
  },
  {
    "id": "B0B1X39YC7",
    "name": "Wireless Charger for Samsung Devices, 4 in 1 Wireless Charging Station for Galaxy S24 Ultra/Z Fold6/Z Flip6/S23 Ultra, Charging Station for Galaxy Watch 7/Ultra/6/6 Classic/5 Pro/5/4, Galaxy Buds2 Pro",
    "ratings": 3.041,
    "price": "$39.99",
    "image": "https://m.media-amazon.com/images/I/71-lPXtMI1L.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "4 in 1 Wireless Charging Station: This 4-in-1 wireless charging station conveniently charges your wireless phone, wireless earbuds, and Galaxy watch together     Wide Compatibility: The leQuiven wireless charging station is compatible with Samsung Galaxy S24 Ultra/Z Fold6/Z Flip6/S24/S24+/Z Fold5/Z Flip5/S23 Ultra/S23 Plus/S23/S22 Ultra/S22/Z Fold4/Z Flip4/S21 FE/S21 Ultra/S21/S20/S20 Ultra/S10/Note 20/Note10, etc.; only for Galaxy Watch 7, Galaxy Watch Ultra, Galaxy Watch 6/6 Classic/5 Pro/5/4/4 Classic/3/1, Active 2/1; for iPhone 16/15/14/13/12/11 series/SE/XS/XS Max/X/XR/8 Plus; for Galaxy Buds2 Pro/2/Live/+, and so on     Adjustable Digital Clock: Equipped with a super cool adjustable digital clock, it makes it easier for you to check the time. The brightness of the charging station's digital clock is adjustable. If you find it too bright at night, you can turn off the time display on the wireless charging station to avoid disturbing your sleep (Note: No alarm clock function, only digital clock design.)     Clean Up Your Cluttered Desktop: Tired of dealing with messy wires and clutter on your nightstand or desk? Our wireless charging station is suitable for home, office, and travel. This wireless charging station helps to simplify your desk and nightstand     Designed For Yourself And Your Loved Ones: Whether it's a birthday, Christmas, Father's Day, Mother's Day, or other holidays, this stylish wireless charger stand can be a surprise gift for yourself, your family, your husband or wife, or your friends     Always Ready for Travel: This portable, compact wireless charger can easily fit in your bag or luggage, so you can take it with you wherever you go for convenient charging     What You Will Get: The package includes 1 x 4-in-1 wireless charging station for Samsung devices, 1 x charging brick, 1 x charging cable, 1 x user manual, and our friendly customer service",
    "details": {
      "brand": "leQuiven",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "USB",
      "color": "Black"
    }
  },
  {
    "id": "B0BQ93DBF3",
    "name": "USB C Cable Fast Charging, 2Pack 3ft Coiled USB A to Type C Charge Cord for Car, USB-C Charging Cable Compatible with iPhone 16/15/Samsung Galaxy S20 S10 S9 S8 Plus Note 10 9 8 and More USB C Devices",
    "ratings": 2.012,
    "price": "$16.99",
    "image": "https://m.media-amazon.com/images/I/61yDKAlYnvL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "Elastic Coiled USB C Cable Made for Car: The USB Type-C cable is designed with stretchable, no tangle, no knot, and does not take up space. This coiled USB C charging cable is made of upgraded high quality PU material, which is flexible, easy to stretch, effortless, quick to rebound and not easily deformed.     Length of Use: 1.3 Feet before stretching, maximum stretch length is 4 feet. Comfortable length of use is 2-3 feet and bounce back to normal length well. Convenient for charging your devices in the bedroom, on the sofa, in the office, while travelling. Easy to use for different occasions, perfect for your different needs.     66W Fast Charge and Data Transfer: PRAKIE USB a to USB c cord supports fast charge and sync fast data transfer, max current is 66W , speed of data transfer up to 480Mbps.This USB c charging has a built-in intelligent safety chip, intelligent thermostat, supports charging while playing, and automatically filters voltage fluctuations to effectively protect the device.     Widely Compatibility: USB type-c cables charging cord compatible with iPhone 16/16 Plus/16 Pro/16 Pro Max/15/15 Plus/ 15 Pro/ 15 Pro Max/ Samsung Galaxy S10 S10e S10+ Plus 5G S8 S8+ S9 S9+ S8 Plus S9 Plus, Note 8 Note 9 Note10 Note10+ Plus 5G, A10e A20 A30 A40s A50 A60 A70 A80 M30s A9/9s A9 Star A8s(2018) A6s C9 C7Pro C5Pro. Google Pixel 2 2XL/Pixel XL/Nexus 5X/Nexus 6P. LG V30 V20 G6 G5, Power Bank、tablets and other type c devices.     What You Get: 2PCS 3 feet USB a to USB c cable(66W) and 12-Month warranty. We have a professional customer service team that will do our best to provide you the satisfactory service and give you pleasant shopping experience.",
    "details": {
      "brand": "PRAKIE",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "N/A"
    }
  }
]