[
  {
    "id": "B0DLZGQ3RR",
    "name": "3 Pack Galaxy S10 Plus Screen Protector with 2 Pack Camera Lens Protector, HD Clear Tempered Glass, Fingerprint Unlock, Scratch Resistant for Samsung Galaxy S10 Plus 5G Glass Screen Protector 6.4 Inch",
    "ratings": null,
    "price": "$9.99",
    "image": "https://m.media-amazon.com/images/I/614+8GWYW1L._AC_SY300_SX300_.jpg",
    "description": "Keep your Galaxy S10 Plus screen protector looking pristine with this tempered glass screen protector. Enjoy ultimate scratch resistance with 9H hardness protection, ensuring your device stays in top condition for longer     This screen protector tempered glass is specially designed for the Samsung Galaxy S10 Plus 6.4 inch, offering a perfect fit for your device. The precise cutouts allow for easy access to all buttons and ports while maintaining the sleek appearance of your phone     Say goodbye to long waiting times with the quick fingerprint unlock feature. Our screen protection is designed to seamlessly integrate with the Samsung Galaxy S10 Plus advanced fingerprint unlock feature. Easily access your device without any hassle     Perfectly engineered to be case-friendly, our screen protector fits snugly with most phone cases, providing comprehensive protection for your Samsung Galaxy S10 Plus without any compromise in style or functionality     High-Definition Clarity: Enjoy crystal-clear visuals on your device with our ultra-thin S10 Plus glass screen protector. Experience vibrant colors and sharp details without sacrificing touch sensitivity",
    "details": {
      "brand": "JUJUENCHAIL",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "N/A"
    }
  },
  {
    "id": "B0DFP17H38",
    "name": "SHEZI [Upgrade 4 in 1 Charging Cable, 60W [Full Chrager Only 0.8h][1GB Transfer Only 12s] Flat Silicone Multi Fast Charge Phone Cord with USB A/Type C/Light-ning for iPhone iPad Samsung, 5FT",
    "ratings": 13,
    "price": "$26.99",
    "image": "https://m.media-amazon.com/images/I/71-hxCuleiL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "Unique Liquid Silicone Material: Our usb c cable use the latest liquid silicone rubber as a material to make the cable softer, stronger, more resistant to dirt, is able to fully withstand stress and it feels incredibly soft between your fingers and is one of the strongest cables ever made. It won't get tangled even when tucked into a bag or pocket, making it perfect for carrying around.     4-in-1 Versatile Simplify Design: Our usb to usb c cable has different ports, including Light-ning/USB A/Type C connectors. Support to charge 99% phones available on the market. It's super handy to carry and meets all your demands on families, travel or work, business trips, and other occasions. ﻿     Fastest Charging in History: Our usb c to light-ning cable can charge your device at the fastest speed. Fully charge a iPhone 15 pro to 96%, a Switch to 90%, a Samsung S23 to 96%, a MacBook Pro to 86% and an iPad Pro to 89% in 35 minutes. NOTE: Please use a charger with the corresponding wattage or higher that our product could output maximum power.     Super Fast Data Transfer: Supports the USB 2.0 standard with unmatched data transfer speed up to maximum 480Mbps. This usbc cable is compatible with USB2 devices and transfer music, movies, or videos in seconds at maximum 480Mbps, 1GB files transfer only 12s.     Support CarPlay & Android Auto: This usb c to usb c cable 100% supports both Android Auto and Carplay which charging and navigating at the same time. Whether you have the usb c or light-ning port devices in your car, we can perfectly work for you. So no longer need to carry cables for each device, make you life more convenient.     Ultra High-Quality Assurance: This usb a to usb c cable has been tested to withstand at least 10,000 cycles of 90-degree bend and 10,000 plugging and unplugging lifespan which is 12 times stronger than all original cables, its zinc alloy cable housing is highly resistant to wear and scratches. You don't need to replace the charging cable within 3 years.     More Promise Less Concern: If you encounter any issues with your usb to light-ning cable, contact us via Amazon Message Center. Our dedicated customer support team is available to assist you with any questions or concerns you may have within 12 hours.",
    "details": {
      "brand": "SHEZI",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "USB",
      "color": "Green"
    }
  },
  {
    "id": "B09D2QC2RG",
    "name": "Samsung Electronics Galaxy Watch 4 44mm R870 Smartwatch GPS WiFi Bluetooth (International Model) (Black), (SM-R870)",
    "ratings": 901,
    "price": " ",
    "image": "https://m.media-amazon.com/images/I/61Nm6UgtUKL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "Do More Right From Your Wrist: Galaxy Watch4 works as an extension of your phone so you can talk, stream, and text from your wrist on the go     Google on Your Wrist: Tap into the power and convenience of select Google services and apps; Pay for coffee, get directions to the park, use Google Assistant or Bixby, and stream from YouTube Music     Timeless Design, Elevated Style: Show of your style with a luxurious and timeless watch design that’s great for any occasion; Personalize your look even more with a range of stylish watch faces and bands     Galaxy Watch SM-R870 44MM     Compatible with Android Phones Running Android 6.0 and Above. NOT compatible with iOS.",
    "details": {
      "brand": "SAMSUNG",
      "operatingSystem": "Android",
      "memoryStorageCapacity": "16000 MB",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "gps",
      "color": "N/A"
    }
  },
  {
    "id": "B0CKLSYK41",
    "name": "Samsung Tab Active4 Pro Field Ready Case, Protective Tablet Case, Rugged, Maximum Protection, Slim Design, Matte Finish, US Version, Black (GP-FPT636TGCBW)...Made by TARGUS",
    "ratings": 6,
    "price": "$89.99",
    "image": "https://m.media-amazon.com/images/I/7154wzL88BL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "MADE BY TARGUS     Two-piece over-molded shell with shock-absorbent TPU edges.     Detachable hand strap integrated into sliding handle for hand-held use and convenient typing angle     Built-in stylus holder to keep your stylus in place when not in use     Built-in Kickstand feature     Clear window on back displays asset tag",
    "details": {
      "brand": "SAMSUNG",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "Matt Black"
    }
  },
  {
    "id": "B0DHN852VW",
    "name": "FNTCASE for Samsung Galaxy A16-5G Case: Military Grade Drop Proof Protection Mobile Cover with Kickstand | Matte Textured Rugged Shockproof TPU | Protective Sturdy Phone Case(Red)",
    "ratings": 1,
    "price": "$17.99",
    "image": "https://m.media-amazon.com/images/I/81Oz+R0jpNL._AC_SY300_SX300_.jpg",
    "description": "Compatibility: ONLY Fit Samsung Galaxy A16 6.7 Inch(2024 release). Not for A15 6.5 Inch or A14 6.6 Inch. WON'T fit any other phone models. Please confirm your model before purchasing     Built-in Screen Protector: The Samsung Galaxy A16 Case Screen protectors with responsive touch performance provide easy and comfortable access to your phone's features while preventing accidental scratches on your smartphone. The built-in screen protection design perfectly solves the trouble of put on a screen protector for you     Full Body Protection: This Armor A16 Case has Four-corner grooved airbags, a unique shock absorption design, and more comprehensive protection of the fragile parts of the smartphone. Raised lips keep the camera lifted to prevent your lens from shock, collision, and scratch. Precise cutouts for speakers, camera, and other functional ports allow you to access all ports and controls easily     Built-In Kickstand: This Samsung A16 Case with a stand works perfectly both in vertical and horizontal positions. Convenient for reading, watching movies, playing games, browsing the web, and face-to-face chatting with friends.Provides hands-free portrait and landscape viewing angles     Comfortable: The non-slip texture on both sides has a better grip, and matte edges reduce the adhesion of fingerprints and oil to ensure the visually clean while enhancing the handheld touch to make the case not easy to slip from your hand",
    "details": {
      "brand": "FNTCASE",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "Red"
    }
  },
  {
    "id": "B0DD43FJF8",
    "name": "furid Mens Wallet for Samsung Galaxy SmartTag2: Slim Minimalist Wallet Compatible with Samsung Tracker Tag - RFID Blocking Bifold Leather Wallet with Money Clip",
    "ratings": 33,
    "price": "$29.99",
    "image": "https://m.media-amazon.com/images/I/91FG25CMS8L.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "Wallet Compatible with Samsung Smart Tag 2: For the one who often can't find his wallet, this trackable wallet is definitely a boon, the samsung track tag will be integrated with the wallet, just open your phone, you can find the wallet easily.     11+Cards Holder & Money Clip: Designed to securely hold more than 10 cards and cash with a built-in money clip, keeping your essentials organized and easily accessible.     Slim Wallet for Men: A slim minimalist wallet for men, light money clip wallet, Fashionable and convenient appearance. Flexible webbing greatly improved the card holding capacity, very convenient for card carrier. Small size Free up more personal space:2.1*3.4*0.2 inch.     RFID Blocking Security: Protect your sensitive card information with our RFID-blocking wallet, keeping your personal and financial data safe from unauthorized access.     Gift for Men: Great Gift for father boyfriend husband brother, male friends at birthday, Anniversary Christmas, Valentine day, father's day, Festivals. The wallet is suitable for everyday carry, travel accessory, outdoor adventure ,hiking trip, business travel, graduation ceremony.",
    "details": {
      "brand": "furid",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "Black Carbon"
    }
  },
  {
    "id": "B0D9QB8N1X",
    "name": "NEW'C 3 Pack Designed for Samsung Galaxy S24 Ultra【No for S24/S24 Plus】 Screen Protector Tempered Glass,Case Friendly Scratch-proof, Bubble Free, Ultra Resistant",
    "ratings": 79,
    "price": "$6.99",
    "image": "https://m.media-amazon.com/images/I/71HCH1a3ZqL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "ATTENTION: NOT COMPATIBLE WITH Samsung Galaxy S24, Samsung Galaxy S24 Plus     Pack of 3 tempered glass screen protectors for Samsung Galaxy S24 Ultra. The space between Samsung Galaxy S24 Ultra and the screen protector enables the proper space for the installation of most phone cases.     Made with high quality 0.33mm thick premium tempered glass with rounded edges. Very high hardness: resistant to scratches up to 9H. High response and high transparency.     Dust-free, fingerprint-free, one-push super easily installation, bubble free     NEW'C Samsung Galaxy S24 Ultra Tempered Glass Screen Protector, delicate touch: coated on the back with a solid silicon adhesive which makes installation easy and attaches the film firmly so as not to affect the sensitivity of the touch screen",
    "details": {
      "brand": "NEW'C",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "N/A"
    }
  },
  {
    "id": "B0CLZKJT28",
    "name": "40 Slots Large Case Bag Watch Band Storage Strap Organizer Double Layer, Watch and Straps Organizer for Apple Watch Band Organizer Box Garmin Fitbit Samsung Galaxy Watch Holder Storage",
    "ratings": 94,
    "price": "$21.75",
    "image": "https://m.media-amazon.com/images/I/81fFKcTnZ5L.__AC_SY300_SX300_QL70_FMwebp_.jpg",
    "description": "【Save Space】This 40 slots organizer is a compact design, double layer design,which is very convenient. Can be placed in the drawer on the desktop or in the cabinet to save space     【Multifunction 1】If used to store watch straps, maximum 40 pieces (strap width1-26 mm)     【Multifunction 2】If it is used to store watches, a maximum of 40 watches can be stored (small dials may reach 40 pieces), if the dial is larger than 40mm, it will be less than 40 pieces, and the minimum is 20 pieces. Special note: This bag cannot hold watches with curved straps     【Velvet Golden Yellow Lining】The golden yellow lining is filled with anti-shock material, covered in soft velvet fabrics, anti-scratch and shock resistant.The outer material is made of high-grade PU leather with litchi pattern.Size:11 inch x 9 inch x 1.2 inch     【Does Not Slip】Each page grids connected by elastic bands , and they are well fixed and do not slip or slide.     【Luxury Hardware】High-grade two-way zipper can last for a long time, adding luxurious vibe to it.     【Aesthetically pleasing】Functional and Aesthetically pleasing on desktop, nightstand or any counte",
    "details": {
      "brand": "Sight Focus",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "40 slots orange yellow"
    }
  },
  {
    "id": "B0916FV2TX",
    "name": "SOAR NFL Wireless Charging Stand",
    "ratings": 90,
    "price": "$24.27",
    "image": "https://m.media-amazon.com/images/I/61BmTrN4gJL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "Compatible with Qi enabled devices     Compatible Apple models: 12 Pro Max, 12 Pro, 12, 12 mini, SE 2020, 11 Pro Max, 11 Pro, 11, XS Max XS, XR, 8, 8 Plus     Samsung: S21 Ultra, S21 Plus, S21, Note 20 Ultra, Note 20, S20 FE, S20 Ultra, S20 Plus, S20, Note 10 Plus, Note 10, S10 5G, S10 Plus, S10, S10e, Note 9, Note 8, S7- S9+ (Plus more devices)     Official Licensed Product",
    "details": {
      "brand": "SOAR",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "Wireless",
      "color": "Team Color"
    }
  },
  {
    "id": "B0CMWBFQ3H",
    "name": "for iPhone 16 15 Charger Fast Charging,2 Pack 20W Wall Charger Block with USB Type c Braided Cable 6ft Charging Cord for iPhone 16 15 Series,for i.Pad Pro 12.9/11 in/Pad air 5/4",
    "ratings": 67,
    "price": "$19.99",
    "image": "https://m.media-amazon.com/images/I/71RhKMrhLgL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "【Compatible for iPhone 16 15 Charger 】Fast Pd 3.0 Usb C Charger For iPhone 15 Charger Fast Charging, Pd Adapter 3.0 Quickly Charge , Latest-Generation Usb-C Port Provides Max 20W Output Power, 3X Faster Than Standard Usb C Charger. Charging Your phone Up To 50% In Just 30 Minutes. At 3A Maximum, Helps You Work Efficiently.     【6Ft Extra Long Usb-C Cable】 6Ft Usb C To C Cable Combined With 20W Charger Let You Can Fast Charge Your phone Directly, Friendly Reversible Design, Rapid Charging At 3A Maximum, Quick Connect And High Speed Data Transfer Speed Up To 480Mb/s Helps You Work Efficiently.     【Safe & Reliable】The Phone Charger With Multi-Charging Protection Keeps Your Device Safe From Over-Current Over-Voltage Over-Heating & Short-Circuiting. Exhaustive Protection While Charging. Built In Intelligent Chip,Actively Adjust The Power Output Depending On The Device's Needs. As Battery Gets Fuller, Charging Becomes Slower To Give Battery Time To Absorb The Charge And Prevent Battery From Breaking.     【Universal Type C Charger】Perfectly Compatible With Usb C Enabled Devices With The Official 6ft Usb C Cable 20W Usb C Charger To Access Fast Charging For Phone 15/15 Pro Max/15 Plus, Also Widely Compatible With Google Pixel 5 4 Xl 4a / 3a Xl / 3 / Xl / 2, Samsung Galaxy S21, S21 Utra, S9/S8 And More Type-C Phones And Tablets.     【What You Get】2-Pack 20W Fast Charger For iPhone, 2-Pack 6Ft Usb-C To Usb-C Cable. If You Have Any Questions,We Will Resolve Your Issue Within 12 Hours.",
    "details": {
      "brand": "JAYUANONE",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "USB",
      "color": "N/A"
    }
  },
  {
    "id": "B0D12GMDHL",
    "name": "LETOID Stretchy Bands for Samsung Galaxy Watch 7 6 5 4 FE 40mm 44mm/Watch 6 4 Classic Band 42mm 46mm 43mm 47mm/Watch 5 Pro Band 45mm/Active 2/Galaxy Watch Ultra Bands, 3-Pack 20mm Elastic Nylon Strap",
    "ratings": 623,
    "price": "$11.99",
    "image": "https://m.media-amazon.com/images/I/71XDTydKg-L.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "",
    "details": {
      "brand": "N/A",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "N/A"
    }
  },
  {
    "id": "B0DLVXVF2Y",
    "name": "Armor Case for Samsung Galaxy Z Flip 5 5G, Military Grade Shockproof Samsung Z Flip 5 Case with Hinge Protection with Finger Ring Kickstand, Black",
    "ratings": 5,
    "price": "$12.99",
    "image": "https://m.media-amazon.com/images/I/71k4KRQ187L.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "【Samsung Galaxy Z Flip 5 Case】THMEIRA kickstand holder series protective case only for samsung galaxy z flip 5 .Not applicable to other models. * *NOTE：wireless charging is not supported due to the metal magnetic stand.     【Z Flip 5 Case Built in Ring Kickstand】Metal kickstand can easily rotate 360° and pull out for hands-free viewing in portrait or landscape mode.Additional,the built-in metal magnetic sheet can be directly stably attached to the magnetic car phone mount.     【Armor Case for Samsung Z Flip 5】Hard PC back cover,soft TPU bumper combined to provide dual layer protection.The case's shock-absorbing TPU bumper keep your phone safe from the occasional drop,while its PC back will protect Samsung Galaxy Z Flip 5 from daily wear and tear,such as scratches.Moreover,the raised lip protects screen and camera effectively.     【Z Flip 5 Case with Hinge Protection】with sliding hinge allow your Galaxy Z Flip 5 to fold freely while protecting the fragile hinges from scratching. Integrated installation, does not affect folding and effectively reduces impact force.     【Excellent Service】We provide friendly customer service,if you have any questions during use,please contact us via Amazon message.We promise to provide you with the best products and services.",
    "details": {
      "brand": "THMEIRA",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "Black"
    }
  },
  {
    "id": "B00Z7T33TY",
    "name": "Otterbox Symmetry Series Cell Phone Case for Samsung Galaxy J7 2Nd Gen/J7 V 2Nd Gen/J7 Refine - Black",
    "ratings": 33,
    "price": "$9.99",
    "image": "https://m.media-amazon.com/images/I/61B8sIwbR-L.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "Compatible with Samsung Galaxy J7 2nd gen/J7 V 2nd gen/J7 Refine     Triple-layer defense: inner shell, outer cover and touchscreen protector     Belt-clip holster included that doubles as a kickstand for hand-free media viewing.     Port covers keep out dust and debris     Includes OtterBox limited lifetime warranty (see website for details) and 100% authentic.",
    "details": {
      "brand": "OtterBox",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "Black"
    }
  },
  {
    "id": "B0D6VPV5CH",
    "name": "Watch Clip Compatible with Samsung Galaxy Watch 7/Galaxy Watch FE Paracord Band, for Galaxy Watch 6/Galaxy Watch5/Galaxy Watch4 Watch Keychain Necklace, EDC Survival Band",
    "ratings": 1,
    "price": " ",
    "image": "https://m.media-amazon.com/images/I/51aJ4Xc+rFL._AC_SY300_SX300_.jpg",
    "description": "",
    "details": {
      "brand": "N/A",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "N/A"
    }
  },
  {
    "id": "B0D44JBG94",
    "name": "Galaxy Book2 Pro 360 Laptop, 2-in-1 15.6\" AMOLED FHD Touch, 12-Core Intel i7-1260P (Up to 4.7GHz), Fingerprint Reader, Thunderbolt 4, Win11 H, w/S Pen & Cloth (16GB LPDDR5 RAM | 1TB SSD)",
    "ratings": 1,
    "price": "$1,029.99",
    "image": "https://m.media-amazon.com/images/I/61STO-MGyKL.__AC_SY300_SX300_QL70_FMwebp_.jpg",
    "description": "【Display & Graphics】2-in-1 15.6\", OLED, FHD (1920 x 1080), Touch Screen. Intel Iris Xe Graphics.     【Processor & Operating System】Intel i7-1260P (Up to 4.7GHz), 12 Cores, 16 Threads, Windows 11 Home.     【Features】2-in-1 Slim Design - 0.47inches & 3.06Pounds, S-pen Included, Backlit Keyboard, Long-lasting battery and Fast Charging, Front Facing Camera 1080p, Bluetooth, Wi-Fi, Fingerprint Reader.     【Ports】1 x Thunderbolt 4, 2 x USB Type-C, 1 x MicroSD Multi-media Card Reader, 1 x Headphone/Microphone Combo Jack.     【16GB LPDDR5 RAM | 1TB SSD】Everything is original from manufacturer. With massive amounts of storage and advanced communication power, PCI-e SSDs are great for major gaming applications, multiple servers, and more. Bundled with S-Pen and CLOTH.",
    "details": {
      "brand": "Samsung",
      "operatingSystem": "Windows 11 Home",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "Galaxy Book2 Pro 360",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "N/A"
    }
  },
  {
    "id": "B0CN3547M9",
    "name": "Samsung Chromebook Plus V2 2-in-1 12.2\" WUXGA LED Touchscreen Laptop, Intel Celeron 3965Y, 4GB RAM, 64GB eMMC, 2 Cameras, Stylus Pen, Island-Type KB, Wi-Fi 5, Chrome OS, Silver, 32GB USB Card",
    "ratings": 1.153,
    "price": "$269.00",
    "image": "https://m.media-amazon.com/images/I/71tVK5QB2GL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "【12.2\" WUXGA Touchscreen LED Display】Embark on a visual journey where vibrant colors and high resolution come to life at your fingertips. 【2-in-1 Design 】Convert to a tablet with the flip of a screen around a 360° hinge.     【Intel Celeron Processor 3965Y】The low voltage design optimizes energy usage, allowing you to stay productive and entertained with great efficiency. Seamlessly multitask between study materials, stream your favorite entertainment content, and browse the internet smoothly without any lag. Experience Intel performance with entertainment features and fast connectivity.     【4GB LPDDR3 RAM】Plenty of high bandwidth to run multiple programs simultaneously without any slowdowns. 【64GB eMMC】Massive storage space for your files, applications, and multimedia content, providing fast and reliable data access.     【Island-type Keyboard】The shape of Island-type keyboard — square with rounded corners — offers a high level of ergonomics that's naturally comfortable to use, making it a popular choice among people who type a lot.【Intel HD Graphics 615】Enjoy solid image quality that brings your everyday content to life with vibrant colors and sharp details.     【Chrome OS】Using Chrome OS let you connect effortlessly with colleagues in the cloud and easily access calendars, documents and other business data.【Dimensions & Weight】11.35\" x 8.2\" x 0.7\", 2.98 Lb. 【Ports and Accessories】1x USB 3.0, 2x USB-C, MicroSD Multi-media Card Reader, 1x Headphone out/Mic-in Combo, Internal Digital Dual Array Mic + Mono Mic, Built-in pen, 802.11 ac (2x2), Bluetooth 4.0, Samsung Bluetooth Mouse, 32GB Hotface USB Card.",
    "details": {
      "brand": "SAMSUNG",
      "operatingSystem": "Chrome OS",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "Samsung Chromebook Plus V2",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "Silver"
    }
  },
  {
    "id": "B0DK1RVTSC",
    "name": "3 Pack for Samsung Galaxy S23 Ultra/S22 Ultra TPU Screen Protector [Not Glass] [100% Fingerprint Unlock] [Bubble Free] Touch Sensitive Film for S23 Ultra/ S22 Ultra 5G",
    "ratings": 33.559,
    "price": "$9.98",
    "image": "https://m.media-amazon.com/images/I/71ECuK9RjtL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "[Support Fingerprint Unlock] For Galaxy S23 Ultra/ S22 Ultra screen protector uses the latest highly responsive touch technology with exclusive ultra-thin die-cut design, perfectly supports fingerprint reader, unlock speed as fast as 0.01s, makes you feel as real as a bare phone.     [Self-Hesling Technology] This screen protector adopts advanced TPU materials, which have powerful automatic-repair features to prevent scratches & bubbles to leave on the screen. Any scratches will disappear within 10 seconds.     [Ultra Clear & High Transparency] The Samsung S23 Ultra/ S22 Ultra screen protectors with high transparency. 99% HD clear screen protector with high definition transparency film and maximum resolution which keeps the bright and colorful image quality.     [Case Friendly] Flexible TPU film for S23 Ultra/ S22 Ultra screen protector will fit your screen perfectly.It designed to offer the maximum amount of coverage for your phone's screen. Extra space left around the borders for your case to wrap around the edges of your phone.     [Easy Installation]design of the exclusive installation kit, easy to Install, accurate positioning, and easy to remove without residue. Please watch the installation video in the product photos or watch the video by scanning the QR code before installing the protector.",
    "details": {
      "brand": "Rvntop",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "N/A"
    }
  },
  {
    "id": "B0CPZX91MR",
    "name": "ZAGG InvisibleShield Fusion XTR3 Samsung Galaxy S24 Screen Protector - Hybrid Polymer, Hexiom Impact, Advanced Blue Light Filter, Anti-Reflective, Recycled Materials, EZ Apply Installation",
    "ratings": 111,
    "price": "$51.99",
    "image": "https://m.media-amazon.com/images/I/715FUO2TUZL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "UNBREAKABLE HYBRID POLYMER: Experience the durability of our flexible hybrid polymer, engineered for unbreakable protection, feeling just like glass     HEXIOM IMPACT TECHNOLOGY: Advanced shock-absorbing technology offering superior impact and scratch resistance to safeguard your screen     ADVANCED EYESAFE BLUE LIGHT FILTRATION: Features RPF60 technology to filter out harmful blue light, enhancing eye comfort while maintaining true screen colors     ANTI-REFLECTIVE & HIGH-DEFINITION CLARITY: Innovative treatment significantly reduces reflections and enhances screen clarity and color vibrancy for an authentic viewing experience     ECO-FRIENDLY & PRECISION FIT: Crafted with up to 100% recycled materials, designed for a precise, anti-dust installation with our EZ Apply system",
    "details": {
      "brand": "ZAGG",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "N/A"
    }
  },
  {
    "id": "B08H84QKYF",
    "name": "Nillkin 15.6 inch Laptop Sleeve Case Laptop Stand Adjustable, Computer Shock Resistant Bag with Mouse Pad for MacBook Pro 16\"/15\" 15.6\" Dell Lenovo HP Asus Samsung Sony Chromebook Computer, Gray",
    "ratings": 1.005,
    "price": "$34.99",
    "image": "https://m.media-amazon.com/images/I/81UIqTNnKyL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "【Compatibility】- Internal dimensions: 358*250*19mm (L x W x H); External dimensions: 375*283*25.6mm (L x W x H); Please check your laptop's size. Design for laptops from 15~16 inch. Such as Apple MacBook 16, MacBook Air 16, MacBook Pro 16 ,Lenovo ThinkPad, Dell Inspiron XPS, HP, ASUS, Chromebook and other 15''~16'' notebooks.     【3 in 1 Function】- Laptop Stand,Laptop sleeve,mouse pad 3 in 1 function.     【Laptop Stand】- 2 Adjustable Angles and Ergonomic Design,Protect your neck and shoulders from pain.     【Material 】- High quality PU leather made ,touch good and use sponge flannel lining inside for shock absorption,It can protect well your notebook,don't worry to bring scratch and other damage for your notebook.     【Easy to carry】- Folding design and convenience to go out. It is a great laptop accessories for your house, office library and coffee shop.",
    "details": {
      "brand": "Nillkin",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "Gray"
    }
  },
  {
    "id": "B0963J2JQ3",
    "name": "Fullmosa 22mm Leather Watch Bands Compatible with Samsung Galaxy Watch 46mm,Galaxy Watch 3 45mm,Gear S3 Frontier/Classic,Brown and Black",
    "ratings": 37.607,
    "price": "$19.99",
    "image": "https://m.media-amazon.com/images/I/71qizfZJVCL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "[Versatile Usage] Our 22mm leather watch straps are compatible with the Samsung Gear S3 Classic and Frontier, Samsung Galaxy Watch 46mm, Galaxy Watch 3 45mm and Garmin Vivoactive 4, Active, Marq, Legacy. For a more appropriate model number, please see the description below.     [High Quality Leather] The flexible genuine leather bracelet makes watch wearing more comfortable. Thanks to the classic colour combination, your watch is suited for all occasions. Two cross stitched collars and a reinforced lining provide durability and dependability.     [Quick Release Function] Fullmosa fast release wristbands are an upgrade from typical pins, enabling you to replace your watch band in seconds. An aided tool is also supplied to assist you in removing your old band.     [Adjustable and Perfect Fit] Designed to fit almost any wrist.These 22mm watch bands fit wrist 4.25\"-6.81\".11 (22mm) precision cut eyelets allow for individualized adjustment to achieve the perfect fit.Before you order, measure the breadth of your watch lugs.     [Package Inclusion] 1 Leather Watch Band, 1 Spring bar tool, 1 Quality Control Card.",
    "details": {
      "brand": "N/A",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "N/A"
    }
  },
  {
    "id": "B0DC5LFDTL",
    "name": "65w USB C Fast Charger 3 Ports with Foldable Plug Adapter Compatible for MacBook Pro/air, Ipad Pro, Charge for iPhone 16/15, Samsung Galaxy S24/s23, Google Pixel, and More",
    "ratings": null,
    "price": "$29.99",
    "image": "https://m.media-amazon.com/images/I/6163K1Ng5GL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "65W Fast Charging Efficiency: Single C1 or C2 port to get an impressive 65W Max charging power, which can charge for MacBook Pro 13 inch (2024/2022/2020) or charger for iPhone 16 pro max at full speed , easily from 2% to 55% in 30 minutes, High-speed charging for compatible devices such as phones, tablets, and laptops     3 in 1 Versatile Charger: Acceron 65w 3 ports usb fast charger provides intelligent current distribution to ensure you get the best charge, which can charge 3 devices (phones, tablets, and laptops) simultaneously, Use one charger to charge more devices, say goodbye to multiple chargers     Travel Friendly, Compact Design: A foldable plug provides more portability and a better travel experience, which is durable, compact and portable, perfect for easy storage, The 6-foot long USB C cable allows you to use your electronic devices comfortably while charging quickly     Wide Compatibility: Perfected to work with both PD & QC, PPS charging protocols for seamless use with your tablets, laptops, smartphones, and all USB-charged devices at the same time. 65w 3 ports usb fast charger block is compatible with Macbook Series, Dell XPS Series, Google Pixelbook, Microsoft Surface Book, iPhone Series, Samsung Series, Google Pixel Series, iPad Series, Galaxy Tab Series, AirPods, Apple Watch, Nintendo Switch, and More     Safe, Stable, and Durable: Utilizing GaN technology, this 65w USB C charger 3 ports has built-in intelligent chip multiple protection system to protect your devices from damage, avoid overvoltage, overcharging, overheating, charge your Phone/iPad/MacBook and more devices quickly, safely and stably     What You Get: Acceron 65w 3 ports usb foldable fast wall charger*1 and 6ft usb c charging cable 100w*1, We offer 2-year warranty, while 24*7 friendly customer support ensures your pleasing shopping experience. If you have any questions, please do not hesitate contact us",
    "details": {
      "brand": "Acceron",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "USB",
      "color": "white"
    }
  },
  {
    "id": "B0DHKQJ3HZ",
    "name": "USB C Car Charger 60W PD&QC3.0 Super Fast Car Charger Adapter JOYROOM Dual Port Car Phone Charger with 3.3ft 60W USB C Cable Fast Charging for iPhone 16 Samsung S24",
    "ratings": null,
    "price": "$19.99",
    "image": "https://m.media-amazon.com/images/I/71Qs1PO7TNL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "60W DUAL PORT CAR CHARGER FAST CHARGING: 60W(Max) super fast car charger usb c supports PD30W and QC3.0 30W high output and is compatible with PD3.0/QC3.0/AFC and FCP super fast charging protocol for all devices. JOYROOM USB c car charger, 10X faster than 2.4A charger, can rapidly charge iPhone 15 pro and Samsung Galaxy S23 from 0% to 80% in 35 minutes. Note: Best super fast charge partner 60W USB C-C Fast Charging Cable included.     EXTRA 3.3FT 60W USB C CABLE RIGHT FOR ALL Type C DEVICES: JOYROOM PD&QC 3.0 fast car charger adapter comes with 60W usb-C Nylon cable for you which support super fast charging for your Samsung Galaxy S23 S22 S21 Ultra/iPhone 16 Pro Max Plus     SMALLEST SIZE, FLUSH FIT: Tiny thumb-sized car charger fits most car cigarette lighters and barely protrudes past the edge of the outlet. It's JOYROOM smallest usb c car charger: lightweight and highly compact takes up no space in the car.     2024 New Upgraded cell car phone charger: JOYROOM All metal iPhone 15 pro max car charger is not only equipped with 3.3 ft 60w usb c cable, as well as the appearance of a soft LED colorful ambient light designed to help find the charging port more easily in the dark.     All Metal, Excellent Heat Dissipation: This dual port usb cigarette lighter adapter is designed with all-metal aluminum alloy, which not only has a textured appearance as well as more durable, but also the metal alloy material helps to improve the heat dissipation performance during the use of the car charger. Metal alloy car charger is safer than plastic car charger, reducing safety hazards.",
    "details": {
      "brand": "JOYROOM",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "USB C & Type C 60W Super Fast Car Charger",
      "color": "N/A"
    }
  },
  {
    "id": "B0B93YM4PC",
    "name": "USB C Headphones for Samsung Galaxy S24 S23 Ultra S22 S21 FE S20 A54 A53 USB C Earphones with Mic Volume Control Wired Earbuds USB Type C Headphones for iPhone 16 15 Pro Max Plus iPad Pro Pixel 8 7 6a",
    "ratings": 2.731,
    "price": "$15.99",
    "image": "https://m.media-amazon.com/images/I/6125osc2MQL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "USB C headphones for iPhone 16/16 Plus/16 Pro/16 Pro Max,15/15 Plus/15 Pro/15 Pro Max,iPad Pro(M4), iPad 10,12.9'' iPad Pro 6th/5th/4th/3rd gen, 11'' iPad Pro 4th/3rd/2nd gen, iPad Air M2/5th/4th, iPad mini 6th, Macbook Air Pro; Samsung Galaxy S24 Ultra/S24+/S24,S23 FE/S23 Ultra/S23+/S23,S22 S21 S20 Ultra FE,Note 20 Ultra/20,A55/A54/A53,Tablet A9+, Z Flip/Fold 5/4/3/2; Google Pixel 9 8 8a 8 Pro 7 7a 7 Pro 6 Pro 6a 6 5 4 4XL 3XL; OnePlus 10T 10 Pro 9 8 Pro and more USB-C device without 3.5mm jack     【Perfect Stereo Sound】BENEWY USB C Earphones built-in high-quality DAC chip reduces the loss in the sound transfer. Delivers premium sound with fine-tuned acoustics that balance strong bass, soaring highs, and clear mids, you can enjoy an authentic live music experience.     【HD Mic & Volume Control】: This samsung s21 fe headphones built-in a HD microphone and integrated remote control allow you to easily switch between music and call, fully meeting your expectation on play/pause songs, volume control, switch songs, answer/reject calls     【Comfortable In-Ear Design】This earphones for samsung s20 fe The ergonomic and comfortable in-ear design not only reduces pain and fatigue from prolonged wear of these Type C earphones, but Anti-knot Design, Built-in powerful magnet on the back of earbuds, easy to roll up and take it and without any tangle in daily use Type C headphones are lightweight and portable, ideal for commuting, taking the bus, running, climbing, and other occasions, to enjoy beautiful music anywhere.     【Built to Last】The wired usb c earbuds headset: utilizes the TPE material cable, which is over 15000 times bend lifespan test, is flexible and durable, the cord is strengthened for longer durability, If you have any issue with our usb c headset, please feel free to contact us via email. We would rather spend one more hour than waste your one more minute.",
    "details": {
      "brand": "BENEWY",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "Black"
    }
  },
  {
    "id": "B09T9DQ4F2",
    "name": "45W Samsung Phone Super Fast Charger, USB C Android Phone Charger Fast Charging Cord with 6.6FT Cable for Samsung Galaxy S24/S23 Ultra/S23+/S22 Ultra/S22+/S20 Ultra/Note 10 Plus, Galaxy Tab S8",
    "ratings": 3.506,
    "price": "$25.99",
    "image": "https://m.media-amazon.com/images/I/71DpayWLsuL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "【 45W Samsung Fast Charger】45W USB-C Samsung Fast Charger Block adopts latest PPS(Programmable Power Supply) fast charging technology to provide maximum power of 45W, charge up to 50% within 20 minutes for Samsung S24/S23/S22 Ultra, full charge only takes less than 1 hour; much faster than the 15W or 25W charger     【45 Watt Samsung Super Fast Charger】This portable 45W USB-C Charger set is broadly compatible with almost any personal devices from cellphones, tablets to laptops, provides optimized charging for Samsung phones, [45W Super Fast Charging 2.0] for Samsung Galaxy S24 Ultra/S24+/S23 Ultra/S23/S23 Plus/S22 Ultra/S22 Plus/S20 Ultra/Note 10 Plus, Galaxy Tab S8/Ultra/S7/Plus; [25W Super Fast Charging] for Samsung Galaxy S24/S23/S22/S21/S21+/S21 Ultra/FE 5G/S20/S20+/Note 20/Note 20 Ultra/A71/Z Fold 3/Z Fold 4/Z Flip 4     【Fast Charger Samsung】 This 45 Watt samsung super fast charging block multiple built-in safeguards protect your devices against damage caused by short circuit, over-current, over-voltage, over-heating, and over-charging issues. Automatically stops charging when battery capacity is full to ensure your device safety and longevity     【Android Phone Charger 】The 6.6FT detachable USB-C to USB-C charger cable is included, offers a user-friendly reversible design, so you can charge your phone from any other c type power source such as your computer or a portable battery. Use the cable to sync and transfer files at blazing speeds with your Galaxy or any other compatible smartphone or laptop     【What You Get】2x 45 Watt USB-C Super Fast Charging Block, 2x 6.6FT USB C to USB C Fast Charging Cord. Input: 100-240V ~ 50/60Hz 3A MAX, (PD3.0) 5.0V~3.0A, 9.0V ~3.0A, 12V~3.0A 15V~3.0A, 20V~2.25A. (PPS2.0) 3.3-11.0V~4.05A, 3.3-16V~2.8A,3.3-21V~2.1A",
    "details": {
      "brand": "Auorld",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "USB",
      "color": "black"
    }
  }
]