[
  {
    "id": "B09D2HV564",
    "name": "SAMSUNG Galaxy Watch 4 Classic R890 46mm Smartwatch GPS WiFi (International Model) (Black)",
    "ratings": 665,
    "price": "$128.99",
    "image": "https://m.media-amazon.com/images/I/51PzK+RgRIL._AC_SY300_SX300_.jpg",
    "description": "1.4 \"(34.5mm) Super AMOLED, 450 x 450 pixels (~321 ppi density), 16M Colors, CPU: Dual-Core 1.15GHz, 361mAh Battery, Android Wear OS, One UI Watch 3, Bluetooth, Wi-Fi     The Galaxy Watch4 Classic uses red LEDs and infrared rays to calculate your SpO2 levels or the amount of oxygen in your blood.     Glass front (Gorilla Glass DX+), MIL-STD-810G compliant, 50m water-resistant (IP68), Compatible with standard 20mm straps, ECG certified, Blood pressure monitor     5 ATM / IP68 The water and dust resistance rating, Military-grade durability, Larger screen but lighter and thinner for more comfort.     Compatible with Android Phones Running Android 6.0 and Above. NOT compatible with iOS.",
    "details": {
      "brand": "N/A",
      "operatingSystem": "Android",
      "memoryStorageCapacity": "16000 MB",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "Wi-Fi",
      "color": "N/A"
    }
  },
  {
    "id": "B08FXRTYPH",
    "name": "$30/mo. Mint Mobile Phone Plan with Unlimited Talk, Text & Data for 3 Months (3-in-1 SIM Card)",
    "ratings": 17.26,
    "price": "$45.00",
    "image": "https://m.media-amazon.com/images/I/61GjGBJErFL.__AC_SY300_SX300_QL70_FMwebp_.jpg",
    "description": "WHAT YOU GET: Three (3) months of unlimited talk, text, and data delivered on the nation’s largest 5G network. Data speeds reduce after 40GB of usage but data is unlimited. Videos stream at 480p.     OH, YOU GET THIS TOO: 5G for Free + 10GB of mobile hotspot + Wi-Fi calling and text + free international calls to Mexico and Canada + 7-day money back guarantee     HOW YOU GET IT: The SIM Kit comes with a 3-in-1 SIM card that includes standard/micro/nano sizes, insert the SIM into your device, and activate on the Mint Mobile website or app. You can activate service on your own unlocked device with our Bring Your Own Phone (BYOP) program. Check your coverage and phone compatibility on the Mint Mobile website.     WHO SHOULD GET IT: Anyone who hates their phone bill     WHY YOU SHOULD GET IT: Mint Mobile took what’s wrong with wireless and made it right. We re-imagined the wireless shopping experience and made it easy and online.     LEGAL STUFF: Capable device required. Coverage not available in all areas. New activation and upfront payment of 90 USD for 3-month plan (30/mo. equiv.) req’d; while supplies last. Intro rate for first 3 months only; then full-price plan options available. Restrictions apply. See full terms on Mint Mobile website.",
    "details": {
      "brand": "Mint Mobile",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "GSM",
      "connectivity": "N/A",
      "color": "N/A"
    }
  },
  {
    "id": "B0CQ3RRS23",
    "name": "SAMSUNG 14\" Galaxy Book4 Pro Laptop PC Computer, Intel Core 7 Ultra Processor 512GB, 3K AMOLED (2880 x 1800) Touchscreen, Advanced Security, 2024 Model, NP940XGK-KG1US, Moonstone Gray",
    "ratings": 26,
    "price": "$1,129.99",
    "image": "https://m.media-amazon.com/images/I/6131ZgIFn1L.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "POWER FOR YOUR MOST PRODUCTIVE DAYS: Breeze through every task with a powerful Intel processor; Intel Core Ultra 7 processor 155H; Enhanced with AI Intel ARC Graphics     POWERFUL. LIGHT. AMAZINGLY SLIM: Take premium power on the go with an ultralight and amazingly slim laptop; 16” Thickness: 12.5mm, Weight: 3.44 lbs; 14\" Thickness: 11.6mm, Weight: 2.71 lbs     BRACE YOURSELF FOR THE ULTIMATE SCREEN EXPERIENCE: Tackle what you need to do then kick back with what you love to do on a spacious 14\" or 16\" Dynamic AMOLED 2X touchscreen that’s bright, crisp and vivid     A PACKED BATTERY FOR YOUR STACKED DAYS: Achieve your goals – and more – with a long-lasting battery that goes the distance; 16”: 76Wh (Typical) 65W Adapter; 14”: 63Wh (Typical) 65W Adapter     OUR MOST ADVANCED GALAXY BOOK SECURITY YET: Have peace of mind while bringing your big ideas to life with our most advanced Galaxy Book security available; Secured Core PC; Secured by Knox",
    "details": {
      "brand": "SAMSUNG",
      "operatingSystem": "Windows 11 Home",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "Galaxy Book4",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "Gray"
    }
  },
  {
    "id": "B0B8TG9R3Q",
    "name": "SAMSUNG Galaxy Buds Pro 2 [2022] (SM-R510NLVALTA) - (Violet)",
    "ratings": 1.648,
    "price": "$109.99",
    "image": "https://m.media-amazon.com/images/I/41C-EvMZ1sL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "ACTIVE NOISE CANCELLATION: Reduce unwanted noise with Galaxy Buds2 Pro; They use Intelligent Active Noise Cancellation* to quiet even the loudest outside sounds; Tune in to what matters most without being bothered by distracting sounds around you     HI-FI SOUND QUALITY: Studio quality sound isn’t just for the pros; Feel every note like you’re there with Galaxy Buds2 Pro** and get a next-level listening experience, whether you’re rocking out to your playlist or staying informed with a podcast     ENHANCED 360-DEGREE AUDIO: Amplify what you like; Minimize what you don’t; Enhanced 360-degree audio** brings out the tones you love from every angle for a personalized surround sound experience every time you pop them in     EXCELLENT FIT: Pop ‘em in and forget they’re there; Galaxy Buds2 Pro are earbuds designed to be even more comfortable than before and fit securely no matter what you’re doing; Whether for your work or workout, make all your moves comfortably     HD VOICE TECHNOLOGY: Turn every call into a high definition chat; HD Voice Technology separates your voice from surrounding noise, so you come in crystal clear even with the hustle and bustle around you     INTELLIGENT CONVERSATION MODE: Keep the conversation going without taking out your earbuds; When your voice is detected, Intelligent Conversation Mode turns off Active Noise Cancellation, turns down the volume and puts your Buds in Ambient Mode***     WATER RESISTANT: Water won’t ruin your workout; Your IPX7 water-resistant Galaxy Buds2 Pro can keep the beat going even with a little rain; They’re protected for immersion up to 3 feet deep for a half-hour****",
    "details": {
      "brand": "SAMSUNG",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "N/A"
    }
  },
  {
    "id": "B0D1DBQRRS",
    "name": "SAMSUNG 32-Inch M8 (M80D) Series 4K UHD Smart Monitor with Streaming TV, Speakers, HDR10+, AI Upscaling, USB-C, Ergonomic Stand, SlimFit Camera, Gaming Hub, LS32DM801UNXZA, 2024",
    "ratings": 837,
    "price": "$499.99",
    "image": "https://m.media-amazon.com/images/I/71Cqqs9ibaL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "ACCESS TO OTT CONTENT: Stream OTT content directly from monitor or tune into Samsung TV Plus¹ to get live TV channels & on-demand content at zero cost; Need to make the most out of a small space or want a 2nd TV? The Smart Monitor is the best choice     UPSCALE OTT CONTENT w/ AI: Unlock the full potential of a 4K screen when streaming content directly on your monitor; AI upscaling, powered by the NQM AI Processor, turns lower resolution content up to nearly 4K²     1 MOUSE & KEYBOARD ACROSS DEVICES: Maximize multitasking by controlling multiple devices with one mouse and keyboard; Seamlessly drag & drop content across the Smart Monitor, a Galaxy Tab & Galaxy mobile device, streamlining your workflow³     CATCH EVERY DETAIL: Pictures with precision, UHD resolution ensures every piece of content is brought to life beautifully; HDR 10+ support creates brighter brights and darker darks, for more nuanced settings without losing any vivid detail⁴     STYLE & COMFORT, WITHOUT COMPROMISE: The Smart Monitor combines cutting-edge design with ergonomic features and a slim, stylish look; Its height-adjustable stand, which also tilts & pivots, ensures the optimal viewing angle for maximum comfort     CONNECT w/ CONVENIENCE: With USB-C, HDMI & USB-A ports, you can connect to the Smart Monitor without adapters; Charge your devices, transmit data & make the most out of your multiscreen setup - or do all at once - thanks to the 4 available ports     WHERE GAMING COMES TOGETHER: Samsung Gaming Hub is the ultimate home for gaming; Instantly play the biggest games from top streaming partners, with no PC or console needed; Discover new games or replay old favorites all in one place⁵",
    "details": {
      "brand": "SAMSUNG",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "4K UHD 2160p",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "N/A"
    }
  },
  {
    "id": "B0BHJF2VRN",
    "name": "SAMSUNG 990 PRO SSD 1TB PCIe 4.0 M.2 2280 Internal Solid State Hard Drive, Seq. Read Speeds Up to 7,450 MB/s for High End Computing, Gaming, and Heavy Duty Workstations, MZ-V9P1T0B/AM",
    "ratings": 9.743,
    "price": "$109.99",
    "image": "https://m.media-amazon.com/images/I/61ZL9Qpo1-L.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "HUGE SPEED BOOST: Get random read/write speeds that are 40%/55% faster than 980 PRO; Experience up to 1400K/1550K IOPS, while sequential read/write speeds up to 7,450/6,900 MB/s reach near the max performance of PCIe 4.0*     BREAKTHROUGH POWER EFFICIENCY: Use less power and get more performance; Enjoy up to 50% improved performance per watt over 980 PRO, plus optimal power efficiency with max PCIe 4.0 performance**     SMART THERMAL CONTROL: Samsung's own nickel-coated controller delivers effective thermal control; With its slim size, 990 PRO is a perfect fit for desktops and laptops that meet the PCI-SIG D8 standard***     THE CHAMPION MAKER: Up to 65% improvement in random performance enables faster loads for an ultimate gaming experience on PS5 and DirectStorage PC games****     SAMSUNG MAGICIAN SOFTWARE: Get the most out of your SSD with Samsung Magician's advanced yet intuitive optimization tools; Monitor drive health, protect valuable data, and receive important updates for your 990 PRO     WORLD'S #1 FLASH MEMORY BRAND: Experience the performance and reliability from the world's #1 brand for flash memory since 2003; All firmware & components, including Samsung's world-renowned DRAM & NAND, are produced in-house*****",
    "details": {
      "brand": "SAMSUNG",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "PCIe Gen 4x4",
      "color": "Multicolor"
    }
  },
  {
    "id": "B0CSF51KCW",
    "name": "Samsung Galaxy Tab A9 (SM-X110), 64GB 4GB RAM, WiFi Only, International Version (15W Wall Charger Bundle) (Gray)",
    "ratings": 393,
    "price": "$107.67",
    "image": "https://m.media-amazon.com/images/I/51HL5sz4keL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "ATTENTION: this is the WIFI ONLY model     Packaging contains the cell phone, a USB C to USB C cable, and a sim tray ejector tool. Seller provides a USB C wall adapter.     Display: TFT LCD | 8.7 inches, 214.9 cm2 (~81.7% screen-to-body ratio) | 800 x 1340 pixels, 5:3 ratio (~179 ppi density)     Camera: 8 MP, AF     Battery: Li-Po 5100 mAh, non-removable | 15W wired",
    "details": {
      "brand": "SAMSUNG",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "64 GB",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "Galaxy Tab A9",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "N/A"
    }
  },
  {
    "id": "B0CCW7H9P9",
    "name": "SAMSUNG Galaxy Watch 6 40mm Aluminum Smartwatch w/ Fitness Tracker, Heart Monitor, BIA Sensor, Advanced Sleep Coaching, Bluetooth – Graphite",
    "ratings": 388,
    "price": "$169.99",
    "image": "https://m.media-amazon.com/images/I/615JzCB9eEL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "",
    "details": {
      "brand": "SAMSUNG",
      "operatingSystem": "Android",
      "memoryStorageCapacity": "16 GB",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "Bluetooth",
      "color": "N/A"
    }
  },
  {
    "id": "B0D5ZZ9G26",
    "name": "SAMSUNG 24-Inch Odyssey G3 (G30D) Series FHD Gaming Monitor, 1ms, 180Hz, AMD FreeSync, Adjustable Stand, Black Equalizer, Virtual Aim Point, Eye Saver Mode, Flicker-Free, LS24DG302ENXZA, 2024",
    "ratings": 3.423,
    "price": "$139.99",
    "image": "https://m.media-amazon.com/images/I/81+37W3qr5L._AC_SX300_SY300_.jpg",
    "description": "REACT IN REAL TIME: 180Hz refresh rate eliminates lag for exhilarating gameplay with ultrasmooth action; 1ms response time (MPRT) provides frames with minimal blur, allowing you to jump on enemies right when you see them¹     STAY IN SYNC WITH THE ACTION: AMD Radeon FreeSync keeps your monitor and graphics card refresh rate in sync to reduce image tearing; Watch movies and play games without interruptions; Even the fastest scenes look seamless and smooth²     DISCOVER ENEMIES IN THE SHADOWS WITH BETTER VISIBILITY: Black Equalizer allows you to adjust dark areas in games, letting you spot your enemies in even the darkest hiding nooks²     A NEW LEVEL OF ACCURACY: Line up more accurate shots with Virtual Aim Point; Crosshairs on the screen give you a new level of accuracy in any game, when precision can mean the difference between life and death²     FRESH EYES WIN MORE: Eye Saver Mode minimizes blue light to help keep your eyes relaxed and comfortable when gaming for extended periods; The Odyssey G3 also reduces irritating and frustrating screen flicker, so you can focus longer²     TAKE IN THE FULL VIEW: Your legacy has no boundaries; The 3-sided borderless design unveils maximum space for bigger, bolder gameplay; Line up two displays precisely in a dual-monitor setup, making it impossible for enemies to slip through the cracks     YOUR GAMES TAILORED TO YOU: Reach the height of winning; Swivel, tilt, pivot and adjust your monitor height until all enemies are in perfect view; Your ergonomic stand can be moved freely so you can find total gaming comfort",
    "details": {
      "brand": "SAMSUNG",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "FHD 1080p",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "N/A"
    }
  },
  {
    "id": "B0DFBYCZJV",
    "name": "Fitpolo Smart Watch for Men Women,1.3\" AMOLED Touchscreen Fitness Tracker, Make/Answer Calls, Heart Rate SpO2 Monitor, IP68 Waterproof, Sleep & Activity Tracking Smartwatch for Android Phones iPhone",
    "ratings": 195,
    "price": "$79.99",
    "image": "https://m.media-amazon.com/images/I/71XJmw1iFeL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "【Stay Connected on the Go】Enjoy a 1.3-inch AMOLED touch screen with always-on display mode and customizable watch faces. Get clear, vibrant visuals, whether indoors or outdoors. Effortlessly make and receive calls with the built-in Bluetooth connectivity, and stay updated with call, text, and app notifications right on your wrist     【Comprehensive Health Monitoring】This advanced fitness tracker monitors your heart rate, SpO2 (blood oxygen) levels, breathing rate, stress management score and menstrual health. Sleep smarter by automatically recording your nightly rest, including light, deep, and REM sleep stages     【Compatible with iOS and Android Phones】Enjoy seamless connectivity with Fitpolo smart watch for iPhone compatible (iOS 10.0+), Android phones (Android 5.0+) (For smartphones only, not for PC, iPad, or tablets)     【120+ Exercise Modes & Water Resistant】Take your fitness to the next level with over 120 exercise modes, including steps, distance, and calorie tracking. Whether you're swimming or running, this fitness tracker is water resistant and built to ensure your workout goals are always within reach     【Long-lasting Battery Life】Enjoy longer usage time with just 2.5 hours of charging, delivering an exceptional battery life of 8 -12 days. This means you can rely on your android & iPhone smart watch for extended periods without worrying about frequent recharging     【User-Friendly Setup】Experience a hassle-free setup process with intuitive features designed for practicality. This step tracker ensures that you can quickly navigate through its functions, making it a convenient addition to your daily routine",
    "details": {
      "brand": "N/A",
      "operatingSystem": "Android & iOS",
      "memoryStorageCapacity": "256 MB",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "Bluetooth",
      "color": "N/A"
    }
  },
  {
    "id": "B0B4YM4G88",
    "name": "Yoidesu Unlocked Cell Phones,7.3in HD Screen Unlocked Smartphones,4G RAM 64G ROM, Dual Cards Dual Standby Mobile Phone,4500mAh Battery(Black)",
    "ratings": 3,
    "price": "$72.42",
    "image": "https://m.media-amazon.com/images/I/71O9BPTeZcL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "Good Photographic Performance: the front camera of smart phone has 5 million pixels, f / 2.0 aperture and fixed focal length. The rear camera has 8 million pixels (color, f / 1.8 aperture) automatic focus and good photographic performance.     Dual Card: The moile phone supports dual card dual standby and 128G memory card expansion. (Support simultaneous installation of two SIM cards or one SIM card and one small memory card.)     Multi Function: With face recognition function, WiFi, BT, FM, GPS function, Type C charging interface, 3.5mm standard headset interface and support for Android 12 system.     Large Battery Capacity: 4500mAh capacity removable battery ensures long time operation during single charge, which is convenient to use and can be used out for a long time.     Excellent Use Experience: Stylish body design and high definition screen design provide you with a great visual experience and a delicate, gentle touch.",
    "details": {
      "brand": "Yoidesu",
      "operatingSystem": "android",
      "memoryStorageCapacity": "64 GB",
      "screenSize": "N/A",
      "resolution": "2400 x 3200",
      "modelName": "S22 Ultra",
      "wirelessCarrier": "Unlocked",
      "cellularTechnology": "4G",
      "connectivity": "Wi-Fi, USB",
      "color": "N/A"
    }
  },
  {
    "id": "B0DDSZRJ2F",
    "name": "for Samsung Galaxy Z Fold 6 Case with S Pen Holder & Stand, [Hinge Protection & Tempered Screen Protector] Full Body Heavy Duty Shockproof Slim Wireless Charging Case for Z Fold 6 (Black)",
    "ratings": null,
    "price": "$36.99",
    "image": "https://m.media-amazon.com/images/I/71h9bUCqH7L.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "[Compatible Models] With S Pen Holder and Ring Stand Heavy Duty Protective Case Designed for Samsung Galaxy Z fold 6 (Note: S Pen Not Included), Compatible with Wireless Charging and Reverse Charging.     [ S Pen Holder & Hinge protection ] The Ring Kickstand & Spen Holder features a 2-in-1 pocket-friendly design that won't make you feel the slightest bit bulky. The included pen holder provides a powerful and secure storage center to take with you wherever your creativity takes you. The hinge protector always fits snugly on the Galaxy fold 6, protecting the hinge from external shocks and scratches at all times. (Note: Pen not included. (Compatible with Slim Z Fold5/ Fold6 S Pen Fold version only)     [Hidden Kickstand & Finger Ring Compatible] BSNRM Galaxy Z Fold 6 case is built-in durable hidden finger ring stand design, which will not add any extra bulk to your phone, and also supports three different ergonomic angle viewing modes, so you can completely free your hands. Also compatible with the finger ring, it is ideal for one-handed operation no matter how you use the screen, providing convenient and stable support in any situation     [Create a second screen for Galaxy Z Fold6] This Samsung Z Fold 6 case consists of lightweight and sturdy PC back cover + military shock absorbing foam + 9H reinforced tempered glass (without affecting the edge sensitivity), reinforcing the protective measures for your expensive and fragile ALED screen, reducing the potential scratches and grease brought by daily or accidental, so that you don't need to pay extra to buy it from a third party to purchase separately. Built-in shock-absorbing foam effectively reduces the impact of drops     [FULL ACCESS & GET SUPPORT] Precise cutouts and buttons are easy to access while compatible with wireless charging or reverse charging.BSNRM AFTER-SALE SUPPORT TEAM PROMISE: If you encounter any problem with the product usage/ not as described/ not as modeled, please contact us through your order and we will be responsible for you",
    "details": {
      "brand": "BSNRM",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "Black"
    }
  },
  {
    "id": "B0CVBKWH12",
    "name": "SAMSUNG 14\" Galaxy Book4 Pro Business Laptop, Wi-Fi PC Computer, Windows 11 PRO, Intel Core 7 Ultra 155H / 16GB / 1TB, 3K AMOLED Touchscreen, 2024 Model, NP944XGK-KG1US, Moonstone Gray",
    "ratings": 31,
    "price": "$1,399.99",
    "image": "https://m.media-amazon.com/images/I/6131ZgIFn1L.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "POWER FOR YOUR MOST PRODUCTIVE DAYS: Galaxy Book4 Pro models come with a new Intel Core Ultra 7 processor 155H or Intel Core Ultra 5 processor 125H with a higher-performance Intel ARC graphics & newly added AI neural processing unit (NPU)     POWERFUL. LIGHT. AMAZINGLY SLIM: Galaxy Book4 Pro is the epitome of portability and the lightest in our all-new Galaxy Book4 Series; 16” Thickness: 12.5mm, Weight: 3.44 lbs; 14\" Thickness: 11.6mm, Weight: 2.71 lbs     BRACE YOURSELF FOR THE ULTIMATE SCREEN EXPERIENCE: Tackle your workday on a spacious 14\" or 16\" Dynamic AMOLED 2X touchscreen; New anti-reflective screen with Vision Booster reduces glare and improves picture clarity in bright lighting conditions     A PACKED BATTERY FOR YOUR STACKED DAYS: Achieve your goals – and more – with a long-lasting battery that goes the distance; 16”: 76Wh (Typical) 65W Adapter; 14”: 63Wh (Typical) 65W Adapter     OUR MOST ADVANCED GALAXY BOOK SECURITY YET: Bring your business ideas to life with our most advanced Galaxy Book security available; Secured Core PC and now secured by Knox to help protect your enterprise data from attacks below the OS layer     HIGH-QUALITY CALLS. UNHINDERED PRODUCTIVITY: Collaborate seamlessly on video calls with a high-quality FHD camera, AKG Quad speakers with Dolby Atmos, and studio-quality dual microphones with bi-directional AI noise canceling     SEAMLESS WORKFLOW: Sync this laptop with other Galaxy devices for a new level of productivity; Pair it with your Samsung smartphone to effortlessly sync files and call and text from your laptop ¹; Also, use your Samsung Tab as a 2nd screen     512GB & 1TB OF BUILT-IN STORAGE: Have the files you need to succeed with up to 512GB and 1TB of built-in storage³ plus up to 2TB of expandable storage⁴",
    "details": {
      "brand": "SAMSUNG",
      "operatingSystem": "Windows 11 Pro",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "GB4 Pro 14”",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "Moonstone Gray"
    }
  },
  {
    "id": "B09ZQ49G32",
    "name": "SAMSUNG HW-S50B/ZA 3.0ch All-in-One Soundbar w/Dolby 5.1, DTS Virtual:X, Q Symphony, Built in Center Speaker, Adaptive Sound Lite, Bluetooth Multi Connection, 2022 Black",
    "ratings": 1.463,
    "price": "$147.99",
    "image": "https://m.media-amazon.com/images/I/717r7x8stSL.__AC_SY300_SX300_QL70_FMwebp_.jpg",
    "description": "ALL-IN-ONE: Everything you need in a single soundbar with two woofers and tweeters built in, so you can enjoy rich sound that will fill your room     DOLBY DIGITAL 5.1 / DTS VIRTUAL:X: Dolby Digital 5.1 capable creates realistic surround sound by projecting it from all around you, while DTS Virtual: X expands your listening experience without having to add extra speakers     Q-SYMPHONY: Perfectly synchronized, fully immersive audio floods your room all at once, using every speaker in compatible Samsung TV and soundbars*     BUILT-IN CENTER SPEAKER: The built-in center speaker is dedicated to delivering enhanced dialogue, so you won't miss a word, no matter how faint the conversation or how intense the background music or action is     ADAPTIVE SOUND LITE: Enjoy dynamically optimized audio with enhanced voice clarity so you can follow along with action-packed games and blockbuster films     MUSIC MODE: Experience vocals and instruments in studio-grade clarity, allowing you to hear every note as the artists intended     BLUETOOTH MULTI CONNECTION: Connect two smart devices at the same time so you can conveniently switch and play songs from different devices**",
    "details": {
      "brand": "SAMSUNG",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "wired, wireless",
      "color": "N/A"
    }
  },
  {
    "id": "B0D4292F1Q",
    "name": "SAMSUNG Galaxy S24 Ultra 5G (512GB, 12GB) 6.8\" AMOLED 2X, 200MP Camera, Dual SIM, 5G / 4G LTE (Fully Unlocked for T-Mobile, Verizon, Global) S928B/DS (w/ 25W Fast Charging Cube, Titanium Black)",
    "ratings": 21,
    "price": "$1,064.50",
    "image": "https://m.media-amazon.com/images/I/51DI8ymD0jL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "6.8 Dynamic AMOLED 2X FHD+, 120Hz Adaptive Refresh Rate, 505ppi, 2600nits (Outdoor Peak), 1440x3120px, 5000mAh Battery     512GB, 12GB RAM, No SD Card Slot, Qualcomm SM8650-AC Snapdragon 8 Gen 3 (4nm), Octa-Core, Adreno 750     Rear Camera: 200MP, f/1.7 + 10MP, f/2.4 + 50MP, f/3.4 + 12MP, f/2.2, Front Camera: 12MP, f/2.2, Android 14, One UI 6.1     2G: 850/900/1800/1900, 3G: UMTS 1(2100)/2(1900)/4(AWS)/5(850)/8(900), 4G LTE: 1(2100)/2(1900)/3(1800)/4(AWS)/5(850)/7(2600)/8(900)/12(700)/13(700)/17(700)/18(800)/19(800)/20(800)/25(1900)/26(850)/28(700)/38(2600)/39(1900)/40(2300)/41(2500)/66(AWS-3), 5G: N1(2100)/2(1900)/3(1800)/5(850)/7(2600)/8(900)/12(700)/20(800)/25(1900)/26(850)/28(700)/38(2600)/40(2300)/41(2500)/66(AWS-3)/77(3700)/78(3500) SA/NSA/Sub6 - Dual SIM (2 Nano-SIMs and eSIM, dual stand-by)     International Model - No Domestic Warranty. Compatible with Most GSM and CDMA Carriers like T-Mobile, MetroPCS, etc. Will Also work with CDMA Carriers Such as Verizon, Sprint.     Width: 4.00 inches; Length: 6.00 inches; Height: 2.00 inches",
    "details": {
      "brand": "SAMSUNG",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "512 GB",
      "screenSize": "N/A",
      "resolution": "1440 x 3120",
      "modelName": "N/A",
      "wirelessCarrier": "Unlocked",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "Titanium Black"
    }
  },
  {
    "id": "B08YM1JFZ7",
    "name": "SAMSUNG 35W Dual Port Wall Charger USB C Adapter, Super Fast Charging Block for Galaxy Phones and Devices, Cable Not Included, 2021, US Version, Black",
    "ratings": 1.867,
    "price": "$19.50",
    "image": "https://m.media-amazon.com/images/I/71HEtGcN04L.__AC_SY300_SX300_QL70_FMwebp_.jpg",
    "description": "Super Fast Charge: Go for high speed, safety, stability and power; Don’t settle for less – enjoy quick charging for many tech essentials, even iPhones.Compatible devices:S22, S22 plus, S22 Ultra, Fold3, Galaxy Flip3, A53, A32, Galaxy Buds2, Buds Live, Buds PRO, Tab S8, S8 plus, Galaxy Book2, Smartphones; tablets, value: Tablets; laptops, value: Laptops; smartwatches, value: Smartwatches; speakers, value: Speakers;Tab A7, A7 Lite, A8.0, A8.4, A10.1, A10.5, S6, S7;Galaxy Tab S3, Tab S4, Tab S5e, Tab S6, Tab S7, and TabS7 plus.Galaxy Tab A 10.1 (2019-2020), Tab A 10.5 (2019), Tab A 8.0 (2016-2019), Tab A 8.4 (2020), Tab A7 (2020), and Tab A7 Lite (2021)     Simultaneous Charging: The dual-port charger is powerful enough for double, high output charging of 2 devices simultaneously with its duo USB ports     Universal Compatibility: Charge up a wide range of devices at their optimal speeds; Androids. Of course; iOS isn't a problem either.     Adapter Only, cord not included.     Super Fast Charging (SFC) is Samsung's fast charge method supported for Galaxy Notes (Note 10 and higher), Galaxy S series (S10 5G and higher), and other SFC capable devices such as iPhone 8 or higher; Adaptive Fast Charging (AFC) is protocol for Samsung devices     35W charging is reserved for single charge PCs only; For mobile phones, tablets, and other compatible devices, charging rates may vary depending on device types as well as the number of devices being charged simultaneously     Power outputs for single vs. multiple device charging vary as follows: Up to 35W for a single device under PD 3.0 and SFC conditions with USB C; Up to 15W for a single device under AFC condition with USB A; Up to 20W for multiple devices under PD 3.0 with USB-C; Up to 15W for multiple devices under AFC condition with USB-A. Special Feature:USB A;USB C;35W;Wall Charger for Samsung Devices;Wall Charger for iPhone.Input voltage: 120 volts_of_alternating_current",
    "details": {
      "brand": "SAMSUNG",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "wired",
      "color": "Black"
    }
  },
  {
    "id": "B0CSF4FJ7T",
    "name": "Samsung Galaxy Tab A9 (SM-X110), 64GB 4GB Ram, WiFi Only, Factory Unlocked GSM, International Version (Silver)",
    "ratings": 90,
    "price": "$106.95",
    "image": "https://m.media-amazon.com/images/I/51YuTXm7ehL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "8.7\" (220.5mm), 1340 x 800 (WXGA+), TFT, 16M colors, Android 13, One UI 5.1     64GB ROM, 4GB RAM, Mediatek Helio G99 (6nm), Octa-core, Mali-G57 MC2 GPU     Rear Camera: 8MP, AF, Front Camera: 2MP, 5100 mAh battery, Bluetooth 5.3, USB Type-C 2.0     No SIM Card Slot / Network - Wi-Fi Only.     International Model without Domestic Warranty. The device is still covered by the Seller's Return Policy.",
    "details": {
      "brand": "SAMSUNG",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "64 GB",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "Galaxy Tab",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "N/A"
    }
  },
  {
    "id": "B0CCW95RBD",
    "name": "SAMSUNG Galaxy Watch 6 Classic 47mm Stainless-Steel Smartwatch w/ Fitness Tracker, Heart Monitor, BIA Sensor, Bluetooth – Black",
    "ratings": 394,
    "price": "$198.39",
    "image": "https://m.media-amazon.com/images/I/61D1af1+kPL._AC_SY300_SX300_.jpg",
    "description": "47mm Rotating Bezel - 1.5\" Super AMOLED, 480x480px ~453ppi, 425mAh Battery, , Bluetooth 5.3, Wi-Fi, MIL-STD-810H compliant, IP68 - 50m water resistant, ECG certified, Blood pressure monitor     16GB, 2GB RAM, Exynos W930 Dual-core 1.4 GHz Cortex-A55, Mali-G68 GPU, Android Wear OS 4, One UI Watch 5     Boost your style with a classic look and a rotating bezel that you can turn to easily access your apps and more     Your Watch continually scans your heart rate to inform you when it detects an irregular rhythm that might be A-fib     Compatible with Android devices Only. Supports Samsung Pay. WIFI+GPS International Model, No Domestic Warranty. Return Policy still covers device.",
    "details": {
      "brand": "SAMSUNG",
      "operatingSystem": "Android",
      "memoryStorageCapacity": "16 GB",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "Bluetooth",
      "color": "Black"
    }
  },
  {
    "id": "B07D7Q41PM",
    "name": "SAMSUNG MUF-256AB/AM FIT Plus 256GB - 400MB/s USB 3.1 Flash Drive, Gunmetal Gray",
    "ratings": 35.574,
    "price": "$24.99",
    "image": "https://m.media-amazon.com/images/I/514WukM0Y4L.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "COMPACT FLASH DRIVE: Exceptionally compact Samsung FIT Plus USB flash drive for instant storage of your photos, videos, music, and files on laptops, tablets, TV’s, car audio systems, gaming consoles and more     QUICK AND CONVENIENT READ SPEEDS: Redefine everyday file transfers with read speeds up to 400MB/s; USB 3.1 flash drive with backwards compatibility (USB 3.0, USB 2.0)     SEAMLESS FITTING DESIGN: The unnoticeable, seamless fit is designed with a key ring to prevent loss     BUILT TO LAST RELIABILITY: Shock proof flash drive is also water proof, temperature proof, x-ray proof and magnetic proof     5-YEAR LIMITED WARRANTY: 5-year limited warranty",
    "details": {
      "brand": "SAMSUNG",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "256 GB",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "N/A"
    }
  },
  {
    "id": "B097WD9P4K",
    "name": "Samsung Galaxy Chromebook 2 XE530QDA-KA1US 13.3\" Touchscreen 2 in 1 Chromebook - Full HD - 1920 x 1080 - Intel Core i3 (10th Gen) i3-10110U 2.10 GHz - 8 GB RAM - Fiesta Red",
    "ratings": 201,
    "price": "$455.99",
    "image": "https://m.media-amazon.com/images/I/71KVH4q7AqS.__AC_SY300_SX300_QL70_FMwebp_.jpg",
    "description": "Aspect Ratio:16:9.Voltage:4.0 volts     Awarded Best Chromebook by CNN Underscored     The power & speed you deserve: Whether your working, studying or relaxing, Galaxy Chromebook 2 has you covered. With the latest Intel Core processor, you'll get super-fast speeds. Plus, Wi-Fi 6 GIG+ that’s up to 3x faster than standard Wi-Fi gives you a super smooth performance     Sleek design to make you stand out: Featuring an ultra-thin design , the Galaxy Chromebook 2 is compact and ready for impact. With technology as slim, sleek and savvy as this, it’s no wonder they’re staring. Whether your working, studying or relaxing, Galaxy Chromebook 2 has you covered. With the latest Intel Core processor, you'll get super-fast speeds. Plus, Wi-Fi 6 GIG+ that’s up to 3x faster than standard Wi-Fi gives you a super smooth performance     A Battery That'S Above & Beyond: Stay dialed in on-the-go with an all-day battery that keeps up no matter how many checkmarks your to-do list demands",
    "details": {
      "brand": "SAMSUNG",
      "operatingSystem": "Chrome OS",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "XE530QDA-KA1US",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "Fiesta Red"
    }
  },
  {
    "id": "B0DFCCGF9Z",
    "name": "TECKNET Universal Car Cup Phone Holder – Adjustable Cradle Car Mount with Air Vent Phone Mount & Extra Grip Pads for iPhone, Samsung, All Smartphone",
    "ratings": 655,
    "price": "$17.99",
    "image": "https://m.media-amazon.com/images/I/61dJrhfPB0L.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "【2 Mounting Options】Just place the car cup holder phone mount in the car cup holder and secure it for use. It also can be effortlessly mounted on your air vents without leaving residue. Take control of your car phone holders for iphone placement with ease!     【Upgraded Wider Expandable Base】TECKNET cupholder phone holder for car accommodates cell phones or devices ranging from 4 to 7 inches and with widths between 2.08 and 3.74 inches. With an adjustable base and three silicone pads, this cupholder phone holder for car seamlessly fits into cup holders of various sizes in your car, truck, golf cart, treadmill, or stroller, ranging from 2.7 to 4.06 inches.     【Super Sturdy Adjustable Arm】Sturdy high quality material from the phone cup holder for car keeps your phone from shaking while driving to ensure your driving safety. The 360°rotatable phone clip and adjustable gooseneck on the phone holder car provide optimal positioning for your phone, ensuring the best viewing angle. The cellphone holder for car height adjustment can reach up to 15 inches.     【Never Shake & Ultra Stable】The phone holder is equipped with a gooseneck stabilizer and a non-slip rubber pad to ensure stability in the car cup holder. Using high-quality aluminum alloy solid core, the phone cup holder for car will hold your phone firmly without concerning of your phone moving when you speed up or make a sharp turn.     【One-Hand Operation & Full Protection】One-touch release button of the car cup holder phone mount allows you to place or remove your phone off the car cup holder phone mount with one hand by press, and hold to set the specific phone dimensions. The soft silicone pad on the cup phone holder for car phone clip serves to secure and protect your device from slipping or scratches.",
    "details": {
      "brand": "TECKNET",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "Dark Black"
    }
  },
  {
    "id": "B0CDTYZTKW",
    "name": "BENFEI USB C to Audio Jack Adapter with DAC chipset, USB-C to 3.5mm Female Headphone Compatible with iPhone 15 Pro Max/15 Pro/15, Samsung Galaxy S24/S23/S22/S21 Ultra, iPad Pro, Pixel 8 Grey",
    "ratings": 683,
    "price": "$6.99",
    "image": "https://m.media-amazon.com/images/I/61wDKXvijEL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "【Feature】 This compact usb-c to aux adapter enable you to listen to music and answer phone call with your headphone and support wire control function as well.     【Hi-Fi Sound Quality】 This usb c to headphone adapter adopted an advanced DAC Smart Chip, offer high-definition audio, powerful noise reduction, you can get higher fidelity sound from it.     【Stable Signal & Durable Material】With the strain relief design, this type c to aux adapter can stand 30000+ bending tests, which makes this adapter much more durable. Shielded enamel wire can still ensure stable signal transmission with daily use. Metal-coated connectors for better contact ensure stable and lossless audio signal transmission.     【Wide Compatibility】 Wider compatibility than others type c to 3.5mm adapters, compatible with most of the type c phones: Google pixel 4 3 2 XL, Samsung Galaxy S23 S22 S21 S20 Ultra S20 Z Flip S20+ S10 S9 S8 Plus, Note 20 ultra 10 10+ 9 8, iPad pro 2018/20/21,Huawei Mate 30 20 10 Pro, P30 P20, One plus 6T 7 7Pro and more.     【18 MONTH WARRANTY 】 Exclusive BENFEI Unconditional 18-month Warranty ensures long-time satisfaction of your purchase; Friendly and easy-to-reach customer service to solve your problems timely",
    "details": {
      "brand": "BENFEI",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "N/A"
    }
  }
]