[
  {
    "id": "B0DFP17H38",
    "name": "SHEZI [Upgrade 4 in 1 Charging Cable, 60W [Full Chrager Only 0.8h][1GB Transfer Only 12s] Flat Silicone Multi Fast Charge Phone Cord with USB A/Type C/Light-ning for iPhone iPad Samsung, 5FT",
    "ratings": 13,
    "price": "$26.99",
    "image": "https://m.media-amazon.com/images/I/71-hxCuleiL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "Unique Liquid Silicone Material: Our usb c cable use the latest liquid silicone rubber as a material to make the cable softer, stronger, more resistant to dirt, is able to fully withstand stress and it feels incredibly soft between your fingers and is one of the strongest cables ever made. It won't get tangled even when tucked into a bag or pocket, making it perfect for carrying around.     4-in-1 Versatile Simplify Design: Our usb to usb c cable has different ports, including Light-ning/USB A/Type C connectors. Support to charge 99% phones available on the market. It's super handy to carry and meets all your demands on families, travel or work, business trips, and other occasions. ﻿     Fastest Charging in History: Our usb c to light-ning cable can charge your device at the fastest speed. Fully charge a iPhone 15 pro to 96%, a Switch to 90%, a Samsung S23 to 96%, a MacBook Pro to 86% and an iPad Pro to 89% in 35 minutes. NOTE: Please use a charger with the corresponding wattage or higher that our product could output maximum power.     Super Fast Data Transfer: Supports the USB 2.0 standard with unmatched data transfer speed up to maximum 480Mbps. This usbc cable is compatible with USB2 devices and transfer music, movies, or videos in seconds at maximum 480Mbps, 1GB files transfer only 12s.     Support CarPlay & Android Auto: This usb c to usb c cable 100% supports both Android Auto and Carplay which charging and navigating at the same time. Whether you have the usb c or light-ning port devices in your car, we can perfectly work for you. So no longer need to carry cables for each device, make you life more convenient.     Ultra High-Quality Assurance: This usb a to usb c cable has been tested to withstand at least 10,000 cycles of 90-degree bend and 10,000 plugging and unplugging lifespan which is 12 times stronger than all original cables, its zinc alloy cable housing is highly resistant to wear and scratches. You don't need to replace the charging cable within 3 years.     More Promise Less Concern: If you encounter any issues with your usb to light-ning cable, contact us via Amazon Message Center. Our dedicated customer support team is available to assist you with any questions or concerns you may have within 12 hours.",
    "details": {
      "brand": "SHEZI",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "USB",
      "color": "Green"
    }
  },
  {
    "id": "B08FRR54HL",
    "name": "SAMSUNG Galaxy S20+ Plus 5G Factory Unlocked Android Cell Phone SM-G986U US Version | 128GB | Fingerprint ID & Facial Recognition | Long-Lasting Battery (Cosmic Gray, 128GB)",
    "ratings": 27,
    "price": "$249.72",
    "image": "https://m.media-amazon.com/images/I/71DA4KTzV2L.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "Power of 5G: Get next-level power for everything you love to do with Samsung Galaxy 5G; Share more, game harder, experience more and never miss a beat     Single Take AI: Capture video and multiple types of images with one tap of the shutter button; Lenses, effects and filters capture the best of every moment, every time     Hi-Res Camera Zoom: Capture hi-res images as if you’re 3 feet away, from 100 feet away; Whether you want to zoom in close from afar or magnify details nearby, the new 30x Space Zoom gives you impressive power and clarity     Bright Night Mode: Capture crisp images and vibrant video in Bright Night mode and create high-quality content in low light – no flash needed     Super Fast Charging: Charge up quicker with Super Fast Charge so you can keep moving with more juice; Give your buds – or Galaxy buds – a boost of power with Wireless PowerShare right from Galaxy S20+ Plus 5G",
    "details": {
      "brand": "SAMSUNG",
      "operatingSystem": "android",
      "memoryStorageCapacity": "128 GB",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "Samsung Galaxy S20+ Plus 5G",
      "wirelessCarrier": "Unlocked",
      "cellularTechnology": "5G",
      "connectivity": "Wi-Fi",
      "color": "Cosmic Gray"
    }
  },
  {
    "id": "B0CV73SG4Z",
    "name": "SAMSUNG Galaxy S24 Ultra 5G S9280 Physical Dual SIM 512GB 12GB RAM AI Smartphone, Factory Unlocked, Global Model, Long Battery Life - Titanium Violet",
    "ratings": 70,
    "price": "$1,037.50",
    "image": "https://m.media-amazon.com/images/I/418KI8X9QBL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "Display Type: AMOLED; Width: 3. inches; Length: 6.8 inches; Height: 0.4 inches; Operating System: Android 11.0",
    "details": {
      "brand": "SAMSUNG",
      "operatingSystem": "Android 11.0",
      "memoryStorageCapacity": "12 GB",
      "screenSize": "N/A",
      "resolution": "1440 x 2960",
      "modelName": "N/A",
      "wirelessCarrier": "Unlocked",
      "cellularTechnology": "5G",
      "connectivity": "USB",
      "color": "N/A"
    }
  },
  {
    "id": "B08FXRTYPH",
    "name": "$30/mo. Mint Mobile Phone Plan with Unlimited Talk, Text & Data for 3 Months (3-in-1 SIM Card)",
    "ratings": 17.26,
    "price": "$45.00",
    "image": "https://m.media-amazon.com/images/I/61GjGBJErFL.__AC_SY300_SX300_QL70_FMwebp_.jpg",
    "description": "WHAT YOU GET: Three (3) months of unlimited talk, text, and data delivered on the nation’s largest 5G network. Data speeds reduce after 40GB of usage but data is unlimited. Videos stream at 480p.     OH, YOU GET THIS TOO: 5G for Free + 10GB of mobile hotspot + Wi-Fi calling and text + free international calls to Mexico and Canada + 7-day money back guarantee     HOW YOU GET IT: The SIM Kit comes with a 3-in-1 SIM card that includes standard/micro/nano sizes, insert the SIM into your device, and activate on the Mint Mobile website or app. You can activate service on your own unlocked device with our Bring Your Own Phone (BYOP) program. Check your coverage and phone compatibility on the Mint Mobile website.     WHO SHOULD GET IT: Anyone who hates their phone bill     WHY YOU SHOULD GET IT: Mint Mobile took what’s wrong with wireless and made it right. We re-imagined the wireless shopping experience and made it easy and online.     LEGAL STUFF: Capable device required. Coverage not available in all areas. New activation and upfront payment of 90 USD for 3-month plan (30/mo. equiv.) req’d; while supplies last. Intro rate for first 3 months only; then full-price plan options available. Restrictions apply. See full terms on Mint Mobile website.",
    "details": {
      "brand": "Mint Mobile",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "GSM",
      "connectivity": "N/A",
      "color": "N/A"
    }
  },
  {
    "id": "B0BSLF1ZN4",
    "name": "Samsung Galaxy S23 Ultra 5G SM-S918B/DS 256GB 12GB RAM, 200 MP Camera, Factory Unlocked, International Model (Green)",
    "ratings": 137,
    "price": "$748.92",
    "image": "https://m.media-amazon.com/images/I/71EYdOx09+L._AC_SY300_SX300_.jpg",
    "description": "Large Storage Capacity: 256GB UFS3.1 and 12GB RAM for ample space and smooth performance.     High-Resolution Camera: 200MP rear camera with multi-directional PDAF and OIS captures stunning photos and videos.     Long Battery Life: 5000mAh battery provides extended usage on a single charge.     Smooth Performance: Qualcomm Snapdragon 8 Gen 2 and Android 13 ensure fast and reliable operation.     Dual SIM: Supports dual SIM cards for convenience and flexibility.",
    "details": {
      "brand": "SAMSUNG",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "256 GB",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "Galaxy S23 Ultra 5G",
      "wirelessCarrier": "Unlocked for All Carriers",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "Green"
    }
  },
  {
    "id": "B0CRFB8HW4",
    "name": "SAMSUNG Galaxy A05 (128GB, 4GB) 6.7\" Dual SIM Fully Unlocked Global 4G LTE A055M/DS (Black)",
    "ratings": 159,
    "price": "$101.99",
    "image": "https://m.media-amazon.com/images/I/61UjBLFlH2L.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "4G LTE Bands: 1, 3, 5, 7, 8, 20, 28, 38, 40, 41 (GSM ONLY)     Packaging contains the cell phone, a USB C to USB C cable, and a sim tray ejector tool. Seller provides a USB C wall adapter.     Display: PLS LCD | 6.7 inches, 108.4 cm2 (~82.1% screen-to-body ratio) | 720 x 1600 pixels, 20:9 ratio (~262 ppi density)     Cameras: 50 MP, f/1.8, (wide), AF | 2 MP, f/2.4, (depth)     This device is compatible with any GSM carrier outside of the United States. In the United States, this device is only compatible with T-Mobile and their MVNO's(Mint, Ultra, Ting, Tello, etc.)     Width: 4. inches; Length: 6. inches; Height: 2. inches; Operating System: Android 13.0; Cpu Model Family: mediatek_helio",
    "details": {
      "brand": "SAMSUNG",
      "operatingSystem": "Android 13.0",
      "memoryStorageCapacity": "128 GB",
      "screenSize": "N/A",
      "resolution": "720 x 1600",
      "modelName": "Samsung Galaxy A05",
      "wirelessCarrier": "Unlocked",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "N/A"
    }
  },
  {
    "id": "B081GBB3NQ",
    "name": "Samsung Official 45W USB-C Super Fast Charging Wall Charger (Black)",
    "ratings": 1.874,
    "price": "$28.99",
    "image": "https://m.media-amazon.com/images/I/51iH8MHrCkL.__AC_SY300_SX300_QL70_FMwebp_.jpg",
    "description": "",
    "details": {
      "brand": "SAMSUNG",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "USB",
      "color": "Black"
    }
  },
  {
    "id": "B0D3216K2G",
    "name": "Samsung Galaxy Watch FE 40mm Bluetooth AI Smartwatch w/Fitness Tracking, BIA Sensor, Personalized HR Zones, Heart Rate Tracker, Sleep Monitor, 2024, Black [US Version, 1Yr Manufacturer Warranty]",
    "ratings": 187,
    "price": "$164.67",
    "image": "https://m.media-amazon.com/images/I/71EHTkDQqfL.__AC_SY300_SX300_QL70_FMwebp_.jpg",
    "description": "FITNESS TRACKING: Get performance insights on step counts, active minutes, calories burned and more; Your Watch automatically tracks everyday movements like walking and running — plus, it helps you manually track over 90 other exercises¹     KEEP YOUR BODY IN BALANCE: Get to know your body better with the BIA sensor² ¹; Use your Watch to get data on body fat, muscle mass, water levels and more, and use these insights to work on goals like muscle growth and improved hydration     HIT YOUR PERSONAL BEST: Work out at your preferred intensity using personalized heart rate zones³ with Galaxy AI; It tailors the data to you the more you use it so you both get better together     SMART HEART MONITORING : Galaxy Watch FE helps you keep an eye on your heart with ECG Monitoring & periodic heart rate measurements to detect irregularities⁴; Get a step ahead of your health by sharing these personalized readings with your doctor     A SLEEP COACH ON YOUR WRIST: Advanced Sleep Coaching with Galaxy AI⁵ helps you plan bedtime, detect snoring⁶ and understand & track your sleep stages (awake, light, deep, REM); Your sleep data & insights adapt to you the more you use it",
    "details": {
      "brand": "N/A",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "N/A"
    }
  },
  {
    "id": "B0D4WGL353",
    "name": "SAMSUNG Galaxy Buds 3 AI True Wireless Bluetooth Earbuds, Open Type Fit, Active Noise Cancellation, 360 Audio, Real-Time Interpreter, Touch Control, Silver [US Version, Amazon Exclusive 2Yr Warranty]",
    "ratings": 314,
    "price": "$149.99",
    "image": "https://m.media-amazon.com/images/I/51GobyVFywL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "ALL-NEW OPEN-TYPE DESIGN: Stay aware of your surroundings while listening from work to play with Galaxy Buds3 brand-new open-type fit without ear tips     ACTIVE NOISE CANCELLATION: Reduce unwanted sounds so you can listen to what you love     PERSONALIZED SOUND: The Adaptive Equalizer with Galaxy AI¹ tailors your sound based on how you wear your Buds so you can enjoy personalized sound on your work commute or as you're listening to a podcast while cooking     LIVE TRANSLATE AND REAL-TIME INTERPRETER: Hear translations through your Galaxy Buds while on calls or face-to-face conversations², when they say “hola”, you hear “hello”     CINEMATIC SOUND WITH 360 AUDIO: Enjoy your own personal theater experience at home with Galaxy Buds3 and hear every detail to the fullest with 360-degree immersive sound that feels like it’s all around you³     BUDS WITH STUNNING SOUND: A new boosted speaker delivers great bass and crystal clear sound to play Ultra High Quality (UHQ) Audio with up to a 24bit / 96kHz sample rate¹     TAKE RICH, HIGH-QUALITY CALLS: Experience a superior call quality with Super Wide Band Speech¹ that records and transmits voice at a 2x wider bandwidth (up to 16KHz) resulting in enhanced clarity and detail",
    "details": {
      "brand": "SAMSUNG",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "Silver"
    }
  },
  {
    "id": "B0B2SH4CN6",
    "name": "SAMSUNG Galaxy Buds2 Pro True Wireless Bluetooth Earbuds, Graphite, Hi-Fi Sound, 360 Audio, Active Noise Cancelling, Comfort Fit, HD Voice, IPX7 Water Resistant [US Version, 1Yr Manufacturer Warranty]",
    "ratings": 9.694,
    "price": "$159.99",
    "image": "https://m.media-amazon.com/images/I/61Qqg+T8nsL._AC_SX300_SY300_.jpg",
    "description": "Includes 1 year limited manufacturer warranty     THEY SAY “HOLA,” YOU HEAR “HELLO”: Now you can communicate freely with someone in another language; Use the Interpreter feature on your Galaxy phone to hear real-time translations through your Galaxy Buds during face-to-face conversations¹     PHONE TO EAR, TRANSLATIONS YOU HEAR: Phoning a relative back home or calling in reservations while traveling , break down language barriers w/ Galaxy Buds & Live Translate; Using the Samsung Phone app, hear real-time translations through your Buds¹     EVERY MOMENT SOUNDS EPIC: Studio quality sound isn’t just for the pros; Feel every note like you’re there with Galaxy Buds2 Pro² and get a next-level listening experience, whether you’re rocking out to your playlist or listening to a podcast     HEAR ONLY WHAT YOU WANT: Intelligent Active Noise Cancellation³ quiets even the loudest outside sounds; Tune in to what matters most without being bothered by distracting sounds around you     SOUND NEVER FELT SO RIGHT: Pop ‘em in and forget they’re there; Galaxy Buds2 Pro are designed to be even more comfortable than before and fit securely no matter what you’re doing, whether you’re working or working out     LIKE 3D FOR YOUR EARS: Amplify what you like; Minimize what you don’t; Enhanced 360-degree audio² brings out the tones you love from every angle for a personalized surround sound experience every time you pop them in",
    "details": {
      "brand": "SAMSUNG",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "Graphite"
    }
  },
  {
    "id": "B0CQKGGFCD",
    "name": "SAMSUNG Galaxy A15 5G (128GB, 4GB) 6.5\" 90Hz AMOLED, Octa-Core, 50MP Triple Camera, 4G Volte (Fully Unlocked for AT&T, T-Mobile, Verizon, Global) A156U (w/ 128GB SD Card, Blue Black)",
    "ratings": 251,
    "price": "$189.99",
    "image": "https://m.media-amazon.com/images/I/61YONEUDYLL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "6.5\" Super AMOLED, 1080x2340 (FHD+), 90Hz Refresh Rate, Android 14, One UI 6, Bluetooth 5.3, Charger not included     128GB, 4GB RAM, Expandable MicroSD, Mediatek Dimensity 6100+ (6 nm), Octa-core, Mali-G57 MC2 GPU, Fingerprint (side-mounted)     Rear Camera: 50MP, f/1.8 + 5MP, f/2.2 + 2MP, f/2.4, Front Camera: 13MP, f/2.0, 5000mAh Battery     2G: 850/900/1800/1900, 3G: 850/900/1700/2100/1900/2100, 4G: LTE 1/2/3/4/5/7/12/13/14/20/20/25/26/28/29/30/38/39/40/41/48/66/71, 5G: 2/5/41/66/77/78 - Single SIM - Single SIM     No Warranty. Compatible with Most GSM Carriers like T-Mobile, AT&T, MetroPCS, etc. Will Also work with CDMA Carriers Such as Verizon, Sprint.",
    "details": {
      "brand": "SAMSUNG",
      "operatingSystem": "Android 13.0",
      "memoryStorageCapacity": "4 GB",
      "screenSize": "N/A",
      "resolution": "1080 x 2340",
      "modelName": "A15",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "N/A"
    }
  },
  {
    "id": "B0CN3547M9",
    "name": "Samsung Chromebook Plus V2 2-in-1 12.2\" WUXGA LED Touchscreen Laptop, Intel Celeron 3965Y, 4GB RAM, 64GB eMMC, 2 Cameras, Stylus Pen, Island-Type KB, Wi-Fi 5, Chrome OS, Silver, 32GB USB Card",
    "ratings": 1.153,
    "price": "$269.00",
    "image": "https://m.media-amazon.com/images/I/71tVK5QB2GL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "【12.2\" WUXGA Touchscreen LED Display】Embark on a visual journey where vibrant colors and high resolution come to life at your fingertips. 【2-in-1 Design 】Convert to a tablet with the flip of a screen around a 360° hinge.     【Intel Celeron Processor 3965Y】The low voltage design optimizes energy usage, allowing you to stay productive and entertained with great efficiency. Seamlessly multitask between study materials, stream your favorite entertainment content, and browse the internet smoothly without any lag. Experience Intel performance with entertainment features and fast connectivity.     【4GB LPDDR3 RAM】Plenty of high bandwidth to run multiple programs simultaneously without any slowdowns. 【64GB eMMC】Massive storage space for your files, applications, and multimedia content, providing fast and reliable data access.     【Island-type Keyboard】The shape of Island-type keyboard — square with rounded corners — offers a high level of ergonomics that's naturally comfortable to use, making it a popular choice among people who type a lot.【Intel HD Graphics 615】Enjoy solid image quality that brings your everyday content to life with vibrant colors and sharp details.     【Chrome OS】Using Chrome OS let you connect effortlessly with colleagues in the cloud and easily access calendars, documents and other business data.【Dimensions & Weight】11.35\" x 8.2\" x 0.7\", 2.98 Lb. 【Ports and Accessories】1x USB 3.0, 2x USB-C, MicroSD Multi-media Card Reader, 1x Headphone out/Mic-in Combo, Internal Digital Dual Array Mic + Mono Mic, Built-in pen, 802.11 ac (2x2), Bluetooth 4.0, Samsung Bluetooth Mouse, 32GB Hotface USB Card.",
    "details": {
      "brand": "SAMSUNG",
      "operatingSystem": "Chrome OS",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "Samsung Chromebook Plus V2",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "Silver"
    }
  },
  {
    "id": "B0CW4FNHTC",
    "name": "SAMSUNG Galaxy S23 FE 5G (128GB, 8GB) 6.4\" AMOLED, Snapdragon 8 Gen 1 (US Model Fully Unlocked for Verizon, AT&T, T-Mobile, Global) S711U (w/Wireless Charger, Graphite)",
    "ratings": 9,
    "price": "$479.99",
    "image": "https://m.media-amazon.com/images/I/31QI6sOxxDL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "6.4 FHD+ Dynamic AMOLED 2X, Infinity-O Display (2400x1080), 403ppi, HDR10+ certified, 120Hz refresh rate     128GB ROM, 8GB RAM, Qualcomm SM8450 Snapdragon 8 Gen 1 5G (4 nm), Octa-core, 4500mAh Battery     Rear Camera: 50MP, f/1.8 (wide) + 8MP, f/2.4 (telephoto) 3x optical zoom + 12MP, f/2.2 (ultrawide), Front Camera: 10MP, f/2.4 (wide), Under Display Fingerprint     3G: 850/900/1700(AWS)/1900/2100, 4G LTE: 1/2/3/4/5/7/12/13/29/25/26/28/38/39/40/41/46/48/66/71, 5G: N41(2500),N66(AWS-3),N71(600),N78(3500),N260(39GHz),N261(28GHz) (ensure to check compatibility with your carrier before purchase)     Fully Unlocked US Model. Single SIM + eSIM. Compatible with Most GSM Carriers like AT&T, T-Mobile, MetroPCS, etc. Will Also work with CDMA Carriers Such as Verizon, and Sprint.     Width: 4.00 inches; Length: 6.00 inches; Height: 2.00 inches",
    "details": {
      "brand": "SAMSUNG",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "128 GB",
      "screenSize": "N/A",
      "resolution": "2400 x 1080",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "Graphite"
    }
  },
  {
    "id": "B0C1PRYPYX",
    "name": "SAMSUNG PRO Plus microSD Memory Card + Adapter, 512GB microSDXC, Up to 180 MB/s, Full HD & 4K UHD, UHS I, C10, U3, V30, A2, for Android Smartphones, Tablets, GoPRO, and DJI Drone (MB MD512SA/AM)",
    "ratings": 25.297,
    "price": "$44.99",
    "image": "https://m.media-amazon.com/images/I/61nIJnYeOPL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "YOUR NEW GO-TO CARD: Capture seamless 4K videos¹ on your compatible phone or drone, while expanded storage gives you the freedom to play more high-performance, intensive games on your tablet or gaming device     TAKE YOUR BURST SHOT: Fast U3, Class 10 rated read/write speeds up to 180/130MB/s²-³ let you shoot more photos faster and transfer with ease⁴; 4K videos look sharp with UHS-I, V30 rated speed and A2 rating provides more storage for apps and games     ADD SPACE, KEEP IT ALL: Huge capacities of 128GB, 256GB and 512GB give you plenty of storage space; Shoot as many long takes⁵-⁷ and high-resolution photos8-9 as you want, or load up on apps and media; Now you’ve got the room     YOU’RE FULLY PROTECTED: The PRO Plus takes on life’s adventures with water¹⁰, temperature¹¹, X-ray¹², magnet¹³, drop¹⁴, and wearout¹⁵ protection; You deserve reliable storage, backed by a 10-year limited warranty¹⁶-¹⁹     WORLD’S #1 FLASH MEMORY BRAND: Performance and reliability from the world’s #1 brand for flash memory since 2003¹⁸; All firmware and components are produced in-house, including our world renowned DRAM and NAND, for quality and you can trust",
    "details": {
      "brand": "SAMSUNG",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "512 GB",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "New Pro Plus MicroSD",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "N/A"
    }
  },
  {
    "id": "B0C63FSMWV",
    "name": "SAMSUNG Galaxy Z Flip5 AI Phone, 512GB Unlocked Android Smartphone, Compact, Foldable Design, One-Hand Control, Best Selfies, Full Cover Screen, Hands-Free Use, US Version, 2023, Mint",
    "ratings": 449,
    "price": "$799.99",
    "image": "https://m.media-amazon.com/images/I/61NKaFRAyRL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "GALAXY AI IS HERE: Search like never before¹, get real-time interpretation on a call², format your notes into a clear summary³, and effortlessly edit your photos⁴ - all from your smartphone, all with AI     PURSE, POCKET & PALM PERFECT: Flex the pocket-perfect and powerful Galaxy Z Flip5; With its innovative design, this compact phone is packed with a big personality     DO MORE SINGLE-HANDEDLY: With Flex Window, the large cover screen you can use while compact, Galaxy Z Flip5 single-handedly takes convenience to a whole new level; Simply reply to texts, change songs and snap photos with just one hand     CAPTURE IT ALL HANDS-FREE: In Flex Mode, record share-worthy video without holding your phone; Whether it’s your dance moves, an outdoor adventure or time with family, capturing life’s best moments is extremely easy with hands-free recording     LARGE SCREEN, EASIER ACCESS: With customizable widgets and a full cover screen, Galaxy Z Flip5 is always open even when it’s closed; Complete tasks in a flash, like sending texts, answering calls, accessing your calendar and even snapping selfies     PERSONALIZED FROM THE OUTSIDE IN: Unfold ultimate personalization with Flex Window on Galaxy Z Flip5; Decorate your cover screen with cute pet selfies, unique frames and customizable clock styles; Plus, access your favorite widgets in a flash     MULTIPLE ANGLES. PERFECT SHOTS: Take stunning selfies hands-free with Galaxy Z Flip5 open or closed; Capture more angles more ways — either in Flex Mode or with the full cover screen that allows you to use the best camera on Z Flip12",
    "details": {
      "brand": "SAMSUNG",
      "operatingSystem": "Android 13.0",
      "memoryStorageCapacity": "512 GB",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "Samsung Galaxy Flip5",
      "wirelessCarrier": "Unlocked for All Carriers",
      "cellularTechnology": "5G",
      "connectivity": "Cellular, Bluetooth, Wi-Fi, USB, NFC",
      "color": "Mint"
    }
  },
  {
    "id": "B0D9C8VNSN",
    "name": "SAMSUNG Galaxy Buds 3 Pro AI True Wireless Bluetooth Earbuds, Noise Cancelling, Sound Optimization, Real-Time Interpreter, Redesigned Comfort Fit Latin American Version (Silver)",
    "ratings": 47,
    "price": "$187.98",
    "image": "https://m.media-amazon.com/images/I/61sRwbWi5kL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "Compatibility & Battery Life: The Samsung Galaxy Buds 3 Pro are compatible with Android devices running Android 8.0 or later with at least 1.5GB RAM. They provide 5-8 hours of playback depending on Active Noise Cancellation (ANC) usage, and up to 18 hours with the charging case. The case supports wireless and wired charging, including Fast Charging technology for quick top-ups.     Audio Features: Equipped with Bluetooth 5.4, the Buds 3 Pro support SSC HiFi and UHQ audio codecs, delivering 24bit/96KHz audio for superior sound quality. They also include 360 Audio with Direct Multi-Channel for an immersive listening experience, especially when paired with Galaxy devices.     ANC & AI Features: The Buds 3 Pro feature improved Active Noise Cancellation (ANC) and advanced Galaxy AI, which enhances functionalities like real-time language translation, personalized sound profiles, and environment-based voice optimization. (Note: Galaxy AI features require a Samsung Galaxy device for full functionality).     Call Features: With enhanced Super Wideband (SWB) microphones and AI-based noise reduction, the Buds 3 Pro improve call clarity by filtering out surrounding noise and reconstructing lost voice bits, ensuring clear and uninterrupted communication even in noisy environments.Water & Sweat Resistance: These earbuds are IPX7-rated for water resistance, making them more suitable for workouts and outdoor use in varying weather conditions.     International Model without Domestic Warranty. Optimized Features: The Galaxy Buds 3 Pro are optimized for Android, particularly Samsung Galaxy devices, for advanced features such as 360 Audio, UHQ audio codecs, and real-time AI-based functionalities. While they are compatible with iOS devices via Bluetooth, certain features are exclusive to Galaxy Android devices.",
    "details": {
      "brand": "SAMSUNG",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "Silver"
    }
  },
  {
    "id": "B0C23ZHVQL",
    "name": "45W Super Fast Charger USB C Android Phone Charger Fast Charging Replacement for Samsung Galaxy S24 Ultra/S24/S24+/S23 Ultra/S23/S23+/S22 Ultra/S22+/S22, Galaxy Tab, PPS Charger & 6ft C Cable",
    "ratings": 1.801,
    "price": "$14.99",
    "image": "https://m.media-amazon.com/images/I/61yGmjxxulL.__AC_SY300_SX300_QL70_FMwebp_.jpg",
    "description": "",
    "details": {
      "brand": "PIOEVTKA",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "USB",
      "color": "N/A"
    }
  },
  {
    "id": "B0CQ3RRS23",
    "name": "SAMSUNG 14\" Galaxy Book4 Pro Laptop PC Computer, Intel Core 7 Ultra Processor 512GB, 3K AMOLED (2880 x 1800) Touchscreen, Advanced Security, 2024 Model, NP940XGK-KG1US, Moonstone Gray",
    "ratings": 26,
    "price": "$1,129.99",
    "image": "https://m.media-amazon.com/images/I/6131ZgIFn1L.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "POWER FOR YOUR MOST PRODUCTIVE DAYS: Breeze through every task with a powerful Intel processor; Intel Core Ultra 7 processor 155H; Enhanced with AI Intel ARC Graphics     POWERFUL. LIGHT. AMAZINGLY SLIM: Take premium power on the go with an ultralight and amazingly slim laptop; 16” Thickness: 12.5mm, Weight: 3.44 lbs; 14\" Thickness: 11.6mm, Weight: 2.71 lbs     BRACE YOURSELF FOR THE ULTIMATE SCREEN EXPERIENCE: Tackle what you need to do then kick back with what you love to do on a spacious 14\" or 16\" Dynamic AMOLED 2X touchscreen that’s bright, crisp and vivid     A PACKED BATTERY FOR YOUR STACKED DAYS: Achieve your goals – and more – with a long-lasting battery that goes the distance; 16”: 76Wh (Typical) 65W Adapter; 14”: 63Wh (Typical) 65W Adapter     OUR MOST ADVANCED GALAXY BOOK SECURITY YET: Have peace of mind while bringing your big ideas to life with our most advanced Galaxy Book security available; Secured Core PC; Secured by Knox",
    "details": {
      "brand": "SAMSUNG",
      "operatingSystem": "Windows 11 Home",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "Galaxy Book4",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "Gray"
    }
  },
  {
    "id": "B0BHJF2VRN",
    "name": "SAMSUNG 990 PRO SSD 1TB PCIe 4.0 M.2 2280 Internal Solid State Hard Drive, Seq. Read Speeds Up to 7,450 MB/s for High End Computing, Gaming, and Heavy Duty Workstations, MZ-V9P1T0B/AM",
    "ratings": 9.743,
    "price": "$109.99",
    "image": "https://m.media-amazon.com/images/I/61ZL9Qpo1-L.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "HUGE SPEED BOOST: Get random read/write speeds that are 40%/55% faster than 980 PRO; Experience up to 1400K/1550K IOPS, while sequential read/write speeds up to 7,450/6,900 MB/s reach near the max performance of PCIe 4.0*     BREAKTHROUGH POWER EFFICIENCY: Use less power and get more performance; Enjoy up to 50% improved performance per watt over 980 PRO, plus optimal power efficiency with max PCIe 4.0 performance**     SMART THERMAL CONTROL: Samsung's own nickel-coated controller delivers effective thermal control; With its slim size, 990 PRO is a perfect fit for desktops and laptops that meet the PCI-SIG D8 standard***     THE CHAMPION MAKER: Up to 65% improvement in random performance enables faster loads for an ultimate gaming experience on PS5 and DirectStorage PC games****     SAMSUNG MAGICIAN SOFTWARE: Get the most out of your SSD with Samsung Magician's advanced yet intuitive optimization tools; Monitor drive health, protect valuable data, and receive important updates for your 990 PRO     WORLD'S #1 FLASH MEMORY BRAND: Experience the performance and reliability from the world's #1 brand for flash memory since 2003; All firmware & components, including Samsung's world-renowned DRAM & NAND, are produced in-house*****",
    "details": {
      "brand": "SAMSUNG",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "PCIe Gen 4x4",
      "color": "Multicolor"
    }
  },
  {
    "id": "B0CMYBCV9D",
    "name": "Samsung Galaxy Official S24 Ultra Smart View Wallet Case, Black",
    "ratings": 1.523,
    "price": "$36.99",
    "image": "https://m.media-amazon.com/images/I/71XzdFSKvAL.__AC_SY300_SX300_QL70_FMwebp_.jpg",
    "description": "Samsung original covers are perfectly adapted to Samsung smartphones and their uses, thus combining protection, comfort and design in an ideal way.     Perfect for making your phone even more secure in your hand     Protected against damage from all sides     Easy to use and comfortable. It is scratch resistant and durable",
    "details": {
      "brand": "SAMSUNG",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "Black"
    }
  },
  {
    "id": "B0DHKQJ3HZ",
    "name": "USB C Car Charger 60W PD&QC3.0 Super Fast Car Charger Adapter JOYROOM Dual Port Car Phone Charger with 3.3ft 60W USB C Cable Fast Charging for iPhone 16 Samsung S24",
    "ratings": null,
    "price": "$19.99",
    "image": "https://m.media-amazon.com/images/I/71Qs1PO7TNL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "60W DUAL PORT CAR CHARGER FAST CHARGING: 60W(Max) super fast car charger usb c supports PD30W and QC3.0 30W high output and is compatible with PD3.0/QC3.0/AFC and FCP super fast charging protocol for all devices. JOYROOM USB c car charger, 10X faster than 2.4A charger, can rapidly charge iPhone 15 pro and Samsung Galaxy S23 from 0% to 80% in 35 minutes. Note: Best super fast charge partner 60W USB C-C Fast Charging Cable included.     EXTRA 3.3FT 60W USB C CABLE RIGHT FOR ALL Type C DEVICES: JOYROOM PD&QC 3.0 fast car charger adapter comes with 60W usb-C Nylon cable for you which support super fast charging for your Samsung Galaxy S23 S22 S21 Ultra/iPhone 16 Pro Max Plus     SMALLEST SIZE, FLUSH FIT: Tiny thumb-sized car charger fits most car cigarette lighters and barely protrudes past the edge of the outlet. It's JOYROOM smallest usb c car charger: lightweight and highly compact takes up no space in the car.     2024 New Upgraded cell car phone charger: JOYROOM All metal iPhone 15 pro max car charger is not only equipped with 3.3 ft 60w usb c cable, as well as the appearance of a soft LED colorful ambient light designed to help find the charging port more easily in the dark.     All Metal, Excellent Heat Dissipation: This dual port usb cigarette lighter adapter is designed with all-metal aluminum alloy, which not only has a textured appearance as well as more durable, but also the metal alloy material helps to improve the heat dissipation performance during the use of the car charger. Metal alloy car charger is safer than plastic car charger, reducing safety hazards.",
    "details": {
      "brand": "JOYROOM",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "USB C & Type C 60W Super Fast Car Charger",
      "color": "N/A"
    }
  },
  {
    "id": "B0DC5LFDTL",
    "name": "65w USB C Fast Charger 3 Ports with Foldable Plug Adapter Compatible for MacBook Pro/air, Ipad Pro, Charge for iPhone 16/15, Samsung Galaxy S24/s23, Google Pixel, and More",
    "ratings": null,
    "price": "$29.99",
    "image": "https://m.media-amazon.com/images/I/6163K1Ng5GL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "65W Fast Charging Efficiency: Single C1 or C2 port to get an impressive 65W Max charging power, which can charge for MacBook Pro 13 inch (2024/2022/2020) or charger for iPhone 16 pro max at full speed , easily from 2% to 55% in 30 minutes, High-speed charging for compatible devices such as phones, tablets, and laptops     3 in 1 Versatile Charger: Acceron 65w 3 ports usb fast charger provides intelligent current distribution to ensure you get the best charge, which can charge 3 devices (phones, tablets, and laptops) simultaneously, Use one charger to charge more devices, say goodbye to multiple chargers     Travel Friendly, Compact Design: A foldable plug provides more portability and a better travel experience, which is durable, compact and portable, perfect for easy storage, The 6-foot long USB C cable allows you to use your electronic devices comfortably while charging quickly     Wide Compatibility: Perfected to work with both PD & QC, PPS charging protocols for seamless use with your tablets, laptops, smartphones, and all USB-charged devices at the same time. 65w 3 ports usb fast charger block is compatible with Macbook Series, Dell XPS Series, Google Pixelbook, Microsoft Surface Book, iPhone Series, Samsung Series, Google Pixel Series, iPad Series, Galaxy Tab Series, AirPods, Apple Watch, Nintendo Switch, and More     Safe, Stable, and Durable: Utilizing GaN technology, this 65w USB C charger 3 ports has built-in intelligent chip multiple protection system to protect your devices from damage, avoid overvoltage, overcharging, overheating, charge your Phone/iPad/MacBook and more devices quickly, safely and stably     What You Get: Acceron 65w 3 ports usb foldable fast wall charger*1 and 6ft usb c charging cable 100w*1, We offer 2-year warranty, while 24*7 friendly customer support ensures your pleasing shopping experience. If you have any questions, please do not hesitate contact us",
    "details": {
      "brand": "Acceron",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "USB",
      "color": "white"
    }
  },
  {
    "id": "B0D6354JRF",
    "name": "Tile by Life360 Essentials (2024) - Bluetooth Trackers & Item Locators for Keys, Wallets, Remotes & More; Easily Find All Your Things. Both iOS and Android Compatible. 4-Pack (Mates/Slim/Sticker)",
    "ratings": 54,
    "price": "$74.99",
    "image": "https://m.media-amazon.com/images/I/61fzqBysxaL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "A VARIETY OF TRACKERS FOR YOUR THINGS: A selection of Tiles to help keep track of your keys, wallet, remotes, and more. Keep track of more for less with our multi-packs or give them to your friends and family as a gift     FIND YOUR THINGS: Ring your misplaced Tile, or track it down in the free app     FIND YOUR PHONE: Phone hiding under a cushion? Use your Tile to make it ring — even when silenced     STAY SAFE WITH SOS: Discreetly trigger an SOS alert to your loved ones in unsafe situations     USE WITH LIFE360: Add your Tiles to Life360 — a top family connection and safety app – to see everything and everyone on the same map     WORKS WITH iOS AND ANDROID: The free Tile app works for all households and individuals     TECH SPECS: Up to 350-foot / 105m Bluetooth range. Up to 3-year battery. Water resistant (IP68 rated)     GIVE THE GIFT OF FINDING: Tile is an easy and functional gift for family and friends",
    "details": {
      "brand": "Tile",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "N/A"
    }
  },
  {
    "id": "B0D636PJ52",
    "name": "Tile by Life360 Slim (2024) - Wallet Finder, Bluetooth Tracker and Item Locator for Luggage Tags, Passports and More. Both iOS and Android Compatible. Phone Finder. 2-Pack (Black)",
    "ratings": 56,
    "price": "$52.46",
    "image": "https://m.media-amazon.com/images/I/512vAv8pHiL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "OUR THINNEST TRACKER: Protect lost or stolen stuff and make family life easier. Slide into wallets, passports, luggage, and more     STAY SAFE WITH SOS: Discreetly trigger an SOS alert to your loved ones in unsafe situations     FIND YOUR THINGS: Ring your misplaced Tile, or track it down in the free app     FIND YOUR PHONE: Phone hiding under a cushion? Use your Tile to make it ring — even when silenced     USE WITH LIFE360: Add your Tiles to Life360 — a top family connection and safety app – to see everything and everyone on the same map     WORKS WITH iOS AND ANDROID: The free Tile app works for all households and individuals     TECH SPECS: 350-foot / 105m Bluetooth range. 3-year battery. Water resistant (IP68 rated)     GIVE THE GIFT OF FINDING: Tile is an easy and functional gift for family and friends",
    "details": {
      "brand": "Tile",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "N/A"
    }
  },
  {
    "id": "B0CTJMDRH3",
    "name": "Wireless Charging Station for Samsung, 3 in 1 Foldable Wireless Charger for Samsung Galaxy S24 Ultra/S24/S23 Ultra/S22/Note 20/iPhone 16 Pro Max, Galaxy Watch Ultra/7/6/5/4/Buds(Travel Essentials)",
    "ratings": 59,
    "price": "$39.99",
    "image": "https://m.media-amazon.com/images/I/71eVDcANN-L.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "All-in-One, Space-Saving: The Charging Station serves as a wireless charger for your phone, watch (for samsung watch only), and earbuds. Helping to declutter messy cords     Design Optimized for Travel: Its portable design makes it perfect for people on the go. Plus, the added convenience of a charger, cable, adapter and storage bag means that you can power all three of your devices simultaneously with ease     Adjustable Mood Lighting: Elevate your bedroom ambiance with our adjustable ambient lighting. With three lighting options (white light, flowing light, and meteor shower light), effortlessly create the perfect atmosphere for any mood. And for a peaceful sleep, easily turn off the light indicator with a simple button     Broad Compatibility: This 3-in-1 wireless charger is compatible with Samsung Galaxy phones, Galaxy Buds, and other wireless-charging-enabled phones and earbuds. The watch charging section is specifically designed for Galaxy Watch Ultra/7/6/6 Classic/5/5 Pro/4/4 Classic/3 and not be suitable for other brands of watches     What You Get: 1 * Charging station, 1 * QC3.0 Adapter, 1 *Charging cable, 1*Storage bag and 1 * User Manual. This cool stuff is not only suitable for your room, but also a great gift for Father's Day, Christmas, New Year or Birthday",
    "details": {
      "brand": "NeotrixQI",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "Wireless",
      "color": "Black-1"
    }
  },
  {
    "id": "B0BYNM8FZJ",
    "name": "Wireless Charger for Samsung Charging Station, 3 in 1 Android Phone Wireless Charger for Samsung Galaxy S24 Ultra/S23 Ultra/Z Flip 6/Fold 6/Buds, Charger for Galaxy Watch 7/6/5/4 (for Samsung Only)",
    "ratings": 5.21,
    "price": "$42.99",
    "image": "https://m.media-amazon.com/images/I/71VgghKrUyL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "✅【3 in 1 Wireless Charging Station】 --- Designed specifically for Samsung users. Whether you have S24 Ultra, earbud, or Galaxy watch 7/6/5 Pro, this charging station for samsung is perfect for charging them all in one spot, no more plug in and out troubles, no more fussing with cords and cables! Say hello to a simpler and more streamlined charging experience every time you use it.     ✅【Thoughtful Design】 --- Space-saving \"U-shaped\" design with a 3-level dimming option. The LED charging indicator keeps you informed about your device's charging status at a glance. Plus, the built-in memory battery ensures your data is safe even during power outages. And when no USB is plugged in, the clock automatically turns off after 10 minutes to conserve energy.     ✅【Case Friendly Charging Stand】 --- Our wireless charging stand is specifically engineered to charge your phone directly through protective cases up to 0.2 inch (5mm) thick. Say goodbye to the inconvenience of constantly removing and reattaching your phone case just to charge your device, simplifying your life in the way.     ✅【Safe and Efficient Wireless Charging Station】 --- This wireless charger is made of fire-resistant ABS material, providing multiple protections for your devices. With features like object detection, temperature control, over-voltage protection, and the carefully designed heat dissipation holes on the back prevent overheating during charging.     ✅【Wide Compatibility】 --- Compatible with both IOS and Android devices. Suitable for Samsung Galaxy Z Flip 6/5/4/Z Fold 6/5/4 /Z Fold 2/Z Fold 3/Z Flip/Z Flip 3/ for Samsung Galaxy S24 Ultra/S23 Ultra/S22/S22+/S22 Ultra/S21/S21+/S21 Ultra/S21/S20+/S20 Ultra/Note 20; iPhone 15 14 13 12 11 11 Pro Max/8 Plus; Google Pixel 6 Pro; Galaxy Buds 2 Pro/Buds/Buds+; AirP ods 3/2/Pro; Galaxy Watch 7/6/5/5 Pro/4 40mm 44mm/4 Classic/3/Active 2/1.Not compatible with Samsung A series. [e.g. Not for Samsung Galaxy A Series A73/A72/A71/A70/A53/A52/A51 A50/A02s/A10e/A11/A12/A20/A21/A21s/A31/A32/A41/ A42/A90]     ✅【What's in the box】 --- You will get 1 x 3 in 1 wireless charger, 1 x QC 3.0 Adapter, 1 x Type-C Cable(1.5m / 59inch length ), 1 x User Manual. This cool wireless charger stand is not only suitable for your nightstand, but also for home, office, travel, and other occasions.",
    "details": {
      "brand": "NeotrixQI",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "USB",
      "color": "Woodgrain"
    }
  },
  {
    "id": "B0B23P6NJQ",
    "name": "Wireless Charger for Samsung Charging Station, 3 in 1 Android Phone Wireless Charger for Samsung Galaxy S24 Ultra/S23 Ultra/Z Flip 6/Fold 6/Buds, Charger for Galaxy Watch Ultra/7/6/5/4/3 (Black)",
    "ratings": 5.21,
    "price": "$39.98",
    "image": "https://m.media-amazon.com/images/I/71XwDnfhkrL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "3 in 1 Wireless Charging Station - Designed specifically for Samsung users. Whether you have S24 Ultra, earbud, or Galaxy watch 7/6/5 Pro, this charging station for samsung is perfect for charging them all in one spot, no more plug in and out troubles, no more fussing with cords and cables! Say hello to a simpler and more streamlined charging experience every time you use it.     Thoughtful Design - Space-saving \"U-shaped\" design with a 3-level dimming option. The LED charging indicator keeps you informed about your device's charging status at a glance. Plus, the built-in memory battery ensures your data is safe even during power outages. And when no USB is plugged in, the clock automatically turns off after 10 minutes to conserve energy.     Case Friendly Charging Stand - Our wireless charging stand is specifically engineered to charge your phone directly through protective cases up to 0.2 inch (5mm) thick. Say goodbye to the inconvenience of constantly removing and reattaching your phone case just to charge your device, simplifying your life in the way.     Safe and Efficient Wireless Charging Station - This wireless charger is made of fire-resistant ABS material, providing multiple protections for your devices. With features like object detection, temperature control, over-voltage protection, and the carefully designed heat dissipation holes on the back prevent overheating during charging.     Wide Compatibility - Suitable for Samsung Galaxy Z Flip 6/5/4/Z Fold 6/5/4 /Z Fold 2/Z Fold 3/Z Flip/Z Flip 3/ for Samsung Galaxy S24 Ultra/S23 Ultra/S22/S22+/S22 Ultra/S21/S21+/S21 Ultra/S21/S20+/S20 Ultra/Note 20; iPhone 16 Pro Max/15/14/13/12/8 Plus;Galaxy Buds 2 Pro/Buds; Galaxy Watch Ultra/7/6/5/5 Pro/4//4 Classic/3/Active 2/1. Not compatible with Samsung A series. [e.g. Not for Samsung Galaxy A Series A73/A72/A71/A70/A53/A52/A51/A50/A02s/A10e/A11/A12/A20/A21/A21s/A31/A32/A41/ A42/A90]     What's in the box - You will get 1 x 3 in 1 wireless charger, 1 x QC 3.0 Adapter, 1 x Type-C Cable(1.5m / 59inch length ), 1 x User Manual. This cool wireless charger stand is not only suitable for your nightstand, but also for home, office, travel, and other occasions.",
    "details": {
      "brand": "NeotrixQI",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "USB",
      "color": "Black"
    }
  }
]