[
  {
    "id": "B09D2QC2RG",
    "name": "Samsung Electronics Galaxy Watch 4 44mm R870 Smartwatch GPS WiFi Bluetooth (International Model) (Black), (SM-R870)",
    "ratings": 901,
    "price": " ",
    "image": "https://m.media-amazon.com/images/I/61Nm6UgtUKL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "Do More Right From Your Wrist: Galaxy Watch4 works as an extension of your phone so you can talk, stream, and text from your wrist on the go     Google on Your Wrist: Tap into the power and convenience of select Google services and apps; Pay for coffee, get directions to the park, use Google Assistant or Bixby, and stream from YouTube Music     Timeless Design, Elevated Style: Show of your style with a luxurious and timeless watch design that’s great for any occasion; Personalize your look even more with a range of stylish watch faces and bands     Galaxy Watch SM-R870 44MM     Compatible with Android Phones Running Android 6.0 and Above. NOT compatible with iOS.",
    "details": {
      "brand": "SAMSUNG",
      "operatingSystem": "Android",
      "memoryStorageCapacity": "16000 MB",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "gps",
      "color": "N/A"
    }
  },
  {
    "id": "B07VNBC9Z9",
    "name": "SAMSUNG Galaxy Watch Active 2 (40mm, GPS, Bluetooth) Smart Watch with Advanced Health Monitoring, Fitness Tracking, and Long lasting Battery, Pink Gold (US Version)",
    "ratings": 8.169,
    "price": "$100.99",
    "image": "https://m.media-amazon.com/images/I/51ZP44Ue2BL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "Better insights to reach your fitness goals get more out of every mile thanks to built-in pace coaching on the Galaxy Watch Active2; Its advanced sensors keep your pace to help you better achieve your run goals     Comfortably sleek the Galaxy Watch Active2 is light enough to wear anywhere comfortably; It comes in aluminum or stainless steel and with a variety of faces, bands and finishes so it goes with anything. Compatible Devices - Samsung Smartphone, Non-Samsung Android Smartphone (Android OS 5.0 and above RAM 1.5GB and above), iOS 9.0 and above iPhone 5 and above     Keep your beat; You can see if your heart rate is where you want it with Galaxy Watch Active2. Get automatically alerted if your watch detects a high or a low heart rate. This device and related software are not intended for use in the diagnosis of disease or other conditions, or in the cure, Mitigation, treatment or prevention of disease     Level up your downtime; Galaxy Watch active2’s built in sleep tracker offers valuable insights on how to get a better night’s sleep. It also monitors your stress level and helps you recently with the integrated calm app. This device and related software are not intended for use in the diagnosis of disease or other conditions, or in the cure, mitigation, treatment or prevention of disease",
    "details": {
      "brand": "SAMSUNG",
      "operatingSystem": "Android,Ios",
      "memoryStorageCapacity": "4 GB",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "Bluetooth",
      "color": "N/A"
    }
  },
  {
    "id": "B0C7SVXRPH",
    "name": "SAMSUNG Galaxy Watch 4 44mm Smartwatch w/Bonus Band (Black), ECG Monitor Tracker for Health, Fitness, Running, Sleep Cycles, GPS Fall Detection & Bluetooth, US Version, Silver",
    "ratings": 6,
    "price": "$192.99",
    "image": "https://m.media-amazon.com/images/I/51zNA2DVHGL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "BONUS BAND INCLUDED: Swap bands to match your mood or outfit; This bundle brings you (1) Galaxy Watch4 44mm smartwatch with a silver band, plus (1) bonus band in black     BODY COMPOSITION ANALYSIS: Galaxy Watch4 Classic is the first smartwatch to off body composition data right on your wrist, On your own schedule, now you can get readings on body fat, skeletal muscle, body water, basal metabolic rate, and Body Mass Index*     BETTER SLEEP STARTS HERE: Wake up feeling refreshed and recharged with advanced sleep tracking; When you go to bed, your Galaxy Watch4 Classic sleep tracker starts monitoring your sleep and SpO2 levels continuously**     BE SMART ABOUT YOUR HEART: Take care of your heart with accurate ECG monitoring and keep an eye on possible atrial fibrillation, a common form of irregular heart rhythm; Share personalized readings with your doctor using the Samsung Health Monitor app on your compatible Galaxy phone***     MAKE EVERY WORKOUT COUNT: Get the most out of every exercise session with advanced workout tracking that recognizes 6 popular activities, from running to rowing to swimming, automatically in just 3 minutes****; Stay motivated by connecting to live coaching sessions via your smartphone or to dynamic Group Challenges with your friends     GO THE EXTRA MILE: Improve your runs with advanced running coaching technology; VO2 Max readings assess your oxygen levels to manage and track your heart and lung endurance*****     GOOGLE ON YOUR WRIST: Tap into the power and convenience of select Google services and apps right from your wrist; Pay for coffee; Get directions to the park; Use Bixby or Google Assistant for help on almost any topic; Stream your favorite tunes on YouTube******     EXTENSION OF YOUR PHONE: Galaxy Watch4 Classic works as an extension of your phone so you can do more while on the go; Talk, text, stream music and more just by tapping the watch on your wrist*******",
    "details": {
      "brand": "SAMSUNG",
      "operatingSystem": "Android",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "Galaxy Watch 4",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "Bluetooth, Wi-Fi",
      "color": "N/A"
    }
  },
  {
    "id": "B0C819WBYR",
    "name": "Samsung Galaxy Official Flap Eco-Leather Case for Z Flip5, Cream",
    "ratings": 188,
    "price": "$35.95",
    "image": "https://m.media-amazon.com/images/I/71ceKaTEzaL.__AC_SY300_SX300_QL70_FMwebp_.jpg",
    "description": "Case made from vegan leather     Good product with excellent quality     Brand :Samsung",
    "details": {
      "brand": "SAMSUNG",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "Cream"
    }
  },
  {
    "id": "B06Y1PLC3Y",
    "name": "TG Imaging Compatible Toner Cartridge Replacement for Samsung MLT-D118L Toner MLTD118L Work in Xpress M3015DW and Xpress M3065FW Printers (4,000 Pages per Cartridge,1-Pack Black)",
    "ratings": 196,
    "price": "$30.99",
    "image": "https://m.media-amazon.com/images/I/71tFRLoTx+L._AC_SY300_SX300_.jpg",
    "description": "Package Included: 1 Pack TG Imaging Compatible MLT-D118L Black Toner Cartridge, High Yield     Professional production of Toner and ink, to provide you with high-quality printing supply, at a more affordable price and better printing quality. Make your office easier.     Comaptible with Replacement for Samsung Xpress M3015DW M3065FW M3015DW/XAA M3065FW/XAA Printer     The use of compatible cartridges and supplies does not damage your printer. Please do not hesitate to contact us if you have any questions, our Customer Service Team will respond Very Soon     Page Yield: Toner up to 4,000 pages based on 5% coverage per Toner Cartridge (A4/Letter), High Yield",
    "details": {
      "brand": "TG Imaging",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "Black"
    }
  },
  {
    "id": "B096BMJPL8",
    "name": "SAMSUNG Galaxy Watch 4 Classic 42mm Smartwatch with ECG Monitor Tracker for Health, Fitness, Running, Sleep Cycles, GPS Fall Detection, LTE, US Version, Silver",
    "ratings": 257,
    "price": "$351.98",
    "image": "https://m.media-amazon.com/images/I/71VNyRYDQeL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "BODY COMPOSITION ANALYSIS: Galaxy Watch4 Classic is the first smartwatch to off body composition data right on your wrist, On your own schedule, now you can get readings on body fat, skeletal muscle, body water, basal metabolic rate, and Body Mass Index*     BETTER SLEEP STARTS HERE: Wake up feeling refreshed and recharged with advanced sleep tracking; When you go to bed, your Galaxy Watch4 Classic sleep tracker starts monitoring your sleep and SpO2 levels continuously**     BE SMART ABOUT YOUR HEART: Take care of your heart with accurate ECG monitoring and keep an eye on possible atrial fibrillation, a common form of irregular heart rhythm; Share personalized readings with your doctor using the Samsung Health Monitor app on your compatible Galaxy phone***     MAKE EVERY WORKOUT COUNT: Get the most out of every exercise session with advanced workout tracking that recognizes 6 popular activities, from running to rowing to swimming, automatically in just 3 minutes****; Stay motivated by connecting to live coaching sessions via your smartphone or to dynamic Group Challenges with your friends     GO THE EXTRA MILE: Improve your runs with advanced running coaching technology; VO2 Max readings assess your oxygen levels to manage and track your heart and lung endurance*****     GOOGLE ON YOUR WRIST: Tap into the power and convenience of select Google services and apps right from your wrist; Pay for coffee; Get directions to the park; Use Bixby or Google Assistant for help on almost any topic; Stream your favorite tunes on YouTube******     EXTENSION OF YOUR PHONE: Galaxy Watch4 Classic works as an extension of your phone so you can do more while on the go; Talk, text, stream music and more just by tapping the watch on your wrist*******",
    "details": {
      "brand": "N/A",
      "operatingSystem": "android 6.0",
      "memoryStorageCapacity": "16 GB",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "Bluetooth, Cellular",
      "color": "N/A"
    }
  },
  {
    "id": "B08J3Y4W5J",
    "name": "SAMSUNG Galaxy Buds Live True Wireless Bluetooth Earbuds w/ Active Noise Cancelling, Charging Case, AKG Tuned 12mm Speaker, Long Battery Life, US Version, Mystic Red",
    "ratings": 9.348,
    "price": " ",
    "image": "https://m.media-amazon.com/images/I/71qsNVFefKL.__AC_SY300_SX300_QL70_FMwebp_.jpg",
    "description": "SOUND THAT ROCKS: The AKG-tuned 12mm speaker and enhanced bass tone play everything in studio-quality sound. An open design creates a live listening environment, suiting those who prefer a natural, spacious sound.Note : If the size of the earbud tips does not match the size of your ear canals or the headset is not worn properly in your ears, you may not obtain the correct sound qualities or call performance. Change the earbud tips to ones that fit more snugly in your ear.Specific uses for product : Music     NEW STYLE. NEW SOUND: Equal parts earbuds and ear bling, Galaxy Buds Live come in three colors you’ll want to rock all day     TURN DOWN DISTRACTIONS: Turn on Active Noise Cancellation to block out background noise on an airplane, train or bus. Tap again to let in surrounding live sounds— colleagues’ voices, flight announcements, street traffic—while still enjoying your favorite playlist or podcast     LONG-LASTING BATTERY: Long-lasting battery life with a case that doubles as a wireless charger     ALWAYS-ON ASSISTANCE: Use your always-on voice assistant to order coffee, send a message or search music hands free     Features including Active Noise Canceling are enabled through Bluetooth connection or the Galaxy Wearable app on Android, available through Google Play Store, and the Galaxy Buds app on iOS devices, available through the App Store",
    "details": {
      "brand": "SAMSUNG",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "Mystic Red"
    }
  },
  {
    "id": "B07S18XXL5",
    "name": "SAMSUNG 15m One Invisible Connect Cable for QLED 4K & The Frame TVs (Newest Model) - White - VG-SOCR15/ZA",
    "ratings": 197,
    "price": "$124.95",
    "image": "https://m.media-amazon.com/images/I/815+b0R0lYL._AC_SX300_SY300_.jpg",
    "description": "The Samsung One Invisible Connection Cable Minimizes Clutter And Uses A Single, Near-Invisible Cable To Connect Your Qled To External Devices, Including The Power Source. The Result Is A Seamless Surface That Hides Cables And Integrates Beautifully In Your Home.     Extended Cable Length For A Clean Look: With 15M, The One Connect Box Can Be Positioned Out Of View. Reimagine Your Tv Where You Want It, Not Where It Plugs In.     Blends With Your Home: One Cord. No Clutter. Say Goodbye To Messy Tangled Wires. Hide All Your Device Connections With The One Invisible Connection Cable, And Your Space Will Never Be The Same.     Compatibility: 2020 TVs: QN43LS03TAFXZA, QN50LS03TAFXZA, QN55LS03TAFXZA, QN65LS03TAFXZA, QN75LS03TAFXZA     Compatibility: 2021 TVs:QN43LS03AAFXZA, QN50LS03AAFXZA, QN55LS03AAFXZA, QN65LS03AAFXZA, QN75LS03AAFXZA, QN85LS03AAFXZA     Compatibility: 2022 TVs: QN43LS03BAFXZA, QN50LS03BAFXZA, QN55LS03BAFXZA, QN65LS03BAFXZA, QN75LS03BAFXZA, QN85LS03BAFXZA",
    "details": {
      "brand": "SAMSUNG",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "N/A"
    }
  },
  {
    "id": "B0C79KRSNX",
    "name": "Samsung Galaxy Tab S9 FE Book Cover Keyboard Slim, Tablet Protector Case, Thin and Lightweight Design, Magnetic Back, PC-Like Experience, Wireless Keyboard Sharing, US Version, Black",
    "ratings": 84,
    "price": " ",
    "image": "https://m.media-amazon.com/images/I/61rjz1zIbfL.__AC_SY300_SX300_QL70_FMwebp_.jpg",
    "description": "STYLISHLY SLIM. INCREDIBLY PRACTICAL: With a slim and lightweight design, this tablet cover provides protection for your device while still maintaining a sleek and modern look     INSTALLS IN A SNAP: All you have to do is wrap it around your tablet like a book cover and magnets will hold it in place; There's even a compartment to serve as a holder for your S Pen     GET THE FULL KEYBOARD EXPERIENCE: The Book Cover Keyboard Slim has all you'd want from a keyboard; Pair your tablet and write emails or draft documents with ease; Combined with DeX Mode, the keyboard delivers a convenient PC-like experience     ENHANCE PRODUCTIVITY w/ WIRELESS SHARING: With Wireless Keyboard Sharing, connect to compatible Galaxy devices and type or navigate on them with ease;* It's like seamlessly switching to your phone and using it the same way as your tablet**     COMPATIBLITY: The Book Cover Keyboard Slim is compatible with Samsung Galaxy Tab S9 FE and Samsung Galaxy Tab S9 tablets (sold separately)",
    "details": {
      "brand": "SAMSUNG",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "USB",
      "color": "Black"
    }
  },
  {
    "id": "B08FXRTYPH",
    "name": "$30/mo. Mint Mobile Phone Plan with Unlimited Talk, Text & Data for 3 Months (3-in-1 SIM Card)",
    "ratings": 17.26,
    "price": "$45.00",
    "image": "https://m.media-amazon.com/images/I/61GjGBJErFL.__AC_SY300_SX300_QL70_FMwebp_.jpg",
    "description": "WHAT YOU GET: Three (3) months of unlimited talk, text, and data delivered on the nation’s largest 5G network. Data speeds reduce after 40GB of usage but data is unlimited. Videos stream at 480p.     OH, YOU GET THIS TOO: 5G for Free + 10GB of mobile hotspot + Wi-Fi calling and text + free international calls to Mexico and Canada + 7-day money back guarantee     HOW YOU GET IT: The SIM Kit comes with a 3-in-1 SIM card that includes standard/micro/nano sizes, insert the SIM into your device, and activate on the Mint Mobile website or app. You can activate service on your own unlocked device with our Bring Your Own Phone (BYOP) program. Check your coverage and phone compatibility on the Mint Mobile website.     WHO SHOULD GET IT: Anyone who hates their phone bill     WHY YOU SHOULD GET IT: Mint Mobile took what’s wrong with wireless and made it right. We re-imagined the wireless shopping experience and made it easy and online.     LEGAL STUFF: Capable device required. Coverage not available in all areas. New activation and upfront payment of 90 USD for 3-month plan (30/mo. equiv.) req’d; while supplies last. Intro rate for first 3 months only; then full-price plan options available. Restrictions apply. See full terms on Mint Mobile website.",
    "details": {
      "brand": "Mint Mobile",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "GSM",
      "connectivity": "N/A",
      "color": "N/A"
    }
  },
  {
    "id": "B0CDTVG4FH",
    "name": "Samsung Galaxy Watch 6 (R940) 44mm Silver",
    "ratings": 84,
    "price": "$169.99",
    "image": "https://m.media-amazon.com/images/I/61qUlIbdsyL.__AC_SY300_SX300_QL70_FMwebp_.jpg",
    "description": "Original brand product.     Two-year warranty against factory defects.     Water resistance depth : 50.0 meters     Human interface input : touch screen     Connectivity technology : Bluetooth     Item dimensions : 19.69 inches     Item shape : Round",
    "details": {
      "brand": "SAMSUNG",
      "operatingSystem": "Android",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "Samsung Galaxy",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "Bluetooth, Wi-Fi",
      "color": "N/A"
    }
  },
  {
    "id": "B06Y1WKKLL",
    "name": "TG Imaging Compatible MLTR116 Imaging Drum Replacement for Samsung MLT-R116 MLT-D116L MLT-D118L (1xDrum)",
    "ratings": 125,
    "price": "$22.99",
    "image": "https://m.media-amazon.com/images/I/41A10lTi9IL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "Package Included: MLT-R116 x1 (DRUM UNIT)     Toner cartridges (MLT-D116L) are SOLD SEPARATELY     Color: Black     Printers: M2835DW, Xpress M2625, Xpress M2625D, Xpress M2626, Xpress M2825DW, Xpress M2825ND, Xpress M2826, SL-M2885FW/XAA, Xpress M2675, Xpress M2675F, Xpress M2675FN, Xpress M2676, Xpress M2875, Xpress M2875FD, Xpress M2875FW, Xpress M2876     Yields up to 9,000 pages @ 5% coverage",
    "details": {
      "brand": "TG Imaging",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "Black"
    }
  },
  {
    "id": "B07B99FMQ2",
    "name": "Samsung Galaxy S9, 64GB GSM Unlocked 4G LTE Smartphone (Midnight Black) - International Version",
    "ratings": 25,
    "price": "$319.99",
    "image": "https://m.media-amazon.com/images/I/51Znhx0t-zL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "5.8-inch Super AMOLED Capacitive Touchscreen, 1440 x 2960 pixels with Corning Gorilla Glass 5     Android OS, Qualcomm Snapdragon 845, Octa-Core (4x2.7 GHz & 4x1.7 GHz), Adreno 630     Internal Memory: 64GB, 4GB RAM - microSD Up to 400GB     12MP Camera with f/1.5-2.4, 26mm lens, Dual Pixel PDAF & 8MP Front Camera with f/1.7, 25mm lens, Auto HDR     Non-Removable 3,000mAh Lithium Ion Capacity",
    "details": {
      "brand": "SAMSUNG",
      "operatingSystem": "Android 8.0",
      "memoryStorageCapacity": "64 GB",
      "screenSize": "N/A",
      "resolution": "1440 x 2960",
      "modelName": "Galaxy S9",
      "wirelessCarrier": "Unlocked",
      "cellularTechnology": "LTE",
      "connectivity": "Wi-Fi",
      "color": "Black"
    }
  },
  {
    "id": "B08DH43LWY",
    "name": "Samsung Galaxy Watch3 2020 Smartwatch (Bluetooth + Wi-Fi + GPS) International Model (Black, 45mm)",
    "ratings": 202,
    "price": "$49.95",
    "image": "https://m.media-amazon.com/images/I/61TQlPWrsIS.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "1.4 \"(34.5mm) Super AMOLED, 360 x 360px Resolution, 16M Colors, CPU: Dual-Core 1.15GHz, 340mAh Battery, Tizen OS, Bluetooth, Wi-Fi     The Galaxy Watch3 uses red LEDs and infrared rays to calculate your SpO2 levels or the amount of oxygen in your blood.     Sensors: Accelerometer, Barometer, Gyro Sensor, Light Sensor, Optical Heart Rate Sensor. The only smartwatch with a precise rotating bezel for navigating between apps     5 ATM/IP68 The water and dust resistance rating, Military-grade durability, Larger screen but lighter and thinner for more comfort.     International Model No Warranty in the US. Compatible with Android and iOS devices. Samsung Pay - Not Supported.",
    "details": {
      "brand": "N/A",
      "operatingSystem": "Android",
      "memoryStorageCapacity": "4000 MB",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "Wireless",
      "color": "N/A"
    }
  },
  {
    "id": "B0BGT9MJ4P",
    "name": "SAMSUNG Galaxy Watch Active 2 (44mm, GPS, Bluetooth, Unlocked LTE) Smart Watch with Advanced Health Monitoring, Fitness Tracking, and Long Lasting Battery, US Version, Aqua Black (Renewed)",
    "ratings": 15,
    "price": "$49.95",
    "image": "https://m.media-amazon.com/images/I/71-ICH1dSoL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "Samsung Galaxy watches feature the Tizen OS. Samsung’s proprietary OS is flexible. If your organization has a mix of Android and non-Android smarphones, the Tizen-equipped Samsung watches will be compatible with all devices. ch Active2. Its advanced sensors keep your pace to help you better achieve your run goals.     Comfortably sleek the Galaxy Watch Active2 is light enough to wear anywhere comfortably. It comes in aluminum casing and with a variety of faces, bands and finishes so it goes with anything.     Keep your beat. You can see if your heart rate is where you want it with Galaxy Watch Active2. Get automatically alerted if your watch detects a high or a low heart rate. This device and related software are not intended for use in the diagnosis of disease     LTE Unlocked (carrier agnostic) - With LTE connectivity, you can leave your phone behind. Bundle Ghost Manta $69 Value accessories : Type-C to USB Cable | Type-C to Type-C Cable | Power Adapter | USB C to USB Adapter | 360° Rotation Phone Ring Holder.     Battery built for endurance The Galaxy Watch active2’s long-lasting battery can go for more than a day on a single charge, and you can always get a quick boost from your compatible Galaxy phone with wireless power share. Works with Qi compatible Samsung. Typical Usage-3~4 hours",
    "details": {
      "brand": "SAMSUNG",
      "operatingSystem": "Android",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "galaxy",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "Bluetooth, Wi-Fi",
      "color": "N/A"
    }
  },
  {
    "id": "B0D1W3N2RB",
    "name": "SAMSUNG Galaxy Z Fold 6 S Pen Phone Case, Protective Cover with Built-in S Pen Holder Slot, Click to Release, US Version, EF-OF95PCJEGUS, Gray",
    "ratings": 63,
    "price": "$77.18",
    "image": "https://m.media-amazon.com/images/I/71mpFvOS-DL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "SLEEK. SLIM. STYLISH: Complete your creative & productive powerhouse with the Z Fold6 S Pen Case; Whip out the included S Pen to edit & create directly on your Z Fold6; Then slide the S Pen back in place, fold up the case and put it in your pocket     YOUR S PEN IS ALWAYS WITHIN REACH: Store your S Pen with ease; Click and release the built-in S Pen to transform your Z Fold6 into a productivity powerhouse; Then slide it back in place, and off you go     DEVICE COMPATIBILITY: The Samsung Galaxy Z Fold6 S Pen Case is compatible with the Samsung Galaxy Z Fold6 cell phone and Z Fold6 S Pen (sold separately)",
    "details": {
      "brand": "SAMSUNG",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "Gray"
    }
  },
  {
    "id": "B015JQ62RY",
    "name": "Samsung Gear S2 Smartwatch - Dark Gray",
    "ratings": 3.128,
    "price": "$119.99",
    "image": "https://m.media-amazon.com/images/I/61eCv1E5Y4L.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "Send and receive texts, calendar notifications, news updates and more right on your wrist and Battery performance may vary depending on network conditions and configuration, and device usage     With rotating bezel and unique circular interface, easily access your apps and notifications.OS Tizen based wearable platform.Processor speed Dual core 1GHz exynos 3250     With a circular design and stainless steel construction, the Gear S2 matches your style     Thousands of third party apps available     Interchangeable bands and hundreds of available watch faces; Please refer the User Manual before use; It doesn't have speakers, hence use Level U bluetooth headphones to hear music",
    "details": {
      "brand": "SAMSUNG",
      "operatingSystem": "android",
      "memoryStorageCapacity": "4 GB",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "Bluetooth",
      "color": "N/A"
    }
  },
  {
    "id": "B09D2MR29Z",
    "name": "Samsung Electronics Galaxy Watch 4 Classic R890 46mm Smartwatch GPS WiFi (International Model) (Silver)",
    "ratings": 136,
    "price": "$179.99",
    "image": "https://m.media-amazon.com/images/I/51QxkF3YnyL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "Keep Crushing Your Day: Put the phone features you need right on your wrist and stay connected to calls, texts, notifications, and music streaming, all accessible with a simple tap     Google on Your Wrist: Tap into the power and convenience of select Google services and apps; Pay for coffee, get directions to the park, use Google Assistant or Bixby, and stream from YouTube Music     Fashion Meets Function: Sleek, lightweight and customizable, Galaxy Watch 4 is made to move with you while working out and matches your mood and outfit with bands plus a variety of faces.     Samsung Galaxy Watch4 Classic SM-R890 46MM     Compatible with Android Phones Running Android 6.0 and Above. NOT compatible with iOS.",
    "details": {
      "brand": "SAMSUNG",
      "operatingSystem": "Android",
      "memoryStorageCapacity": "16000 MB",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "gps",
      "color": "N/A"
    }
  },
  {
    "id": "B0CPZX91MR",
    "name": "ZAGG InvisibleShield Fusion XTR3 Samsung Galaxy S24 Screen Protector - Hybrid Polymer, Hexiom Impact, Advanced Blue Light Filter, Anti-Reflective, Recycled Materials, EZ Apply Installation",
    "ratings": 111,
    "price": "$51.99",
    "image": "https://m.media-amazon.com/images/I/715FUO2TUZL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "UNBREAKABLE HYBRID POLYMER: Experience the durability of our flexible hybrid polymer, engineered for unbreakable protection, feeling just like glass     HEXIOM IMPACT TECHNOLOGY: Advanced shock-absorbing technology offering superior impact and scratch resistance to safeguard your screen     ADVANCED EYESAFE BLUE LIGHT FILTRATION: Features RPF60 technology to filter out harmful blue light, enhancing eye comfort while maintaining true screen colors     ANTI-REFLECTIVE & HIGH-DEFINITION CLARITY: Innovative treatment significantly reduces reflections and enhances screen clarity and color vibrancy for an authentic viewing experience     ECO-FRIENDLY & PRECISION FIT: Crafted with up to 100% recycled materials, designed for a precise, anti-dust installation with our EZ Apply system",
    "details": {
      "brand": "ZAGG",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "N/A"
    }
  },
  {
    "id": "B0CPJ1QBMR",
    "name": "amFilm Auto-Alignment OneTouch for Samsung Galaxy S24 Ultra 6.8'' Screen Protector + Camera Lens Protector, Tempered Glass, 30 seconds Installation, Bubble Free, Case Friendly, Anti-Scratch [2+2 Pack]",
    "ratings": 14.649,
    "price": "$7.89",
    "image": "https://m.media-amazon.com/images/I/71iw+Mv8+XL._AC_SX300_SY300_.jpg",
    "description": "💎【Ultra-Fast Installation, Auto-Alignment in 30 seconds!】 Installing a screen protector might seem like a headache, but our OneTouch Samsung Galaxy s24 ultra screen protector is equipped with an automatic alignment kit for a fast installation in just 30 seconds! Say goodbye to the hassle of manual alignment.     💎【Indestructible Ultra 9H Glass for Ultimate Protection】Our Samsung Galaxy S24 ultra tempered glass screen protector leads the market with Ultra-high 9H hardness for maximum resistance against impacts and scratches from objects. No matter you’re daily routine, your phone is safely protected. Give your device that extra layer of sturdy protection it deserves!     💎【Anti-Fingerprint Resistance for a Cleaner Screen】Annoyed by fingerprints? Our Samsung Galaxy S24 Ultra screen protector comes with a transparent layer that is hydrophobic and oil repellent. After testing, they effectively prevented 99.99% of fingerprints caused by sweat and oil stains.     💎【Ultra-Clear and Ultra-Sensitive】Our Samsung Galaxy S24 Ultra screen protector uses high-quality materials and advanced coating technology to provide a clear, visual experience, ensuring smooth screen touching and sensitive response. Whether swiping, tapping or gaming, you can enjoy a seamless experience without delay or lag.     💎【Screen Protector Compatible with Samsung Galaxy S24 Ultra 6.8\"】 Specially designed ONLY for Samsung Galaxy S24 Ultra 6.8\". Not compatible with any other Phone models.",
    "details": {
      "brand": "amFilm",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "N/A"
    }
  },
  {
    "id": "B0DC5LFDTL",
    "name": "65w USB C Fast Charger 3 Ports with Foldable Plug Adapter Compatible for MacBook Pro/air, Ipad Pro, Charge for iPhone 16/15, Samsung Galaxy S24/s23, Google Pixel, and More",
    "ratings": null,
    "price": "$29.99",
    "image": "https://m.media-amazon.com/images/I/6163K1Ng5GL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "65W Fast Charging Efficiency: Single C1 or C2 port to get an impressive 65W Max charging power, which can charge for MacBook Pro 13 inch (2024/2022/2020) or charger for iPhone 16 pro max at full speed , easily from 2% to 55% in 30 minutes, High-speed charging for compatible devices such as phones, tablets, and laptops     3 in 1 Versatile Charger: Acceron 65w 3 ports usb fast charger provides intelligent current distribution to ensure you get the best charge, which can charge 3 devices (phones, tablets, and laptops) simultaneously, Use one charger to charge more devices, say goodbye to multiple chargers     Travel Friendly, Compact Design: A foldable plug provides more portability and a better travel experience, which is durable, compact and portable, perfect for easy storage, The 6-foot long USB C cable allows you to use your electronic devices comfortably while charging quickly     Wide Compatibility: Perfected to work with both PD & QC, PPS charging protocols for seamless use with your tablets, laptops, smartphones, and all USB-charged devices at the same time. 65w 3 ports usb fast charger block is compatible with Macbook Series, Dell XPS Series, Google Pixelbook, Microsoft Surface Book, iPhone Series, Samsung Series, Google Pixel Series, iPad Series, Galaxy Tab Series, AirPods, Apple Watch, Nintendo Switch, and More     Safe, Stable, and Durable: Utilizing GaN technology, this 65w USB C charger 3 ports has built-in intelligent chip multiple protection system to protect your devices from damage, avoid overvoltage, overcharging, overheating, charge your Phone/iPad/MacBook and more devices quickly, safely and stably     What You Get: Acceron 65w 3 ports usb foldable fast wall charger*1 and 6ft usb c charging cable 100w*1, We offer 2-year warranty, while 24*7 friendly customer support ensures your pleasing shopping experience. If you have any questions, please do not hesitate contact us",
    "details": {
      "brand": "Acceron",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "USB",
      "color": "white"
    }
  },
  {
    "id": "B0DFP17H38",
    "name": "SHEZI [Upgrade 4 in 1 Charging Cable, 60W [Full Chrager Only 0.8h][1GB Transfer Only 12s] Flat Silicone Multi Fast Charge Phone Cord with USB A/Type C/Light-ning for iPhone iPad Samsung, 5FT",
    "ratings": 13,
    "price": "$26.99",
    "image": "https://m.media-amazon.com/images/I/71-hxCuleiL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "Unique Liquid Silicone Material: Our usb c cable use the latest liquid silicone rubber as a material to make the cable softer, stronger, more resistant to dirt, is able to fully withstand stress and it feels incredibly soft between your fingers and is one of the strongest cables ever made. It won't get tangled even when tucked into a bag or pocket, making it perfect for carrying around.     4-in-1 Versatile Simplify Design: Our usb to usb c cable has different ports, including Light-ning/USB A/Type C connectors. Support to charge 99% phones available on the market. It's super handy to carry and meets all your demands on families, travel or work, business trips, and other occasions. ﻿     Fastest Charging in History: Our usb c to light-ning cable can charge your device at the fastest speed. Fully charge a iPhone 15 pro to 96%, a Switch to 90%, a Samsung S23 to 96%, a MacBook Pro to 86% and an iPad Pro to 89% in 35 minutes. NOTE: Please use a charger with the corresponding wattage or higher that our product could output maximum power.     Super Fast Data Transfer: Supports the USB 2.0 standard with unmatched data transfer speed up to maximum 480Mbps. This usbc cable is compatible with USB2 devices and transfer music, movies, or videos in seconds at maximum 480Mbps, 1GB files transfer only 12s.     Support CarPlay & Android Auto: This usb c to usb c cable 100% supports both Android Auto and Carplay which charging and navigating at the same time. Whether you have the usb c or light-ning port devices in your car, we can perfectly work for you. So no longer need to carry cables for each device, make you life more convenient.     Ultra High-Quality Assurance: This usb a to usb c cable has been tested to withstand at least 10,000 cycles of 90-degree bend and 10,000 plugging and unplugging lifespan which is 12 times stronger than all original cables, its zinc alloy cable housing is highly resistant to wear and scratches. You don't need to replace the charging cable within 3 years.     More Promise Less Concern: If you encounter any issues with your usb to light-ning cable, contact us via Amazon Message Center. Our dedicated customer support team is available to assist you with any questions or concerns you may have within 12 hours.",
    "details": {
      "brand": "SHEZI",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "USB",
      "color": "Green"
    }
  },
  {
    "id": "B09W2SPRDG",
    "name": "Super Fast Charger Type C, 25W USB C Wall Charger Fast Charging for Samsung Galaxy S24 Ultra/S24/S24+/S23 Ultra/S23/S22 Ultra/S22/S21 Ultra/S20 Ultra/Note 20 with 10FT Long Type C Charger Cable 2Pack",
    "ratings": 11.669,
    "price": "$16.99",
    "image": "https://m.media-amazon.com/images/I/61bzII2gzKL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "Small & Powerful: With 25W charging power but smaller size, this Samsung charger fast charging cord is more convenient and portable. Equipped with a type c port, you can charge your device back to full power in no time by using the 25W USB C fast charger for Samsung Galaxy S24 series. It only takes 30min to charge your Samsung Galaxy S24/S23 ultra from 0 to 60%, 5 times as fast as standard USB C charger.     10FT Type C Charger Fast Charging: The 25W android phone charger fast charging is equipped with extra longer 10FT USB C fast charger cable, offering a user-friendly reversible design and longer charging distance, fast charging and up to 480 Mbps data transfer speed. The power output up to 3 Amp and 100-240 volt input of this 2pack Samsung fast chargers can charge two devices simultaneously, ideal for worldwide travel with your partner!     Safety Assurance: The Samsung galaxy S24 S23 ultra super fast charger is built in intelligent chips, which can protect your devices against damage caused by short circuit, over-current, over-voltage, over-heating, and over-charging issues. Automatically stops charging when battery capacity is full to ensure your device safety and longevity.     Super Fast Charger Universal Compatibility: The android charger fast charging supports most of android usb c devices, including Samsung Galaxy S24 Ultra/S24/S24+/S23 Ultra/S23/S23+/S21/ S21+/ S21 Ultra 5G/ S22/S22+/S22 Ultra/Note10/ 10+, Note 20/20 Ultra 5G, S20/S20+/S20 Ultra 5G/ S20 FE(Fan Edition) 5G, S10, S10+, etc.     What's in Package: 2x 25W USB C fast charger blocks and 2x extra long 10FT USB C fast charging cables.",
    "details": {
      "brand": "Vilive",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "Powerline",
      "color": "Black"
    }
  }
]