[
  {
    "id": "B0CT45DH2H",
    "name": "SAMSUNG Galaxy S24 Ultra SM-S928B/DS 12GB 256GB Dual Sim Factory Unlocked International Model (Titanium Grey)",
    "ratings": 76,
    "price": "$945.00",
    "image": "https://m.media-amazon.com/images/I/51EldjH4K8L.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "Galaxy AI, circle to Search with Google, Ai Hels you translate on your next phone call. Phot Assist has AI-enhanced HDR previews & AI-powered editing.     Display type: Dynamic AMOLED Screen size: 6.8\" inches Screen-to-body ratio: ~89.5% (screen-to-body ratio), Display resolution: 1440x3088 pixels , Touchscreen :Capacitive Multitouch 10-points , Pixel density (dot pitch): 501 PPI Colors 16 million , Scratch-resistant glass : Gorilla Glass Victus 2 , Refresh rate: 120Hz Display features:1750nits[peak] HDR10+ Always-On Display     Rear Camera: 200 MP, f/1.7, 24 mm ( Wide-angle ), 0.6 μm, 1/1.3\" Sensor size Laser Autofocus Multi-Directional PDAF Optical Image Stabilization (OIS) 10 MP, f/4.9, 230 mm ( Periscope telephoto ), 1.12 μm, x10 optical zoom, 1/3.52\" Sensor size Dual Pixel Autofocus (PDAF) Optical Image Stabilization (OIS) 10 MP, f/2.4, 70 mm ( Telephoto ), 1.12 μm, x3 optical zoom, 1/3.52\" Sensor size Dual Pixel Autofocus (PDAF) Optical Image Stabilization (OIS) 12 MP, f/2.2, 13 mm ( Ultra-Wide angle ), 1.4 μm, 1/2.55\" Sensor size Dual Pixel Autofocus (PDAF) Super Steady Video     Front Camera: Single camera 12 MP, f/2.2, 26 mm ( Wide-angle ) Dual Pixel Autofocus (PDAF) Features Auto-HDR Dual video call HDR10+ Video support Yes Video resolution 2160p @ 30/60 fps 1080p @ 30 fps Video features Dual video call     LTE BANDS.5G: N1, N3, N5, N8, n28, n40, n41, n77, n78 4G LTE: 1, 2, 4, 5, 12, 48, 66 ,1, 3, 7, 8, 13, 18, 19, 20, 25, 26, 28, 38, 39, 40, 41, 66     Snapdragon 888 Gen 3, Battery 5000 mah , 12GB Ram, 256 GB storage",
    "details": {
      "brand": "SAMSUNG",
      "operatingSystem": "Android 14",
      "memoryStorageCapacity": "256 GB",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "Galaxy S24 Ultra Dual SIM",
      "wirelessCarrier": "Unlocked",
      "cellularTechnology": "5G",
      "connectivity": "N/A",
      "color": "Grey"
    }
  },
  {
    "id": "B0CV31FT2V",
    "name": "Samsung Galaxy A15 (SM-155M/DSN), 128GB 6GB RAM, Dual SIM, Factory Unlocked GSM, International Version (Ring Grip Case Bundle) (Blue Black)",
    "ratings": 269,
    "price": "$164.49",
    "image": "https://m.media-amazon.com/images/I/31KxYNFW0CL.__AC_SY300_SX300_QL70_FMwebp_.jpg",
    "description": "4G LTE Bands: 1, 3, 5, 7, 8, 20, 28, 38, 40, 41 (GSM ONLY)     Packaging contains the cell phone, a USB C to USB C cable, and a sim tray ejector tool. Seller provides a USB C wall adapter.     Display: Super AMOLED, 90Hz, 800 nits (HBM) | 6.5 inches, 103.7 cm2 (~84.3% screen-to-body ratio) | 1080 x 2340 pixels, 19.5:9 ratio (~396 ppi density)     Cameras: 50 MP, f/1.8, (wide), AF | 5 MP, f/2.2, (ultrawide) | 2 MP, f/2.4, (macro)     This device is compatible with any GSM carrier outside of the United States. In the United States, this device is only compatible with T-Mobile and their MVNO's(Mint, Ultra, Ting, Tello, etc.)     Operating System: Android; Cpu Model Family: mediatek_helio",
    "details": {
      "brand": "SAMSUNG",
      "operatingSystem": "Android",
      "memoryStorageCapacity": "128 GB",
      "screenSize": "N/A",
      "resolution": "1080 x 2340",
      "modelName": "Samsung Galaxy A15",
      "wirelessCarrier": "Unlocked",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "N/A"
    }
  },
  {
    "id": "B08FXRTYPH",
    "name": "$30/mo. Mint Mobile Phone Plan with Unlimited Talk, Text & Data for 3 Months (3-in-1 SIM Card)",
    "ratings": 17.26,
    "price": "$45.00",
    "image": "https://m.media-amazon.com/images/I/61GjGBJErFL.__AC_SY300_SX300_QL70_FMwebp_.jpg",
    "description": "WHAT YOU GET: Three (3) months of unlimited talk, text, and data delivered on the nation’s largest 5G network. Data speeds reduce after 40GB of usage but data is unlimited. Videos stream at 480p.     OH, YOU GET THIS TOO: 5G for Free + 10GB of mobile hotspot + Wi-Fi calling and text + free international calls to Mexico and Canada + 7-day money back guarantee     HOW YOU GET IT: The SIM Kit comes with a 3-in-1 SIM card that includes standard/micro/nano sizes, insert the SIM into your device, and activate on the Mint Mobile website or app. You can activate service on your own unlocked device with our Bring Your Own Phone (BYOP) program. Check your coverage and phone compatibility on the Mint Mobile website.     WHO SHOULD GET IT: Anyone who hates their phone bill     WHY YOU SHOULD GET IT: Mint Mobile took what’s wrong with wireless and made it right. We re-imagined the wireless shopping experience and made it easy and online.     LEGAL STUFF: Capable device required. Coverage not available in all areas. New activation and upfront payment of 90 USD for 3-month plan (30/mo. equiv.) req’d; while supplies last. Intro rate for first 3 months only; then full-price plan options available. Restrictions apply. See full terms on Mint Mobile website.",
    "details": {
      "brand": "Mint Mobile",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "GSM",
      "connectivity": "N/A",
      "color": "N/A"
    }
  },
  {
    "id": "B0C6LSD69F",
    "name": "SAMSUNG 34\" ViewFinity S50GC Series Ultrawide QHD Monitor, 100Hz, 5ms, HDR10, AMD FreeSync, Eye Care, Borderless Design, PIP, PBP, LS34C50DGANXZA, 2023, Black",
    "ratings": 2.767,
    "price": "$219.99",
    "image": "https://m.media-amazon.com/images/I/61l+GRhlN+L._AC_SY300_SX300_.jpg",
    "description": "HANDPICKED BY AMAZON: They did the research, so you don’t have to     DO MORE ON ONE SCREEN: See every detail on the wider display featuring a 21:9 aspect ratio; Ultra-WQHD provides the simplest way to maximize screen real estate and experience truly seamless multitasking on just one screen     ENJOY A BILLION COLORS W/ INCREDIBLE DEPTH: With HDR10 that displays over 1 billion colors compared to 16.7 million for typical SDR technology, dark colors are darker and the brightest are even brighter     CARE FOR YOUR EYES DAY & NIGHT: An ambient light sensor on the monitor detects lighting in your workstation and automatically adjusts brightness; Eye Saver Mode minimizes excessive blue light, and Flicker Free relieves eye strain     SEE CONTENT SMOOTHER, EVEN GAMING: A faster than average refresh rate updates the image on screen more often every second; 100Hz refresh rate reduces lag and motion blur when playing games, watching videos, or working on design projects     Windows Certification: Windows 10",
    "details": {
      "brand": "SAMSUNG",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "QHD Ultra Wide 1440p",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "N/A"
    }
  },
  {
    "id": "B0CN1Q2X3B",
    "name": "SAMSUNG Galaxy A25 5G A Series Cell Phone, 128GB Unlocked Android Smartphone, AMOLED Display, Advanced Triple Camera System, Expandable Storage, Stereo Speakers, US Version, 2024, Black",
    "ratings": 297,
    "price": "$249.99",
    "image": "https://m.media-amazon.com/images/I/61cwMOVn17L.__AC_SY300_SX300_QL70_FMwebp_.jpg",
    "description": "YOUR CONTENT, SUPERSMOOTH: Whether watching shows, playing games or reading online, the ultra-clear, superfluid display¹ of Galaxy A25 5G brings your content to life; Plus, Vision Booster lets you to enjoy the bright 800-nits screen experience     CAPTURE AWE-WORTHY CONTENT: Mountain ranges, sunsets, dinners with friends — do the moment justice with the high-resolution cameras of Galaxy A25 5G; The triple-lens camera is ready for every angle, while a 50MP main camera catches all the details     STORE MORE & WORRY LESS: With improved internal storage of up to 128GB and up to 1TB² of expandable storage, Galaxy A25 5G makes it easy to keep cherished photos, videos and important files readily accessible whenever you need them     STEREO SPEAKERS: Experience sensational sound at your fingertips with Galaxy A25 5G; All new stereo speakers get you fully into the world of your favorite music, films and other content in a way like never before —no matter where you are     A DIGITAL WALLET IS ALREADY IN YOUR GALAXY: Carry your essentials conveniently in the digital wallet that’s made for your Galaxy phone and Watch³",
    "details": {
      "brand": "SAMSUNG",
      "operatingSystem": "Android 14, One UI",
      "memoryStorageCapacity": "128 GB",
      "screenSize": "N/A",
      "resolution": "1080 x 1920",
      "modelName": "Galaxy A25",
      "wirelessCarrier": "Unlocked for All Carriers",
      "cellularTechnology": "5G",
      "connectivity": "USB Type C",
      "color": "N/A"
    }
  },
  {
    "id": "B0CRCC9863",
    "name": "SAMSUNG 990 EVO SSD 1TB, PCIe Gen 4x4, Gen 5x2 M.2 2280 NVMe Internal Solid State Drive, Speeds Up to 5,000MB/s, Upgrade Storage for PC Computer, Laptop, MZ-V9E1T0B/AM, Black",
    "ratings": 1.329,
    "price": "$69.99",
    "image": "https://m.media-amazon.com/images/I/71FHPYQ2JbL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "READ/WRITE SPEEDS UP TO 5,000/4,200 MB/s: Load games and save files in a flash. Bring power to your productivity with read and write speeds of up to 5,000/4,200 MB/s.* The 990 EVO provides continuous speed to keep you going.     POWER EFFICIENCY: Save the power for your performance. Get power efficiency all while experiencing up to 70% improved performance per watt over the 970 EVO Plus.* It makes every move more effective with less power consumption overall.     SMART THERMAL CONTROL: Now you can ramp things up without overheating the system. Samsung’s fine tuned controller and heat spreading label deliver effective thermal control to avoid sudden performance drops mid project. It cools things down even when things are running high, so your hard earned checkpoints are saved.     PCIe 5.0 INTERFACE: Optimized to support the latest technology for SSDs 990 EVO is compatible with PCIe 4.0 x4 and PCIe 5.0 x2. This means you get more bandwidth and higher data processing and performance. Overall, it does more to support smooth storage with less power consumption.     ALWAYS UP TO DATE VIA MAGICIAN SOFTWARE: It’s not hocus pocus. Your 990 EVO SSD performs like new with the always up to date Magician Software. Stay up to speed with the latest firmware updates, extra encryption and continual monitoring of your drive health it works like a charm.",
    "details": {
      "brand": "SAMSUNG",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "PCIe Gen 5x2, PCIe Gen 4x4",
      "color": "Black"
    }
  },
  {
    "id": "B0CWS8MNW1",
    "name": "Samsung Galaxy Tab S6 Lite 10.4\" 64GB WiFi Android Tablet, S Pen Included, Gaming Ready, Long Battery Life, Slim Metal Design, Expandable Storage, US Version, Oxford Gray, Amazon Exclusive",
    "ratings": 912,
    "price": "$229.99",
    "image": "https://m.media-amazon.com/images/I/71-hJGtkLWL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "GALAXY TAB S6 LITE, MORE POWERFUL THAN EVER: With an included S Pen, crystal-clear display and Dolby Atmos surround sound, this reliable tablet is all about fun plus a little work     CHANGE THE WAY YOU NOTE: It’s easier than ever to write notes, edit photos and videos, mark up documents and more with the included S Pen     SLEEK, MODERN STYLE IN FRESH COLORS: Take this sleek, lightweight tablet anywhere; Its slim design slips right into your bag and comes in your choice of stylish colors – with newly included Mint color     STUNNING STREAMING. THRILLING GAMING: The shows and games you love look epic, thanks to our latest processor, crystal-clear screen and Dolby Atmos surround sound     PC-LIKE PRODUCTIVITY WITH SAMSUNG DeX: Get more done each day by turning your Galaxy devices into an expanded desktop workstation; Send multiple windows to the devices of your choice and control them all from your Galaxy Tab S6 Lite like a boss",
    "details": {
      "brand": "SAMSUNG",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "64 GB",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "Tab S6 Lite",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "N/A"
    }
  },
  {
    "id": "B0CC5VBD7V",
    "name": "bmani Wireless Earbuds Bluetooth Headphones 48hrs Play Back Sport Earphones with LED Display Over-Ear Buds with Earhooks Built-in Mic Headset for Workout Mint Green",
    "ratings": 54.107,
    "price": "$39.99",
    "image": "https://m.media-amazon.com/images/I/71mrQ8mUHRL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "Dual LED Displays Charging Case: Wireless earbuds with LED display make it obvious to show the battery power of the case and ear buds. The remaining power in percentage on the screen is shown to the left of the bluetooth headphones. The right side is assigning to a charging process of each bud, there are separated power consumption indicators by 4 grids in total, each grid represents 25% power of bud. During Charging, the LED indicator light will flash.     Bluetooth and Stereo Sound Quality: bluetooth earbuds adopt bluetooth technology, which can offer a clear and smooth connection, allowing you to hear crystal clear calls like you are communicating face to face with others. Don't worry about interruptions on listing to music and calling.     One Button Control and Auto Pairing: Compared with touch control, button control is easy so that you can obviate any operations and don't need to remember its instruction. When you pick wireless earphones out of the charging case, they'll automatically connect to the paired previous device. The range can reach up to 33ft away. When you put it back, the bluetooth earphones shut down and are recharging.     Designed for Sports: Sport headphones to keep you motivated, a secure fit that won’t shift or fall out during long hours of training, and no wires to hold you back. Equipped with 3 pairs of ear caps and flexible earhooks, which can stay on your ears and get a suitable fitting. So that you will not feel tired and pain when wearing it for a long time. bluetooth earphones can fit for camping, running, or working out, even on a rainy day.",
    "details": {
      "brand": "bmani",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "Mint Green"
    }
  },
  {
    "id": "B0C4B9MWHY",
    "name": "Samsung Galaxy Tab S9 11” 256GB WiFi 7 Android AI Tablet, Snapdragon 8 Gen 2 Processor, AMOLED Screen, Durable Design, S Pen Included, Long Battery Life, Auto Focus Camera, US Version, 2023, Graphite",
    "ratings": 893,
    "price": "$752.35",
    "image": "https://m.media-amazon.com/images/I/71wf0FpPBcL.__AC_SY300_SX300_QL70_FMwebp_.jpg",
    "description": "GALAXY AI IS HERE: Search like never before, let transcript assist take the notes for you, format your notes into a clear summary, and effortlessly edit your photos - all from your tablet, all with AI     OUR MOST POWERFUL TABLET PROCESSOR YET: From work time to playtime, unleash greatness in every experience with a superfast Snapdragon 8 Gen 2 chip, our most powerful tablet processor yet⁵     INTENSELY BRILLIANT SCREEN: Elevate your entertainment with an 11\" Dynamic AMOLED 2X screen⁶; Get ready for intense colors, deep contrasts and unbelievable brilliance; Plus, Vision Booster automatically adjusts brightness and contrast     STANDS UP TO DUST and WATER: Confidently take your Tab S9 with you everywhere; With an Armor Aluminum frame, it’s designed to protect against bumps; With an IP68 rating, it’s one of the only water- and dust-resistant tablets on the market⁷     DESIGNED TO INSPIRE: Minimalistic and sleek, Galaxy Tab S9 delivers an innovative look and feel; The ultra-slim bezels and refined Armor Aluminum finish make for a Tab that’s designed to inspire     A BATTERY THAT LASTS and LASTS: Get lost in your favorite shows and games without worrying about battery life; And when you do need to recharge, do it quickly and keep going with Super Fast Charging⁸     STORE WHAT YOU LOVE: Whether it’s movies, music, photos, games or creative projects, store what you want with up to 256GB of storage⁹",
    "details": {
      "brand": "SAMSUNG",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "256 GB",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "S9",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "N/A"
    }
  },
  {
    "id": "B0CCBXRYRC",
    "name": "SAMSUNG Galaxy SmartTag2, Bluetooth Tracker, Smart Tag GPS Locator Tracking Device, Item Finder for Keys, Wallet, Luggage, Pets, Use w/ Phones and Tablets Android 11 or Later, 2023, 1 Pack, Black",
    "ratings": 5.714,
    "price": "$21.27",
    "image": "https://m.media-amazon.com/images/I/61PzhW9vK4L.__AC_SY300_SX300_QL70_FMwebp_.jpg",
    "description": "REDESIGNED TO DO MORE: The redesigned Galaxy SmartTag2 is made so you can keep calm and keep track; Its design makes it easy for you to tag and carry your belongings     EASY TO USE: It's IP67-rated water- and dust-resistant, activates your compatible IoT devices and stays powered for up to 500 days or even up to 40% more on Non-Power Saving Mode     RELAX, YOU'VE GOT IT TAGGED: Simply register a new Galaxy SmartTag2 and get started right away with SmartThings Find; With its intuitive tracking experience, you now have a way to keep track of things you love right in the palm of your hand     SEARCH NEAR WHEN IT'S NOT FAR: Lose something. Switch on Search Nearby and get guided instructions to your item's location via Compass View; If you still don't see it, just ring your Galaxy SmartTag2 to have it send out an audible signal     Type of battery needed: replaceable CR2032 1 ea Lithium battery (not included)",
    "details": {
      "brand": "SAMSUNG",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "Bluetooth",
      "color": "N/A"
    }
  },
  {
    "id": "B0CSJZD7GK",
    "name": "AirPods Cleaning Kit - 3-in-1 Earphone Cleaner Kit Compatible AirPod/AirPod Pro with Sponge, Brush, Metal Tip, Multifunctional Earphone Cleaning Kit for Earbuds, AirPods",
    "ratings": 172,
    "price": "$18.99",
    "image": "https://m.media-amazon.com/images/I/51TdXxxVZAL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "【Dual-Head Structure, Detachable Design】The multifunctional earbuds cleaning pen combines three functions in one portable gadget with each part playing its role. Switch the head to use a flocking sponge, high-density brush, or metal tip, dealing with different cleaning tasks.     【Sponge for Thorough Cleaning】Made of furry flocking fabric, the soft sponge reaches deep into the wireless charging cases and wipes clean all the dust and dirt. Note: Spray some rubbing alcohol onto the surface to strengthen its cleaning power and make the charging case new.     【Soft Brush for Effortless Cleaning】A high-density brush helps clean up the dirt accumulated in the sound outlet holes gently without doing any damage to your earbuds. Regular cleaning keeps your earbuds clean and sanitary and eliminates the negative effect on their performance.     【Metal Tip for Tough Cleaning Work】Same as the pen tip, the cleaner pen protects the cleaning surface with a round-headed tip, getting deep into the hard-to-reach dead corners and scraping up the stubborn dirt effortlessly. Make sure an all-round cleaning and leave no dirt to survive.     【Simple Operation, Easy Transportation】All you need is to rotate and pull out the inside part to change for the head you need. Carry and store the cleaning kit with the wireless charging case in case of need. Tips: Suggested to water wash the sponge after use with cleaning solution.",
    "details": {
      "brand": "qalgtih",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "N/A"
    }
  },
  {
    "id": "B09STKRTHG",
    "name": "SAMSUNG 2022 Galaxy Tab A8 10.5” Inch 32 GB Wi-Fi Android 11 Touchscreen International Tablet Bundle – MDTec Hard Back Tri-Fold Stand Cover Case and 64GB microSD Card [Gray]",
    "ratings": 729,
    "price": "$239.00",
    "image": "https://m.media-amazon.com/images/I/81LxiyoB41L.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "BUNDLED ACCESSORIES: Save time and money searching for accessories. Get everything you need for your new Galaxy Tab A8 right here – a specially designed ultra-slim, MDTec Hard Back Shell Tri-Fold Stand Cover Case with precise cutouts for full access to all controls and buttons. A 64GB Class 10 Micro SDHC Memory Card is also included to expand the memory of your new Galaxy Tab A8 device!     SLIM, STYLISH DESIGN: Stream and browse on a 10.5-inch WUXGA TFT display designed to bring your content to life without weighing you down. The front-facing, landscape-oriented camera allows you to transition between entertainment and work seamlessly.     POWER AND STORAGE: Go for hours on a single charge* and back to 100% with the fast charging USB C port; *Battery life may vary depending on network environment, usage patterns and other factors     DO MORE OF WHAT YOU LOVE: Powerful processing speeds and upgraded memory means you can do more, and keep more, of the things you love: apps, videos, playlists and beyond.     KIDS DIGITAL LEARNING: Children can enjoy access to Samsung Kids, a library of safe and fun games, books and videos that are kid friendly and parent approved",
    "details": {
      "brand": "SAMSUNG",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "32 GB",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "SM-X200",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "N/A"
    }
  },
  {
    "id": "B0C63689JH",
    "name": "SAMSUNG Galaxy Z Fold5 AI Phone, 512GB Unlocked Android Smartphone, Big 7.6” Screen for Streaming, Gaming, Dual App View, One-Hand Control, Hands-Free Use, US Version, 2023, Icy Blue",
    "ratings": 350,
    "price": "$1,548.00",
    "image": "https://m.media-amazon.com/images/I/61LyIe34PVL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "GALAXY AI IS HERE: Search like never before¹, get real-time interpretation on a call², format your notes into a clear summary³, and effortlessly edit your photos⁴ - all from your smartphone, all with AI     THE FUTURE OF DOING MORE: With Dual-App Viewing, you can do more with more screen on Galaxy Z Fold5; Drag and drop photos into a text message, shop two sites side by side or stream videos while checking your feed     IMPRESSIVE PRECISION. MORE PRODUCTIVITY: Precision meets portability with S Pen⁵ capability on Galaxy Z Fold5; Write directly on the large screen and go from to-do to done     EXPANSIVE SCREEN, CINEMATIC EXPERIENCE: Streaming on the go with this big screen is a big deal; Unfold the massive 7.6\" screen⁶ on Galaxy Z Fold5 and lose yourself in your favorite content, no matter where you are     YOUR GAMING EXPERIENCE, ELEVATED: Enjoy mobile games on the cover screen or unfold the interior screen for a more immersive experience; With an impressive processor, power through with a high refresh rate and minimal input delays     UNFOLD WITH CONFIDENCE: Meet our most durable Galaxy Fold yet; With Gorilla Glass Victus 2 external protection and IPX8 water resistance⁷, you can unfold your world no matter where life takes you     FULL SCREEN OUTSIDE, MASSIVE SCREEN INSIDE: The 6.2” cover display⁶ is perfect for one-handed scrolling and quick tasks; Or unfold the massive 7.6” interior screen⁶ for everything else",
    "details": {
      "brand": "SAMSUNG",
      "operatingSystem": "Android 13.0",
      "memoryStorageCapacity": "512 GB",
      "screenSize": "N/A",
      "resolution": "2176 x 1812",
      "modelName": "Samsung Galaxy Fold5",
      "wirelessCarrier": "Unlocked for All Carriers",
      "cellularTechnology": "5G",
      "connectivity": "N/A",
      "color": "N/A"
    }
  },
  {
    "id": "B09V5LDZQ4",
    "name": "Samsung Galaxy S22 Smartphone, Factory Unlocked Android Cell Phone, 128GB, 8K Camera & Video, Brightest Display, Long Battery Life, Fast 4nm Processor, US Version, Phantom Black (Renewed)",
    "ratings": 2.182,
    "price": "$229.99",
    "image": "https://m.media-amazon.com/images/I/61M4ndNetDL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "Android 12 | One UI 4.1.1 | Octa-core | 8GB | 128GB | Adreno 730     Dynamic AMOLED 2X, 120Hz, HDR10+ display | Corning Gorilla Glass | 6.1inches | 1080 x 2340     Wi-Fi 802.11 a/b/g/n/ac/6e dual-band | GPS | Wi-Fi Direct, hotspot | Bluetooth 5.2 | USB Type-C 3.2     50 MP Camera | LED Flash | 1080p | Speaker     5.75x 2.78 x 0.30 | 5.89oz | Single SIM | GSM, HSPA, LTE, CDMA",
    "details": {
      "brand": "SAMSUNG",
      "operatingSystem": "Android",
      "memoryStorageCapacity": "128 GB",
      "screenSize": "N/A",
      "resolution": "1080 x 2340",
      "modelName": "Galaxy S22",
      "wirelessCarrier": "Unlocked for All Carriers",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "N/A"
    }
  },
  {
    "id": "B0CSB1GX4H",
    "name": "Samsung Galaxy A15 A155M 128GB Dual-SIM GSM Unlocked Android Smartphone (Latin America Version) - Yellow",
    "ratings": 305,
    "price": "$152.50",
    "image": "https://m.media-amazon.com/images/I/51rK-Be8dxL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "Display: 6.5 inches, Super AMOLED - 1080 x 2340 pixels     Memory: 128GB, 6GB RAM - MicroSD, up to 1TB     Camera: Triple - 50MP(OIS)+ 5MP + 2MP, Selfie - 13 MP     Platform: Android -- Mediatek Helio G99 -- Octa-core -- Mali-G57 MC2     Battery: 5000 mAh, non-removable     Dimensions: 6.30 x 3.02 x 0.33 in, 7.05 oz",
    "details": {
      "brand": "SAMSUNG",
      "operatingSystem": "Android 14",
      "memoryStorageCapacity": "128 GB",
      "screenSize": "N/A",
      "resolution": "1080 x 2340",
      "modelName": "Samsung Galaxy A15",
      "wirelessCarrier": "Unlocked",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "N/A"
    }
  },
  {
    "id": "B0C87Q4R51",
    "name": "SAMSUNG 30” - 100” The Freestyle 2nd Gen with Gaming Hub Smart Portable Projector, FHD, HDR, Big Screen Home Theater Experience, 360 Sound, SP-LFF3CLAXXZA, 2023 Model",
    "ratings": 208,
    "price": "$797.99",
    "image": "https://m.media-amazon.com/images/I/71u4IRKLTFL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "POINT & PLAY: Pick a spot, place it, tilt it and watch content come to life with the smart theater that makes it simple; The cradle stand gives you floor-to-ceiling flexibility with a rotation of 180 degrees - always giving you the best view*     EASY SET UP: Let The Freestyle 2nd Gen with Gaming Hub do the work with its Auto Leveling, Auto Focus and Auto Keystone technology that adjusts your picture for the best view possible; No fussing with settings—just sit back and enjoy the show**     SMART ENTERTAINMENT: Access everything; All your apps, workouts, recipes and shows in one portable smart theater*; It's got your content covered with the streaming services you love***     GAMING HUB: Where gaming comes together bringing the best of console games, streaming games and more; With easier access to your favorite games, standalone apps & accessories, start playing faster and get recommendations for other games****     360 SOUND: Immersive sounds with 360-degree audio from The Freestyle 2nd Gen with Gaming Hub; High quality speakers ensure an earful; Bring the noise even more when you connect a Bluetooth speaker, Samsung Sound Tower or Soundbar     EXTERNAL BATTERY COMPATIBLE: Pair The Freestyle 2nd Gen with Gaming Hub with your personal portable battery*****; Connect a USB-C type compatible battery for instant use and charge it with a C-type charger for indoor or outdoor use     SCALE & MOVE SCREEN: No need to move your image around; When wall or surface isn’t quite right, this smart theater-to-go makes it easy to shrink down the image, move it around and project from 100 to 30 inches; Your picture will always stay level",
    "details": {
      "brand": "SAMSUNG",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "HDMI",
      "color": "N/A"
    }
  },
  {
    "id": "B0B8TC6KWF",
    "name": "Samsung Galaxy Buds Pro 2 [2022] (SM-R510NZAALTA) - (Gray)",
    "ratings": 7.155,
    "price": "$106.49",
    "image": "https://m.media-amazon.com/images/I/61ReFn+YL1L._AC_SY300_SX300_.jpg",
    "description": "Active Noise Cancellation: Intelligent Active Noise Cancellation reduces unwanted noise, allowing you to focus on what matters most.     Hi-Fi Sound Quality: Experience studio-quality sound with Galaxy Buds2 Pro for an immersive listening experience.     Enhanced 360-Degree Audio: Enjoy personalized surround sound that amplifies your favorite tones from every angle.     Water Resistant: IPX7 rated, these earbuds can handle immersion up to 3 feet for half an hour, making them great for workouts.     International Model without Domestic Warranty. Contents: Buds 2 Pro, Charging Case, USB-C Cable, 3-Eartip, QSG",
    "details": {
      "brand": "SAMSUNG",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "Gray"
    }
  },
  {
    "id": "B0874XWW23",
    "name": "SAMSUNG T7 Portable SSD, 2TB External Solid State Drive, Speeds Up to 1,050MB/s, USB 3.2 Gen 2, Reliable Storage for Gaming, Students, Professionals, MU-PC2T0T/AM, Gray",
    "ratings": 33.209,
    "price": "$158.41",
    "image": "https://m.media-amazon.com/images/I/91YfRIy7kYL.__AC_SY300_SX300_QL70_FMwebp_.jpg",
    "description": "MADE FOR THE MAKERS: Create; Explore; Store; The T7 Portable SSD delivers fast speeds and durable features to back up any endeavor; Build your video editing empire, file your photographs or back up your blogs all in an instant     SHARE IDEAS IN A FLASH: Don’t waste a second waiting and spend more time doing; The T7 is embedded with PCIe NVMe technology that brings fast read and write speeds up to 1,050/1,000 MB/s¹, making it almost twice as fast as the T5     ALWAYS MAKE THE SAVE: Compact design with massive capacity; With capacities up to 4TB, save exactly what you need to your drive – from large working files to game data and everything in between     ADAPTS TO EVERY NEED: Whether using a PC or mobile phone, count on the T7 for extensive compatibility²; It’s a true team player when it comes to heavy-duty application usage or file-saving     HI RESOLUTION VIDEO RECORDING: Record Ultra High Resolution (4K 60fs) videos directly onto the T7 Portable SSD with your favorite camera or mobile devices; Supports iPhone 15 Pro Res 4K at 60fps video and more³     ALL FOR THE SHOT: This strong, sturdy sidekick will help you see it through with shock resistance and fall protection up to 6 feet⁴; With its solid aluminum unibody construction, it’s made to withstand any adventure     WORLD’S #1 FLASH MEMORY BRAND: Performance and reliability from the world’s #1 brand for flash memory since 2003⁵; All firmware and components are produced in-house, including our world renowned DRAM and NAND, for quality and you can trust",
    "details": {
      "brand": "SAMSUNG",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "USB 3.2 Gen 2",
      "color": "Titan Gray"
    }
  },
  {
    "id": "B0CRWT7WF1",
    "name": "Samsung Galaxy A05 A055M 64GB Dual-SIM GSM Unlocked Android Smartphone (Latin America Version) - Black",
    "ratings": 190,
    "price": "$91.99",
    "image": "https://m.media-amazon.com/images/I/61UjBLFlH2L.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "Display: 6.7 inches HD + PLS LCD, 720 x 1600 pixels     Memory: 64GB 4GB RAM - microSD up to 1TB     Camera: Dual - 50 MP, f/1.8, (wide), AF + 2 MP, f/2.4, (depth) - Selfie 8 MP     Platform: Android -- Mediatek MT6769V/CZ Helio G85 -- Octa-core -- Mali-G52 MC2     Battery: Li-Po 5000 mAh, non-removable     Dimensions: 6.65 x 3.08 x 0.35 in, 6.88 oz",
    "details": {
      "brand": "SAMSUNG",
      "operatingSystem": "Android 13.0",
      "memoryStorageCapacity": "64 GB",
      "screenSize": "N/A",
      "resolution": "720 x 1600",
      "modelName": "A055M",
      "wirelessCarrier": "Unlocked",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "N/A"
    }
  },
  {
    "id": "B08QBMD6P4",
    "name": "SAMSUNG 870 EVO SATA SSD 500GB 2.5” Internal Solid State Drive, Upgrade PC or Laptop Memory and Storage for IT Pros, Creators, Everyday Users, MZ-77E500B/AM, Black",
    "ratings": 40.94,
    "price": "$52.99",
    "image": "https://m.media-amazon.com/images/I/911ujeCkGfL.__AC_SY300_SX300_QL70_FMwebp_.jpg",
    "description": "THE SSD ALL-STAR: The latest 870 EVO has indisputable performance, reliability and compatibility built upon Samsung's pioneering technology. S.M.A.R.T. Support: Yes.Specific uses: Business, personal     EXCELLENCE IN PERFORMANCE: Enjoy professional level SSD performance which maximizes the SATA interface limit to 560 530 MB/s sequential speeds,* accelerates write speeds and maintains long term high performance with a larger variable buffer     INDUSTRY-DEFINING RELIABILITY: Meet the demands of every task — from everyday computing to 8K video processing, with up to 600 TBW** under a 5-year limited warranty***     MORE COMPATIBLE THAN EVER: The 870 EVO has been compatibility tested**** for major host systems and applications, including chipsets, motherboards, NAS, and video recording devices     UPGRADE WITH EASE: Using the 870 EVO SSD is as simple as plugging it into the standard 2.5 inch SATA form factor on your desktop PC or laptop; The renewed migration software takes care of the rest     SAMSUNG MAGICIAN SOFTWARE: Samsung Magician 6 software**** helps you easily manage your drive, keep up the latest updates, monitor the drive's health and status, or even enhance its performance     WORLD'S #1 FLASH MEMORY BRAND: Experience the performance and reliability from the world's #1 brand for flash memory since 2003;***** All firmware and components, including Samsung's world-renowned DRAM and NAND, are produced in-house, allowing end-to-end integration for quality you can trust. Samsung 512 MB Low Power DDR4 SDRAM",
    "details": {
      "brand": "SAMSUNG",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "SATA 6Gb/s",
      "color": "Black"
    }
  },
  {
    "id": "B0DFP17H38",
    "name": "SHEZI [Upgrade 4 in 1 Charging Cable, 60W [Full Chrager Only 0.8h][1GB Transfer Only 12s] Flat Silicone Multi Fast Charge Phone Cord with USB A/Type C/Light-ning for iPhone iPad Samsung, 5FT",
    "ratings": 13,
    "price": "$26.99",
    "image": "https://m.media-amazon.com/images/I/71-hxCuleiL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "Unique Liquid Silicone Material: Our usb c cable use the latest liquid silicone rubber as a material to make the cable softer, stronger, more resistant to dirt, is able to fully withstand stress and it feels incredibly soft between your fingers and is one of the strongest cables ever made. It won't get tangled even when tucked into a bag or pocket, making it perfect for carrying around.     4-in-1 Versatile Simplify Design: Our usb to usb c cable has different ports, including Light-ning/USB A/Type C connectors. Support to charge 99% phones available on the market. It's super handy to carry and meets all your demands on families, travel or work, business trips, and other occasions. ﻿     Fastest Charging in History: Our usb c to light-ning cable can charge your device at the fastest speed. Fully charge a iPhone 15 pro to 96%, a Switch to 90%, a Samsung S23 to 96%, a MacBook Pro to 86% and an iPad Pro to 89% in 35 minutes. NOTE: Please use a charger with the corresponding wattage or higher that our product could output maximum power.     Super Fast Data Transfer: Supports the USB 2.0 standard with unmatched data transfer speed up to maximum 480Mbps. This usbc cable is compatible with USB2 devices and transfer music, movies, or videos in seconds at maximum 480Mbps, 1GB files transfer only 12s.     Support CarPlay & Android Auto: This usb c to usb c cable 100% supports both Android Auto and Carplay which charging and navigating at the same time. Whether you have the usb c or light-ning port devices in your car, we can perfectly work for you. So no longer need to carry cables for each device, make you life more convenient.     Ultra High-Quality Assurance: This usb a to usb c cable has been tested to withstand at least 10,000 cycles of 90-degree bend and 10,000 plugging and unplugging lifespan which is 12 times stronger than all original cables, its zinc alloy cable housing is highly resistant to wear and scratches. You don't need to replace the charging cable within 3 years.     More Promise Less Concern: If you encounter any issues with your usb to light-ning cable, contact us via Amazon Message Center. Our dedicated customer support team is available to assist you with any questions or concerns you may have within 12 hours.",
    "details": {
      "brand": "SHEZI",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "USB",
      "color": "Green"
    }
  },
  {
    "id": "B0CW5F6D85",
    "name": "SUNDA 120W USB C Fast Car Charger, 4-Ports Car Charger Adapter, Dual Type C PD60W/PPS60W Compatible with iPhone16/15 Pro/Max/iPhone14/Galaxy/SamsungS24, Dual USB-A 18W QC3.0 for Android(Black)",
    "ratings": 2.706,
    "price": "$27.99",
    "image": "https://m.media-amazon.com/images/I/716Fd5R5-fL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "[Multi-Device Intelligently Fast Charging]: 4-Ports 120W fast USB-C car charger supporting dual-ports PD 60W / PPS 60W high output and USB-A 30W QC 3.0 dual-ports design can greatly meet the charging needs of different types of mobile electronic devices. Delivery technology provides amazing-fast charge up to max 60W(20V⎓3A) for USB-C devices. This advanced tech is at your beck and call–getting your laptop battery back to 100% in a short time.     [4 Ports for Family & Travel Simultaneous Charging ]: Our Fast Car Charger is perfect companion for family travel with kids. Super charging speed, fast-charging 4 devices at the same time. Intelligently distributes power to provide optimal charging. PPS 60W Max supports Samsung S23 charging 0%~95% in just 30 minutes; PD 60W Max supports iPhone 15/ 14 /13 charging 0~90% in 30 minutes.     [Unique Design ]: The SUNDA car charger offers a fashionable design with black and premium grey to match every performance car interior with superior charging speeds, making it perfect for daily car travel. With the LED light inside the port, it is convenient for you to find the car charger in the darkness, enjoy safe driving.     [Wide Compatibility]: Compatible with Macbook Air, iPhone 16 / iPhone 15 / iPhone 14 / iPhone 13/ 13 Pro /12 / 12 Pro / 11 / 11 Pro / 11 Pro Max / XS / XS Max / XR / X / 8 / 8 Plus / 7 / 7 Plus / 6 / 6S /6S Plus / 5 / 5S / SE / iPad Pro / iPad mini / iPad Air / Airpods Pro, Samsung Galaxy S23 / S22 / S21 / A12 / A11 /S10e / S10+ / S9 / S9+ / S8 / S8+ / S7 Edge / S6 Edge / Note 23 /22 / 21 / 20 Ultra / 9 / 8 / 7 / 5 / 4 /3, Google Pixel 6 / 5, LG V50 etc.     [Suitable For Any Vehicle]: Our usb type c fast charger is designed to fit any standard 12V/24V cigarette lighter adapter, and compatible with any device charging via USB. Works with including Apple and Android smart phones such as iPhone, Samsung Galaxy, Google Pixel, LG and laptop car charger for MacBook, Dell, HP, Levono, ThinkPad and more. You can charge your switch, tablets, drones, video games controllers, sports watches, etc.     [Superior Safety]: Certified with CE, FCC and RoHS and Built-in multiple protection measures can protect your equipment from excessive current, overheating, over-voltage and over-load. Safe to use with wi-fi, bluetooth, and radio. Ensure excellent performance, safety and reliability.     [Loyal Service]: We provide premium car charger adapter for you best choice. This car charger meets the charging needs of most devices. We provide you with the efficient post-sales service, buy it, if our usb-c car charger doesn’t fit your car or gets broken, please contact SUNDA's team directly for your best solution.",
    "details": {
      "brand": "SUNDA",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "USB",
      "color": "2A2C-Black 120W 03"
    }
  }
]