[
  {
    "id": "B08FXRTYPH",
    "name": "$30/mo. Mint Mobile Phone Plan with Unlimited Talk, Text & Data for 3 Months (3-in-1 SIM Card)",
    "ratings": 17.26,
    "price": "$45.00",
    "image": "https://m.media-amazon.com/images/I/61GjGBJErFL.__AC_SY300_SX300_QL70_FMwebp_.jpg",
    "description": "WHAT YOU GET: Three (3) months of unlimited talk, text, and data delivered on the nation’s largest 5G network. Data speeds reduce after 40GB of usage but data is unlimited. Videos stream at 480p.     OH, YOU GET THIS TOO: 5G for Free + 10GB of mobile hotspot + Wi-Fi calling and text + free international calls to Mexico and Canada + 7-day money back guarantee     HOW YOU GET IT: The SIM Kit comes with a 3-in-1 SIM card that includes standard/micro/nano sizes, insert the SIM into your device, and activate on the Mint Mobile website or app. You can activate service on your own unlocked device with our Bring Your Own Phone (BYOP) program. Check your coverage and phone compatibility on the Mint Mobile website.     WHO SHOULD GET IT: Anyone who hates their phone bill     WHY YOU SHOULD GET IT: Mint Mobile took what’s wrong with wireless and made it right. We re-imagined the wireless shopping experience and made it easy and online.     LEGAL STUFF: Capable device required. Coverage not available in all areas. New activation and upfront payment of 90 USD for 3-month plan (30/mo. equiv.) req’d; while supplies last. Intro rate for first 3 months only; then full-price plan options available. Restrictions apply. See full terms on Mint Mobile website.",
    "details": {
      "brand": "Mint Mobile",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "GSM",
      "connectivity": "N/A",
      "color": "N/A"
    }
  },
  {
    "id": "B0DFP17H38",
    "name": "SHEZI [Upgrade 4 in 1 Charging Cable, 60W [Full Chrager Only 0.8h][1GB Transfer Only 12s] Flat Silicone Multi Fast Charge Phone Cord with USB A/Type C/Light-ning for iPhone iPad Samsung, 5FT",
    "ratings": 13,
    "price": "$26.99",
    "image": "https://m.media-amazon.com/images/I/71-hxCuleiL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "Unique Liquid Silicone Material: Our usb c cable use the latest liquid silicone rubber as a material to make the cable softer, stronger, more resistant to dirt, is able to fully withstand stress and it feels incredibly soft between your fingers and is one of the strongest cables ever made. It won't get tangled even when tucked into a bag or pocket, making it perfect for carrying around.     4-in-1 Versatile Simplify Design: Our usb to usb c cable has different ports, including Light-ning/USB A/Type C connectors. Support to charge 99% phones available on the market. It's super handy to carry and meets all your demands on families, travel or work, business trips, and other occasions. ﻿     Fastest Charging in History: Our usb c to light-ning cable can charge your device at the fastest speed. Fully charge a iPhone 15 pro to 96%, a Switch to 90%, a Samsung S23 to 96%, a MacBook Pro to 86% and an iPad Pro to 89% in 35 minutes. NOTE: Please use a charger with the corresponding wattage or higher that our product could output maximum power.     Super Fast Data Transfer: Supports the USB 2.0 standard with unmatched data transfer speed up to maximum 480Mbps. This usbc cable is compatible with USB2 devices and transfer music, movies, or videos in seconds at maximum 480Mbps, 1GB files transfer only 12s.     Support CarPlay & Android Auto: This usb c to usb c cable 100% supports both Android Auto and Carplay which charging and navigating at the same time. Whether you have the usb c or light-ning port devices in your car, we can perfectly work for you. So no longer need to carry cables for each device, make you life more convenient.     Ultra High-Quality Assurance: This usb a to usb c cable has been tested to withstand at least 10,000 cycles of 90-degree bend and 10,000 plugging and unplugging lifespan which is 12 times stronger than all original cables, its zinc alloy cable housing is highly resistant to wear and scratches. You don't need to replace the charging cable within 3 years.     More Promise Less Concern: If you encounter any issues with your usb to light-ning cable, contact us via Amazon Message Center. Our dedicated customer support team is available to assist you with any questions or concerns you may have within 12 hours.",
    "details": {
      "brand": "SHEZI",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "USB",
      "color": "Green"
    }
  },
  {
    "id": "B0CQ5FKG8R",
    "name": "Samsung Galaxy A15 (SM-A155F/DSN), 128GB 4GB RAM, Dual SIM, Factory Unlocked GSM, International Version (Wall Charger Bundle) (Yellow)",
    "ratings": 2.176,
    "price": "$145.00",
    "image": "https://m.media-amazon.com/images/I/61hdrs3-MuL.__AC_SY300_SX300_QL70_FMwebp_.jpg",
    "description": "Super Vivid and Bright Display: The Galaxy A15 6.5-inch Super AMOLED display boasts vibrant clarity even in direct sunlight with Vision Booster, with up to 800 nits for brightness     Create your shot with multi-cameras: For landscapes and close-ups, 50MP for serious photography for high resolution images, 13MP Front camera for profile-worthy selfies, with an astonishing 90Hz refresh rate and a low blue light display for eye comfort     Get it done with Boosted Performance: with an octa-core processor for powerful performance, spacious memory and storage options keep your data and contents ready at hand     Battery Power up with Super Fast Charging: Stay up and running with a 5000mAh (typical) battery that rechaarges with super fast charging to get you back out on the road     Balanced simplicity: The Galaxy A15 designed to fulfill its refined aesthetics through an intuitive frame, glossy backcover and tidy camera layout. Available in Black, Blue, and Yellow",
    "details": {
      "brand": "SAMSUNG",
      "operatingSystem": "Android",
      "memoryStorageCapacity": "128 GB",
      "screenSize": "N/A",
      "resolution": "1080 x 2340",
      "modelName": "Galaxy A15",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "N/A"
    }
  },
  {
    "id": "B0B23P6NJQ",
    "name": "Wireless Charger for Samsung Charging Station, 3 in 1 Android Phone Wireless Charger for Samsung Galaxy S24 Ultra/S23 Ultra/Z Flip 6/Fold 6/Buds, Charger for Galaxy Watch Ultra/7/6/5/4/3 (Black)",
    "ratings": 5.21,
    "price": "$39.98",
    "image": "https://m.media-amazon.com/images/I/71XwDnfhkrL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "3 in 1 Wireless Charging Station - Designed specifically for Samsung users. Whether you have S24 Ultra, earbud, or Galaxy watch 7/6/5 Pro, this charging station for samsung is perfect for charging them all in one spot, no more plug in and out troubles, no more fussing with cords and cables! Say hello to a simpler and more streamlined charging experience every time you use it.     Thoughtful Design - Space-saving \"U-shaped\" design with a 3-level dimming option. The LED charging indicator keeps you informed about your device's charging status at a glance. Plus, the built-in memory battery ensures your data is safe even during power outages. And when no USB is plugged in, the clock automatically turns off after 10 minutes to conserve energy.     Case Friendly Charging Stand - Our wireless charging stand is specifically engineered to charge your phone directly through protective cases up to 0.2 inch (5mm) thick. Say goodbye to the inconvenience of constantly removing and reattaching your phone case just to charge your device, simplifying your life in the way.     Safe and Efficient Wireless Charging Station - This wireless charger is made of fire-resistant ABS material, providing multiple protections for your devices. With features like object detection, temperature control, over-voltage protection, and the carefully designed heat dissipation holes on the back prevent overheating during charging.     Wide Compatibility - Suitable for Samsung Galaxy Z Flip 6/5/4/Z Fold 6/5/4 /Z Fold 2/Z Fold 3/Z Flip/Z Flip 3/ for Samsung Galaxy S24 Ultra/S23 Ultra/S22/S22+/S22 Ultra/S21/S21+/S21 Ultra/S21/S20+/S20 Ultra/Note 20; iPhone 16 Pro Max/15/14/13/12/8 Plus;Galaxy Buds 2 Pro/Buds; Galaxy Watch Ultra/7/6/5/5 Pro/4//4 Classic/3/Active 2/1. Not compatible with Samsung A series. [e.g. Not for Samsung Galaxy A Series A73/A72/A71/A70/A53/A52/A51/A50/A02s/A10e/A11/A12/A20/A21/A21s/A31/A32/A41/ A42/A90]     What's in the box - You will get 1 x 3 in 1 wireless charger, 1 x QC 3.0 Adapter, 1 x Type-C Cable(1.5m / 59inch length ), 1 x User Manual. This cool wireless charger stand is not only suitable for your nightstand, but also for home, office, travel, and other occasions.",
    "details": {
      "brand": "NeotrixQI",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "USB",
      "color": "Black"
    }
  },
  {
    "id": "B0B46LKCV7",
    "name": "Samsung SWA-9200S 2.0Ch Wireless Rear Surround Sound Speakers (2022)",
    "ratings": 856,
    "price": "$97.99",
    "image": "https://m.media-amazon.com/images/I/91jJHfAN1+L._AC_SX300_SY300_.jpg",
    "description": "WIRELESS SURROUND SOUND: Connect easily and wirelessly to optional Samsung speakers for room-filling sound*.Waterproof : No     WIRELESS SOLUTION: Wirelessly connect 2.0 Ch 2 front-firing rear speakers to compatible Samsung soundbars**     COMPATIBILITY: These speakers are ONLY compatible with 2023 Soundbars: B550, B650, C450, Q600C, S50B, S60B, S61B, B63C. 2024 Soundbars: B550D, B750D, S60D, S61D, S700D. They will not work with Non-Atmos Soundbar systems from Samsung.     IMMERSIVE SURROUND: Create an experience to bring you into the action of your favorite movies, shows, and sports     PAIRING: Simply plug in and pair with your soundbar to enjoy all the action of your favorite entertainment in surround sound and clutter free     WIRELESS SOUND: Bring wireless sound to your SAMSUNG sound plus soundbars.",
    "details": {
      "brand": "SAMSUNG",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "Wireless",
      "color": "N/A"
    }
  },
  {
    "id": "B0BDRSY88T",
    "name": "【Pack of 2】 for Samsung Smart TV Remote Control Replacement,Universal for All Samsung TVs",
    "ratings": 38.527,
    "price": "$14.97",
    "image": "https://m.media-amazon.com/images/I/612sTsWo+WL._AC_SY300_SX300_.jpg",
    "description": "【What's in the Package】The package includes 2pcs remote controls to solve your home backup remote control needs and avoid inconvenience when the remote control is broken or missing. (Note: batteries and manual are not included)     【Completely Compatible】 The upgrade universal remote control compatible with All Samsung Frame Curved Crystal UHD Neo QLED OLED 4K 8K Smart TVs. And it can replace most of Samsung remote controls, is a good backup remote for your Samsung smart TVs.     【Key Features】The remote control is designed with 3 popular streaming buttons, including NETFLIX, Prime-video and hulu, you can switch to your favorite application conveniently. Pleae noted that this is a infrared remote control and it doesn't come with voice function.     【Premium Replacement Remote】Strongest signal by mature infrared technology,our remote control feature with farther transmitting distance and fast reponse, following the movement of the TV page without obvious delay. It is made of high quality ABS and silicone material, for long time use.     【Out of the box】This Item Is Selling Without Batteries, Customers Need To Buy 2 AA Batteries In Local Store By Themselves And Put The Batteries In Then It Works .",
    "details": {
      "brand": "Angrox",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "black"
    }
  },
  {
    "id": "B0D6CJCRRF",
    "name": "SAMSUNG Galaxy Tab A9 4G LTE (64GB, 4GB, Cellular) 8.7\" Android Tablet, Octa-core (6nm), Dual Speakers (International Model Fully Unlocked for US & Global) X115 (w/ 15W Fast Charger, Graphite)",
    "ratings": 44,
    "price": "$135.44",
    "image": "https://m.media-amazon.com/images/I/51HL5sz4keL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "8.7\" (220.5mm), 1340 x 800 (WXGA+), TFT, 16M colors, Android 13, One UI 5.1     64GB ROM, 4GB RAM, Mediatek Helio G99 (6nm), Octa-core, Mali-G57 MC2 GPU     Rear Camera: 8MP, AF, Front Camera: 2MP, 5100 mAh battery, Bluetooth 5.3, USB Type-C 2.0     2G: GSM850, GSM900, DCS1800, PCS1900, 3G: UMTS B1(2100), B2(1900), B4(AWS), B5(850), B8(900), 4G: LTE LTE B1(2100), B2(1900), B3(1800), B4(AWS), B5(850), B7(2600), B8(900), B12(700), B17(700), B20(800), B28(700), B38(2600), B40(2300), B41(2500), B66(AWS-3) - Single Nano-SIM     International Model without Domestic Warranty. The device is Fully Unlocked for all Carriers (Data Only). Can make calls with T-Mobile Only. Most Other US carriers will not allow calling feature to work on this device.",
    "details": {
      "brand": "SAMSUNG",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "64 GB",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "Galaxy Tab",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "N/A"
    }
  },
  {
    "id": "B0D6W2ZY8L",
    "name": "Wireless Charging Station for Samsung:5 in 1 Wireless Charger for Samsung, Charger Dock Stand for Multiple Devices-Samsung Galaxy Watch 7 6 5 Buds Galaxy S24 Ultra S23 S22 S20 Note 20 10 Z Fold,Black",
    "ratings": 256,
    "price": "$29.79",
    "image": "https://m.media-amazon.com/images/I/71ZRX-QqlPL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "【2 YEARS AFTER-SALE SERVICE】BERXZWE Wireless Charging Station comes with 2-year after-sale service for any reason. If you need replacement parts, please reach out to us via your Amazon order detail page (Go to Your Orders>Problem with order>Contact Seller). We hope you can say goodbye to cluttered cables and bring convenience to your daily life with our 5-in-1 portable charging station.     【5 in 1 Wireless Charger for Samsung】BERXZWE 5-in-1 wireless charging station is equipped with a USB C port and USB A port, which can simultaneously charge Samsung phones, Galaxy Watch, Galaxy Tab, and earphones, perfectly solving the problem of charging multiple devices. The portable charging station Makes your home nightstand, office desk, and meeting room more space-saving and tidy. It is an essential accessory for home, office, travel, and gifts.     【36W Fast Charging Station】This ultra-fast charging station is equipped with the latest advanced intelligent and efficient chipset. With an input power of up to 36W, it can efficiently and quickly charge up to 5 devices simultaneously within 2-3 hours, which is 2-3 times faster than a standard wireless phone charger, saving you valuable time. The Android charging station has 16 air vents and 4 non-slip pads at the bottom to safely dissipate heat and charge your devices.     【Widly Compatibility】Our Samsung wireless charger works for almost all Samsung or Android phones or earbuds that support wireless charging, like the Galaxy S, Note, and Z Fold series(NOT FOR Galaxy Z Flip Series & A Series): For S24/S24 Plus/S24 Ulta/S23/S22/S21/S20/Note20/10/9/8/Z Fold 6/5/4/3/2; The Samsung watch charger can only charge Galaxy Watch 7/7 Ultra/6/6 Classic/5/4/3/Pro/Active. Attention: Not for Apple Watch or other brand watch     【Secure Intelligent Protection】Our desk charging station has passed FCC, CE, and RoHS certification. It features all-round protection: providing overcharge protection, over-current protection, over-voltage protection, and foreign object detection to ensure a safe and harmless charge. The excellent heat dissipation system and the large heat dissipation holes at the bottom can improve the charging efficiency.",
    "details": {
      "brand": "BERXZWE",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "Wireless",
      "color": "Black"
    }
  },
  {
    "id": "B0CB71BY87",
    "name": "SAMSUNG 27\" ViewFinity S9 Series 5K Computer Monitor, Thunderbolt 4, DisplayPort, Matte Display, 4K Slimfit-Camera, Slim Metal Design, AirPlay, Smart-TV Apps, Gaming Hub, LS27C900PANXZA, 2023",
    "ratings": 124,
    "price": "$819.00",
    "image": "https://m.media-amazon.com/images/I/71PVs8LNztL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "5K RESOLUTION: 5K provides more pixels than 4K, with 218 PPI for incredible detail; 99% DCI-P3 delivers color saturation to bring your ideas to vibrant life, and factory-calibrated color accuracy (ΔE < 2) delivers true color representation.     MATTE DISPLAY: Matte Display drastically reduces light reflections without obscuring your view; Intelligent Eye Care automatically optimizes brightness, reduces blue light, and eliminates screen flickering, so you can keep your eyes on the prize     THUNDERBOLT 4 & DP PORT: A 5K monitor that connects to your favorite Windows and Mac devices with DisplayPort and Thunderbolt 4 connectivity; New Thunderbolt 4 compatibility enables you to consistently transfer data more reliably     4K SLIMFIT CAMERA: Always capture your good side; The 4K resolution of the built-in SlimFit camera keeps video conferencing crystal-clear; Capturing content in high resolution has never been easier     SLIM METAL DESIGN & ERGONOMICS: Slim metal design works in any space, with a height-adjustable screen that tilts for the best angle; Pivot 90 degrees to view long docs with less scrolling; Plus, keep desktop clutter-free VESA compatible mounting     APPLE AIRPLAY: Sometimes one screen just isn't enough; With Apple AirPlay, mirror or extend your screens to get more done; Wireless dual screens increase productivity, without increasing the number of plugs     SMART TV APPS: When the work is done, let the play begin; Seamlessly switch to entertainment mode with embedded Smart TV Apps which have all of today's hottest streaming content, easily accessible on one screen",
    "details": {
      "brand": "SAMSUNG",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "5K UHD 2880p",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "N/A"
    }
  },
  {
    "id": "B0B8TDQZ5K",
    "name": "SAMSUNG Galaxy Buds2 Pro True Wireless Bluetooth Earbud Headphones - White",
    "ratings": 1.129,
    "price": "$102.00",
    "image": "https://m.media-amazon.com/images/I/51bY832NkkL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "HD VOICE TECHNOLOGY: Turn every call into a high definition chat; HD Voice Technology separates your voice from surrounding noise, so you come in crystal clear even with the hustle and bustle around you     INTELLIGENT CONVERSATION MODE: Keep the conversation going without taking out your earbuds; When your voice is detected, Intelligent Conversation Mode turns off Active Noise Cancellation, turns down the volume and puts your Buds in Ambient Mode***     HD VOICE TECHNOLOGY: Turn every call into a high definition chat; HD Voice Technology separates your voice from surrounding noise, so you come in crystal clear even with the hustle and bustle around you;INTELLIGENT CONVERSATION MODE: Keep the conversation going without taking out your earbuds; When your voice is detected, Intelligent Conversation Mode turns off Active Noise Cancellation, turns down the volume and puts your Buds in Ambient Mode***",
    "details": {
      "brand": "SAMSUNG",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "N/A"
    }
  },
  {
    "id": "B0D3JDTZZQ",
    "name": "SAMSUNG Galaxy Ring Sizing Kit, Size First Before You Buy + Receive $10 Amazon Credit Towards Future Galaxy Ring Purchase, Includes 9 Sample Ring Sizes",
    "ratings": 295,
    "price": "$9.88",
    "image": "https://m.media-amazon.com/images/I/61428+Kq5TL._AC_SY300_SX300_.jpg",
    "description": "A SIZING KIT FOR A FLAWLESS FIT: Finding your perfect fit is a breeze with our convenient Galaxy Ring Sizing Kit¹; Select your best fit from a variety of sizing options     GET A $10 CREDIT: Purchase the Sizing Kit for $10, which includes 9 sample rings² to try on and get a $10 credit towards your future purchase of the Galaxy Ring (terms and conditions apply)     HOW TO USE THE SIZING KIT: After receiving the Galaxy Ring Sizing Kit, choose a sample ring and wear it for at least 24 hours³ (including sleep); Check that it’s not too small or too big     SENSORS SHOULD FACE YOUR PALM: The 3 bumps on the inner part of the sample ring are where the sensors on the actual Galaxy Ring will be; Turn the sample ring so that the sensors are facing towards the palm of your hand     MAY DIFFER FROM REGULAR RING SIZES: Galaxy Ring sizes² may be different from regular ring sizes, so find the right fit with the Sizing Kit and follow the instructions provided; Galaxy Ring sizes range from 5-13 and there are no half sizes",
    "details": {
      "brand": "N/A",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "N/A"
    }
  },
  {
    "id": "B0D63657GY",
    "name": "Tile by Life360 Mate (2024) Bluetooth Tracker, Keys Finder and Item Locator for Keys, Bags and More. Phone Finder. Both iOS and Android Compatible. 1-Pack (Black)",
    "ratings": 1.242,
    "price": "$24.98",
    "image": "https://m.media-amazon.com/images/I/612bzkKC0WL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "THE EVERYTHING TRACKER: Protect lost or stolen stuff and make family life easier. Attach to everyday things like keys, water bottles, or bags     STAY SAFE WITH SOS: Discreetly trigger an SOS alert to your loved ones in unsafe situations     FIND YOUR THINGS: Ring your misplaced Tile, or track it down in the free app     FIND YOUR PHONE: Phone hiding under a cushion? Use your Tile to make it ring — even when silenced     USE WITH LIFE360: Add your Tiles to Life360 — a top family connection and safety app – to see everything and everyone on the same map     WORKS WITH iOS AND ANDROID: The free Tile app works for all households and individuals     TECH SPECS: 350-foot / 105m Bluetooth range. Up to 3-year battery. Water resistant (IP68 rated)     GIVE THE GIFT OF FINDING: Tile is an easy and functional gift for family and friends",
    "details": {
      "brand": "Tile",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "N/A"
    }
  },
  {
    "id": "B07D7Q41PM",
    "name": "SAMSUNG MUF-256AB/AM FIT Plus 256GB - 400MB/s USB 3.1 Flash Drive, Gunmetal Gray",
    "ratings": 35.574,
    "price": "$24.99",
    "image": "https://m.media-amazon.com/images/I/514WukM0Y4L.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "COMPACT FLASH DRIVE: Exceptionally compact Samsung FIT Plus USB flash drive for instant storage of your photos, videos, music, and files on laptops, tablets, TV’s, car audio systems, gaming consoles and more     QUICK AND CONVENIENT READ SPEEDS: Redefine everyday file transfers with read speeds up to 400MB/s; USB 3.1 flash drive with backwards compatibility (USB 3.0, USB 2.0)     SEAMLESS FITTING DESIGN: The unnoticeable, seamless fit is designed with a key ring to prevent loss     BUILT TO LAST RELIABILITY: Shock proof flash drive is also water proof, temperature proof, x-ray proof and magnetic proof     5-YEAR LIMITED WARRANTY: 5-year limited warranty",
    "details": {
      "brand": "SAMSUNG",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "256 GB",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "N/A"
    }
  },
  {
    "id": "B0BQXGVMSL",
    "name": "Samsung Galaxy S23 Ultra 5G SM-S918B/DS 512GB 12GB RAM, 200 MP Camera, Factory Unlocked International Model (Phantom Black)",
    "ratings": 639,
    "price": "$855.00",
    "image": "https://m.media-amazon.com/images/I/61-Trif8A+L._AC_SY300_SX300_.jpg",
    "description": "6.8\" Dynamic AMOLED 2X Infinity-O QHD+, Edge Screen, 120Hz Refresh Rate, 500ppi, 1750nit (Outdoor Peak), 1440 x 3088 pixels, 5000mAh Battery     512GB, 12GB RAM, No SD Card Slot, Qualcomm SM8550-AC Snapdragon 8 Gen 2 (4nm), Octa-Core, Adreno 740     Rear Camera: 200MP, f/1.7 + 10MP, f/4.9 + 10MP, f/2.4 + 12MP, f/2.2, Front Camera: 12MP, f/2.2, Android 13, One UI 5.1     2G: GSM 850/900/1800/1900, CDMA 800/1900, 3G: HSDPA 850/900/1700(AWS)/1900/2100, CDMA2000 1xEV-DO, 4G LTE: 1/2/3/4/5/7/8/12/13/17/18/19/20/25/26/28/32/38/39/40/41/66, 5G: 1/2/3/5/7/8/12/20/25/28/38/40/41/66/75/77/78 SA/NSA/Sub6 - Dual SIM and eSIM     International Model without Domestic Warranty. The Seller's Return Policy still covers the device. Compatible with Most GSM and CDMA Carriers like T-Mobile, AT&T, etc. Will Also work with CDMA Carriers Such as Verizon. Not Compatible with MetroPCS.",
    "details": {
      "brand": "SAMSUNG",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "512 GB",
      "screenSize": "N/A",
      "resolution": "1440x3088",
      "modelName": "Galaxy S23 Ultra 5G",
      "wirelessCarrier": "Unlocked",
      "cellularTechnology": "2G, 3G, 4G ,5G",
      "connectivity": "N/A",
      "color": "Phantom Black"
    }
  },
  {
    "id": "B09MV3MQN3",
    "name": "SAMSUNG 15W Wireless Charger Duo w/ USB C Cable, Charge 2 Devices at Once, Cordless Super Fast Charging Pad for Galaxy Phones and Devices, 2022, US Version, White",
    "ratings": 657,
    "price": "$33.35",
    "image": "https://m.media-amazon.com/images/I/31FBP3n8T7L.__AC_SY300_SX300_QL70_FMwebp_.jpg",
    "description": "SUPER FAST WIRELESS CHARGING: Get the charge you need quickly, thanks to up to 15W of Fast Charging support; This boost of battery is compatible with USB PD and Adaptive Fast Charging travel adapters for an easy pick-me-up*     EASE OF USE & MULTI DEVICE CHARGING: Simultaneously power up your favorite pair of devices to enjoy together — whether that's your phone and Galaxy Watch or your Galaxy Watch and earbuds     DIRECT COOLING FAN: The Super Fast Wireless Charger Pad has a built-in cooling system with a fan and charges your phone fast**     DEVICE DESIGN: Simply place the Wireless Charger where you want it; With a slim, smooth and compact design, it fits even in your smaller spaces, so it's easy to access when your phone or earbuds need a little extra juice****     LED INDICATOR: LED light tells you the charging status of your device with different colors: red for charging, flashing red for charging error, and green for fully charged; When it’s time for lights out, you can dim it to not disturb your sleep*****",
    "details": {
      "brand": "SAMSUNG",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "USB",
      "color": "White"
    }
  },
  {
    "id": "B0B2HXJZ98",
    "name": "Samsung Galaxy Watch 5 Pro 45mm Smartwatch with GPS, Heart Rate, Fitness Tracking - Titanium, Sapphire Glass, Improved Battery",
    "ratings": 2.728,
    "price": "$239.99",
    "image": "https://m.media-amazon.com/images/I/61TPFvgM7pL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "ADVANCED SLEEP COACHING: Manage your overall sleep quality with an advanced sleep tracker that detects and analyzes sleep stages while you rest; Plus, Advanced Sleep Coaching helps you develop better sleep habits by analyzing your sleep patterns*.Supported Application:Fitness Tracker,Elevation Tracker,GPS,Multisport Tracker,Time Display. Connectivity technology:Bluetooth. Wireless comm standard:Bluetooth,802_11_AGNAC     BODY COMPOSITION ANALYSIS (BIA)**: Galaxy Watch5 Pro provides body composition data right on your wrist; On your own schedule, you can now get readings on body fat, skeletal muscle, body water, basal metabolic rate and Body Mass Index (BMI)     IMPROVED SENSOR ACCURACY: Stay up to date on your wellness; Get an accurate heart rate thanks to an improved, curved Samsung BioActive Sensor that gets closer to your skin***     AUTO WORKOUT TRACKING: Make the most of every adventure with Auto Workout Tracking — from running to rowing to swimming — automatically in just minutes, and manually tracking more than 90 exercises, including complex activities like HIIT****     IMPROVED BATTERY & GALAXY CONNECTED EXPERIENCE: With its improved battery life, it’s built to keep going on lengthy adventures in the great outdoors;***** Do more on your adventures with synced Galaxy devices that work in perfect harmony******     SAPPHIRE CRYSTAL GLASS & TITANIUM CASE: From hiking to rock climbing, its 2x stronger,***** sapphire crystal glass display is ready for intense activities in rough outdoor environments; And with its super-tough titanium case, you can train worry-free     GPS ROUTE TRACKING & TRACK BACK: All-new Route Tracking lets you follow GPX-format routes on your Watch; Use Track Back to help you back to the place you started from; Stay on track thanks to voice- or vibration-guided turn-by- turn navigation*******",
    "details": {
      "brand": "N/A",
      "operatingSystem": "Android Wear 1.0",
      "memoryStorageCapacity": "16000 MB",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "Bluetooth",
      "color": "N/A"
    }
  },
  {
    "id": "B07MFZXR1B",
    "name": "SAMSUNG 970 EVO Plus SSD 2TB - M.2 NVMe Interface Internal Solid State Drive with V-NAND Technology (MZ-V7S2T0B/AM)",
    "ratings": 58.582,
    "price": "$174.49",
    "image": "https://m.media-amazon.com/images/I/51Brl+iYtvL._AC_SX300_SY300_.jpg",
    "description": "Always Evolving SSD: The 970 EVO Plus is powered by the latest V-NAND technology and firmware optimization, maximizing the potential of NVMe bandwidth; Comes in storage capacities of up to 2TB, with reliability of up to 1,200 TBW.Computer Platform:PC.Internal Storage : Samsung V-NAND 3-bit MLC. Voltage : 3.3 V ± 5 % Allowable voltage.Allowable Voltage : 3.3 V ± 5 % Allowable voltage.     Breakthrough Read/Write Speeds: The 970 EVO Plus reaches sequential read/write speeds up to 3,500/3,300 MB/s, up to 53%* faster than the 970 EVO     Samsung Magician for Data Security: This software provides a suite of user-friendly tools that help you keep your drive up to date, monitor drive health and speed, and even boost performance     Superior Heat Dissipation: Samsung’s Dynamic Thermal Guard automatically monitors and maintains optimal operating temperatures to minimize performance drops     7 Year Limited Warranty: The 970 EVO Plus provides up to 1200 TBW (Terabytes Written) with 5-years of protection for exceptional endurance powered by the latest V-NAND technology and Samsung's reputation for quality",
    "details": {
      "brand": "SAMSUNG",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "NVMe",
      "color": "Black"
    }
  },
  {
    "id": "B0D9C8DDKZ",
    "name": "SAMSUNG Galaxy Buds 3 AI True Wireless Bluetooth Earbuds, Sound Optimization, Real-Time Interpreter, Noise Cancelling, Redesigned Fit, Touch Control, Latin American Version (Silver)",
    "ratings": 39,
    "price": "$120.72",
    "image": "https://m.media-amazon.com/images/I/51D-S5Va4WL.__AC_SY300_SX300_QL70_FMwebp_.jpg",
    "description": "Compatibility & Battery Life: The Samsung Galaxy Buds 3 are compatible with Android devices running Android 8.0 or later with at least 1.5GB RAM. They provide 6-8 hours of playback depending on Active Noise Cancellation (ANC) use, and up to 12 hours with the charging case​. Case can charged wireless or wired.     Audio Features: The Buds3, with the power of Bluetooth 5.4, features SSC HiFi and UHQ audio codecs, offering 24bit/96KHz audio for high-quality sound.     ANC & AI Features: They include Active Noise Cancellation (ANC), along with Galaxy AI for enhanced features like real-time language translation and voice optimization in noisy environments. (**Galaxy AI Features Require Samsung Galaxy Device).     Call Features: The Super Wideband (SWB) microphones, combined with Galaxy AI, enhance call quality by capturing a wider bandwidth and reconstructing lost voice bits, ensuring clear communication even in challenging conditions​.     International Model without Domestic Warranty. Optimized for Android devices, especially Samsung Galaxy phones, but they can also work with iOS devices through Bluetooth connectivity. Advanced features such as Galaxy AI, SSC HiFi/UHQ audio codecs, and real-time language translation are Only supported for Galaxy Android Devices.",
    "details": {
      "brand": "SAMSUNG",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "Silver"
    }
  },
  {
    "id": "B0C1PRYPYX",
    "name": "SAMSUNG PRO Plus microSD Memory Card + Adapter, 512GB microSDXC, Up to 180 MB/s, Full HD & 4K UHD, UHS I, C10, U3, V30, A2, for Android Smartphones, Tablets, GoPRO, and DJI Drone (MB MD512SA/AM)",
    "ratings": 25.297,
    "price": "$44.99",
    "image": "https://m.media-amazon.com/images/I/61nIJnYeOPL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "YOUR NEW GO-TO CARD: Capture seamless 4K videos¹ on your compatible phone or drone, while expanded storage gives you the freedom to play more high-performance, intensive games on your tablet or gaming device     TAKE YOUR BURST SHOT: Fast U3, Class 10 rated read/write speeds up to 180/130MB/s²-³ let you shoot more photos faster and transfer with ease⁴; 4K videos look sharp with UHS-I, V30 rated speed and A2 rating provides more storage for apps and games     ADD SPACE, KEEP IT ALL: Huge capacities of 128GB, 256GB and 512GB give you plenty of storage space; Shoot as many long takes⁵-⁷ and high-resolution photos8-9 as you want, or load up on apps and media; Now you’ve got the room     YOU’RE FULLY PROTECTED: The PRO Plus takes on life’s adventures with water¹⁰, temperature¹¹, X-ray¹², magnet¹³, drop¹⁴, and wearout¹⁵ protection; You deserve reliable storage, backed by a 10-year limited warranty¹⁶-¹⁹     WORLD’S #1 FLASH MEMORY BRAND: Performance and reliability from the world’s #1 brand for flash memory since 2003¹⁸; All firmware and components are produced in-house, including our world renowned DRAM and NAND, for quality and you can trust",
    "details": {
      "brand": "SAMSUNG",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "512 GB",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "New Pro Plus MicroSD",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "N/A"
    }
  },
  {
    "id": "B06Y1WKKLL",
    "name": "TG Imaging Compatible MLTR116 Imaging Drum Replacement for Samsung MLT-R116 MLT-D116L MLT-D118L (1xDrum)",
    "ratings": 125,
    "price": "$22.99",
    "image": "https://m.media-amazon.com/images/I/41A10lTi9IL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "Package Included: MLT-R116 x1 (DRUM UNIT)     Toner cartridges (MLT-D116L) are SOLD SEPARATELY     Printers: M2835DW, Xpress M2625, Xpress M2625D, Xpress M2626, Xpress M2825DW, Xpress M2825ND, Xpress M2826, SL-M2885FW/XAA, Xpress M2675, Xpress M2675F, Xpress M2675FN, Xpress M2676, Xpress M2875, Xpress M2875FD, Xpress M2875FW, Xpress M2876     Yields up to 9,000 pages @ 5% coverage",
    "details": {
      "brand": "TG Imaging",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "Black"
    }
  },
  {
    "id": "B0D63573CF",
    "name": "Tile by Life360 Mate (2024) Bluetooth Tracker, Keys Finder and Item Locator for Keys, Bags and More. Phone Finder. Both iOS and Android Compatible. 2-Pack (Black/White)",
    "ratings": 1.242,
    "price": "$44.99",
    "image": "https://m.media-amazon.com/images/I/51qSsKf+5BL._AC_SY300_SX300_.jpg",
    "description": "THE EVERYTHING TRACKER: Protect lost or stolen stuff and make family life easier. Attach to everyday things like keys, water bottles, or bags     STAY SAFE WITH SOS: Discreetly trigger an SOS alert to your loved ones in unsafe situations     FIND YOUR THINGS: Ring your misplaced Tile, or track it down in the free app     FIND YOUR PHONE: Phone hiding under a cushion? Use your Tile to make it ring — even when silenced     USE WITH LIFE360: Add your Tiles to Life360 — a top family connection and safety app – to see everything and everyone on the same map     WORKS WITH iOS AND ANDROID: The free Tile app works for all households and individuals     TECH SPECS: 350-foot / 105m Bluetooth range. Up to 3-year battery. Water resistant (IP68 rated)     GIVE THE GIFT OF FINDING: Tile is an easy and functional gift for family and friends",
    "details": {
      "brand": "Tile",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "N/A"
    }
  },
  {
    "id": "B0DC5LFDTL",
    "name": "65w USB C Fast Charger 3 Ports with Foldable Plug Adapter Compatible for MacBook Pro/air, Ipad Pro, Charge for iPhone 16/15, Samsung Galaxy S24/s23, Google Pixel, and More",
    "ratings": null,
    "price": "$29.99",
    "image": "https://m.media-amazon.com/images/I/6163K1Ng5GL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "65W Fast Charging Efficiency: Single C1 or C2 port to get an impressive 65W Max charging power, which can charge for MacBook Pro 13 inch (2024/2022/2020) or charger for iPhone 16 pro max at full speed , easily from 2% to 55% in 30 minutes, High-speed charging for compatible devices such as phones, tablets, and laptops     3 in 1 Versatile Charger: Acceron 65w 3 ports usb fast charger provides intelligent current distribution to ensure you get the best charge, which can charge 3 devices (phones, tablets, and laptops) simultaneously, Use one charger to charge more devices, say goodbye to multiple chargers     Travel Friendly, Compact Design: A foldable plug provides more portability and a better travel experience, which is durable, compact and portable, perfect for easy storage, The 6-foot long USB C cable allows you to use your electronic devices comfortably while charging quickly     Wide Compatibility: Perfected to work with both PD & QC, PPS charging protocols for seamless use with your tablets, laptops, smartphones, and all USB-charged devices at the same time. 65w 3 ports usb fast charger block is compatible with Macbook Series, Dell XPS Series, Google Pixelbook, Microsoft Surface Book, iPhone Series, Samsung Series, Google Pixel Series, iPad Series, Galaxy Tab Series, AirPods, Apple Watch, Nintendo Switch, and More     Safe, Stable, and Durable: Utilizing GaN technology, this 65w USB C charger 3 ports has built-in intelligent chip multiple protection system to protect your devices from damage, avoid overvoltage, overcharging, overheating, charge your Phone/iPad/MacBook and more devices quickly, safely and stably     What You Get: Acceron 65w 3 ports usb foldable fast wall charger*1 and 6ft usb c charging cable 100w*1, We offer 2-year warranty, while 24*7 friendly customer support ensures your pleasing shopping experience. If you have any questions, please do not hesitate contact us",
    "details": {
      "brand": "Acceron",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "USB",
      "color": "white"
    }
  },
  {
    "id": "B0D634BYLV",
    "name": "Tile by Life360 Mate (2024) Bluetooth Tracker, Keys Finder and Item Locator for Keys, Bags and More. Phone Finder. Both iOS and Android Compatible. 4-Pack (Black)",
    "ratings": 1.242,
    "price": "$79.99",
    "image": "https://m.media-amazon.com/images/I/617TtwZKmCL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "THE EVERYTHING TRACKER: Protect lost or stolen stuff and make family life easier. Attach to everyday things like keys, water bottles, or bags     STAY SAFE WITH SOS: Discreetly trigger an SOS alert to your loved ones in unsafe situations     FIND YOUR THINGS: Ring your misplaced Tile, or track it down in the free app     FIND YOUR PHONE: Phone hiding under a cushion? Use your Tile to make it ring — even when silenced     USE WITH LIFE360: Add your Tiles to Life360 — a top family connection and safety app – to see everything and everyone on the same map     WORKS WITH iOS AND ANDROID: The free Tile app works for all households and individuals     TECH SPECS: 350-foot / 105m Bluetooth range. Up to 3-year battery. Water resistant (IP68 rated)     GIVE THE GIFT OF FINDING: Tile is an easy and functional gift for family and friends",
    "details": {
      "brand": "Tile",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "N/A"
    }
  },
  {
    "id": "B0CH82J32K",
    "name": "ELECOM 65W USB C Wall Charger Block, 3 Multi Port GaN II Plus Fast Charging, Compact Power Adapter for Multiple Devices, iPhone, Laptop, Tablet, iPad, Airpods, Watch, Speakers, Samsung (Black)",
    "ratings": 107,
    "price": "$25.99",
    "image": "https://m.media-amazon.com/images/I/61uZik2WINL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "65W GAN II FAST CHARGING: This ultra-fast charging power adapter elevates charging performance by using the advantages of GaN II technology, delivering superior power density and efficiency when compared to conventional silicon-based models. Resulting in compact, lightweight designs that minimize energy loss, optimize energy utilization, and reduce heat generation.     3-PORT POWER BRICK: Featuring (2) USB-C and (1) USB-A ports, this versatile power adapter offers flexibility to charge multiple devices (cell phone, airpods, and mini laptops) simultaneously without compromising on power speed or performance.     SAFETY FEATURES: Feel secure with ELECOM’s Multi-Protect safety system, providing superior protection for your device and ensuring peace of mind when charging. Equipped with built-in temperature detection, short circuit protection, overload protection, and overvoltage protection, offering all-around security for your devices.     MULTIPLE DEVICE COMPATIBILITY: This wall charger is easily powers various devices, like iPhone, iPhone Pro and Pro Max, other smart phones (Samsung Galaxy, Android, Google Pixel), iPad Air/Mini, Tablets, Apple Watch, Airpods, or Lower Powered Laptops.     INTELLIGENT POWER DELIVERY: Our wall charger adapts to your devices with Smart Power Delivery (PD), automatically adjusting the charging output for fast and safe charging. Powered by Programmable Power Supply (PPS) technology, it optimizes charging efficiency by precisely matching power levels to your device's requirements.     SCRATCH AND SMUDGE-RESISTANT: Made from high-quality materials, this wall charger block features a durable construction that effectively resists scratches and smudges, maintaining its sleek appearance over time.     LIGHTWEIGHT AND COMPACT: Designed with portability in mind, take this small wall charger with you wherever you go, ensuring that you never run out of power when you need it the most. Plus, its folding plug makes it effortless to store and take on the go.     PRODUCT DIMENSIONS: Size: 2.0\" W x 1.5\" L x 1.6\" H. Weight: 3.2 oz.",
    "details": {
      "brand": "ELECOM",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "USB",
      "color": "Black"
    }
  }
]