[
  {
    "id": "B0DCLCPN9T",
    "name": "SAMSUNG Galaxy S24 FE AI Phone, 128GB Unlocked Android Smartphone, High-Res 50MP Camera, Long Battery Life, Brighter Display Screen, US Version, 2024, US 1 Yr Manufacturer Warranty, Graphite",
    "ratings": 37,
    "price": "$552.54",
    "image": "https://m.media-amazon.com/images/I/61uakkLoHxL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "MOVE IT. REMOVE IT. IMPROVE IT: Take a great pic, then make it better using Photo Assist¹ with Galaxy AI,² It gives you suggestions for improving your photo and makes it easier to move, remove or resize objects for post-worthy pics every time.     NEVER BE LOST IN TRANSLATION AGAIN: Understand text, calls and in-person conversations in another language using real-time translations¹ with Galaxy AI.²     SLOW-MO MADE SIMPLE: Sometimes you just want to make the moment last longer. Using Instant Slow-Mo¹ with Galaxy AI,² simply tap and hold to replay any video in epic slow motion.     DO MORE W/ EPIC BATTERY POWER: Do what you love, whether work or play, without worrying about your battery. Galaxy S24 FE intuitively manages your apps to make your charge last longer.⁴.     CAPTURE HIGHLIGHTS IN LOW LIGHT: Poorly lit portraits? Not anymore. Bring details out of the dark with Night Portrait. Using AI,² your Galaxy S24 FE can analyze and optimize your low-light shots and make them shine.",
    "details": {
      "brand": "SAMSUNG",
      "operatingSystem": "One UI 6.1, Android 14",
      "memoryStorageCapacity": "128 GB",
      "screenSize": "N/A",
      "resolution": "2340 x 1080 , Refresh Rate 120Hz, 1,900nits(peak)",
      "modelName": "Galaxy S24 FE",
      "wirelessCarrier": "Unlocked for All Carriers",
      "cellularTechnology": "5G",
      "connectivity": "N/A",
      "color": "N/A"
    }
  },
  {
    "id": "B0CSB22F9C",
    "name": "Samsung Galaxy A15 (SM-155M/DSN), 128GB 6GB RAM, Dual SIM, Factory Unlocked GSM, International Version (Wall Charger Bundle) (Light Blue)",
    "ratings": 1.09,
    "price": "$157.99",
    "image": "https://m.media-amazon.com/images/I/51rp0nqaPoL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "Super Vivid And Bright Display     Stay In The Zone With A 2-day Battery     Get It Done With Boosted Performance",
    "details": {
      "brand": "SAMSUNG",
      "operatingSystem": "Android 13.0",
      "memoryStorageCapacity": "128 GB",
      "screenSize": "N/A",
      "resolution": "1080 x 2340",
      "modelName": "N/A",
      "wirelessCarrier": "Unlocked",
      "cellularTechnology": "4G",
      "connectivity": "USB",
      "color": "N/A"
    }
  },
  {
    "id": "B0CV4NH5T9",
    "name": "SAMSUNG Galaxy A35 5G A Series Cell Phone, 128GB Unlocked Android Smartphone, AMOLED Display, Advanced Triple Camera System, Expandable Storage, Rugged Design, US Version, 2024, Awesome Lilac",
    "ratings": 396,
    "price": "$324.99",
    "image": "https://m.media-amazon.com/images/I/71hvjmD42tL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "CIRCLE IT, SEARCH IT, FIND IT. JUST LIKE THAT: What’s your favorite influencer wearing? Where’d they go on vacation? What’s that word mean? Don’t try to describe it — use Circle to Search with Google¹ and get the answer in a snap     OUR BRIGHTEST GALAXY A SERIES SCREEN YET: Thanks to Vision Booster, the screen seamlessly adjusts to your surroundings so you can enjoy uninterrupted streaming, gaming or browsing² even on the sunniest afternoon     STUNNING SHOTS. VIVID VIDEO: Advanced triple-lens camera of turns every moment into a masterpiece; With high-res photos & high-definition video, it’s easy to capture awe-worthy content and optical image stabilization lets you capture it blur-free     CAPTURE THE NIGHT LIKE NEVER BEFORE: Your nights just became a whole lot brighter with Galaxy A35 5G; Whether it’s fireworks, birthday candles or smiles under the stars, low-light photos and videos look clear as day with stunning Nightography     NOW THERE’S EVEN MORE IN STORE: Enjoy big storage for big memories; With an upgraded internal storage of 128GB and up to 1TB expandable storage³; A35 5G keeps all your memories close without worry of running low on space",
    "details": {
      "brand": "SAMSUNG",
      "operatingSystem": "ONE UI 6.0, Android 14",
      "memoryStorageCapacity": "128 GB",
      "screenSize": "N/A",
      "resolution": "1080 x 2340",
      "modelName": "Galaxy A35",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "N/A"
    }
  },
  {
    "id": "B0CN1QSH8Q",
    "name": "SAMSUNG Galaxy A15 5G A Series Cell Phone, 128GB Unlocked Android Smartphone, AMOLED Display, Expandable Storage, Knox Security, Super Fast Charging, US Version, 2024, Blue Black",
    "ratings": 810,
    "price": "$179.99",
    "image": "https://m.media-amazon.com/images/I/41vU1u8DZXL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "YOUR CONTENT, SUPERSMOOTH: Whether watching shows, playing games or reading online, the ultra-clear, superfluid display¹ of Galaxy A15 5G brings your content to life; Plus, Vision Booster lets you to enjoy the bright 800-nits screen experience     STORE MORE & WORRY LESS: With improved internal storage of up to 128GB and up to 1TB² of expandable storage, Galaxy A15 5G makes it easy to keep cherished photos, videos and important files readily accessible whenever you need them     MANAGE PERSONAL DATA w/ CONFIDENCE: Securely manage your files and rest easy knowing your sensitive data is safeguarded with the fortified layers of Knox Security     LIVE FAST. CHARGE FASTER: Focus more on the moment and less on your battery percentage with Galaxy A15 5G; Super Fast Charging³ powers up your battery at lightning speed so you can get back to life sooner     A DIGITAL WALLET IS ALREADY IN YOUR GALAXY: Carry your essentials conveniently in the digital wallet that’s made for your Galaxy phone and Watch⁴",
    "details": {
      "brand": "SAMSUNG",
      "operatingSystem": "Android 13 or later",
      "memoryStorageCapacity": "128 GB",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "Galaxy A15",
      "wirelessCarrier": "Unlocked for All Carriers",
      "cellularTechnology": "5G",
      "connectivity": "USB Type C",
      "color": "Black"
    }
  },
  {
    "id": "B0CMDPJ8Y8",
    "name": "SAMSUNG Galaxy S24 Ultra Cell Phone, 512GB AI Smartphone, Unlocked Android, 50MP Zoom Camera, Long Battery Life, S Pen, US Version, 2024, Titanium Violet",
    "ratings": 3.214,
    "price": "$1,180.00",
    "image": "https://m.media-amazon.com/images/I/71qeTVe5d1L.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "CIRCLE & SEARCH¹ IN A SNAP: What’s your favorite influencer wearing? Where’d they go on vacation? What’s that word mean? Don’t try to describe it — use Circle to Search1 with Google to get the answer; With S24 Series, circle it on your screen and learn more     REAL EASY, REAL-TIME TRANSLATIONS: Speak foreign languages on the spot with Live Translate²; Unlock the power of convenient communication with near real-time voice translations, right through your Samsung Phone app     NOTE SMARTER, NOT HARDER: Focus on capturing your notes and spend less time perfecting them; Note Assist³ will summarize, format, and even translate them for you; All of your notes are organized neatly so that you can find what you need     BRING DETAILS OUT OF THE DARKNESS: Brighten up your night with Nightography on S24 Ultra; Want a closer look? Zoom in from a distance, even in low light     MORE WOW, LESS WORK: Turn every photo into a post-worthy masterpiece; Move or remove objects; Fill in empty space; Simply snap a pic and take it from great to jaw-dropping with Generative Edit⁴     CAPTURE. SHARE. IMPRESS: Create crystal-clear content worth sharing; From bustling cityscape to a serene landscape, capture a masterpiece of detail with 200MP camera and let S24 Ultra adjust each hue and shade to reflect the world as you see it     OUR MOST POWERFUL GALAXY SMARTPHONE YET: Jump seamlessly between apps without the wait and see content in high quality with our fastest processor yet, Snapdragon 8 Gen 3 for Galaxy⁵",
    "details": {
      "brand": "SAMSUNG",
      "operatingSystem": "Android 14, One UI 6.1",
      "memoryStorageCapacity": "512 GB",
      "screenSize": "N/A",
      "resolution": "3120 x 1440 pixels",
      "modelName": "Galaxy S24 Ultra",
      "wirelessCarrier": "Unlocked for All Carriers",
      "cellularTechnology": "5G",
      "connectivity": "N/A",
      "color": "N/A"
    }
  },
  {
    "id": "B0D1YLBBMB",
    "name": "Samsung Galaxy Watch Ultra 47mm LTE AI Smartwatch w/Energy Score, Wellness Tips, Heart Rate Tracking, Sleep Monitor, Fitness Tracker, GPS, 2024,Titanium Silver [US Version, 1Yr Manufacturer Warranty]",
    "ratings": 706,
    "price": "$482.43",
    "image": "https://m.media-amazon.com/images/I/817QHxxq34L.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "RUGGED. RELIABLE. READY FOR ANYTHING: Climb the highest peak; Bike the long way home; The durable titanium design is our toughest yet, able to stand up to the rigors of your workout, including rainy or dusty conditions — even ocean swimming¹     USE YESTERDAY TO BEAT TODAY: Meet your biggest competition — you; Challenge yourself to perform at your peak on your next run or bike ride using tracking with Galaxy AI²; It lets you compare your current performance to your last one³     KNOW YOUR SCORE. OWN YOUR DAY: Get personalized insights that help you perform at your peak every day; Know your physical readiness using Energy Score with Galaxy AI²; It calculates a score based on yesterday’s sleep, heart rate and steps⁴     PERSONALIZED TIPS TO UNLOCK THE BEST YOU: Stay at your best using daily personalized suggestions from Wellness Tips⁵; Gain information based on insights collected by your Watch and analyzed on your phone     MORE PRECISE HEART RATE TRACKING: Zero in on more precise readings during workouts using Heart Rate Tracking with Galaxy AI⁴ that filters out the physical movements of your body; Insights are collected by your Watch and analyzed on your phone",
    "details": {
      "brand": "N/A",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "N/A"
    }
  },
  {
    "id": "B0CSB14R7J",
    "name": "Samsung Galaxy A15 A155M 128GB Dual-SIM GSM Unlocked Android Smartphone (Latin America Version) - Blue Black",
    "ratings": 669,
    "price": "$149.98",
    "image": "https://m.media-amazon.com/images/I/515zGEaozeL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "Display: 6.5 inches, Super AMOLED - 1080 x 2340 pixels     Memory: 128GB, 6GB RAM - MicroSD, up to 1TB     Camera: Triple - 50MP(OIS)+ 5MP + 2MP, Selfie - 13 MP     Platform: Android -- Mediatek Helio G99 -- Octa-core -- Mali-G57 MC2     Battery: 5000 mAh, non-removable     Dimensions: 6.30 x 3.02 x 0.33 in, 7.05 oz",
    "details": {
      "brand": "SAMSUNG",
      "operatingSystem": "Android 14",
      "memoryStorageCapacity": "128 GB",
      "screenSize": "N/A",
      "resolution": "1080 x 2340",
      "modelName": "Samsung Galaxy A15",
      "wirelessCarrier": "Unlocked",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "N/A"
    }
  },
  {
    "id": "B0D9YZJ3V7",
    "name": "SAMSUNG Galaxy Buds 3 Pro AI True Wireless Bluetooth Earbuds, Noise Cancelling, Sound Optimization, Real-Time Interpreter, Redesigned Comfort Fit, Silver [US Version, Amazon Exclusive 2Yr Warranty]",
    "ratings": 259,
    "price": "$188.99",
    "image": "https://m.media-amazon.com/images/I/61zW8yc4hTL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "REDESIGNED WITH THE BEST SOUND IN MIND: Keep your Galaxy Buds3 Pro in with a design that delivers long-lasting comfort for an immersive listening experience     A SLEEK DESIGN MADE TO SHINE: Let your sound shine as much as you do with Buds3 Pro that light up¹     AUDIO THAT ADAPTS TO YOUR SURROUNDINGS: Immerse yourself while staying alert to your surroundings thanks to Adaptive Active Noise Cancellation with Galaxy AI²; Your Buds will automatically adapt to help you hear what matters²     AUDIO TAILORED TO BEST FIT YOU: Immerse yourself in the best listening experience, no matter how you wear your Galaxy Buds3 Pro; An Adaptive Equalizer for Sound Optimization with Galaxy AI allows you to get the most out of your audio²     SOUND THAT TRANSPORTS YOU: Your favorite content deserves our best and most immersive audio¹     THEY SAY “HOLA,” YOU HEAR “HELLO: Hear translations through your Galaxy Buds during face-to-face conversations using Real-Time Interpreter with Galaxy AI³     YOUR BEST BUDS FOR TRANSLATING CALLS: Hear translations through your Galaxy Buds while using the Samsung Phone app³",
    "details": {
      "brand": "SAMSUNG",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "Silver"
    }
  },
  {
    "id": "B0CLF3VPMV",
    "name": "Samsung Galaxy Tab A9+ Tablet 11” 64GB Android Tablet, Big Screen, Quad Speakers, Upgraded Chipset, Multi Window Display, Slim, Light, Durable Design, US Version, 2024, Graphite",
    "ratings": 6.587,
    "price": "$169.99",
    "image": "https://m.media-amazon.com/images/I/61d46oYQgdL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "BIG SCREEN. FAMILY-SIZED FUN: Bring fun home to everyone with a bright, engaging screen; great for videos, games or fun time for the kids (11” 1920 x 1200, 90Hz, 480 nits, TFT LCD)     RICH SOUND ALL AROUND: Your music; Your shows; Your games; Hear them all loud and clear, thanks to quad speakers powered by Dolby Atmos; Galaxy Tab A9+ delivers a cinema-like audio experience your ears will love     POWER FOR ALL YOU DO. STORAGE FOR ALL YOU LOVE: Watch videos, play games and do more with an upgraded chipset; 4GB RAM + 64GB | 8GB RAM + 128GB | Up to 1TB expandable storage; Processor Qualcomm Snapdragon 69     SEE and USE MULTIPLE APPS AT ONCE: Open multiple apps at once with Galaxy Tab A9+ and accomplish more seamlessly; Bounce between the things like a multitasking pro — browse the internet, check email and jot down notes all on one screen     LOVED BY KIDS. TRUSTED BY PARENTS: Give your kids a safe place to learn and play with the Samsung Kids app⁵ ; Kids will love a wide variety of playful, colorful content that keeps them entertained while stimulating their young minds     SLIM. LIGHT. DURABLE: Carry your Tab easily with a slim, light design that’s also durable; Galaxy Tab A9+ is the perfect blend of performance and portability to help you bring the fun with you wherever you go     SEND FILES IN A FLASH: Sharing files has never been easier with Quick Share⁶ ; Select the file you want to share on your device —from a video clip to a photo, then easily transfer the file to another device whether it’s Android or iOS",
    "details": {
      "brand": "SAMSUNG",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "64 GB",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "A9+",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "N/A"
    }
  },
  {
    "id": "B0CF7GYNW2",
    "name": "SAMSUNG Galaxy Buds FE True Wireless Bluetooth Earbuds, Comfort and Secure in Ear Fit, Auto Switch Audio, Touch Control, Built-in Voice Assistant, Graphite [US Version, 1Yr Manufacturer Warranty]",
    "ratings": 2.833,
    "price": "$59.99",
    "image": "https://m.media-amazon.com/images/I/613cPuOz5OL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "Includes 1 year limited manufacturer warranty     THEY SAY “HOLA,” YOU HEAR “HELLO”: Now you can communicate freely with someone in another language; Use the Interpreter feature on your Galaxy phone to hear real-time translations through your Galaxy Buds during face-to-face conversations¹     PHONE TO EAR, TRANSLATIONS YOU HEAR: Phoning a relative back home or calling in reservations while traveling , break down language barriers w/ Galaxy Buds & Live Translate; Using the Samsung Phone app, hear real-time translations through your Buds¹     DESIGNED FOR COMFORT. SHAPED TO FIT: Listen comfortably all day with the new wing-tip design that keeps your Buds in place     HEAR WHAT YOU WANT, NOT WHAT YOU DON’T: Hear what you want how you want thanks to Active Noise Cancellation     PAIRS EASILY WITH YOUR GALAXY: Galaxy Buds FE pair easily to your other Galaxy devices through your Samsung account; Just open the case, tap to connect² and your paired Buds FE show up in your list of devices     AUDIO THAT SWITCHES AUTOMATICALLY: With Auto Switch³, Buds FE connect to whatever device you need so you don’t miss a beat; Stream a movie on your Tab — if a call comes through on your phone, you can answer through your Buds FE",
    "details": {
      "brand": "SAMSUNG",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "Graphite"
    }
  },
  {
    "id": "B0DC5LFDTL",
    "name": "65w USB C Fast Charger 3 Ports with Foldable Plug Adapter Compatible for MacBook Pro/air, Ipad Pro, Charge for iPhone 16/15, Samsung Galaxy S24/s23, Google Pixel, and More",
    "ratings": null,
    "price": "$29.99",
    "image": "https://m.media-amazon.com/images/I/6163K1Ng5GL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "65W Fast Charging Efficiency: Single C1 or C2 port to get an impressive 65W Max charging power, which can charge for MacBook Pro 13 inch (2024/2022/2020) or charger for iPhone 16 pro max at full speed , easily from 2% to 55% in 30 minutes, High-speed charging for compatible devices such as phones, tablets, and laptops     3 in 1 Versatile Charger: Acceron 65w 3 ports usb fast charger provides intelligent current distribution to ensure you get the best charge, which can charge 3 devices (phones, tablets, and laptops) simultaneously, Use one charger to charge more devices, say goodbye to multiple chargers     Travel Friendly, Compact Design: A foldable plug provides more portability and a better travel experience, which is durable, compact and portable, perfect for easy storage, The 6-foot long USB C cable allows you to use your electronic devices comfortably while charging quickly     Wide Compatibility: Perfected to work with both PD & QC, PPS charging protocols for seamless use with your tablets, laptops, smartphones, and all USB-charged devices at the same time. 65w 3 ports usb fast charger block is compatible with Macbook Series, Dell XPS Series, Google Pixelbook, Microsoft Surface Book, iPhone Series, Samsung Series, Google Pixel Series, iPad Series, Galaxy Tab Series, AirPods, Apple Watch, Nintendo Switch, and More     Safe, Stable, and Durable: Utilizing GaN technology, this 65w USB C charger 3 ports has built-in intelligent chip multiple protection system to protect your devices from damage, avoid overvoltage, overcharging, overheating, charge your Phone/iPad/MacBook and more devices quickly, safely and stably     What You Get: Acceron 65w 3 ports usb foldable fast wall charger*1 and 6ft usb c charging cable 100w*1, We offer 2-year warranty, while 24*7 friendly customer support ensures your pleasing shopping experience. If you have any questions, please do not hesitate contact us",
    "details": {
      "brand": "Acceron",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "USB",
      "color": "white"
    }
  },
  {
    "id": "B0DFP17H38",
    "name": "SHEZI [Upgrade 4 in 1 Charging Cable, 60W [Full Chrager Only 0.8h][1GB Transfer Only 12s] Flat Silicone Multi Fast Charge Phone Cord with USB A/Type C/Light-ning for iPhone iPad Samsung, 5FT",
    "ratings": 13,
    "price": "$26.99",
    "image": "https://m.media-amazon.com/images/I/71-hxCuleiL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "Unique Liquid Silicone Material: Our usb c cable use the latest liquid silicone rubber as a material to make the cable softer, stronger, more resistant to dirt, is able to fully withstand stress and it feels incredibly soft between your fingers and is one of the strongest cables ever made. It won't get tangled even when tucked into a bag or pocket, making it perfect for carrying around.     4-in-1 Versatile Simplify Design: Our usb to usb c cable has different ports, including Light-ning/USB A/Type C connectors. Support to charge 99% phones available on the market. It's super handy to carry and meets all your demands on families, travel or work, business trips, and other occasions. ﻿     Fastest Charging in History: Our usb c to light-ning cable can charge your device at the fastest speed. Fully charge a iPhone 15 pro to 96%, a Switch to 90%, a Samsung S23 to 96%, a MacBook Pro to 86% and an iPad Pro to 89% in 35 minutes. NOTE: Please use a charger with the corresponding wattage or higher that our product could output maximum power.     Super Fast Data Transfer: Supports the USB 2.0 standard with unmatched data transfer speed up to maximum 480Mbps. This usbc cable is compatible with USB2 devices and transfer music, movies, or videos in seconds at maximum 480Mbps, 1GB files transfer only 12s.     Support CarPlay & Android Auto: This usb c to usb c cable 100% supports both Android Auto and Carplay which charging and navigating at the same time. Whether you have the usb c or light-ning port devices in your car, we can perfectly work for you. So no longer need to carry cables for each device, make you life more convenient.     Ultra High-Quality Assurance: This usb a to usb c cable has been tested to withstand at least 10,000 cycles of 90-degree bend and 10,000 plugging and unplugging lifespan which is 12 times stronger than all original cables, its zinc alloy cable housing is highly resistant to wear and scratches. You don't need to replace the charging cable within 3 years.     More Promise Less Concern: If you encounter any issues with your usb to light-ning cable, contact us via Amazon Message Center. Our dedicated customer support team is available to assist you with any questions or concerns you may have within 12 hours.",
    "details": {
      "brand": "SHEZI",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "USB",
      "color": "Green"
    }
  },
  {
    "id": "B0CYHZ11CM",
    "name": "Samsung Galaxy A55 5G A556E 256GB Dual-SIM GSM Unlocked Android Smartphone (Latin Variant/US Compatible LTE) - Awesome Navy",
    "ratings": 128,
    "price": "$340.50",
    "image": "https://m.media-amazon.com/images/I/61s7W4UjnoL.__AC_SY300_SX300_QL70_FMwebp_.jpg",
    "description": "Display: 6.6” FHD+ Super AMOLED w/Corning Gorilla Glass Victus+ - Resolution 1080 x 2340 pixels     Memory: 256GB 8GB RAM - MicroSD up to 1TB     Camera: Triple 50 MP + 12 MP + 5 MP w/ LED flash, panorama, HDR -- Selfie 32 MP     Platform: OS, Android -- Chipset, Exynos 1480 -- CPU, Octa-core -- GPU, Xclipse 530     Battery: Li-Ion 5000 mAh, non-removable     Dimensions: 6.34 x 3.05 x 0.32 in, 7.51 oz",
    "details": {
      "brand": "SAMSUNG",
      "operatingSystem": "Android 14 with Samsung One UI 6.1",
      "memoryStorageCapacity": "8 GB",
      "screenSize": "N/A",
      "resolution": "1080 x 2340",
      "modelName": "Galaxy A55 5G",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "N/A"
    }
  },
  {
    "id": "B0D198N6Y6",
    "name": "SAMSUNG Galaxy Z Fold 6 AI Cell Phone, 512GB Unlocked Android Smartphone, Circle to Search, Handsfree Live Interpreter, AI Photo Edits, Large Screen, 2024,US 1 Yr Manufacturer Warranty, Navy",
    "ratings": 145,
    "price": "$1,649.94",
    "image": "https://m.media-amazon.com/images/I/61896OtgvGL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "CIRCLE IT. FIND IT. SEE IT: Make huge discoveries when you use Circle to Search¹ with Google on the large screen of Galaxy Z Fold6; Circle those shoes on your feed and easily see where to buy them; Search is easier than ever on an expansive screen     TWO SCREENS. ZERO LANGUAGE BARRIER: Say bye to being lost in translation & hi to fluency in up to 16 languages with Interpreter with Galaxy AI; In FlexMode, phone displays translations on both sides of the screen for easy in-person conversation²     SMART AI EDITS. BRILLIANT PHOTOS: Editing photos is even easier on the large screen of Galaxy Z Fold6; See more detail as you instantly fix imperfections, move and remove objects and enhance colors using AI smart tools like Generative Edit and more³     IMMERSIVE SCREEN. IMPRESSIVE GRAPHICS: Level up your screen and level up your gaming experience; Totally immerse yourself with Galaxy Z Fold6 thanks to a huge screen, a lightning-fast processor and incredibly realistic graphics     MULTIPLE WINDOWS. MULTIPLE POSSIBILITIES: Edit, scroll and organize; Or chat, shop and stream — all at the same time on up to three windows; When it comes to viewing and doing more, Fold6 is built to handle more⁴",
    "details": {
      "brand": "SAMSUNG",
      "operatingSystem": "OneUI 6.1, Android 14",
      "memoryStorageCapacity": "512 GB",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "Galaxy Z Fold6",
      "wirelessCarrier": "Unlocked for All Carriers",
      "cellularTechnology": "5G",
      "connectivity": "Bluetooth, Wi-Fi, USB, NFC",
      "color": "N/A"
    }
  },
  {
    "id": "B0CV31FT2V",
    "name": "Samsung Galaxy A15 (SM-155M/DSN), 128GB 6GB RAM, Dual SIM, Factory Unlocked GSM, International Version (Ring Grip Case Bundle) (Blue Black)",
    "ratings": 269,
    "price": "$164.49",
    "image": "https://m.media-amazon.com/images/I/31KxYNFW0CL.__AC_SY300_SX300_QL70_FMwebp_.jpg",
    "description": "4G LTE Bands: 1, 3, 5, 7, 8, 20, 28, 38, 40, 41 (GSM ONLY)     Packaging contains the cell phone, a USB C to USB C cable, and a sim tray ejector tool. Seller provides a USB C wall adapter.     Display: Super AMOLED, 90Hz, 800 nits (HBM) | 6.5 inches, 103.7 cm2 (~84.3% screen-to-body ratio) | 1080 x 2340 pixels, 19.5:9 ratio (~396 ppi density)     Cameras: 50 MP, f/1.8, (wide), AF | 5 MP, f/2.2, (ultrawide) | 2 MP, f/2.4, (macro)     This device is compatible with any GSM carrier outside of the United States. In the United States, this device is only compatible with T-Mobile and their MVNO's(Mint, Ultra, Ting, Tello, etc.)     Operating System: Android; Cpu Model Family: mediatek_helio",
    "details": {
      "brand": "SAMSUNG",
      "operatingSystem": "Android",
      "memoryStorageCapacity": "128 GB",
      "screenSize": "N/A",
      "resolution": "1080 x 2340",
      "modelName": "Samsung Galaxy A15",
      "wirelessCarrier": "Unlocked",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "N/A"
    }
  },
  {
    "id": "B0CHFSZX9W",
    "name": "SAMSUNG T9 Portable SSD 4TB, USB 3.2 Gen 2x2 External Solid State Drive, Seq. Read Speeds Up to 2,000MB/s for Gaming, Students and Professionals,MU-PG4T0B/AM, Black (Pack of 1)",
    "ratings": 1.146,
    "price": "$299.99",
    "image": "https://m.media-amazon.com/images/I/71EESd1deTL.__AC_SY300_SX300_QL70_FMwebp_.jpg",
    "description": "NONSTOP SPEED: Race through projects with our fastest SSD for creators; Load, edit and transfer with sustained read and write speeds of up to 2,000MB/s1; The T9 Portable SSD performs at high speeds even during longer processes     DYNAMIC THERMAL GUARD: When you’re elbow-deep in a passion project, the T9 Portable SSD stays cool; Its advanced thermal solution withstands and controls heat to keep the SSD at ideal temperatures—even in heavy use2     ADAPTS TO EVERY NEED: Whether you’re using a desktop, camera or a gaming console3, count on the T9 Portable SSD for extensive compatibility; It’s a true team player when it comes to heavy-duty application usage or file-saving     STRONG. SOLID. STABLE: From concept to completion – the T9 Portable SSD gives you the longevity to last through heavy use with one convenient drive that dares to go the distance     WORKS LIKE MAGIC: Your T9 Portable SSD performs like new with the always up-to-date Magician Software; With firmware updates, extra encryption and continual monitoring of your drive health, it works like a charm     WORLD’S #1 FLASH MEMORY BRAND: Performance and reliability from the world’s #1 brand for flash memory since 20034; All firmware and components are produced in-house, including our world renowned DRAM and NAND, for quality and you can trust     SUPPORTS iPHONE: Supports iPhone 15 Pro Res 4K at 60fps video and more5; Included SSD cable recommended",
    "details": {
      "brand": "SAMSUNG",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "USB 3.2 Gen 2x2",
      "color": "Black"
    }
  },
  {
    "id": "B0C797946T",
    "name": "Samsung Galaxy Watch 6 44mm Bluetooth Smartwatch, Fitness Tracker, Personalized HR Zones, Advanced Sleep Coaching, Heart Monitor, BIA Sensor, Health Wellness Insights, Big Screen, US Version, Graphite",
    "ratings": 5.811,
    "price": "$189.99",
    "image": "https://m.media-amazon.com/images/I/711f6KLsMaL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "KEEP YOUR GOALS ON TRACK: Workout to your full potential with fitness tracking* on Galaxy Watch6; Get insights on duration, distance, calories burned and more; Watch recognizes activities from running to swimming and tracks over 90 other exercises     FIND YOUR ZONE: Zone in on the results you want with personalized heart rate zones**; Watch scans your health data to provide HR zones tailored just for you; Target your preferred intensity to maintain the heart rate needed to achieve your goals     SLEEP COACH ON YOUR WRIST: Get the insights to develop better sleep habits with Advanced Sleep Coaching*; Use Watch to plan your bedtime, detect snoring*** and understand and track your sleep stages (awake, light, deep, REM)     ALWAYS-ON HEART MONITORING****: Your Watch continually scans your heart rate to inform you when it’s detected an irregular rhythm that might be A-fib — a heart-related abnormality that can lead to serious complications     KNOW YOUR BODY INSIDE & OUT: Stay in the know about your body with the advanced BIA sensor*****; Use your Watch to get readings on body fat, skeletal muscle, body water, Body Mass Index (BMI) and more*     KEEP CONNECTED ON THE GO: Your Watch syncs with your other Galaxy devices seamlessly so you can play your favorite music, control your smartphone camera, make calls, text and do more from anywhere******     OUR LARGEST WATCH DISPLAY YET: See even more on our largest display yet******* and quickly navigate apps thanks to an improved interface; Plus, durable crystal glass keeps screen looking great and protected from bumps and scratches     MAKE MOVES IN STYLE: Match any mood or style with a wide variety of bands — now even easier to swap with one simple click********; Then accent your look with an assortment of new and enhanced Watch faces",
    "details": {
      "brand": "SAMSUNG",
      "operatingSystem": "Android",
      "memoryStorageCapacity": "16000 MB",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "Bluetooth, Wi-Fi",
      "color": "N/A"
    }
  },
  {
    "id": "B0CDW3B9J2",
    "name": "USB C to USB C Cable 3ft 2Pack Coiled USB C Charger Cable for Car Type C Fast Charging Cable for iPhone 16/15/Plus/Pro/Pro Max/Samsung Galaxy S23",
    "ratings": 578,
    "price": "$17.99",
    "image": "https://m.media-amazon.com/images/I/61GcQf0oMFL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "USB C to USB C Cable Fast Charging for Car: Coiled type c car charger with spring shape design, portable and not tangled. It can well save the use of space in the car and say goodbye to the hassle of data cable clutter and tangles.     Fast Charge and Data Transfer: Our Type C fast charging cable supports PD3.0 and QC3.0 fast charging with a max 60W (20V 3A) output and data transfer speeds up to 480Mbps.     3FT Short USB C to Type C Charger Cord: Retractable usb-c cable 1.5FT (stretchable to 4FT, comfortable stetch length 2ft-3ft) and bounce back to normal length. If you use it in the front seat of your car and store your Android device in a compartment, or connected to a rechargeable battery, or put in the pocket of clothes, or office, or travel, we recommend choosing 3 feet. Type-c fast charging cable 3f can meet your different needs.     Perfect Compatibility: USB-C to USB-C cable well compatible with iPhone 16/16 Plus/16 Pro/16 Pro Max/15/15 Plus/ 15 Pro/ 15 Pro Max/MacBook Pro 2020/iPad Pro 2020/iPad Air 4/Samsung Galaxy S10 S10e S10+ Plus 5G S8 S8+ S9 S9+ S8 Plus S9 Plus, Note 8 Note 9 Note10 Note10+ Plus 5G, A10e A20 A30 A40 A40s A50 A60 A70 A80 M30s A9/9s A9 Star A8s(2018) A6s C9 C7Pro C5Pro. LG G5 G6 G7 V40 V35 ThinQ V30S V30 V20 Stylo 4 5. G7/G7 Plus/ G7 Power/G6 /G6 Plus( NOT include G6 Play) Z Z2 Z3 X4, LG G6 G7, Pixel 2 XL etc.     What you get: 2 Pack 3ft coiled usb c to usb c charger cable.     Professional After-Sales Team: If you have any questions, please feel free to contact us, we will be happy to serve you and give you an easy and pleasant shopping experience.",
    "details": {
      "brand": "KIYODA",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "N/A"
    }
  },
  {
    "id": "B0CCX11JT6",
    "name": "Samsung Galaxy Tab S9 FE 10.9” 128GB WiFi Android Tablet, Large Display, Long Battery Life, Powerful Processor, S Pen, 8MP Camera, Lightweight Durable Design, Expandable Storage, US Version,2023, Gray",
    "ratings": 1.941,
    "price": "$307.49",
    "image": "https://m.media-amazon.com/images/I/417bx91cc8L.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "CIRCLE IT, SEARCH IT, FIND IT. JUST LIKE THAT: Search for anything you see on your Galaxy Tab S9 FE Series screen simply by circling it. From discovering where to buy those awesome shoes to getting a recipe based on a dish your friend just posted, find answers fast using Circle to Search with Google.¹     A SCREEN FOR ALL YOUR ADVENTURES: Start every adventure with a large, beautiful 10.9\" screen. Whether you’re a multitasker, a gamer or a devoted movie watcher, you’ll feel closer to the action. Plus, dual speakers make everything sound amazing     BUILT FOR ADVENTURE: An IP68 rating makes Galaxy Tab S9 FE one of the only water- and dust-resistant tablets on the market. It’s built to last wherever you use it, making it a great choice for first-time tablet buyers     A BATTERY THAT KEEPS YOU IN CHARGE: With a tablet this powerful, portable and fun, you’ll never want to put it down. Go up to 18 hours with a long-lasting battery and get a full charge in less than 90 minutes with Super Fast Charging     POWER FOR ADVENTURE: The latest Exynos chipset lets you own the day and stay in touch. Cross off your to-do list and video chat with your college roomie miles away. Whatever you’re doing, Galaxy Tab S9 FE makes for rich experiences     SMART TECH, BEAUTIFULLY MADE: Galaxy Tab S9 FE complements your personality perfectly. Plus, with a refined design that’s sleek and lightweight, you’ll be able to show off your great taste anywhere you use your Tab     PEN-POINT PRECISION: There’s virtually no limit to what you can do with S Pen. Write notes by hand. Draw a comic strip or mark up a document. Pen features a responsive design that feels like you’re writing on actual paper",
    "details": {
      "brand": "SAMSUNG",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "6 GB",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "Tab S9 FE",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "N/A"
    }
  }
]