[
  {
    "id": "B0DFP17H38",
    "name": "SHEZI [Upgrade 4 in 1 Charging Cable, 60W [Full Chrager Only 0.8h][1GB Transfer Only 12s] Flat Silicone Multi Fast Charge Phone Cord with USB A/Type C/Light-ning for iPhone iPad Samsung, 5FT",
    "ratings": 13,
    "price": "$26.99",
    "image": "https://m.media-amazon.com/images/I/71-hxCuleiL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "Unique Liquid Silicone Material: Our usb c cable use the latest liquid silicone rubber as a material to make the cable softer, stronger, more resistant to dirt, is able to fully withstand stress and it feels incredibly soft between your fingers and is one of the strongest cables ever made. It won't get tangled even when tucked into a bag or pocket, making it perfect for carrying around.     4-in-1 Versatile Simplify Design: Our usb to usb c cable has different ports, including Light-ning/USB A/Type C connectors. Support to charge 99% phones available on the market. It's super handy to carry and meets all your demands on families, travel or work, business trips, and other occasions. ﻿     Fastest Charging in History: Our usb c to light-ning cable can charge your device at the fastest speed. Fully charge a iPhone 15 pro to 96%, a Switch to 90%, a Samsung S23 to 96%, a MacBook Pro to 86% and an iPad Pro to 89% in 35 minutes. NOTE: Please use a charger with the corresponding wattage or higher that our product could output maximum power.     Super Fast Data Transfer: Supports the USB 2.0 standard with unmatched data transfer speed up to maximum 480Mbps. This usbc cable is compatible with USB2 devices and transfer music, movies, or videos in seconds at maximum 480Mbps, 1GB files transfer only 12s.     Support CarPlay & Android Auto: This usb c to usb c cable 100% supports both Android Auto and Carplay which charging and navigating at the same time. Whether you have the usb c or light-ning port devices in your car, we can perfectly work for you. So no longer need to carry cables for each device, make you life more convenient.     Ultra High-Quality Assurance: This usb a to usb c cable has been tested to withstand at least 10,000 cycles of 90-degree bend and 10,000 plugging and unplugging lifespan which is 12 times stronger than all original cables, its zinc alloy cable housing is highly resistant to wear and scratches. You don't need to replace the charging cable within 3 years.     More Promise Less Concern: If you encounter any issues with your usb to light-ning cable, contact us via Amazon Message Center. Our dedicated customer support team is available to assist you with any questions or concerns you may have within 12 hours.",
    "details": {
      "brand": "SHEZI",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "USB",
      "color": "Green"
    }
  },
  {
    "id": "B08FXRTYPH",
    "name": "$30/mo. Mint Mobile Phone Plan with Unlimited Talk, Text & Data for 3 Months (3-in-1 SIM Card)",
    "ratings": 17.26,
    "price": "$45.00",
    "image": "https://m.media-amazon.com/images/I/61GjGBJErFL.__AC_SY300_SX300_QL70_FMwebp_.jpg",
    "description": "WHAT YOU GET: Three (3) months of unlimited talk, text, and data delivered on the nation’s largest 5G network. Data speeds reduce after 40GB of usage but data is unlimited. Videos stream at 480p.     OH, YOU GET THIS TOO: 5G for Free + 10GB of mobile hotspot + Wi-Fi calling and text + free international calls to Mexico and Canada + 7-day money back guarantee     HOW YOU GET IT: The SIM Kit comes with a 3-in-1 SIM card that includes standard/micro/nano sizes, insert the SIM into your device, and activate on the Mint Mobile website or app. You can activate service on your own unlocked device with our Bring Your Own Phone (BYOP) program. Check your coverage and phone compatibility on the Mint Mobile website.     WHO SHOULD GET IT: Anyone who hates their phone bill     WHY YOU SHOULD GET IT: Mint Mobile took what’s wrong with wireless and made it right. We re-imagined the wireless shopping experience and made it easy and online.     LEGAL STUFF: Capable device required. Coverage not available in all areas. New activation and upfront payment of 90 USD for 3-month plan (30/mo. equiv.) req’d; while supplies last. Intro rate for first 3 months only; then full-price plan options available. Restrictions apply. See full terms on Mint Mobile website.",
    "details": {
      "brand": "Mint Mobile",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "GSM",
      "connectivity": "N/A",
      "color": "N/A"
    }
  },
  {
    "id": "B09WB2NL8W",
    "name": "Samsung Type-C™ USB Flash Drive, 256GB, Transfers 4GB Files in 11 Secs w/Up to 400MB/s 3.13 Read Speeds, Compatible w/USB 3.0/2.0, Waterproof, 2022, Blue, MUF-256DA/AM",
    "ratings": 11.404,
    "price": "$27.99",
    "image": "https://m.media-amazon.com/images/I/817xK9Cd6JL.__AC_SY300_SX300_QL70_FMwebp_.jpg",
    "description": "USB-C STORAGE ON THE GO: This sleek drive is supported by Samsung NAND flash and is incredibly compact to fit in the palm of your hand; Count on reliable performance and fast transfer speeds while staying compact     PERFORMANCE WITH SPEED: No need to choose between performance and reliability; Experience a fast, powerful flash drive that transfers 4GB files in just 11 seconds with up to 400MB/s USB 3.13 read speeds and is backward compatible with USB 3.0/2.0     MODERN MEETS ICONIC: The ultra-sleek USB-C drive looks as good as it performs; Featuring a reversible plug, the Type-C inserts into your devices seamlessly every time; Transfer large files with style and ease     ALWAYS CONNECTED: USB-C is compatible across devices, including laptops, tablets, phones and cameras, with enough space for 63,730 photos or maximum 12 hours of 4K video; With up to 256GB of storage space, this pocket-sized thumb drive comes in handy wherever you go     TOUGH & TRUSTED: Files stay secure, no matter the terrain; Samsung's flash memory technology makes the Type-C a trustworthy drive to store your valuable data; It's waterproof, shock-proof, magnet-proof, temperature-proof, and X-ray-proof body, plus it's backed by a 5-year limited warranty     SUPPORTS iPHONE 15: ProRes 4K at 30fps video and more",
    "details": {
      "brand": "SAMSUNG",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "256 GB",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "N/A"
    }
  },
  {
    "id": "B09BFRV59N",
    "name": "SAMSUNG Galaxy S21 FE 5G Cell Phone, Factory Unlocked Android Smartphone, 128GB, 120Hz Display Screen, Pro Grade Camera, All Day Intelligent Battery, US Version, 2022, White",
    "ratings": 14.93,
    "price": "$308.95",
    "image": "https://m.media-amazon.com/images/I/61S8-z34EFL.__AC_SY300_SX300_QL70_FMwebp_.jpg",
    "description": "SMOOTH SCROLLING: The 120Hz display delivers a super smooth scroll, with optimized refresh rate, and a fast touch response gives seamless visuals in both work and play.Form_factor : Smartphone     REAL DISPLAY VISION: The high quality display with Dynamic AMOLED 2X delivers vibrant color and brightness, even in bright sunlight     PRO-GRADE CAMERA: The powerful pro grade camera delivers high quality photos and videos, with a Rear Camera that boasts 12MP Ultra Wide, Wide-angle cameras and an 8MP Telephoto Camera; It also features a Front Camera that includes a 32MP Selfie Camera     30X SPACE ZOOM: 30x SpaceZoom combines a 3x Hybrid Optic Zoom and 30x digital zoom for high resolution close ups, while the EngageZoom Lock reduces shakiness the further your zoom in     SUPERIOR PERFORMANCE: The power-efficient processor chip offers reliability and performance that boosts every experience, from graphic-heavy gaming to multitasking.     ALL DAY INTELLIGENT POWER: The 4500mAh intelligent battery outlasts the day, even on 5G, while Super Fast Charging can charge 50% in 30 minutes.",
    "details": {
      "brand": "SAMSUNG",
      "operatingSystem": "Android",
      "memoryStorageCapacity": "128 GB",
      "screenSize": "N/A",
      "resolution": "2340 x 1080",
      "modelName": "Galaxy S21 FE",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "N/A"
    }
  },
  {
    "id": "B0CWPNR918",
    "name": "SAMSUNG EVO Select microSDMemory Card + Adapter, 1TB microSDXC, Up-to 160 MB/s, 4K UHD, UHS-I, C10, U3, V30, A2, for Mobile Phone, Smartphones, Nintendo-Switch, and Tablets (MB-ME1T0SA/AM)",
    "ratings": 89.43,
    "price": "$89.99",
    "image": "https://m.media-amazon.com/images/I/71UvozhmlRL.__AC_SY300_SX300_QL70_FMwebp_.jpg",
    "description": "ADAPTER INCLUDED: Your microSD card includes a Samsung adapter that works with your computer, handheld gaming console, tablet or camera—and virtually any device with an SD card slot; Transfer files with no fuss— and no need to hunt for extra tech     READ/WRITE SPEEDS UP TO 160 MB/s: The EVO Select is ready to save real-time moments with ultrafast transfer speeds of up to 160 MB/s; Transfer everything instantly and capture each memory as it comes with an SD that keeps up with your real life¹     STORAGE CAPACITIES FROM 64GB - 1TB: Save every second in mere minutes with storage capacities ranging from 64GB to 1TB; It’s always reliable with the right amount of space to fit your lifestyle, so you can hold on to the things that matter most     U3, CLASS 10, A2, V30 & UHS-I INTERFACE: Ultra-high-speeds; Crystal clear 4K UHD video and content complete with the latest U3 and V30 speeds for faster transfers and more memory² on-the-spot, all while recording full HD 1080p and 3D video, too     6 PROOF PROTECTION w/ 10-YEAR LIMITED WARRANTY: The Samsung EVO Select microSD is tough enough to take on anything; With protection covering everything from water to extreme temperatures— it can handle wear and tear⁴⁻¹¹",
    "details": {
      "brand": "SAMSUNG",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "1000 GB",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "EVO Select",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "N/A"
    }
  },
  {
    "id": "B08QBMD6P4",
    "name": "SAMSUNG 870 EVO SATA SSD 500GB 2.5” Internal Solid State Drive, Upgrade PC or Laptop Memory and Storage for IT Pros, Creators, Everyday Users, MZ-77E500B/AM, Black",
    "ratings": 40.94,
    "price": "$52.99",
    "image": "https://m.media-amazon.com/images/I/911ujeCkGfL.__AC_SY300_SX300_QL70_FMwebp_.jpg",
    "description": "THE SSD ALL-STAR: The latest 870 EVO has indisputable performance, reliability and compatibility built upon Samsung's pioneering technology. S.M.A.R.T. Support: Yes.Specific uses: Business, personal     EXCELLENCE IN PERFORMANCE: Enjoy professional level SSD performance which maximizes the SATA interface limit to 560 530 MB/s sequential speeds,* accelerates write speeds and maintains long term high performance with a larger variable buffer     INDUSTRY-DEFINING RELIABILITY: Meet the demands of every task — from everyday computing to 8K video processing, with up to 600 TBW** under a 5-year limited warranty***     MORE COMPATIBLE THAN EVER: The 870 EVO has been compatibility tested**** for major host systems and applications, including chipsets, motherboards, NAS, and video recording devices     UPGRADE WITH EASE: Using the 870 EVO SSD is as simple as plugging it into the standard 2.5 inch SATA form factor on your desktop PC or laptop; The renewed migration software takes care of the rest     SAMSUNG MAGICIAN SOFTWARE: Samsung Magician 6 software**** helps you easily manage your drive, keep up the latest updates, monitor the drive's health and status, or even enhance its performance     WORLD'S #1 FLASH MEMORY BRAND: Experience the performance and reliability from the world's #1 brand for flash memory since 2003;***** All firmware and components, including Samsung's world-renowned DRAM and NAND, are produced in-house, allowing end-to-end integration for quality you can trust. Samsung 512 MB Low Power DDR4 SDRAM",
    "details": {
      "brand": "SAMSUNG",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "SATA 6Gb/s",
      "color": "Black"
    }
  },
  {
    "id": "B0D18R2DYS",
    "name": "SAMSUNG Galaxy Z Flip 6 AI Cell Phone, 512GB Unlocked Android Smartphone, FlexCam, Photo Assist, Camcorder Mode, Live Interpreter, Foldable Design, 2024, US 1 Yr Manufacturer Warranty, Blue",
    "ratings": 176,
    "price": "$1,219.99",
    "image": "https://m.media-amazon.com/images/I/61mSUSY4xWL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "DON’T STOP TO CROP: Capture stunning hands-free photos using FlexCam with Galaxy AI to frame up your shot automatically; Whether you’re posing in front of a famous landmark or want to get the whole group in, keep everything you want in frame¹     TAKE PICS FROM GOOD TO GREAT WITH GALAXY AI: Galaxy Z Flip6 takes great photos and easily fixes imperfections, moves objects and enhances colors using Photo Assist with Galaxy AI²     FLEX A NEW WAY TO CAPTURE VIDEO: Capture social content in a fun new way with Camcorder Mode; When held in FlexMode, Galaxy Z Flip6 lets you easily control the cam with one hand and use Smooth Zoom control to record moments as they happen     YOUR TINY, MIGHTY TRANSLATOR: Say bye to being lost in translation & hi to fluency in up to 16 languages using Interpreter with Galaxy AI; In FlexMode, your phone displays translations on both sides of the screen for easy in-person conversation³     REPLY ON THE FLY WITH GALAXY AI: Complete simple tasks & send texts without opening your phone on FlexWindow with Galaxy AI; Get quick reply text suggestions based on the context of your conversation, use Bixby to change songs hands-free and more⁴",
    "details": {
      "brand": "SAMSUNG",
      "operatingSystem": "OneUI 6.1, Android 14",
      "memoryStorageCapacity": "512 GB",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "Galaxy Z Flip6",
      "wirelessCarrier": "Unlocked for All Carriers",
      "cellularTechnology": "5G",
      "connectivity": "N/A",
      "color": "N/A"
    }
  },
  {
    "id": "B0BLZN9NDG",
    "name": "SAMSUNG,Galaxy A04e (SM-A042M/DS) Dual SIM 32GB,6.5'' GSM Unlocked,International Version-Black",
    "ratings": 751,
    "price": "$87.10",
    "image": "https://m.media-amazon.com/images/I/71O2YkTlq-L.__AC_SY300_SX300_QL70_FMwebp_.jpg",
    "description": "This is an international device     NO WARRANTY - Factory Unlocked     This phone is compatible only with T-Mobile     Mint - Tello - Metro in USA Market and any GSM provider in Latin America",
    "details": {
      "brand": "SAMSUNG",
      "operatingSystem": "Android",
      "memoryStorageCapacity": "3 GB",
      "screenSize": "N/A",
      "resolution": "720 x 1600",
      "modelName": "A04e",
      "wirelessCarrier": "Unlocked for All Carriers",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "N/A"
    }
  },
  {
    "id": "B0CB9357F7",
    "name": "SAMSUNG 25W Wall Charger Power Adapter with Cable, Super Fast Charging, Compact Design, Compatible with Galaxy and USB Type C Devices, Black",
    "ratings": 369,
    "price": "$21.99",
    "image": "https://m.media-amazon.com/images/I/61x6AO7aCJL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "LIGHTNING FAST AND EFFICIENT: The new power adapter accommodates your active lifestyle by giving you up to 25W of Super Fast Charging* for devices compatible with USB Type-C cables**; So when you do run low on power, it won't be for long     SMALL SIZE. BIG POWER: Don't let its size fool you; The compact 25W Power Adapter packs huge power into a slimmer and more travel-friendly design***, all thanks to GaN Tech****     POWER WITH A PURPOSE: New 25W Power Adapter reduces its power from 20mW to just 5mW when not in use to save power; Plus, it includes recycled content, reflecting our commitment to being environmentally conscious in everything we do*****     CHARGE WITH CONFIDENCE: The new 25W Power Adapter helps protect your devices from overcurrent, short circuits, high temperatures, leakage and more**     ONE ADAPTER. MULTIPLE CHARGING POSSIBILITIES: Meet your new go-to for all your charging needs****** Whether powering up your workstation, fueling your Galaxy devices or giving life to any Type-C-cable-compatible gadget, it has you covered**",
    "details": {
      "brand": "SAMSUNG",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "USB",
      "color": "Black"
    }
  },
  {
    "id": "B0CL8CJPVM",
    "name": "SAMSUNG Galaxy Buds Fan Edition(FE) SM-R400, Active Noise-Cancelling, Wireless Bluetooth v5.2 Earbuds, Android 8.0 and Up - (Graphite)",
    "ratings": 1.029,
    "price": "$50.80",
    "image": "https://m.media-amazon.com/images/I/51aqlXxVgFL.__AC_SY300_SX300_QL70_FMwebp_.jpg",
    "description": "New wingtip design | 3 sizes of eartips included     Active Noise Cancellation     Touch controls for Pause/Play, Skip, Previous     Seamless pairing     Bluetooth v5.2",
    "details": {
      "brand": "SAMSUNG",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "Graphite"
    }
  },
  {
    "id": "B08FRS3R32",
    "name": "SAMSUNG Galaxy S20+ Plus 5G Factory Unlocked Android Cell Phone SM-G986U US Version | 128GB | Fingerprint ID & Facial Recognition | Long-Lasting Battery (Cosmic Black, 128GB)",
    "ratings": 367,
    "price": "$247.62",
    "image": "https://m.media-amazon.com/images/I/71eDFQCMCbL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "Power of 5G: Get next-level power for everything you love to do with Samsung Galaxy 5G; Share more, game harder, experience more and never miss a beat     Single Take AI: Capture video and multiple types of images with one tap of the shutter button; Lenses, effects and filters capture the best of every moment, every time     Hi-Res Camera Zoom: Capture hi-res images as if you’re 3 feet away, from 100 feet away; Whether you want to zoom in close from afar or magnify details nearby, the new 30x Space Zoom gives you impressive power and clarity     Bright Night Mode: Capture crisp images and vibrant video in Bright Night mode and create high-quality content in low light – no flash needed     Super Fast Charging: Charge up quicker with Super Fast Charge so you can keep moving with more juice; Give your buds – or Galaxy buds – a boost of power with Wireless PowerShare right from Galaxy S20+ Plus 5G",
    "details": {
      "brand": "SAMSUNG",
      "operatingSystem": "android",
      "memoryStorageCapacity": "128 GB",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "Samsung Galaxy S20+ Plus 5G",
      "wirelessCarrier": "Unlocked",
      "cellularTechnology": "5G",
      "connectivity": "Wi-Fi",
      "color": "Cosmic Black"
    }
  },
  {
    "id": "B0DHKQJ3HZ",
    "name": "USB C Car Charger 60W PD&QC3.0 Super Fast Car Charger Adapter JOYROOM Dual Port Car Phone Charger with 3.3ft 60W USB C Cable Fast Charging for iPhone 16 Samsung S24",
    "ratings": null,
    "price": "$19.99",
    "image": "https://m.media-amazon.com/images/I/71Qs1PO7TNL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "60W DUAL PORT CAR CHARGER FAST CHARGING: 60W(Max) super fast car charger usb c supports PD30W and QC3.0 30W high output and is compatible with PD3.0/QC3.0/AFC and FCP super fast charging protocol for all devices. JOYROOM USB c car charger, 10X faster than 2.4A charger, can rapidly charge iPhone 15 pro and Samsung Galaxy S23 from 0% to 80% in 35 minutes. Note: Best super fast charge partner 60W USB C-C Fast Charging Cable included.     EXTRA 3.3FT 60W USB C CABLE RIGHT FOR ALL Type C DEVICES: JOYROOM PD&QC 3.0 fast car charger adapter comes with 60W usb-C Nylon cable for you which support super fast charging for your Samsung Galaxy S23 S22 S21 Ultra/iPhone 16 Pro Max Plus     SMALLEST SIZE, FLUSH FIT: Tiny thumb-sized car charger fits most car cigarette lighters and barely protrudes past the edge of the outlet. It's JOYROOM smallest usb c car charger: lightweight and highly compact takes up no space in the car.     2024 New Upgraded cell car phone charger: JOYROOM All metal iPhone 15 pro max car charger is not only equipped with 3.3 ft 60w usb c cable, as well as the appearance of a soft LED colorful ambient light designed to help find the charging port more easily in the dark.     All Metal, Excellent Heat Dissipation: This dual port usb cigarette lighter adapter is designed with all-metal aluminum alloy, which not only has a textured appearance as well as more durable, but also the metal alloy material helps to improve the heat dissipation performance during the use of the car charger. Metal alloy car charger is safer than plastic car charger, reducing safety hazards.",
    "details": {
      "brand": "JOYROOM",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "USB C & Type C 60W Super Fast Car Charger",
      "color": "N/A"
    }
  },
  {
    "id": "B0DC5LFDTL",
    "name": "65w USB C Fast Charger 3 Ports with Foldable Plug Adapter Compatible for MacBook Pro/air, Ipad Pro, Charge for iPhone 16/15, Samsung Galaxy S24/s23, Google Pixel, and More",
    "ratings": null,
    "price": "$29.99",
    "image": "https://m.media-amazon.com/images/I/6163K1Ng5GL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "65W Fast Charging Efficiency: Single C1 or C2 port to get an impressive 65W Max charging power, which can charge for MacBook Pro 13 inch (2024/2022/2020) or charger for iPhone 16 pro max at full speed , easily from 2% to 55% in 30 minutes, High-speed charging for compatible devices such as phones, tablets, and laptops     3 in 1 Versatile Charger: Acceron 65w 3 ports usb fast charger provides intelligent current distribution to ensure you get the best charge, which can charge 3 devices (phones, tablets, and laptops) simultaneously, Use one charger to charge more devices, say goodbye to multiple chargers     Travel Friendly, Compact Design: A foldable plug provides more portability and a better travel experience, which is durable, compact and portable, perfect for easy storage, The 6-foot long USB C cable allows you to use your electronic devices comfortably while charging quickly     Wide Compatibility: Perfected to work with both PD & QC, PPS charging protocols for seamless use with your tablets, laptops, smartphones, and all USB-charged devices at the same time. 65w 3 ports usb fast charger block is compatible with Macbook Series, Dell XPS Series, Google Pixelbook, Microsoft Surface Book, iPhone Series, Samsung Series, Google Pixel Series, iPad Series, Galaxy Tab Series, AirPods, Apple Watch, Nintendo Switch, and More     Safe, Stable, and Durable: Utilizing GaN technology, this 65w USB C charger 3 ports has built-in intelligent chip multiple protection system to protect your devices from damage, avoid overvoltage, overcharging, overheating, charge your Phone/iPad/MacBook and more devices quickly, safely and stably     What You Get: Acceron 65w 3 ports usb foldable fast wall charger*1 and 6ft usb c charging cable 100w*1, We offer 2-year warranty, while 24*7 friendly customer support ensures your pleasing shopping experience. If you have any questions, please do not hesitate contact us",
    "details": {
      "brand": "Acceron",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "USB",
      "color": "white"
    }
  },
  {
    "id": "B0CV73SG4Z",
    "name": "SAMSUNG Galaxy S24 Ultra 5G S9280 Physical Dual SIM 512GB 12GB RAM AI Smartphone, Factory Unlocked, Global Model, Long Battery Life - Titanium Violet",
    "ratings": 70,
    "price": "$1,037.50",
    "image": "https://m.media-amazon.com/images/I/418KI8X9QBL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "Display Type: AMOLED; Width: 3. inches; Length: 6.8 inches; Height: 0.4 inches; Operating System: Android 11.0",
    "details": {
      "brand": "SAMSUNG",
      "operatingSystem": "Android 11.0",
      "memoryStorageCapacity": "12 GB",
      "screenSize": "N/A",
      "resolution": "1440 x 2960",
      "modelName": "N/A",
      "wirelessCarrier": "Unlocked",
      "cellularTechnology": "5G",
      "connectivity": "USB",
      "color": "N/A"
    }
  },
  {
    "id": "B0CW3VWC3X",
    "name": "SAMSUNG Galaxy FIT 3 [2024] 1.6\" AMOLED Display | 14 Days Battery Life | 100+ Watchfaces | 100+ Exercise Modes | International Model -",
    "ratings": 849,
    "price": "$45.94",
    "image": "https://m.media-amazon.com/images/I/61TJB03ROCL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "",
    "details": {
      "brand": "SAMSUNG",
      "operatingSystem": "Android",
      "memoryStorageCapacity": "2 GB",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "Bluetooth",
      "color": "N/A"
    }
  },
  {
    "id": "B0CY8Q7V4S",
    "name": "Samsung Galaxy A35 5G A356E 128GB Dual-SIM GSM Unlocked Android Smartphone (Latin Variant/US Compatible LTE) - Awesome Ice Blue",
    "ratings": 71,
    "price": "$257.50",
    "image": "https://m.media-amazon.com/images/I/614c+lTK3iL._AC_SY300_SX300_.jpg",
    "description": "Display: 6.6” FHD+ Super AMOLED w/Corning Gorilla Glass Victus+ - Resolution 1080 x 2340 pixels     Memory: 128GB 8GB RAM - MicroSD up to 1TB     Camera: Triple 50 MP + 8 MP + 5 MP w/ LED flash, panorama, HDR -- Selfie 13 MP     Platform: OS, Android -- Chipset, Exynos 1380 -- CPU, Octa-core -- GPU, Mali-G68 MP5     Battery: Li-Ion 5000 mAh, non-removable     Dimensions: 6.37 x 3.07 x 0.32 in, 7.37 oz",
    "details": {
      "brand": "SAMSUNG",
      "operatingSystem": "Android 14",
      "memoryStorageCapacity": "128 GB",
      "screenSize": "N/A",
      "resolution": "1080 x 2340",
      "modelName": "Galaxy A35 5G",
      "wirelessCarrier": "Unlocked",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "N/A"
    }
  },
  {
    "id": "B0BJH22XW6",
    "name": "SAMSUNG 27\" Odyssey G65B QHD 240Hz 1ms (GTG) HDR 600 Gaming Hub 1000R Curved Gaming Monitor",
    "ratings": 283,
    "price": "$402.92",
    "image": "https://m.media-amazon.com/images/I/81fwJfCNVJL.__AC_SY300_SX300_QL70_FMwebp_.jpg",
    "description": "QHD RESOLUTION: Your gaming world will be more life like than ever before. Packing in 1.7 times the pixel density of Full HD, QHD resolution boasts incrediblydetailed, pin-sharp images. Experience a fuller view with more space to take in all the action.     DISPLAYHDR 600: Reveal the whole picture. DisplayHDR 600 delivers more contrast, with deeper blacks and brighter whites to help you uncover enemies orsecrets lurking in the shadows. Even in dark scenes, every detail shines with clarity.     240Hz REFRESH RATE & 1ms(GTG) RESPONSE TIME: Speed through scenes. 240Hz refresh rate eliminates lag for exhilarating gameplay withultra-smooth action. Jump on enemies right when you see them with a 1ms(GTG)response time and blur-free frames.     AMD FREESYNC PREMIUM PRO: Effortlessly smooth game play. AMD FreeSync Premium Pro features adaptive sync technology which reduces screen tearing, stutter, and inputlatency. Low frame rate compensation ensures every scene flows seamlessly.     1000R CURVE: Vivid scenes wrap even more tightly around you. Experience the next level of heart-pounding gaming that's superior to anything you've seenbefore. The 1000R display fills your peripheral vision and draws you into the character's shoes.",
    "details": {
      "brand": "SAMSUNG",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "QHD 1440p",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "N/A"
    }
  },
  {
    "id": "B0D84MHZX5",
    "name": "SAMSUNG Galaxy Tab S10+ Plus 12.4” 256GB, Android Tablet, Circle to Search, Sketch to Image, Durability, Long Battery Life, AMOLED 2X Screen, S Pen Included, US Version, 2024, Moonstone Gray",
    "ratings": 29,
    "price": "$974.34",
    "image": "https://m.media-amazon.com/images/I/51LHmhoU-cL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "INNOVATIVE ART POWER: Turn your simple sketches into works of art instantly using Sketch to Image¹ with Galaxy AI.²     SEARCHING MADE EASY: Quickly search for just about anything you see on your Tab — all without switching apps — using Circle to Search with Google.³     MAKE A LONG STORY SHORT: Capture your lecture, meeting, or daily notes and let Note Assist⁴ with Galaxy AI² do the hard work of organizing and even summarizing them for you.     NEXT-LEVEL NOTE TAKING: Get transcripts and summaries of recorded lectures and meetings, just like that.⁵     PACKED WITH POWER: No matter what you take on or where you take your Galaxy Tab S10+, enjoy every experience with a powerful tablet processor.     BIG SCREEN. BREATHTAKING BRILLIANCE: Enjoy unbelievable brilliance with reduced glare from anywhere on a 12.4\" Dynamic AMOLED 2X screen.⁶     CONVENIENTLY CONTROL YOUR HOME: Enhance your home life using the SmartThings Home Insight Widget to conveniently automate home controls and see more at a glance with Map View on your Galaxy Tab S10 Series device.⁷",
    "details": {
      "brand": "SAMSUNG",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "256 GB",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "Tab S10+",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "N/A"
    }
  },
  {
    "id": "B0B1DJGJZ2",
    "name": "LK Samsung Wireless Charger 3 in 1 Samsung Charging Station Galaxy Watch Charger Compatible for Samsung S24 Ultra Plus S23 S22 S21 Z Fold Flip 6/5/4/3, Galaxy Watch 7/6/5 Pro/4/3(NOT for Watch Ultra)",
    "ratings": 7.978,
    "price": "$33.98",
    "image": "https://m.media-amazon.com/images/I/71KeAWCgPLL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "Perfect Choice for Samsung Users: LK Samsung Wireless Charger is specifically designed for your Samsung devices. Great for Galaxy Watch 7/6/6 Classic/5 Pro/5/4/3/Active2/1, Samsung Galaxy S24/S24 Plus/S24 Ultra S23 S22 S21 S20/Ultra/Plus/FE, Z Flip5/Fold 5/4/3/2, S10/S10e/S10+/S9/S9+, Galaxy Note20/10/9/8,Galaxy Buds/Pro/Live. NOTE: Only support earbuds with wireless charging cases. NOT COMPATIBLE FOR GALAXY WATCH ULTRA     Detachable Samsung Watch Charger: The Galaxy watch charger of this 3 in 1 wireless charger samsung is detachable so that you can charge your Samsung Watch separately with Type-C ports. It is ideal for Galaxy Watch 7/6/6 Classic/5 Pro/5/4/4 Classic/3/Active 2/1. And it's easy to carry and store. Attention: Not for Apple Watch, Galaxy Watch Gear, Sport, Fit, Live Series     Equipped Fast Charge QC 3.0 Adapter: The LK wireless charger is equipped with a QC 3.0 charger adapter, the maximum output power of the phone chargers is 15W, which helps ensure you don't have to wait too long to get back to 100% battery. Get back to your work or playtime quickly with the charging station capability     Phone Case Friendly: Our Samsung charging station can charge your phone normally without taking off your phone case (case thick recommended ≤ 5 mm), like silicone case, clear case, and official magnetic case. NOTE: The metal case, magnetic pad, credit card, grips & stands and case with a thickness greater than 0.2 in (5 mm) will interfere with charging. Please take off these cases when charging.     Friendly Charging Indicating: Independent LED indicator lights on the bottom of this Samsung wireless charging station provide a clear charging indication for each device, and it will not disturb your sleep time. You will know if your device is charging at a glance through the LED lights with this wireless charger android     Package & Service: You will get 1 x LK Wireless Charging Stand, 1 x QC3.0 18W Adapter, 1 x USB A-C Cable, 1 x User Manual and reliable 24-hour response service. 24 Months if you got any problems about the wireless charger. (Just simply tell us with your order number and we will give you the best solution as your wishes.)",
    "details": {
      "brand": "N/A",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "N/A"
    }
  },
  {
    "id": "B0CJYL1Q9S",
    "name": "Samsung SmartTag2 (2023) Bluetooth + UWB, IP67 Water and Dust Resistant, Findable via App, 1.5 Year Battery Life (4-Pack) - Black/White",
    "ratings": 2.086,
    "price": "$58.99",
    "image": "https://m.media-amazon.com/images/I/61M4PsB+WNL._AC_SX300_SY300_.jpg",
    "description": "Find your things with ease: The SmartThings Find app uses Bluetooth and ultra-wideband (UWB) technology to locate and keep track of your stuff     Water and Dust Resistant: IP67 rating offers protection against dust and water immersion between 15 cm and 1 meter for up to 30 minutes     Compatible with Galaxy Devices Only",
    "details": {
      "brand": "SAMSUNG",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "N/A"
    }
  }
]