[
  {
    "id": "B0DGKWXG66",
    "name": "Case for iPhone 16/16 Plus/16 Pro/16 Pro Max, Premium PU Leather Soft TPU Bumper Shockproof Protective Phone Cover, Soft Non-Slip Grip Anti-Scratch",
    "ratings": null,
    "price": "$49.99",
    "image": "https://m.media-amazon.com/images/I/71SgrNYRl7L.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "Selected Vintage PU Leather : Crafted from high-quality, textured PU leather, this case offers both style and durability, making it a long-lasting choice for daily protection.     Ultimate Drop Protection : Features a triple-layer design with premium PU leather, a soft TPU edge, and a hard interior PC shell to guard your phone against drops, shocks, and scratches.     All-Around Device Protection : The raised lips around the screen and camera provide extra protection, ensuring your phone stays safe from scratches on flat surfaces.     Precision Cutouts : Designed with precise cutouts for easy access to all ports, buttons, speakers, and the camera, so you can use all features without removing the case.     Slim & User-Friendly Design : The lightweight, slim design maintains your phone’s sleek profile while offering comprehensive protection.",
    "details": {
      "brand": "QANXGOG",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "Black"
    }
  },
  {
    "id": "B0DGL4JR1X",
    "name": "Case for iPhone 16/16 Plus/16 Pro/16 Pro Max, Clear [Not-Yellowing] with Leather Wristband [Military Grade Drop Protection]",
    "ratings": null,
    "price": "$43.99",
    "image": "https://m.media-amazon.com/images/I/71yMiUXmZsL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "Premium Leather Wristband: Equipped with a textured, stain-resistant leather wristband for a comfortable grip and stylish look. Perfect for on-the-go convenience.     Durable Anti-Drop Protection: High-toughness molecular material ensures complete protection from daily drops and shocks, keeping your phone safe at all times.     Scratch & Anti-Yellowing Backplate: The crystal-clear backplate resists scratches and prevents yellowing over time, maintaining a pristine look even with regular use.     0.3mm Lens & Screen Protection: Elevated edges around the camera lens and screen offer enhanced protection from scratches and direct impacts, preserving the integrity of your device.     Perfect Fit Design : Precise cutouts ensure easy access to speakers, power port, audio jack, and buttons. Slim, lightweight, and comfortable for all-day use, it’s ideal for both outdoor adventures and everyday activities.",
    "details": {
      "brand": "QANXGOG",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "Black"
    }
  },
  {
    "id": "B0DGL54K2G",
    "name": "Case for iPhone 16/16 Plus/16 Pro/16 Pro Max, Clear [Not-Yellowing] with Built-in Camera Stand [Military Grade Drop Protection]",
    "ratings": null,
    "price": "$43.99",
    "image": "https://m.media-amazon.com/images/I/61C958y0dFL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "[Built-in Stand]: This clear case features a built-in camera ring stand that supports wireless charging, ensuring convenience without compromising protection.     [Adjustable Kickstand]: The fully adjustable camera ring stand allows for a perfect viewing angle between 0-95°, making it ideal for video calls, watching videos, or browsing hands-free.     [Durable & Reliable]: The camera stand has been tested for over 3,000 rotations, featuring a zinc alloy structure that guarantees long-lasting durability and smooth operation.     [Premium Protection]: Crafted with a flexible TPU frame and crystal-clear PC back, this case showcases your phone’s original beauty while defending it against scratches, shocks, and drops.     [Precise Fit & Easy Access]: Designed with precisely aligned cutouts for the speaker, camera, and ports, ensuring full access to all buttons and features without any hassle.",
    "details": {
      "brand": "QANXGOG",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "Black"
    }
  },
  {
    "id": "B0DGKYPKF5",
    "name": "Case for iPhone 16/16 Plus/16 Pro/16 Pro Max, Heavy Duty Protective Metal Bumper Silicone Case with Stand Built-in Screen Protector, Outdoor Shockproof Cover",
    "ratings": null,
    "price": "$47.99",
    "image": "https://m.media-amazon.com/images/I/71IXn+QihJL._AC_SY300_SX300_.jpg",
    "description": "360° Full Body Protection : Guard your device from all angles with a reinforced metal frame, thick silicone outer shell, and built-in Gorilla Glass, offering comprehensive defense against serious drops, dirt, scrapes, and bumps.     Military-Grade Shock Absorption : Engineered with a shock-absorbing silicone layer and sturdy metal frame to withstand drops from heights up to 8 feet, exceeding MIL-STD 810G-516.6 military drop-test standards.     Magnetic Kickstand for Hands-Free Viewing : Enjoy seamless media viewing in both portrait and landscape modes with a built-in magnetic stand for added convenience and functionality.     Dust & Dirt Resistant Design : Covered buttons and port covers keep dust, dirt, and debris from clogging your device, while maintaining easy access to all functions.     Built for Adventure : Designed for rugged use by outdoor enthusiasts, truck drivers, and military personnel, this case offers the ultimate protection in extreme conditions.",
    "details": {
      "brand": "QANXGOG",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "Black"
    }
  },
  {
    "id": "B0DGL4Q7DW",
    "name": "Case for iPhone 16/16 Plus/16 Pro/16 Pro Max, [Military-Grade Drop Protection] Translucent Matte Hard Back with Soft Silicone Bumper Comfortable Case",
    "ratings": null,
    "price": "$44.99",
    "image": "https://m.media-amazon.com/images/I/61gdVU-xOdL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "Premium Protection : Hard translucent PC back and soft rubber bumper safeguard your device from daily wear and tear, keeping it protected without compromising style.     Ultra-Slim, Lightweight Design : Exact-fit, slim profile adds zero bulk, preserving your phone’s sleek form while ensuring top-notch protection.     Comfortable, Smudge-Free Grip : Nano Oleophobic Coating offers a smooth touch, repels fingerprints, grease, and scratches, maintaining a pristine look.     Enhanced Screen & Camera Protection : Raised lip design keeps your screen and camera safe from scratches and direct contact with flat surfaces.     Easy Access & Precise Fit : Enlarged port openings accommodate most cables, with responsive button covers for effortless operation. Quick to install and remove without causing any damage.",
    "details": {
      "brand": "QANXGOG",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "Black"
    }
  },
  {
    "id": "B0DGKDS8G1",
    "name": "Case for iPhone 16/16 Plus/16 Pro/16 Pro Max, Carbon Fiber Texture Thin Soft Silicone Shockproof Protective Cover",
    "ratings": null,
    "price": "$44.99",
    "image": "https://m.media-amazon.com/images/I/71RdPqKWdqL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "Premium Carbon Fiber Finish: Upgrade your iPhone with a sleek carbon fiber case that offers a high-tech look and superior protection, combining elegance and durability.     Perfect Fit & Function: Designed for precise fit, this case allows effortless access to all ports and buttons while providing robust edge-to-edge protection.     Stylish & Versatile: Black carbon fiber design complements any style, perfect for both professional and casual settings; ideal for both men and women.     Slim Yet Strong: Enjoy slim, lightweight protection that doesn't compromise on strength, offering comfort and robust protection against daily knocks and drops.     Enhanced Grip & Comfort: Textured carbon fiber finish ensures a secure, comfortable grip while adding a touch of luxury to your phone’s appearance.",
    "details": {
      "brand": "QANXGOG",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "Black"
    }
  },
  {
    "id": "B0DGKMV3PY",
    "name": "Case for iPhone 16/16 Plus/16 Pro/16 Pro Max, [Military Grade Drop Tested] with Kickstand, Soft Edge Comfort Grip",
    "ratings": null,
    "price": "$49.99",
    "image": "https://m.media-amazon.com/images/I/71psexJ6vgL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "Magnetic Kickstand Functionality: Equipped with a durable, folding metal stand for effortless hands-free viewing in both portrait and landscape modes.     Ultimate Lens Protection: Precision camera cutouts with raised edges prevent scratches and damage to your camera lenses, ensuring crystal-clear photos.     Soft Edge, Comfortable Grip: Made with premium silicone rubber, the soft yet sturdy edges offer a secure, non-slip grip that is comfortable to hold.     Hydrophobic & Anti-Fingerprint Finish: The case’s hydrophobic coating keeps moisture away, while the anti-fingerprint surface ensures a sleek and clean look throughout the day.     Screen Protector Compatibility: The 0.8mm raised edge design provides an extra layer of protection while ensuring perfect compatibility with your favorite screen protector.",
    "details": {
      "brand": "QANXGOG",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "16 Plus"
    }
  },
  {
    "id": "B0DGKZKCW1",
    "name": "Case for iPhone 16/16 Plus/16 Pro/16 Pro Max, Military-Grade Drop Protection Yellowing Resistant Hard Transparent Back",
    "ratings": null,
    "price": "$44.99",
    "image": "https://m.media-amazon.com/images/I/61gidg3At8L.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "Military-Grade Protection: Built-in shock-absorbing airbags and anti-collision corner technology provide 10FT drop protection, safeguarding your iPhone from damage caused by drops, bumps, and frontal impacts.     Never Yellowing Design: Crafted from advanced anti-yellowing materials, the case resists UV and sweat-induced oxidation, maintaining a crystal-clear appearance over time.     Enhanced Camera & Screen Protection: Raised bezels (0.8mm above the camera and 0.2mm above the screen) prevent scratches and drops, ensuring your phone remains in pristine condition.     Perfect Fit & Precision Cutouts: Seamlessly wraps around your phone, protecting against dust and scratches while providing easy access to all buttons, ports, and features without removing the case.     Comfortable & Pocket-Friendly: Designed for daily use, this lightweight case offers a firm grip without adding bulk, making it easy to carry in your pocket or bag.",
    "details": {
      "brand": "QANXGOG",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "Black"
    }
  },
  {
    "id": "B0CWLH5RDR",
    "name": "USB C Wall Fast Charger Block, 40W 4-Port Type C Charger Fast Charging Blocks PD Power Charger Adapter+QC 3.0 USB Multiport Charger Brick for iPhone 16/15/14/13/12 Pro Max, iPad, Galaxy S24/23-2Pack",
    "ratings": 794,
    "price": "$19.99",
    "image": "https://m.media-amazon.com/images/I/6199osd13KL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "【40W USB C Charger Fast Charging Blocks】:The 40W USB C Charger Fast Charging Blocks supports the Power Delivery and Quick Charge 3.0 fast charging functions with a total power of up to 40W.The USB-A port offers an output power of 3.1 A/5 V, while the USB-C port offers a charging speed of 20W.Charge your i Phone 15/14 devices from 0% to 58% in just 30 minutes.     【Multi 4-Port Fast Charging Plug】:The 40W USB C Charger block has two USB-C ports and two USB-A ports output, support total power up to 40W. Allows you to charge 4 devices simultaneously to minimize waiting time, also save your space, one of our wall charger can instead of 4 single USB port wall chargers.     【Universal Compatibility】: The USB C multiport adapter is compatible with almost all electronic devices, charging for iPhone 16 / 16 Pro / 16 Pro Max / 16 Plus/i Phone 15/15 Pro /15 Pro Max/14/14 Pro/14 Pro Max/13/13 Mini/13 Pro Max/12/12 Pro Max/12 Pro Max/12 Mini/SE 2020/11/11 Pro/11 Pro Max/XR/XS/X/8/7,iPadAir/Pro/Mini, Galaxy S24 Ultra/S24Plus /S24/S23 Ultra/S23 Plus/S23 /S22 Ultra/S22/S21/S20/S10/S9/S8/Tablets and other digital devices compatible.     【Compact Portable &Safty Reliable】: This USB C Wall charger block is Incredibly compact for enhanced portability. All this power comes installed in a pocket-friendly compact body, to go wherever the journey takes you. Ideal for home, office, and on the go. Equipped with a smart chip, which can adjust the input power of the Phone to prevent the Phone from overcharging and overheating.     【What You Get】: 40W 4 ports USB Wall Charger block*2. 18-month guarantee. if you have any questions, please contact us,We promise to solve your problems within 24 Hours.",
    "details": {
      "brand": "N/A",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "N/A"
    }
  },
  {
    "id": "B0DFH49C82",
    "name": "A14 Pro Cell Phone, 5G Unlocked Smartphone 8GB+256GB Smartphone Android 14, 6800mAh Battery, 6.8\" FHD+120Hz 64MP Camera, Dual SIM Octa-Core Phone GPS/Fingerprint/Face ID (White)",
    "ratings": 1,
    "price": "$159.99",
    "image": "https://m.media-amazon.com/images/I/61SEbxw3BCL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "【6800mAh Long Lasting Battery & Fast Charging】This affordable 5g unlocked smartphone with a large 6000mAh battery, 30W fast charging which can well meet your power needs throughout the day. The GPS navigation will direct you to right destinations.     【6.8\" Screen+ Android 14 OS】This A14 Pro Max unlocked cell phones with 6.8\" display,bringing you more vision to immerse in, Adopt Android 14 system, facial recognition, on-screen fingerprint unlock to protect your privacy.     【64MP Professional Photo System】The A14 Pro Max unlocked cell phones is equipped with a 64MP main camera,48MP front camera and 12MP ultra wide angle camera and telephoto cameras, making every photo particularly clear and detailed and take more creative photos.     【Octa-Core CPU+ 256GB】A14 Pro Max dual sim smartphone unlocked features the powerful Qualcomm Snapdragon 8 Gen 3 processor that boosts the overall speed in video and gaming. Up to 8GB + 256GB of memory is enough for social apps, games, movies and other applications.     Customer's satisfaction is the goal we have been striving for We enable our customers to be able to use the least amount of money and be able to buy affordable advanced and good products , if you have any questions or dissatisfaction, please contact us, we will reply you within 24 hours!",
    "details": {
      "brand": "viqee",
      "operatingSystem": "Android 14",
      "memoryStorageCapacity": "256 GB",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "Galaxy A14",
      "wirelessCarrier": "3",
      "cellularTechnology": "5G",
      "connectivity": "N/A",
      "color": "White"
    }
  },
  {
    "id": "B0DGL3N25Y",
    "name": "Wallet Case for iPhone 16/16 Plus/16 Pro/16 Pro Max, Premium PU Leather and Soft TPU with Card Slot,Kickstand, Magnetic Closure",
    "ratings": null,
    "price": "$45.99",
    "image": "https://m.media-amazon.com/images/I/81D-ZbOaFnL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "Premium PU Leather & TPU Design : Crafted from high-quality durable PU leather and a soft TPU inner shell, this wallet case offers reliable protection while adding a touch of elegance.     Convenient Wallet Function : Includes multiple card slots for IDs, credit cards, and door access cards, making it a perfect replacement for bulky wallets or purses, suitable for men and women of all ages.     Hands-Free Kickstand Feature : Built-in kickstand allows for hands-free viewing of videos, reading, and video calls, ensuring convenience whether at home or on the go.     Advanced RFID Blocking : Equipped with cutting-edge RFID blocking technology to secure your personal card information from unauthorized scanning, ideal for frequent travelers and shoppers.     Comprehensive Protection : Featuring raised edges (0.5 mm for the camera, 1.6 mm for the screen), this case offers enhanced shockproof protection during outdoor adventures, bike rides, and daily use.",
    "details": {
      "brand": "QANXGOG",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "Black"
    }
  },
  {
    "id": "B0DH35FW6W",
    "name": "Case for iPhone 16 Pro Max/16 Pro/16, Liquid Metal Frame Magnetic Case with 360° Rotating Stand [Compatibility with Magsafe] Sleek and Frameless Design",
    "ratings": null,
    "price": "$53.99",
    "image": "https://m.media-amazon.com/images/I/71I-xlMLhbL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "Frameless Cool Touch : All-metal design offers a sleek, cool touch and improved heat dissipation, meticulously crafted for a smooth, rounded grip.     360° Rotating Stand : Innovative rotating stand offers versatile viewing angles for hands-free convenience, enhancing your multimedia experience with stability and ease.     Excellent Adsorption Capacity : Built-in 36 N52 magnets that tight division in the ring that will automatically aligned with magnet charger, and it can effectively prevent accidental drop when shaking.     Metal Camera Protection Ring : Our iPhone case is equipped with an 4 mm high innovative metal camera protection ring, which can effectively protect the camera from impact. Making your phone most special.     Well Designed : Precise cutouts design has easy access to all control buttons, ports, sensors & camera without removing the case.The unique and beautiful luster of the metal makes you love it.",
    "details": {
      "brand": "QANXGOG",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "Black"
    }
  },
  {
    "id": "B0D6V85W7Q",
    "name": "Case for iPhone 14 Pro Max/14 Pro/14, Wavy Liquid Silicone Phone Case - Gradient, Shockproof Protective Cover,Brown+Black,13 Pro",
    "ratings": null,
    "price": "$27.99",
    "image": "https://m.media-amazon.com/images/I/51VFfk7-TyL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "～【Unique Design】Eye-catching gradient wavy pattern adds a trendy touch to your phone while providing a comfortable grip.     ～【Superior Protection】Made from high-quality liquid silicone, this case offers excellent shock absorption and protects your phone from drops and scratches.     ～【Perfect Fit】Precisely cut to ensure easy access to all buttons, ports, and cameras without removing the case.     ～【Durable Material】The liquid silicone material is durable, resistant to dirt, and easy to clean, maintaining its vibrant color over time.     ～【Multiple Colors】Available in various attractive colors to match your style and mood, including vibrant green and soft pink.",
    "details": {
      "brand": "QANXGOG",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "Brown+Black"
    }
  },
  {
    "id": "B0DH363XSC",
    "name": "Case for iPhone 16 Pro Max/16 Pro, with Invisible Kickstand, Ultra-Thin Metal Frameless Case [Compatible with MagSafe] Hollow Heat Dissipation",
    "ratings": null,
    "price": "$65.99",
    "image": "https://m.media-amazon.com/images/I/61aOR0d4tIL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "Frameless Design : Showcases the true color of your phone while ensuring efficient heat dissipation with an aluminum alloy construction.     360° Rotation : The cardan rotation design allows 360° free rotation, providing smooth and stable adjustment for perfect viewing angles.     Excellent Adsorption Capacity : Built-in 36 N52 magnets that tight division in the ring that will automatically aligned with magnet charger, and it can effectively prevent accidental drop when shaking.     Durable Construction : Made from aerospace-grade aluminum alloy with an anodized surface for long-lasting durability.     Screen and Camera Protection : Raised edges around the screen and camera guard against scratches and impact.",
    "details": {
      "brand": "QANXGOG",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "Black"
    }
  },
  {
    "id": "B0DGKYQGPS",
    "name": "Case for iPhone 16/16 Plus/16 Pro/16 Pro Max, Shockproof Clear Slim Protective Cell with Built-in Anti-Collision Tape, Anti-Slip Grip",
    "ratings": null,
    "price": "$43.99",
    "image": "https://m.media-amazon.com/images/I/61JtfLCQlIL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "Military-Grade Protection : Built-in 4 corner airbags and anti-collision tape offer superior defense against drops, bumps, and scratches. Passed military drop tests for up to 10 feet.     Excellent Adsorption Capacity : Built-in 36 N52 magnets that tight division in the ring that will automatically aligned with magnet charger, and it can effectively prevent accidental drop when shaking.     Slim & Lightweight Design : Designed for easy pocket use and one-handed operation, this ultra-slim case offers a comfortable, non-slip grip without bulk.     Enhanced Screen & Camera Protection : Raised edges with 0.8mm camera lips and 1.2mm screen lips provide essential protection, safeguarding your iPhone from scratches.     Crystal Clear Durability : Made with Bayer's ultra-clear TPU and PC material, the case resists stains and yellowing, maintaining long-lasting clarity and brilliance.",
    "details": {
      "brand": "QANXGOG",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "Black"
    }
  },
  {
    "id": "B0BGPVH2WK",
    "name": "Magmat iPhone 14 Pro Max Black",
    "ratings": null,
    "price": "$31.86",
    "image": "https://m.media-amazon.com/images/I/61faLiPVJaL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "Magmat iPhone 14 Pro Max Black",
    "details": {
      "brand": "Celly",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "N/A"
    }
  },
  {
    "id": "B0DCBX2CVG",
    "name": "Top Phone Cases for 2024 case Otterbox Protective Cute Phone Cases for Phone Clear Glitter 15, 14, 13, pro promax Plus Pink Protector Generation case,(Pink, Phone 14)",
    "ratings": 2,
    "price": "$16.00",
    "image": "https://m.media-amazon.com/images/I/41APEtEAbHL.__AC_SY300_SX300_QL70_FMwebp_.jpg",
    "description": "Enhanced Appeal: This case perfectly blends style and protection, making it the ideal choice for your device. Experience a harmonious balance of aesthetics and durability.     Transparency: The clear cover provides a window to flaunt your device's original color and design, adding a touch of personal flair while ensuring protection. Enjoy the best of both worlds with this transparent case.     Precise Fit: Tailored for iPhone 14/13/12 Pro and Pro Max models, guaranteeing an exact fit that maintains the device's sleek profile and access to all buttons, ports, and features. Ensure a snug, precise fit for optimal protection and usability.     Premium Material: Crafted from high-quality soft silicone, this case provides a comfortable grip while ensuring durable protection against everyday wear and tear. Experience a luxurious feel and reliable defense for your device.     Luxurious Design: Enhance the aesthetic of your iPhone 12 or 13 with a stunning glitter bling diamond design, adding a touch of elegance and glamour to your device. Stand out with a luxurious and eye-catching style upgrade.",
    "details": {
      "brand": "Generic",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "Pink"
    }
  },
  {
    "id": "B0CB6Z77TT",
    "name": "Mini Smartphone, Child Small Phone, 3G 2.5in GPS 1GB 8GB ROM 5MP Quad Core Dual SIM, Unlocked Tiny Phone for Android Cell Phone (Pearl White)",
    "ratings": null,
    "price": "$56.85",
    "image": "https://m.media-amazon.com/images/I/51XX6EwkoTL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "SUPER MINI SMARTPHONE: With a 2.5in screen, you can carry in your wallet and very portable. Suitable for travel, daily life and working hours. With protective shell for without fear of damage     3G SMALL SMARTPHONE: Make sure your SIM card supports 2G GSM 850, 900, 1800, 1900; 3G WCDMA B1/B5 for Android 6.0, support APP download     BEST BACKUP PHONE: With 1580mAh battery, dual camera, 300,000 pixels front, 5MP rear, dual analog, dual standby     OTHER FEATURES: The mini smartphone also supports GPS navigation, MP3, MP4, calculator, alarm clock, calendar and more     MULTIPLE FEATURES: Support for calls, player, , memory card slot, FM radio, messaging, , Bluetooth, front facing camera, response, email. for the palm of your hand, the high tech artwork and accurate design make you feel comfortable in every way",
    "details": {
      "brand": "N/A",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "N/A"
    }
  },
  {
    "id": "B0CTBBBP1X",
    "name": "3 in 1 Charging Station for iPhone 16/15/14/13/12 Series, Travel Charger for Multiple Devices for AirPods 4/3/2/Pro,Wireless Charger Magnetic Charging for Apple Watch S10 Series(Black)",
    "ratings": 522,
    "price": "$39.99",
    "image": "https://m.media-amazon.com/images/I/81ZiiJn8eVL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "What is: It's a foldable, small, travelable, travel charger station! JARGOU charging station can charge for iPhone, for Apple watch, and for AirPods at the same time, charger station is simply a little helper to keep the desktop tidy! Exclusively designed for Apple fans     Feature: It takes 3.5 hours to fully charge iPhone 14, and charging efficiency is accelerated by 22%. 3 in 1 wireless charging station also has many designs, such as over-current protection, over-voltage protection, over-temperature protection. More importantly, We've researched the wireless chargers on the market and got inspired by: Foldable phone stand, multiple charging methods, easy to carry, 3 in 1, colorful colors. We put these ideas into this charging station     How to work: 3 in 1 wireless charging station equipped with a 47.2in Type-C cable, only need to connect the power to the device for charger. So enjoy the convenience of wireless charging     Compatible models: JARGOU 3 in 1 charging station is compatible for iPhone 16/15/14/13/12 series, for iWatch series 10/9/8/7/6/5/4/3/2/Ultra/Ultra2/SE, for AirPods 4/3/2/Pro/Pro 2. The magnetic attraction function is only for iPhone 16-12 series     Else: This is the only wireless charging station on the market that has a stand and is foldable for travel! Let me introduce to you the two feature of wireless charging station: the first is that our 3 in 1 wireless charging station stand has more functional designs at the same price, the second is the self-developed wireless charging station     You will get: The accessories included in this wireless charging station are: 1 * Charging Station, 1 * Fast Adapter, 1 * USB Cable, 1 * Storage Box, 1 * User Manual. JARGOU 3 in 1 wireless charging station is also a great gift for family and friends",
    "details": {
      "brand": "JARGOU",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "USB",
      "color": "Black"
    }
  },
  {
    "id": "B0DG3FSVCB",
    "name": "2024 Upgraded 3-in-1 Wireless Charger for iPhone,Travel Magnetic Charger Stand Nightlight Foldable Wireless Charging Station Compatible with Magsafe Charger&iPhone 16/15/14/13/12,Apple Watch&AirPods",
    "ratings": 22,
    "price": "$39.95",
    "image": "https://m.media-amazon.com/images/I/61WwJGaSAtL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "【Wireless Charger for iPhone/Apple Watch/AirPods】Wireless magnetic portable charger compatible with MagSafe magnetic case, iPhone 16/ 16 Plus/ 16 Pro/ 16 Pro Max/iPhone 15/ 15 Plus/ 15 Pro/ 15 Pro Max/ 14/ 14 Plus/ 14 Pro/ 14 Pro Max/ 13/ 13 mini/ 13 Pro/ 13 Pro Max/ 12/ 12 mini/ 12 Pro/ 12 Pro Max, Apple Watch 9/8/7/6/5/4/3/2/Ultra 2/Ultra 1/SE, AirPods 3/2 Pro 2/Pro. (Note: Please use Mag-Safe phone case or without case for wireless charging)     【Fast Wireless Charger Foldable Stand】Effortlessly charge for iPhone at a lightning-fast 15 W, for Apple Watch at a reliable 2.5 W, and for AirPods at a steady 5 W—all at once. Each device charges independently, without affecting the performance of the others. It takes only 2-3 hours to fully charge your devices, allowing you to enjoy the convenience of a single, fast, unified charging solution.[Note: To charge at full speed, please use a PD charger of 20 W or higher.]     【Upgrade Powerful Mag-Safe Charger Stand】Mag-Safe charger 3 in 1 makes fast charging safe and easy. The built-in super strong magnet makes alignment instantly and precisely, just 1 second to achieve lightning fast wireless charging. The magnetic charger can hold your iPhone horizontally and vertically, or in any directions, the phone charging area can adjust the angle up and down by 120°, you can enjoy all your comfortable viewing from any angle.     【Intergrated Smart for Apple Ecosystem】 Many smart devices have become companions in our lives, and it has become important to simplify how to power them. Carrying multple charging cables to power your devices can become a hassle, but our 3 in 1 charging station for apple can take on the work of three cables by connecting to just one power adapter. Note: Does not come with an adapter, you need to pair it with an adapter of at least 25W for fast charging!     【Your Safety Companion】Our wireless chargers have passed various certifications with professional circuit design and intelligent protection technology. It has overcurrent, overvoltage, and temperature control to ensure safe and fast charging of your device. This wireless charging station is not only the best charging accessory for the desktop and bedside, but the perfect gift for your friends and family! You will get a 3 in 1 charging station, a 5ft charging cable, a user guide.",
    "details": {
      "brand": "BODSEIEOU",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "USB",
      "color": "Black"
    }
  }
]