[
  {
    "id": "B097QDTNM5",
    "name": "Azumi iPhone SE 16GB Unlocked, Silver 2016 (Gen 1)",
    "ratings": 883,
    "price": "$199.00",
    "image": "https://m.media-amazon.com/images/I/41XJM0wkHVS.__AC_SY300_SX300_QL70_FMwebp_.jpg",
    "description": "Factory unlocked, compatible with (e.g. AT&T, T-Mobile, Metro, Mint, Tello, Us Mobile, Ting Mobile, Simple Mobile, Lyca Mobile. NOT Compatible with Verizon, Straight Talk, Boost.     Ready out of the box, Phone included with generic box with a charger, cable, and handsfree.     Inspected and guaranteed to have minimal to no cosmetic damage, which is not noticeable when the device is held at arms length. Successfully passed a full diagnostic test which ensures perfect functionality. Tested for battery health and guaranteed to have a minimum battery capacity of +90%.     The Apple iPhone SE is the 1st Generation iPhone SE made in 2016 along with the iPhone 6s and iPhone 6s Plus. The iPhone SE has the same shape as the iPhone 5 and iPhone 5s, but is a lot more powerful. The iPhone 5 and 5s cases will also fit the iPhone SE and vice versa.     This iPhone is able to update to the latest version of iOS 15.",
    "details": {
      "brand": "Apple",
      "operatingSystem": "iOS 15",
      "memoryStorageCapacity": "16 GB",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "iPhone SE",
      "wirelessCarrier": "Unlocked for All Carriers",
      "cellularTechnology": "LTE, UMTS, HSPA, HSDPA, GSM, EDGE",
      "connectivity": "Bluetooth, Wi-Fi, USB",
      "color": "N/A"
    }
  },
  {
    "id": "B0C9ZDKSRD",
    "name": "Plum iPhone 6s 16GB Gray Unlocked 4G LTE - ATT Tmobile Verizon",
    "ratings": 27,
    "price": "$159.99",
    "image": "https://m.media-amazon.com/images/I/41WRQV5Gl8L.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "Factory Unlocked iPhone 6S, Compatible With AT&T, T-Mobile, Verizon, Straight Talk, Mint, Boost Mobile, US Mobile, Ting Mobile, Simple Mobile and any other service provider     Inspected To Have Minimal To No Cosmetic Damage, Which Is Not Noticeable When The Device Is Held At Arm'S Length. Successfully Passed A Full Diagnostic Test Which Ensures Perfect Functionality. Tested For Battery Health And Assured To Have A Minimum Battery Capacity Of +80%     Preowned - Fully Inspected and tested to be in good working condition     Includes - New Charger, Cable Packed in White Box     Upgradeable To IOS 15",
    "details": {
      "brand": "Plum",
      "operatingSystem": "iOS 15",
      "memoryStorageCapacity": "16 GB",
      "screenSize": "N/A",
      "resolution": "1334 x 750 pixels",
      "modelName": "IP6S16GRY",
      "wirelessCarrier": "Unlocked for All Carriers",
      "cellularTechnology": "4G",
      "connectivity": "Bluetooth",
      "color": "N/A"
    }
  },
  {
    "id": "B0BYH9S5MT",
    "name": "Apple iPhone 14 Plus, 128GB, Midnight for Unlocked (Renewed Premium)",
    "ratings": 75,
    "price": "$199.99",
    "image": "https://m.media-amazon.com/images/I/61B0+qQriPL._AC_SY300_SX300_.jpg",
    "description": "6.7-inch Super Retina XDR display and advanced camera system for better photos in any light.",
    "details": {
      "brand": "Apple",
      "operatingSystem": "iOS 16",
      "memoryStorageCapacity": "128 GB",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "iPhone 14 Plus",
      "wirelessCarrier": "Unlocked for All Carriers",
      "cellularTechnology": "5G",
      "connectivity": "Wi-Fi",
      "color": "Midnight"
    }
  },
  {
    "id": "B09LPS396Z",
    "name": "Apple iPhone 13 Pro Max, 1TB, Silver - Verizon (Renewed)",
    "ratings": null,
    "price": "$199.99",
    "image": "https://m.media-amazon.com/images/I/613AVx005lL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "6.7\" Super Retina XDR display with ProMotion. 5G Superfast downloads, high?quality streaming     Cinematic mode in 1080p at 30 fps. Dolby Vision HDR video recording up to 4K at 60 fps. 6X Optical zoom range     A15 Bionic chip. New 6-core CPU with 2 performance and 4 efficiency cores. New 5-core GPU. New 16-core Neural Engine     Up to 28 hours video playback. Face ID. Ceramic Shield front. Surgical-grade stainless steel",
    "details": {
      "brand": "Apple",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "1 TB",
      "screenSize": "N/A",
      "resolution": "1920 x 1080",
      "modelName": "iPhone 13 Pro Max",
      "wirelessCarrier": "Verizon",
      "cellularTechnology": "5G",
      "connectivity": "Wi-Fi",
      "color": "Silver"
    }
  },
  {
    "id": "B0BTRTY1HB",
    "name": "6.7Inch Unlocked Cell Phone IP14pro 2GB +16GB/SD128 GB Straight Talk and Dual Sim Boost Smart Phones for Android10.1",
    "ratings": 52,
    "price": "$89.99",
    "image": "https://m.media-amazon.com/images/I/51KGMfxB6CL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "",
    "details": {
      "brand": "NIEGA",
      "operatingSystem": "Android 10.0",
      "memoryStorageCapacity": "16 GB",
      "screenSize": "N/A",
      "resolution": "1920 x 1080",
      "modelName": "iPhone 14 Pro",
      "wirelessCarrier": "Unlocked for All Carriers",
      "cellularTechnology": "2G, 3G, 4G",
      "connectivity": "N/A",
      "color": "N/A"
    }
  },
  {
    "id": "B0CY8R25ZG",
    "name": "Unlocked Smartphone 6.7inch Cell Phone IP14pro 2+16GB HD Full Screen Straight Talk Dual Sim Android Phones Boost Mobile",
    "ratings": 24,
    "price": "$89.99",
    "image": "https://m.media-amazon.com/images/I/51WlZ30kx7L.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "【A Bigger Screen 6.7inch】The unlocked android phones come with a expansive 6.7\" display. Its high-definition resolution brings you real-world vividness and vibrant color. It supports view different contents on the same screen to enable entertaining while working, Dark Mode can reduce the light emitted by the screen to decrease eye strain for comfortable visuals.     【2GB RAM+ 16GB ROM】Unlocked smartphone is equipped with high-performance 2GB +16G and Android 10 system, the moblie phone can be expanded to 256GB through a microSD card,runs smoothly, and has a good user experience. Watch live broadcasts, swipe videos, play games, and video chat to enjoy a smooth and non-stuck experience.     【5000mAh Battery】Tmobile cell phones with powerful processor and long-lasting battery greatly improved network, runtime speed, frame rate and image smoothness when playing large games and multitasking.     【Multi Color and One-year Warranty】We apply multi-color for you in the series, all the products from our store enjoy a one-year warranty service after the purchase, welcome to share your excellent experience, if you have any problem, please contact us in time     【Gift For Children or the Old People】Design is an endless journey of pursuing beauty, and everything can be the spark of new inspirations. S22 Ultra cell phone interprets the color aesthetics in life from the splendid nature scenes to the whimsical imaginations with four invigorating hues. This android unlocked smartphone has all the features to cater to adults, elderly as well as children.",
    "details": {
      "brand": "HIEGOU",
      "operatingSystem": "Android 10.0",
      "memoryStorageCapacity": "128 GB",
      "screenSize": "N/A",
      "resolution": "1600x3200",
      "modelName": "iPhone 14 Pro Max",
      "wirelessCarrier": "Unlocked",
      "cellularTechnology": "4G",
      "connectivity": "N/A",
      "color": "N/A"
    }
  },
  {
    "id": "B0CBS6WR8S",
    "name": "Blackview N6000 Rugged Smartphone 2023, 4.3-inch Small Android 13 Phone, 16GB 256GB Octa-core MTK Helio G99 6nm, 48MP + 16MP Camera, Dual SIM 4G, QHD+ Display 3880mAh 18W Fast Charge Rugged Phone, NFC",
    "ratings": 22,
    "price": "$279.99",
    "image": "https://m.media-amazon.com/images/I/71VJ0v1Y-fL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "【4.3-inch Small in Size, yet Boundlessly Mighty in Durability】Blackview phone N6000, with 4.3-inch size, easily fits into your pocket or bag, allowing for one-handed operation with just a thumb swiping left, right, up, and down. Weighing just 208g, this feather-light mini smartphone brings sheer joy and convenience, never burdening you with unnecessary weight. However, don't be deceived by its slim profile, as this mini rugged phone is designed to be exceptionally durable. Certified with IP68&IP69K and MIL-STD 810H, it withstands the harshest environments and challenging conditions, featuring DROPPROOF up to 5 meters, 360°DUSTPROOF, and WATERPROOF up to 1.5 meters deep for 30 minutes.     【Octa-core MTK Helio G99 6nm that Rivals 5G chipsets & 16GB RAM + 256GB ROM】Equipped with Octa-core Helio G99 6nm processor, this rugged cell phones unlocked gives a strong boost for work and entertainment performance. With 8GB RAM expandable to 16GB and 256GB ROM, this rugged phone effortlessly handles multitasking, storing your favorite photos and music for easy access anytime, anywhere. MediaTek HyperEngine 2.0 Lite for smoother gameplay. Networking Engine 2.0 for faster response and reliable connectivity, even during gaming. Fourfold Integrated Cooling System reduces CPU temperature up to 15°C. Atomized memory technology launches apps and multitasking 17% faster.     【Android 13 Based on Doke OS 3.1】 The Blackview N6000 4G SIM mobile phone empowers you with the latest Android 13, enhancing privacy and personalization for a seamless work and play experience. This Android 13 unlocked phone offers per-app language preferences, a data migration assistant, cleared clipboard history, and notification permissions. But wait, there's more! N6000 Blackview phone, based on Doke OS 3.1, also upgrades in privacy, personality, convenience, and fluency, featuring double protection with DAC + MAC for data security, a cold room feature, system management, sports metrics monitoring, and a new focus mode app.     【ArcSoft 5.0 Algorithms & 48MP Camera】Capture stunning moments with the N6000 rugged mini mobile phone, featuring ArcSoft 5.0 algorithms that enhance photographic results by 15%! Equipped with a 48MP Samsung ISOCELL GM2 camera and a 16MP SK Hynix HI-1634Q camera, every detail is captured with clarity. Day or night, TetraPixel Technology ensures breathtaking landscapes. Swift and precise capture with Super-PD Auto Focus and intelligent exposure control with Smart-ISO. Explore various camera modes: 2K Video Recording, Pro Mode, Improved HDR, Night Mode, Beauty Mode, Portrait Mode, and 360°Panorama. Smart Google Lens instantly identifies objects, landmarks, and translates languages.     【Ultra-linear Box Speaker with Smart-PA, BesLoudness, Hi-Fi Mode】The N6000 small rugged phone unlocked features an ultra-linear box speaker with Smart-PA technology, delivering crisp and clear sound. Enhance the loudness and clarity with BesLoudness, and indulge in the highest audio quality with Hi-Fi Mode. Immerse yourself in an exceptional audio experience with these advanced features.     【3,880mAh Solid State Battery & 18W Fast Charging & 2.5W OTG Reverse Charging】N6000 mini rugged smartphone unlocked powered by a robust 3,880mAh solid-state battery, ensuring endurance in extreme temperatures from -40 ℃ to 80 ℃ (-40°F to 176°F). Rigorously tested for durability, it withstands high-pressure situations and drop impacts with ease. Experience seamless charging with 18W fast charging and 2.5W OTG reverse charging, providing reliable power supply for your adventures. With up to 18-day standby, the Blackview phone unlocked N6000 will be your unwavering companion, offering invaluable support on your journey, wherever you go, be it glaciers, mountains, or deserts.     【QHD+ Display with MiraVision Technology & Corning Gorilla Glass 5】Blackview N6000 rugged cell phone unlocked features a QHD+ Display that delivers ultra-definition visuals and rich colors. With advanced MiraVision Technology, every detail becomes vivid, and the contrast sharpens, creating a captivating visual experience. Whether indoors or outdoors, the 450nit brightness ensures comfortable usage without worrying about reflections. What is more, this rugged android phone with a screen made of Corning Gorilla Glass 5, providing enhanced toughness to shield it from cracks and thick scratches resulting from accidental drops and falls.",
    "details": {
      "brand": "Blackview",
      "operatingSystem": "Android",
      "memoryStorageCapacity": "256 GB",
      "screenSize": "N/A",
      "resolution": "2560 x 1440",
      "modelName": "Rugged Smartphone Blackview N6000/Black",
      "wirelessCarrier": "T-Mobile",
      "cellularTechnology": "4G",
      "connectivity": "USB",
      "color": "Black"
    }
  },
  {
    "id": "B07QL37B7D",
    "name": "iLight Mini Smartphone 16 Pro Max World's Smallest 16Pro Android Mobile Phone 4G Super Small Little 3\" Touch Screen. Global Unlocked Great for Kids Teens. 3GB RAM / 64GB ROM Tiny Pocket iPhone 16 Plus",
    "ratings": 116,
    "price": " ",
    "image": "https://m.media-amazon.com/images/I/51YPaZkMq4L.__AC_SY300_SX300_QL70_FMwebp_.jpg",
    "description": "COOL MiNi SMART PHONE with such a Cute iPhone 16 Pro Max Look alike Design and a Mini 3 inch Little TouchScreen. Use it like any other Android mobile, You Can Browse the Internet anywhere and use Google Play Store to Download apps at the Palm of your Hand.     THIS PHONE IS UNLOCKED it will be compatible with all 2G and 3G 4G network in US including Cricket, Straight Talk, NET10, MetroPCS, Simple Mobile, Google Project Fi, T-mobile, VERIZON, AT and T and more. Check Your Network Compatibility,     TINY DEVICE, MANY FEATURES! With Bluetooth, Wi-Fi and SIM Connectivity The little Smart Phone supports Voice Calling, Video Calls, Camera, Sound Record, Email, MP3 Playback, GPRS, FM Radio, Touchscreen, GPS Navigation, Message, SMS, MMS, Video Player, Memory Card Slots,Internet Browser. Use The GOOGLE PLAY STORE and Download your Favorite Apps Facebook, Youtube, Twitter, Whatsapp, Chrome, Waze, Instagram and many more..     FAST STRONG AND DURABLE With MTK Quad CPU, 3GB Of RAM, 64GB of Storage. Strong durable body With a Great but Small iPhone 11pro / XI Pro Max Design!     CONNECT ANYWHERE GLOBAL UNLOCKED with Wifi, Bluetooth and GPS Navigation You can Connect anywhere Enjoy a Simple life With a Small portable SmartPhone. Check Your Network Band. Do Not Buy Before Checking Band Compatibility!     MINI CUTE PHONE. Super small just like a bank card. Mini iPhone 16 Pro Look's and Feeling! 16 Pro / Pro Max. USE IT LIKE ANY OTHER ANDROID SMARTPHONE! Download your Apps via The Google Play Store. Smart and Small. Children Just Love It!!     BEST BACKUP PHONE, POCKET SMARTPHONE - Improved 2000mAh Battery!!! Awesome Nice Gift! Portable and Great for Travel!!! Dual Camera front (with Beautifying), Rear Back . Dual Sim dual standby.",
    "details": {
      "brand": "iLight",
      "operatingSystem": "Android 10.0",
      "memoryStorageCapacity": "16 GB",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "iLight iPhone 16 pro max mini",
      "wirelessCarrier": "Unlocked for All Carriers",
      "cellularTechnology": "4G",
      "connectivity": "Bluetooth, Wi-Fi, USB",
      "color": "N/A"
    }
  },
  {
    "id": "B0CJDTC6ZB",
    "name": "【Upgraded】 SUPERONE Retractable Car Charger 4 in 1, Fast Car Phone Charger with Cord 2.6ft, USB C and Apple Car Charger Adapter, Compatible with iPhone 16 15/15 Pro Max/14/13/12/11, Galaxy, Pixel",
    "ratings": 1.793,
    "price": "$23.99",
    "image": "https://m.media-amazon.com/images/I/61+F2Q2HxSL._AC_SY300_SX300_.jpg",
    "description": "Convenient Retractable Design: Our Retractable Car Charger features two 80cm long extendable cables, allowing for easy storage and keeping your car interior clean and organized. No more tangled cables or messy car compartments!     Upgraded 4-1 Fast Charging Solution: With a real PD30W type-C retractable cable(Yellow fast charging port), an IOS retractable cable, and additional USB-C and USB-A ports, this fast charge retractable car charger supports fast charging for up to 4 devices simultaneously. Say goodbye to the hassle of carrying multiple chargers for your different devices.【This car charger is only for charging, and cannot be used for CarPlay】     Voltage Display for Battery Health Monitoring: Our Car Charger with cord is equipped with a voltage display feature, allowing you to monitor the health of your car battery at all times. Stay informed and ensure optimal performance for your vehicle.     This 4 in 1 retractable car phone charger can be used for both 12V DC and 24V DC. Rated Power: 60W. Type-C Retractable Cable Output: PD30W Max. IOS Retractable Cable Output: 5V/2.4A. Type-C Port Output: 5V/3A. USB-A Port Output: 5V/2.4A.     Safe Usage with All-Round Protections: 18-Months Warranty. Stable plug with built-in 15A fuse and protective circuits against overcharging, over-temp and short-circuit to safeguard your precious appliances.     [Multi-Fast Charging Protocol Certification] The cigarette lighter usb c charger is compatible with devices supporting PD, QC3.0, AFC, MTK, and FCP including phones, tablets, notebooks, Switch, etc. Be like iPhone 16/15/14/13/12/11/ Plus/ Pro/ Pro Max/ mini/ XS / XS Max / XR /X /8 Plus/8/ 7 Plus /7 /6S /6, Samsung Galaxy Note 20 Ultra/ Note10 Plus/ S23/S22/S22+/S22 Ultra/S21+/S20/S10 5G /A54/S /S9 Plus/ S8+/ Note 9, Google Pixel7/ 7a/ 6/ 6a/ 5/ 4xl/ 3xl/ 2xl/ 3a/ 4/ 4a/Nexus 6P etc.",
    "details": {
      "brand": "SUPERONE",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "USB",
      "color": "Black"
    }
  },
  {
    "id": "B0DCVR2NWS",
    "name": "CASETiFY Compact Case for iPhone 16 [Lightweight / 4 ft. 2X Military Grade Drop Protection/Slim] - Pastel Gradient - Clear Black",
    "ratings": 45,
    "price": "$38.25",
    "image": "https://m.media-amazon.com/images/I/41gUmN0Sc+L._AC_SY300_SX300_.jpg",
    "description": "Compatible with iPhone 16 Only (6.1 Screen Size)     4 ft. drop protection (2x MIL-STD-810G)     Slim and sleek; Anti-slip grip     Seamless access to camera control button     Wireless charging compatible",
    "details": {
      "brand": "CASETiFY",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "Pastel Gradient"
    }
  },
  {
    "id": "B00COB3RT4",
    "name": "Samsung Galaxy S III, Purple 16GB (Sprint)",
    "ratings": 89,
    "price": "$269.99",
    "image": "https://m.media-amazon.com/images/I/916m6fgT7CL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "Display: 4.8-inches     Camera: 8-MP     Processor Speed: 1.5 GHz     OS: Android 4.0 (Ice Cream Sandwich)",
    "details": {
      "brand": "SAMSUNG",
      "operatingSystem": "Android",
      "memoryStorageCapacity": "16 GB",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "S III",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "4G",
      "connectivity": "NFC",
      "color": "Purple"
    }
  },
  {
    "id": "B0D3F7T32Z",
    "name": "Apple iPhone X, 64GB Unlocked - Gray",
    "ratings": 21,
    "price": "$44.59",
    "image": "https://m.media-amazon.com/images/I/517cbS1x8gL._AC_SX300_SY300_.jpg",
    "description": "Unlocked and Compatible with All service providers Worldwide     Tested for battery health and guaranteed to have a minimum battery capacity of 80%     Successfully passed a full diagnostic test which ensures like-new functionality and removal of any prior-user personal information.     Includes Charger and Cable. Does not include the Sim Card (Sim card is always provided by your service provider)",
    "details": {
      "brand": "AT&T Prepaid",
      "operatingSystem": "iOS 16",
      "memoryStorageCapacity": "64 GB",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "IPX64GRY",
      "wirelessCarrier": "Unlocked for All Carriers",
      "cellularTechnology": "4G",
      "connectivity": "N/A",
      "color": "N/A"
    }
  },
  {
    "id": "B0BVL41FQ5",
    "name": "Apple iPhone 14 Plus, 256GB, Blue for Unlocked (Renewed Premium)",
    "ratings": 35,
    "price": "$179.99",
    "image": "https://m.media-amazon.com/images/I/61BGE6iu4AL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "6.7-inch Super Retina XDR display and advanced camera system for better photos in any light.",
    "details": {
      "brand": "Apple",
      "operatingSystem": "iOS 16",
      "memoryStorageCapacity": "256 GB",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "iPhone 14 Plus",
      "wirelessCarrier": "Unlocked for All Carriers",
      "cellularTechnology": "5G",
      "connectivity": "Wi-Fi",
      "color": "Blue"
    }
  },
  {
    "id": "B08PPCFBNW",
    "name": "Apple iPhone 12 Mini, 128GB, White - Unlocked (Renewed)",
    "ratings": 13.782,
    "price": "$158.99",
    "image": "https://m.media-amazon.com/images/I/41WsaMyJAqL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "This phone is unlocked and compatible with any carrier of choice on GSM and CDMA networks (e.g. AT&T, T-Mobile, Sprint, Verizon, US Cellular, Cricket, Metro, Tracfone, Mint Mobile, etc.).     Please check with your carrier to verify compatibility.     When you receive the phone, insert a SIM card from a compatible carrier. Then, turn it on, connect to Wi-Fi, and follow the on screen prompts to activate service.     The device does not come with headphones or a SIM card. It does include a generic (Mfi certified) charging cable.     Tested for battery health and guaranteed to have a minimum battery capacity of 80%.",
    "details": {
      "brand": "Apple",
      "operatingSystem": "iOS 16",
      "memoryStorageCapacity": "128 GB",
      "screenSize": "N/A",
      "resolution": "2340 x 1080",
      "modelName": "iPhone 12 mini",
      "wirelessCarrier": "Unlocked for All Carriers",
      "cellularTechnology": "5G",
      "connectivity": "Bluetooth, Wi-Fi",
      "color": "White"
    }
  },
  {
    "id": "B088NMH5KL",
    "name": "Apple iPhone SE (2nd Generation), US Version, 128GB, Black - Unlocked (Renewed)",
    "ratings": 19.219,
    "price": "$11.99",
    "image": "https://m.media-amazon.com/images/I/61JNofhHZZL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "This phone is unlocked and compatible with any carrier of choice on GSM and CDMA networks (e.g. AT&T, T-Mobile, Sprint, Verizon, US Cellular, Cricket, Metro, Tracfone, Mint Mobile, etc.).     Please check with your carrier to verify compatibility.     When you receive the phone, insert a SIM card from a compatible carrier. Then, turn it on, connect to Wi-Fi, and follow the on screen prompts to activate service.     The device does not come with headphones or a SIM card. It does include a generic (Mfi certified) charging cable.     Tested for battery health and guaranteed to have a minimum battery capacity of 80%.",
    "details": {
      "brand": "Apple",
      "operatingSystem": "iOS 16",
      "memoryStorageCapacity": "128 GB",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "iPhone SE2",
      "wirelessCarrier": "Unlocked for All Carriers",
      "cellularTechnology": "4G",
      "connectivity": "Bluetooth, Wi-Fi",
      "color": "Black"
    }
  },
  {
    "id": "B0CNSC8MJF",
    "name": "BLU G33 | 2023 | All-Day Battery | Unlocked | 6.26” Display | Android Smartphone (Bronze, 16GB)",
    "ratings": 22,
    "price": "$59.80",
    "image": "https://m.media-amazon.com/images/I/51T8+GPjuPL._AC_SY300_SX300_.jpg",
    "description": "Unlocked and ready to use with your preferred GSM Carrier. Compatible with T-Mobile, Metro PCS, and others. Sim card not included. (Not compatible with AT&T, Cricket or with CDMA Networks like Verizon, Sprint, and Boost Mobile)     Stunning 6.26” Super display, bring every image to life with breathtaking clarity and vibrancy.     Preserve your precious memories with 5MP Dual Camera with 5MP Selfie.     Operating system: Android 13 (Go Edition)",
    "details": {
      "brand": "BLU",
      "operatingSystem": "Android 13.0",
      "memoryStorageCapacity": "32 GB",
      "screenSize": "N/A",
      "resolution": "480 x 960",
      "modelName": "G33",
      "wirelessCarrier": "T-Mobile",
      "cellularTechnology": "4G",
      "connectivity": "N/A",
      "color": "N/A"
    }
  },
  {
    "id": "B0DFQ1T85J",
    "name": "Phone Tripod Stand, Aluminum Alloy Phone Stand Compatible with iPhone 16/15/14/13/12 Series, Foldable Strong Magnetic Phone Stand, Multifuctional Angle Adjustment Pocket Tripod (Grey)",
    "ratings": 56,
    "price": "$35.99",
    "image": "https://m.media-amazon.com/images/I/71dWz+xrFeL._AC_SY300_SX300_.jpg",
    "description": "Phone Stand with Stylish Design: The cell phone stand is made of new generation aluminum alloy, and the tripod stand design makes the product more stable. The hinge is solid and reliable, adjustable multiple angles. Perfect compatible with Mag-safe charger     Compatibility: 1ST IDEA Phone tripod stand compatible with iPhone 16 Pro Max, iPhone16 Pro, iPhone 16 Plus, iPhone 16, iPhone 15 Pro Max, iPhone15 Pro, iPhone 15 Plus, iPhone 15, iPhone 14 Pro Max, iPhone14 Pro, iPhone 14 Plus, iPhone 14, iPhone 13 Pro Max, iPhone 13 Pro, iPhone 13, iPhone 13 Mini, iPhone 12 Pro Max, iPhone 12 Pro, iPhone 12, iPhone 12 Mini, and compatible with MagSafe cases. For non-MagSafe phones or cases with an included Metal Ring Inside the package     Lightweight and Convenient: With a thin card-style design, pocket tripod weights less than 2.4 oz, height 0.2 inches. Unfolds up to 8.9 inches and it only takes 3 seconds to unfold and close - Recommended to use with phone case     Strong Magnetic Wireless Charger stand: The phone tripod has built-in strong magnets. tripod compatible with the Original Mag-Safe Charger. Super magnetic properties can improve wireless charging efficiency. Mag-safe charger is also quite easy to attach and detach your phone from the mag charging stand     Convenient and Reliable: The aluminum alloy magnetic phone stand has a smooth touch and is resistant to daily dirt and scratches. The aluminum alloy material is waterproof and sun-proof and has a longer service life. It is more convenient for you to use at home, in the office, on the beach, in the gym or when traveling",
    "details": {
      "brand": "1ST IDEA",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "Grey"
    }
  },
  {
    "id": "B0B5FDB92L",
    "name": "Apple iPhone 13, 128GB, Green - Unlocked (Renewed)",
    "ratings": 12.8,
    "price": "$409.60",
    "image": "https://m.media-amazon.com/images/I/51KxuUmFqeL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "6.1\" Super Retina XDR display. 5G Superfast downloads, high?quality streaming     Cinematic mode in 1080p at 30 fps. Dolby Vision HDR video recording up to 4K at 60 fps. 2X Optical zoom range     A15 Bionic chip. New 6-core CPU with 2 performance and 4 efficiency cores. New 4-core GPU. New 16-core Neural Engine     Up to 19 hours video playback. Face ID. Ceramic Shield front. Aerospace-grade aluminum",
    "details": {
      "brand": "Apple",
      "operatingSystem": "iOS 16",
      "memoryStorageCapacity": "128 GB",
      "screenSize": "N/A",
      "resolution": "1920 x 1080",
      "modelName": "iPhone 13",
      "wirelessCarrier": "Unlocked for All Carriers",
      "cellularTechnology": "5G, 4G LTE",
      "connectivity": "Wi-Fi",
      "color": "N/A"
    }
  },
  {
    "id": "B0D9LMRR4V",
    "name": "Ailun 3 Pack Privacy Screen Protector for iPhone 16 [6.1 inch] + 3 Pack Camera Lens Protector, Anti Spy Private Tempered Glass Film, Case Friendly, [9H Hardness] - HD [6 Pack]",
    "ratings": 27.442,
    "price": "$8.89",
    "image": "https://m.media-amazon.com/images/I/71QLY9BLiWL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "[3+3 Pack] This product includes 3 pack privacy screen protectors and 3 pack camera lens protectors. Works For iPhone 16 [6.1 inch] tempered glass screen protector and camera lens protector. Featuring maximum protection from scratches, scrapes, and bumps.     Night shooting function: specially designed iPhone 16 6.1 Inch camera lens protective film. The camera lens protector adopts the new technology of \"seamless\" integration of augmented reality, with light transmittance and night shooting function, without the need to design the flash hole position, when the flash is turned on at night, the original quality of photos and videos can be restored.     High Privacy: Keeps your personal, private, and sensitive information hidden from strangers, screen is only visible to persons directly in front of screen. Good choose when you are in the bus,elevator,metro or other public occasions. (Note: Due to this privacy cover will darken the image to prevent the peeking eyes near you, you might need to turn your device display brightness up a bit when use it.)     Easiest Installation - Please watch our installation video tutorial before installation. Removing dust and aligning it properly before actual installation, no worrying about bubbles, enjoy your screen as if it wasn't there.     99.99% High-definition clear hydrophobic and oleophobic screen coating protects against sweat and oil residue from fingerprints, and enhance the visibility of the screen.",
    "details": {
      "brand": "Ailun",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "N/A"
    }
  },
  {
    "id": "B0BYHD5LN7",
    "name": "Apple iPhone 14 Plus, 256GB, Midnight for Unlocked (Renewed Premium)",
    "ratings": 41,
    "price": "$159.99",
    "image": "https://m.media-amazon.com/images/I/61B0+qQriPL._AC_SY300_SX300_.jpg",
    "description": "6.7-inch Super Retina XDR display and advanced camera system for better photos in any light.",
    "details": {
      "brand": "Apple",
      "operatingSystem": "iOS 16",
      "memoryStorageCapacity": "256 GB",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "iPhone 14 Plus",
      "wirelessCarrier": "Unlocked for All Carriers",
      "cellularTechnology": "5G",
      "connectivity": "Wi-Fi",
      "color": "Midnight"
    }
  }
]