[
  {
    "id": "B0D6V85W7Q",
    "name": "Case for iPhone 14 Pro Max/14 Pro/14, Wavy Liquid Silicone Phone Case - Gradient, Shockproof Protective Cover,Brown+Black,13 Pro",
    "ratings": null,
    "price": "$27.99",
    "image": "https://m.media-amazon.com/images/I/51VFfk7-TyL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "～【Unique Design】Eye-catching gradient wavy pattern adds a trendy touch to your phone while providing a comfortable grip.     ～【Superior Protection】Made from high-quality liquid silicone, this case offers excellent shock absorption and protects your phone from drops and scratches.     ～【Perfect Fit】Precisely cut to ensure easy access to all buttons, ports, and cameras without removing the case.     ～【Durable Material】The liquid silicone material is durable, resistant to dirt, and easy to clean, maintaining its vibrant color over time.     ～【Multiple Colors】Available in various attractive colors to match your style and mood, including vibrant green and soft pink.",
    "details": {
      "brand": "QANXGOG",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "Brown+Black"
    }
  },
  {
    "id": "B0DGP11WW5",
    "name": "Case for iPhone 16 Pro Max/16 Pro/16 Plus/16, Stylish Genuine Leather Luxury Plating Edge Soft TPU Bumper Lip Screen Protection Slim Elegant Business Case,Green,16",
    "ratings": null,
    "price": "N/A",
    "image": "https://m.media-amazon.com/images/I/71J3CLeIKgL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "COMPATIBLE MODELS : Classy leather case for iPhone 16 Pro Max/16 Pro/16 Plus/16 (2024 release). Show your elegant & unique taste, wonderful gift choice for yourself, family and friends.     PREMIUM LEATHER : This iPhone case is made of cross pattern genuine leather. The lychee pattern combined with the rich leather texture adds a touch of elegance to your iPhone, making it a stylish accessory.     SLIM SMOOTH : Tired of having a heavy bulky cover? This case is the one. It fits your iPhone like a glove. Sleek and lightweight, adds reasonable protection without being too bulky and clunky.     SCREEN AND CAMERA PROTECTION : Precise alignment of incision and lens, the lens is completely wrapped by the cutouts and slight raised lip for camera. 0.5mm raised lips lift screen and camera to provide the daily protection from cracks and scratches.     PLATED EDGE : The frame and the edge of the camera frame are designed with electroplated makes your phone luxury and gorgeous. Business simple elegant style, Luxury for iPhone Case for Men & Women.",
    "details": {
      "brand": "FeylWezm",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "Green"
    }
  },
  {
    "id": "B0DH363XSC",
    "name": "Case for iPhone 16 Pro Max/16 Pro, with Invisible Kickstand, Ultra-Thin Metal Frameless Case [Compatible with MagSafe] Hollow Heat Dissipation",
    "ratings": null,
    "price": "$65.99",
    "image": "https://m.media-amazon.com/images/I/61aOR0d4tIL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "Frameless Design : Showcases the true color of your phone while ensuring efficient heat dissipation with an aluminum alloy construction.     360° Rotation : The cardan rotation design allows 360° free rotation, providing smooth and stable adjustment for perfect viewing angles.     Excellent Adsorption Capacity : Built-in 36 N52 magnets that tight division in the ring that will automatically aligned with magnet charger, and it can effectively prevent accidental drop when shaking.     Durable Construction : Made from aerospace-grade aluminum alloy with an anodized surface for long-lasting durability.     Screen and Camera Protection : Raised edges around the screen and camera guard against scratches and impact.",
    "details": {
      "brand": "QANXGOG",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "Black"
    }
  },
  {
    "id": "B0DGLVS9XS",
    "name": "Case for iPhone 16 Pro Max/16 Pro/16 Plus/16, Compatible with Magsafe Upgrade Full-Body Heavy Duty Protection Clear Case with Built-in 9H Tempered Glass Screen Protector",
    "ratings": null,
    "price": "$87.00",
    "image": "https://m.media-amazon.com/images/I/71zGBpvuOIL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "Compatibility : This case only compatible with iPhone 16 Pro Max/16 Pro/16 Plus/16 (2024 release). The camera hole, speaker hole, power button, volume button, charging position and other holes are accurately positioned.     360° Full-Body Rugged Protection : The four reinforced raised bumpers at the corners can accept shocks in most cases, thereby avoiding mobile phone scratches and other daily damages. The military grade drop proof iphone heavy duty case that delivers legendary defense.     Built-in Screen Protecto : Built-in Screen Protector, Clear polycarbonate back, and TPU lining and Bumpers. Impact resistant TPU lining around the polycarbonate case provides shock absorbing bumper protection for the corners and enhances grip to prevent sliding.     Crystal Clear : The anti-fingerprint and anti-scratch AF electroplating coating effectively repels stains, sweat, and UV rays. With a 99.9% prevention rate against yellowing, the crystal clear back allows you to showcase the true style of your iPhone with amazing clarity.     Strong Magnetic Adsorption : Perfectly aligned magnets make wireless charging faster and easier than ever, providing a magical attach and detach experience and maintaining 15W high-speed charging.",
    "details": {
      "brand": "FeylWezm",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "Black"
    }
  },
  {
    "id": "B0DH35FW6W",
    "name": "Case for iPhone 16 Pro Max/16 Pro/16, Liquid Metal Frame Magnetic Case with 360° Rotating Stand [Compatibility with Magsafe] Sleek and Frameless Design",
    "ratings": null,
    "price": "$53.99",
    "image": "https://m.media-amazon.com/images/I/71I-xlMLhbL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "Frameless Cool Touch : All-metal design offers a sleek, cool touch and improved heat dissipation, meticulously crafted for a smooth, rounded grip.     360° Rotating Stand : Innovative rotating stand offers versatile viewing angles for hands-free convenience, enhancing your multimedia experience with stability and ease.     Excellent Adsorption Capacity : Built-in 36 N52 magnets that tight division in the ring that will automatically aligned with magnet charger, and it can effectively prevent accidental drop when shaking.     Metal Camera Protection Ring : Our iPhone case is equipped with an 4 mm high innovative metal camera protection ring, which can effectively protect the camera from impact. Making your phone most special.     Well Designed : Precise cutouts design has easy access to all control buttons, ports, sensors & camera without removing the case.The unique and beautiful luster of the metal makes you love it.",
    "details": {
      "brand": "QANXGOG",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "Black"
    }
  },
  {
    "id": "B0BGPVH2WK",
    "name": "Magmat iPhone 14 Pro Max Black",
    "ratings": null,
    "price": "$31.86",
    "image": "https://m.media-amazon.com/images/I/61faLiPVJaL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "Magmat iPhone 14 Pro Max Black",
    "details": {
      "brand": "Celly",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "N/A"
    }
  },
  {
    "id": "B0B7B8FRNN",
    "name": "Diyeeni 3G Android Phone, IP12 Pro 4.66inch Cell Phone, 512MB 4GB Unlocked Smartphone for Android 4.4.2, 2MP Rear Camera, 1500mah Battery, Dual Card Dual Standby(Gold)",
    "ratings": null,
    "price": "$68.55",
    "image": "https://m.media-amazon.com/images/I/71Jksiuw3aS.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "【4.66 inch Screen 】The large screen allows you to experience a broader view. In games and videos, the content is displayed more, but the phone is still small and light.     【MTK6572 dual-core CPU】Powerful processor greatly improves the network speed, frame rate and picture smoothness when playing games and multitasking.     【Dual Cards Dual Standby】Up to 128GB of expandable storage, supports simultaneous use of a standard SIM card and a card and a Memory card (three card slots) for phone calls and data storage.     【0.3MP Front+2MP Rear Camera】High‑definition camera for vivid and lifelike colors, every photo is as beautiful, and the front and rear dual cameras can be used more widely.     【For Android 4.4.2】The system is based on the in‑depth development for Android system, which is more complete and smooth.",
    "details": {
      "brand": "Diyeeni",
      "operatingSystem": "Android 4.4",
      "memoryStorageCapacity": "4 GB",
      "screenSize": "N/A",
      "resolution": "480 x 854",
      "modelName": "iPhone 12 Pro",
      "wirelessCarrier": "Unlocked",
      "cellularTechnology": "3G",
      "connectivity": "Wi-Fi, USB",
      "color": "Gold"
    }
  },
  {
    "id": "B0B17KX8XH",
    "name": "Unlocked Android Smartphone，Dual Cards Dual Standby Smartphone, 4.66 Inch Display Cell Phone with Front Rear High Definition Dual Cameras，Mobile Unlocked Phone",
    "ratings": 13,
    "price": "$57.98",
    "image": "https://m.media-amazon.com/images/I/71MnLmPnL-S.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "4.66 inch HD display for an immersive visual experience     Dual SIM card slots to use two networks simultaneously     2MP rear camera captures vivid, lifelike photos and videos     Up to 128GB expandable storage to store media and files     Powerful processor delivers smooth performance for gaming and multitasking",
    "details": {
      "brand": "Pomya",
      "operatingSystem": "Android 4.4",
      "memoryStorageCapacity": "4 GB",
      "screenSize": "N/A",
      "resolution": "480 x 854",
      "modelName": "iPhone 12 Pro",
      "wirelessCarrier": "Unlocked",
      "cellularTechnology": "3G",
      "connectivity": "N/A",
      "color": "N/A"
    }
  },
  {
    "id": "B0DFH49C82",
    "name": "A14 Pro Cell Phone, 5G Unlocked Smartphone 8GB+256GB Smartphone Android 14, 6800mAh Battery, 6.8\" FHD+120Hz 64MP Camera, Dual SIM Octa-Core Phone GPS/Fingerprint/Face ID (White)",
    "ratings": 1,
    "price": "$159.99",
    "image": "https://m.media-amazon.com/images/I/61SEbxw3BCL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "【6800mAh Long Lasting Battery & Fast Charging】This affordable 5g unlocked smartphone with a large 6000mAh battery, 30W fast charging which can well meet your power needs throughout the day. The GPS navigation will direct you to right destinations.     【6.8\" Screen+ Android 14 OS】This A14 Pro Max unlocked cell phones with 6.8\" display,bringing you more vision to immerse in, Adopt Android 14 system, facial recognition, on-screen fingerprint unlock to protect your privacy.     【64MP Professional Photo System】The A14 Pro Max unlocked cell phones is equipped with a 64MP main camera,48MP front camera and 12MP ultra wide angle camera and telephoto cameras, making every photo particularly clear and detailed and take more creative photos.     【Octa-Core CPU+ 256GB】A14 Pro Max dual sim smartphone unlocked features the powerful Qualcomm Snapdragon 8 Gen 3 processor that boosts the overall speed in video and gaming. Up to 8GB + 256GB of memory is enough for social apps, games, movies and other applications.     Customer's satisfaction is the goal we have been striving for We enable our customers to be able to use the least amount of money and be able to buy affordable advanced and good products , if you have any questions or dissatisfaction, please contact us, we will reply you within 24 hours!",
    "details": {
      "brand": "viqee",
      "operatingSystem": "Android 14",
      "memoryStorageCapacity": "256 GB",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "Galaxy A14",
      "wirelessCarrier": "3",
      "cellularTechnology": "5G",
      "connectivity": "N/A",
      "color": "White"
    }
  },
  {
    "id": "B0CWLH5RDR",
    "name": "USB C Wall Fast Charger Block, 40W 4-Port Type C Charger Fast Charging Blocks PD Power Charger Adapter+QC 3.0 USB Multiport Charger Brick for iPhone 16/15/14/13/12 Pro Max, iPad, Galaxy S24/23-2Pack",
    "ratings": 794,
    "price": "$19.99",
    "image": "https://m.media-amazon.com/images/I/6199osd13KL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "【40W USB C Charger Fast Charging Blocks】:The 40W USB C Charger Fast Charging Blocks supports the Power Delivery and Quick Charge 3.0 fast charging functions with a total power of up to 40W.The USB-A port offers an output power of 3.1 A/5 V, while the USB-C port offers a charging speed of 20W.Charge your i Phone 15/14 devices from 0% to 58% in just 30 minutes.     【Multi 4-Port Fast Charging Plug】:The 40W USB C Charger block has two USB-C ports and two USB-A ports output, support total power up to 40W. Allows you to charge 4 devices simultaneously to minimize waiting time, also save your space, one of our wall charger can instead of 4 single USB port wall chargers.     【Universal Compatibility】: The USB C multiport adapter is compatible with almost all electronic devices, charging for iPhone 16 / 16 Pro / 16 Pro Max / 16 Plus/i Phone 15/15 Pro /15 Pro Max/14/14 Pro/14 Pro Max/13/13 Mini/13 Pro Max/12/12 Pro Max/12 Pro Max/12 Mini/SE 2020/11/11 Pro/11 Pro Max/XR/XS/X/8/7,iPadAir/Pro/Mini, Galaxy S24 Ultra/S24Plus /S24/S23 Ultra/S23 Plus/S23 /S22 Ultra/S22/S21/S20/S10/S9/S8/Tablets and other digital devices compatible.     【Compact Portable &Safty Reliable】: This USB C Wall charger block is Incredibly compact for enhanced portability. All this power comes installed in a pocket-friendly compact body, to go wherever the journey takes you. Ideal for home, office, and on the go. Equipped with a smart chip, which can adjust the input power of the Phone to prevent the Phone from overcharging and overheating.     【What You Get】: 40W 4 ports USB Wall Charger block*2. 18-month guarantee. if you have any questions, please contact us,We promise to solve your problems within 24 Hours.",
    "details": {
      "brand": "N/A",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "N/A"
    }
  },
  {
    "id": "B0DGM14N66",
    "name": "Case for iPhone 16 Pro Max/16 Pro/16 Plus/16, Compatible with MagSafe 360° Rotatable Stand Military-Grade Drop Protection Anti-Fingerprint Lightweight Thin Frosted Case,Black,16",
    "ratings": null,
    "price": "N/A",
    "image": "https://m.media-amazon.com/images/I/717ndQK87zL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "PERFECT FIT : Designed case for iPhone 16 Pro Max/16 Pro/16 Plus/16 (released in 2024). Every subtle design fits the specs of your phone perfectly. The cutouts have been measured thousands of times to ensure precisely calculated cuts and sensitive buttons     360°ROTATABLE STAND : The hinge supports 360° rotation and stands, rotates smoothly. You‘ll free your hands and get the perfect viewing angle, such as browsing videos, video meetings, etc. It doubles as a handy ring holder for you to hook when your hands are full, allowing effortless one-finger handling     UPGRADED MULTIPLE PROTECTION : This iPhone case features a shockproof polycarbonate back and the airbag cushions design, which can provide multiple layers of shock protection and reduce damage even from a 10FT drop     SUPER MAGNETIC PROPERTIES : Built-in N52 magnets that align perfectly, this iPhone Case offers more powerful magnetism and faster wireless charging. It allows for fast charging speed and provides strong and secure connections with magnetic accessories such as wallets, chargers, car mounts, etc     SKIN-FRIENDLY : This is made of high-quality Germany imported material, making it more scratch-resistant and anti-fingerprint. The new Nano Oleophobic coating ensures the case has a silky touch feeling without being sticky. The semi-clear minimalist and classic appearance shows your phone's logo flawlessly",
    "details": {
      "brand": "FeylWezm",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "Black"
    }
  },
  {
    "id": "B0DGP3TPD2",
    "name": "Wallet Case for iPhone 16 Pro Max/16 Pro/16 Plus/16, Compatible with MagSafe Full Camera Protection Luxury Quilted Leather Plating Crystal Clear Case with Card Holder,Pale Blue,16",
    "ratings": 1,
    "price": "N/A",
    "image": "https://m.media-amazon.com/images/I/71EV5sbIBFL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "STYLISH DESIGN : This case compatible with iPhone 16 Pro Max/16 Pro/16 Plus/16 (2024 release). Made of high-quality premium microfiber leather with a diamond pattern, which is stylish, durable and finely stitched. It feels good and doesn't hurt hands.     HIGH DEFINITION COLOR : High definition and high transmittance, restore the bare phone, transmitting the original color of the phone to improve the value of the phone, the overall shape of the light and dynamic.Luxury electroplated edge phone case gives your phone a beautiful, shiny look.     CARD HOLDER : This case includes 3 card slots. It is compact and lightweight for everyday portability. The all-in-one design lets you take it outdoors without carrying a bulky purse. It will be your perfect companion for shopping, walking, business trips, short trips and commuting.     FULL PROTECTION : Provide a full Camera lens protection that can protect the camera 100% and will not affect the quality of the photo. Nearly 2mm (2x higer than others)camera raised bezels and 1mm screen raised bezels prevent screen and camera against from scratches & frictions.     ONE-SECOND ATTACHMENT : Perfectly aligned magnets make wireless charging faster and easier than ever, providing a magical attach. Not only provide high quality protection for your iPhone, which bring you the original charging speed experience.",
    "details": {
      "brand": "FeylWezm",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "Pale Blue"
    }
  },
  {
    "id": "B0DGLZCL59",
    "name": "Magnetic Case for iPhone 16 Pro Max/16 Pro/16 Plus/16, Compatible with MagSafe Soft TPU Bumper Hard Translucent Matte Back Slim Fit Shockproof Protective Case,Black,16",
    "ratings": null,
    "price": "N/A",
    "image": "https://m.media-amazon.com/images/I/71mwLz8wOyL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "INVISIBLE STAND : The reversible lens ring doubles as a convenient stand, the lens bracket adjusts from 0° to 110° for optimal viewing angles, allowing both vertical and horizontal viewing positions for hands-free use     MATTE TRANSLUCENT BACK : The iPhone c ase uses High-quality matte TPU and PC translucent material. The frosted surface provides a comfortable hand feel, and the Nano antioxidant layer effectively resists stains, fingerprints, and scratches     MILITARY GRADE PROTECTION: Our case for iPhone backplane is made of rigid polycarbonate, with TPU bumpers around the edges and 4 built-in corner airbags to absorb impact, which prevent your Phone from accidental drops, bumps     METAL DESIGN : Lens protection and buttons are made of metal, and the tiny design of the 2.5mm edge above the camera, 1.5 mm bezels over the screen, and 0.5 mm raised corner lips on the back provide extra and comprehensive protection     PRECISE CUTOUTS : Precise cutouts of speakers, camera, audio, and other functional ports, you can enjoy easy and precise access to all ports and functionality controls without having to remove the phone back case",
    "details": {
      "brand": "FeylWezm",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "Black"
    }
  },
  {
    "id": "B0DGP32QJW",
    "name": "Wallet Case for iPhone 16 Pro Max/16 Pro/16 Plus/16, Compatible with Magsafe Zip Pocket Magnetic Closure Card Holder PU Leather Case with Detachable Wrist Strap,Black,16",
    "ratings": null,
    "price": "N/A",
    "image": "https://m.media-amazon.com/images/I/81y6I1Oi1cL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "STYLISH DESIGN : This iPhone Case is made of high-end stylish PU leather, offers soft nature feel. the perfect balance between fashion and classic. Time flies, the classics last forever.     CARD HOLDER : This iPhone case with folding wallet & card holder designing, it offers 6 card slots, 1 zip pocket and 1 cash compartment for credit cards, ID, business cards, cash, bills.     DETACHABLE WRIST STRAP : The case has an detachable wsrist strap, making it easy to carry around, and can also be a phone case purse to leave your hand free. With a removable lanyard strap, providing a optional griping method.     STRONG PROTECTION : The iPhone case Protective Case is made of flexible TPU bumper. It can effectively absorb the impact of accidental drops and provide full body protection.     STABLE KICKSTAND : The hands-free kickstand flip holster allows your phone or tablet standing independently, which is perfect for video calls, reading, working or movie-watching anywhere.",
    "details": {
      "brand": "FeylWezm",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "Black"
    }
  },
  {
    "id": "B07KWHK4R6",
    "name": "Nokia 7.1 TA-1085 Dual Sim 64GB/4GB (Gloss Steel) - Factory Unlocked - International Version - No Warranty in The USA - GSM ONLY, NO CDMA",
    "ratings": 5,
    "price": "$8.96",
    "image": "https://m.media-amazon.com/images/I/61D21oXmeSL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "",
    "details": {
      "brand": "Nokia",
      "operatingSystem": "Android 8.1",
      "memoryStorageCapacity": "64 GB",
      "screenSize": "N/A",
      "resolution": "1080 x 2280",
      "modelName": "7",
      "wirelessCarrier": "Unlocked",
      "cellularTechnology": "GSM",
      "connectivity": "Wi-Fi",
      "color": "N/A"
    }
  },
  {
    "id": "B0DGLY2Y6C",
    "name": "Case for iPhone 16 Pro Max/16 Pro/16 Plus/16, Compatible with MagSafe Upgraded Drop Protection Non-Yellowing Crystal Clear Case with Built-In Invisible Lens Kickstand,Gray,16",
    "ratings": null,
    "price": "$17.99",
    "image": "https://m.media-amazon.com/images/I/61GKX+95LfL._AC_SY300_SX300_.jpg",
    "description": "ADJUSTABLE LENS BRACKET : Innovatively designed with a durable aluminum alloy, the lens bracket adjusts from 0° to 110° for optimal viewing angles, freeing your hands for a more convenient experience.     UPGRADED DROPPROOF : Adopted with the durable hard PC back, soft TPU bumper and exclusive patent 360°surrounding airbags, the case creates multiple protection to avoid accidental damage. Say NO to the expensive repair cost and strike a perfect balance between sleekness and protection.     BEYOND ORIGINAL BEAUTY: Exclusive micro-dot laser craft and 0.2% Blu-molecular injection ensure 100% light transmittance, which makes the iPhone case crystal clearer than others, fully showing off the brilliant color. Let 's admire the stunning beauty of the iPhone.     RAISED EDGES PROTECTION : The lens frame is elevated by 4mm, while the screen edge is raised by 1mm, effectively guarding your camera lenses and screen against scratches and wear.     STRONGER MAGNETIC : With a built-in super-strong magnet, the case provides a super-strong magnetic connection, ensuring automatic alignment and making Wireless charging faster and safer. It also works seamlessly with most wireless accessories.",
    "details": {
      "brand": "FeylWezm",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "Grey"
    }
  },
  {
    "id": "B0DGLXZZ5J",
    "name": "Case for iPhone 16 Pro Max/16 Pro/16 Plus/16, Compatible with Magsafe Full Camera Lens Protection Luxury Electroplated Mirror Edge Crystal Clear Magnetic Case,Purple,16",
    "ratings": null,
    "price": "$15.97",
    "image": "https://m.media-amazon.com/images/I/71xoGSzC5PL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "BEYOND ORIGINAL BEAUTY : Ultra clear transparent back shows the original beauty of your iPhone. Electroplated mirror edges are for good grip and fashion. Nano diamond anti-oxidation coating can effectively resist most ultraviolet rays and sweat, so that your phone will never turn yellow     UPGRADED CAMERA PROTECTION : This case contains a full-coverage camera design.The ultramodern self-contained lens protective film design can forestall the phone lens from being broken or scratched     SUPER MAGNETIC PROPERTIES : The built-in super ring magnet can strengthen the magnetic connection and ensure automatic alignment. Compared with the previous design, it can achieve faster, safer charging and lower loss     PERFECT COLOR MATCH : We've taken inspiration from the elegant design of the phone itself. Through vacuum plating technology, we've crafted a color that perfectly matches the original shades. The metallic glossy texture not only complements your Phone but enhances its beauty     PRECISE CUTOUTS : Precise cut out for all features, speaker, charging port and camera. The case does not impede the use of any of the function that you don't need to remove it when using your phone. The case is soft and lightweight, easy to install and comfortable to grip",
    "details": {
      "brand": "FeylWezm",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "Purple"
    }
  },
  {
    "id": "B0DGLZJ3RW",
    "name": "Case for iPhone 16 Pro Max/16 Pro/16 Plus/16, Compatible with MagSafe Military-Grade Protection Yellowing Resistant Scratch-Resistant Translucent Matte Back Case,Black,16",
    "ratings": null,
    "price": "$39.99",
    "image": "https://m.media-amazon.com/images/I/71M40DPIHZL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "PERFECT FIT : Designed case for iPhone 16 Pro Max/16 Pro/16 Plus/16 (released in 2024). Every subtle design fits the specs of your phone perfectly. The cutouts have been measured thousands of times to ensure precisely calculated cuts and sensitive buttons     UPGRADED MULTIPLE PROTECTION : This iPhone case features a shockproof polycarbonate back and the airbag cushions design, which can provide multiple layers of shock protection and reduce damage even from a 10FT drop     SCREEN AND CAMERA PROTECTION : Raised camera and screen edges help your phone protects against scratches,the front rugged bumper will protect your screen when placed face down     SUPER MAGNETIC PROPERTIES : Built-in N52 magnets that align perfectly, this iPhone Case offers more powerful magnetism and faster wireless charging. It allows for fast charging speed and provides strong and secure connections with magnetic accessories such as wallets, chargers, car mounts, etc     SKIN-FRIENDLY TOUCH : The Matte Case boasts a premium translucent finish with an upgraded Nano-Oleophobic coating for a smooth, non-sticky touch as well as superior anti-slip properties and a comfortable grip",
    "details": {
      "brand": "FeylWezm",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "Black"
    }
  },
  {
    "id": "B0B6C6QGJL",
    "name": "Coiled Lightning Cable, iPhone Charger Cable 3FT for Car, 2 Pack [Apple MFi Certified] 3 Feet Lightning Cord Compatible with iPhone14/13/12/11 Pro Max/XS MAX/XR/XS/X/8/7/Plus/6S iPad/iPod- Black",
    "ratings": 5.343,
    "price": "$15.69",
    "image": "https://m.media-amazon.com/images/I/61JaLqDphoL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "iPhone Charging Cable for Car : Retractable iPhone car charger with spring shape design, portable and not tangled. It can well save the use of space in the car and say goodbye to the hassle of data cable clutter and tangles.     Elastic Coiled Lightning Cable : Coiled lightning cable 1FT (stretchable to 3FT, comfortable stetch length 1.5ft-2ft) coiled lightning cable 2FT (stretchable to 6FT, comfortable stetch length 3.5ft-4ft) and bounce back to normal length. If you use it in the front seat of your car and store your iPhone device in a compartment, we recommend 3 feet; if you use your device in the back seat of your car, you can choose 6 feet.iPhone charging cable 3ft and 6ft can meet your different needs.     MFi Certified Coiled Lightning Cable: Apple MFi certified lightning charger cable meets all Apple standards with transfer speeds up to 480Mb/s and 2A fast charging.     Wide Compatibility: Compatible with all iPhone models, such as iPhone 14/13/iPhone 12 Pro Max/iPhone 12 Pro/iPhone 12/iPhone 12 mini/11/Xs/XR/X/SE/iPhone 8/7/6/5. Also compatible with iPad and AirPods.     Professional After-Sales Team: If you have any questions, please feel free to contact us, we will be happy to serve you and give you an easy and pleasant shopping experience.",
    "details": {
      "brand": "KIYODA",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "N/A"
    }
  },
  {
    "id": "B08YJ6LGD6",
    "name": "[Apple MFi Certified] Syncwire iPhone Car Charger 32W Super Fast Car Phone Charger Cigarette Lighter USB Car Adapter with Build-in 5FT Coiled Lightning Cable for Apple iPhone 14/13/12/11/XR/Max, iPad",
    "ratings": 3.802,
    "price": "$21.99",
    "image": "https://m.media-amazon.com/images/I/71HHBi7dXzL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "【EFFICIENT QUICK CHARGING】Syncwire 32W iPhone Car Charger can support PD 20W （9V=2.22A）and extra USB 12W output. The PD 20W port with lightning cable equipped with Apple MFi Certified C94 chip, can perfectly adapt to iPhone 14/13/12 series, iPad Pro and Airpods Pro, which has 4X faster than most normal ones. It can charge your iPhone 13 Pro from 0% to 58% within 30 minutes.     【Apple MFi Certified】Using Apple MFi Certified C94 Smart Chip, syncwire USB car charger is compatible with Apple iPhone 14 Pro Max/ iPhone 14 Pro/iPhone 14 Plus/iPhone 14/iPhone 13/13 Mini/13 Pro/13 Pro Max/12/12 Mini/12 Pro/12 Pro Max/SE 2020/11/11 Pro/11 Pro Max/XR/XS/XS Max/X/8 , iPad, AirPods. Additional USB port can charger any other USB-powered devices including Samsung Galaxy, Note, Nexus, HTC, Sony, LG, tablet, power bank and more. Syncwire Fast car charger can charge two devices simultaneously.     【Clever built-in Lightning cable】 The coiled cable can extend to 5ft (1.5M) if pulled tightly while it naturally extends to approximately 1.3ft (0.4M), with first-rate shape retention! And it is designed to fit all aftermarket cases & accessories(including life proof & otter-box cases).     【Advanced certification】 Approved for UL & CE & FCC certification. Syncwire iPhone car charger is suitable for all vehicle models with DC 12-24V input. No interference issues with radio, Bluetooth or Wi-Fi.     【Lifetime reliability 】The sturdy polycarbonate shell, The built-in \"smart IC\" & the thermal material design keep the car adapter going against overheat and over-load on the unit and over-charge onto the devices. The blue LED indicator tells you that Syncwire car Charger is ready for charging!",
    "details": {
      "brand": "SYNCWIRE",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "USB",
      "color": "Black-red"
    }
  }
]