[
  {
    "id": "B0CKNYFHS5",
    "name": "Apple iPhone SE, 16GB 1st Gen 2016 Unlocked, ATT Tmobile",
    "ratings": 3,
    "price": " ",
    "image": "https://m.media-amazon.com/images/I/514nADiSS3L._AC_SY300_SX300_.jpg",
    "description": "Factory Unlocked and compatible with ATT, Tmobile, Cricket, Metro, Boost Mobile, Mint, Ting, Tello, Consumr Cellular and all service providers that use ATT and Tmobile network. NOT compatible with Verizon/Straight Talk or any service provider tha tuses Verizon Network     Insert an activated sim card Provided by your service provider (not included with the phone) power the phone on. All set     Inspected and guaranteed to have minimal to no cosmetic damage, which is not noticeable when the device is held at arms length. Successfully passed a full diagnostic test which ensures perfect functionality. Tested for battery health and guaranteed to have a minimum battery capacity of +80%.     The Apple iPhone SE is the 1st Generation iPhone SE made in 2016 and is Upgradeable to IOS 15     Packed in Generic box with Charger and Cable.",
    "details": {
      "brand": "Plum",
      "operatingSystem": "iOS 15",
      "memoryStorageCapacity": "32 GB",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "IPSE16SILVER",
      "wirelessCarrier": "Unlocked for All Carriers",
      "cellularTechnology": "4G",
      "connectivity": "Bluetooth",
      "color": "Silver"
    }
  },
  {
    "id": "B0DFCBC65J",
    "name": "I16 PROMAX 5G Cell Phone,Smartphone Unlocked Cell Phone 8GB+256GB/6.99\" Display/68MP+108MP Camera/7000 mAh Battery Super Endurance, Dual SIM Card/Face Unlock/GPS/Fingerprint Button Unlock(Wine Red)",
    "ratings": 7,
    "price": "$179.99",
    "image": "https://m.media-amazon.com/images/I/619E+BYBgSL._AC_SY300_SX300_.jpg",
    "description": "🥇 6.99-inch FHD display creates an immersive theater-level visual experience with ultra-high resolution. Vividly presenting your favorite content, each frame is showcased like a work of art, delivering an unprecedented visual feast.     🥇7000mAh Super Large Battery: Maintain long-lasting battery life. Powerful enough to support extended gaming or calls, intelligent AI battery management cleverly optimizes power consumption, and intelligently extends standby time, freeing you from battery worries and injecting more convenience and lasting power into your life!     🥇TAKE TOTAL CAMERA CONTROL—The improved camera with autofocus lets you takes incredibly detailed macro photos and videos. Use the 68MP+108MP Fusion camera for stunning high-resolution images. The latest-generation Photographic Styles give you greater creative flexibility, so you can make every photo even more you. And you can reverse any of those styles anytime you want.     🥇[Global Band, Dual SIM Dual Standby 5G Mobile Phone] The machine adopts 5G smartphone 5G smartphone with fast transmission speed, short latency, high positioning accuracy, and wide link, allowing users to feel a more advanced experience.     🥇【Giveaways+ 365 Days Warranty】When you choose our C24 Ultra smart phone, you will receive the phone, ✔a s pen, ✔a Charger and USB Cable, ✔a Headset, ✔a Screen Protective Film, ✔a Phone Case, ✔a User Guide and a Card Pin. If you have any questions about using the C24 Ultra phone, please feel free to contact us, and we will solve any problems for you",
    "details": {
      "brand": "QPWOEIB",
      "operatingSystem": "Android 13.0",
      "memoryStorageCapacity": "256 GB",
      "screenSize": "N/A",
      "resolution": "1440 x 3200",
      "modelName": "I16 PROMAX",
      "wirelessCarrier": "Unlocked for All Carriers",
      "cellularTechnology": "5G,4G",
      "connectivity": "USB",
      "color": "Wine Red"
    }
  },
  {
    "id": "B0BDY74L2P",
    "name": "Apple iPhone SE 3rd Gen, 64GB, Starlight - Unlocked (Renewed)",
    "ratings": 2.044,
    "price": "$158.99",
    "image": "https://m.media-amazon.com/images/I/511tZTsZESL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "4.7-inch Retina HD display. 5G capable     Advanced single-camera system with 12MP Wide camera; Smart HDR 4, Photographic Styles, Portrait mode, and 4K video up to 60 fps     7MP FaceTime HD camera with Smart HDR 4, Photographic Styles, Portrait mode, and 1080p video recording. Home button with Touch ID for secure authentication     Up to 15 hours of video playback",
    "details": {
      "brand": "Apple",
      "operatingSystem": "iOS 14",
      "memoryStorageCapacity": "64 GB",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "iPhone SE (3rd Gen)",
      "wirelessCarrier": "Unlocked for All Carriers",
      "cellularTechnology": "5G",
      "connectivity": "Wi-Fi",
      "color": "Starlight"
    }
  },
  {
    "id": "B0BV5SV5HL",
    "name": "Samsung Galaxy S23 Ultra 5G SM-S918B/DS Dual SIM 256GB ROM 8GB RAM GSM Factory Unlocked Global Model (Mobile Cell Phone) (Phantom Green)",
    "ratings": 660,
    "price": "$815.00",
    "image": "https://m.media-amazon.com/images/I/51mXHdm9jHL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "6.8\" Dynamic AMOLED 2X Infinity-O QHD+, Edge Screen, 120Hz Refresh Rate, 500ppi, 1750nit (Outdoor Peak), 1440 x 3088 pixels, 5000mAh Battery     256GB, 8GB RAM, No SD Card Slot, Qualcomm SM8550-AC Snapdragon 8 Gen 2 (4nm), Octa-Core, Adreno 740     Rear Camera: 200MP, f/1.7 + 10MP, f/4.9 + 10MP, f/2.4 + 12MP, f/2.2, Front Camera: 12MP, f/2.2, Android 13, One UI 5.1     2G: GSM 850/900/1800/1900, CDMA 800/1900, 3G: HSDPA 850/900/1700(AWS)/1900/2100, CDMA2000 1xEV-DO, 4G LTE: 1/2/3/4/5/7/8/12/13/17/18/19/20/25/26/28/32/38/39/40/41/66, 5G: 1/2/3/5/7/8/12/20/25/28/38/40/41/66/75/77/78 SA/NSA/Sub6 - Dual SIM and eSIM     International Model without Domestic Warranty. The Seller's Return Policy still covers the device. Compatible with Most GSM and CDMA Carriers like T-Mobile, AT&T, etc. Will Also work with CDMA Carriers Such as Verizon. Not Compatible with MetroPCS.",
    "details": {
      "brand": "SAMSUNG",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "256 GB",
      "screenSize": "N/A",
      "resolution": "3040 x 1440",
      "modelName": "SAMSUNG Galaxy S23 Ultra 5G",
      "wirelessCarrier": "Unlocked for All Carriers",
      "cellularTechnology": "5G",
      "connectivity": "5G",
      "color": "N/A"
    }
  },
  {
    "id": "B0DBRH4W9W",
    "name": "I14 Pro Max Unlocked Cell Phone,Long Battery Life 6.82\" HD Screen Unlocked Phones,Android13 6+256GB Smartphone with 128G Memory Card,Dual SIM/Fingerprint Lock/Face ID/GPS(Blue)",
    "ratings": 23,
    "price": "$158.99",
    "image": "https://m.media-amazon.com/images/I/61NfnaEUqOL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "【6.8-inch HD Screen】6.8-inch HD Screen with 3040*1440 resolution 5G cell phones, deliver more vibrant colors and stronger contrasts. Magnesium aluminum body. Facial recognition, on-screen fingerprint unlock to protect your privacy. comfortable to hold. Adopts facial recognition and on-screen fingerprint unlocking to better protect your privacy.     【Android 13 & 6GB+256GB】Android 13 Phone is the lastest version, the excellent compatibility makes the smartphone 5G not obsolete in years. Powerful privacy controls protect you from malicious apps. This unlocked android smartphone has 6GB RAM makes the smartphone keep smooth when handling heavy tasks, running more apps in the background, 256GB ROM Supports expandable storage up to 128GB, Say goodbye to lag.     【108MP+48MP Camera & Deca-Core Processor】108MP main camera, paired with enhanced image processing algorithms, makes every photo exceptionally sharp and detailed, while still striking and lifelike. The cell phone is equipped with the powerful Deca-Core processor, which can dramatically improve the running speed, network, frame rate and picture smoothness, you will no more need to suffer from phone lag.     【6800mAH & 20W Fast Charging】Thanks to the 6800mAh powerhouse on the back, I14 Pro Max 5G keeps anxiety at bay with a bigger battery for offering you longer entertainment time. Moreover, it supports 20W fast charging to withstand urgent use - when it does need a charge, make it fast.     【Global Band & Dual SIM 5G/4G Phone】Support multiple bands dual card. unlocked phone will smoothly run multiple apps simultaneously with ease, meet your work and entertainment needs, such as T-Mobile, BTC, MetroPCS, H2O, Movistar, Telcel, Tigo, Claro, Vivacom, Ultra Mobile, and so on.",
    "details": {
      "brand": "A SLICE RED",
      "operatingSystem": "Android 13.0",
      "memoryStorageCapacity": "256 GB",
      "screenSize": "N/A",
      "resolution": "1440 x 3040",
      "modelName": "A14 PRO",
      "wirelessCarrier": "Unlocked for All Carriers",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "N/A"
    }
  },
  {
    "id": "B0D99K5M8M",
    "name": "I15 ProMax 5G Unlocked Smartphone,8GB+256GB with128GB Memory Card cell phone Android 13, 6.8\"HD Screen Unlocked Cell Phone, 7000mAh, 48MP+108MP Dual Camera/Fingerprint Lock/Face(Natural Titanium)",
    "ratings": 10,
    "price": "$178.88",
    "image": "https://m.media-amazon.com/images/I/61nqcgrJ-QL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "【Snapdragon8 Gen2 CPU + 128GB Expandable TF Card】unlocked Android cell phone powerful by Snapdragon 8CPU+ 5G Octa-Core Processor, Up to 8GB RAM and 256GB ROM Supports expandable storage up to 128GB, storage card to easily store your favorite music videos photograph it offers you a capacious room to keep all your favorite things     【48MP+108MP+6.8\"HD Screen】108MP main camera and a 48MP front facing camera,Equipped with extra-large 6.8\"HD Screen High Definition Storage of Pictures and Videos Recording of Good Life     【7000mAh Battery+Android 13】Large capacity and long battery life No need to recharge multiple times Enjoy long time use of your cell phone,Android 13 on board for a smoother experience     【Unlocked Smartphones & Multi-function NFC】 unlocked smartphones works with most major U.S. carriers. It is compatible with most GSM networks and CDMA networks. Both SIM slots are compatible with 5G/4G, and support 5G/4G in both slots simultaneously.     【Parts + Service】I15 ProMax 5G Phone present as a gift built in pen/screen protector/earphones/charger/128GB Memory Card, I wish you a happy life, if you have any questions in the process of experiencing the mobile phone, please feel free to contact us, we will solve the problem with you in time",
    "details": {
      "brand": "Ecshock",
      "operatingSystem": "Android 13.0",
      "memoryStorageCapacity": "256 GB",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "15 PROMAX",
      "wirelessCarrier": "Unlocked for All Carriers",
      "cellularTechnology": "5G",
      "connectivity": "Wi-Fi, USB",
      "color": "Natural Titanium"
    }
  },
  {
    "id": "B0CQ9WLBFF",
    "name": "OnePlus 12R, 16GB RAM+256GB, Dual-SIM, US Factory Unlocked Android Smartphone, 5500 mAh Battery, 50MP Camera, 80W Fast Charging, 2024, Cool Blue",
    "ratings": 487,
    "price": "$529.99",
    "image": "https://m.media-amazon.com/images/I/6178pE1utbL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "Comes with 6 months of Google One and 3 months of Youtube Premium with purchase of OnePlus 12R. (New accounts only for each service to qualify)     Premium Display: Experience the 1.5k Super Fluid AMOLED display, powered by the cutting-edge 4th Gen LTPO, which dynamically adjusts your content from 1Hz up to 120Hz.     Peak Performance: The OnePlus 12R is powered by Snapdragon 8 Gen 2 with up to 16GB of RAM.     Fast Charging: Introducing the longest-lasting battery of any OnePlus phone! The massive 5500 mAh is powered by an 80W SUPERVOOC charger, which comes included in the box.     Next-Gen Cooling System: The all new Dual Cryo-velocity VC Cooling System delivers improved temperature dissapation, which is perfect for gaming or any other graphics-intensive apps. Our advanced technology and innovative design ensures that the OnePlus 12R stays cool, no matter how you use it.",
    "details": {
      "brand": "OnePlus",
      "operatingSystem": "Android 14",
      "memoryStorageCapacity": "16 GB",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "OnePlus 12R",
      "wirelessCarrier": "Unlocked for All Carriers",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "N/A"
    }
  },
  {
    "id": "B0CHN7M531",
    "name": "OnePlus Open, 16GB RAM+512GB, Dual-SIM, Voyager Black, US Factory Unlocked Android Smartphone, 4805 mAh Battery, 67W Fast Charging, Hasselblad Camera, 120Hz Fluid Display",
    "ratings": 255,
    "price": "$1,299.99",
    "image": "https://m.media-amazon.com/images/I/71slFjJerBL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "Comes with 6 months of Google One and 3 months of Youtube Premium with purchase of OnePlus Open. (New accounts only for each service to qualify)     Thin & Light Design: The OnePlus Open is the thinnest & lightest foldable in North America*. With aerospace-grade materials & a custom Flexion hinge design, the OnePlus Open delivers a ergonomic user experience. With carbon fiber support structures & titanium alloy, the Open is as durable as it is premium. *Comparison does not include flip-style foldable phones. Thinnest measurement excludes rear-facing camera.     Premium Displays: OnePlus Open features a 6.31\" exterior display & 7.82\" foldable interior display. Experience a premium viewing experience with a near-invisible crease, Dolby Vision, & 10-bit color, & 2800 nits peak brightness.     Multitasking: Take multitasking to the next level with Open Canvas, which allows instant app-switching & drag-and-drop functionality across apps. With our iconic OxygenOS design language, the OnePlus Open is fast & smooth across all scenarios - gaming, entertainment, working, and more.     Camera: The OnePlus Open features a powerful triple camera array co-developed with Hasselblad. These include a primary 48MP primary lens, a 48MP ultra-wide, and a 64MP periscope zoom lens. Capture pro-grade portraits with natural bokeh & high color accuracy or shoot stories in Dolby Vision HDR format.",
    "details": {
      "brand": "OnePlus",
      "operatingSystem": "Android 13.0",
      "memoryStorageCapacity": "512 GB",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "OnePlus Open",
      "wirelessCarrier": "Unlocked",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "N/A"
    }
  },
  {
    "id": "B0D8SWK722",
    "name": "REDMAGIC 9S Pro Smartphone 5G, 120Hz Gaming Phone, 6.8\" Full Screen, Under Display Camera, 6500mAh Android Phone, Snapdragon 8 Gen 3, 16+512GB, 80W Charger, Dual-Sim, Unlocked Phone Transparent",
    "ratings": 1.036,
    "price": "$899.00",
    "image": "https://m.media-amazon.com/images/I/51OJK9ATJpL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "【6.8\" FHD+ Full Screen】Gaming Phone with a 120Hz refresh rate and a resolution of 2480 x 1116 pixels, this 6.8\" FHD+ Full AMOLED screen delivers beautiful HD+ visuals at up to 120 frames per second. With a 960Hz touch sampling rate for multi fingers, the Cell Phone delivers ultra-fast touch and precise response, giving you a serious competitive edge while gaming. The 5G Smartphone have also Under-display Fingerprint Sensor and 16MP Under Display Camera.     【Latest Chip and Larger Storage】The Gaming Smartphone has the latest Qualcomm Snapdragon 8 Gen 3 Leading Version(Red Core 2 Pro + UFS 4.0 + LPDDR5X). Play your favorite games with ease with the raw power of the new CPU clocking in at nearly 3.4GHz and enjoy Triple-A graphics thanks to the fast rendering power of the GPU. 16GB RAM + 512GB ROM provides not only a fun gaming experience and effects, also large storage space for game downloads.     【Multi-Dimensional Cooling System】The Gaming Phone incorporates new aerospace-grade phase change materials (PCM) . Heat can be stored inside this material and released slowly so you feel less heat from the phone while playing, making it more comfortable to hold the phone. The High-Speed Built-In Turbofan accelerates heat dissipation and the fan noise is as quiet as a whisper.     【5G & WIFI Connection and 80W fast charging】5G is SA+NSA dual mode and supports all key regions up to 3.0 Gbps uploads, up to 7.5 Gbps downloads. WIFI 7 is up to 3.5Gbps. These bring mobile gaming to a whole new level. Download the latest games and videos in gigabit speeds with ease to show off your smooth, low latency experience. The Cell Phone certified 80W GAN charger and supports 80W fast charging.     【Ultra HD AI Quad Camera】Rear Camera are Samsung GN5 50MP(Wide) + Samsung JN1 50MP(Ultrawide) + 2MP(Macro). The primary camera is upgraded to enable users to take fantastic photos and videos with a fast auto focus, even in the dimmest scenario. Every detail is captured. Thanks to dual pixel focusing, it ensures fast autofocus regardless. Front Camera is 16 Megapixel and 5nd generation under-display-camera (UDC).",
    "details": {
      "brand": "REDMAGIC",
      "operatingSystem": "Android 14",
      "memoryStorageCapacity": "512 GB",
      "screenSize": "N/A",
      "resolution": "2480 x 1116",
      "modelName": "9S Pro Transparent",
      "wirelessCarrier": "Unlocked",
      "cellularTechnology": "5G",
      "connectivity": "N/A",
      "color": "N/A"
    }
  },
  {
    "id": "B0CMDWC436",
    "name": "SAMSUNG Galaxy S24 Ultra Cell Phone, 512GB AI Smartphone, Unlocked Android, 50MP Zoom Camera, Long Battery Life, S Pen, US Version, 2024, Titanium Gray",
    "ratings": 3.214,
    "price": "$1,324.97",
    "image": "https://m.media-amazon.com/images/I/71-EnPs+uQL._AC_SY300_SX300_.jpg",
    "description": "CIRCLE & SEARCH¹ IN A SNAP: What’s your favorite influencer wearing? Where’d they go on vacation? What’s that word mean? Don’t try to describe it — use Circle to Search1 with Google to get the answer; With S24 Series, circle it on your screen and learn more     REAL EASY, REAL-TIME TRANSLATIONS: Speak foreign languages on the spot with Live Translate²; Unlock the power of convenient communication with near real-time voice translations, right through your Samsung Phone app     NOTE SMARTER, NOT HARDER: Focus on capturing your notes and spend less time perfecting them; Note Assist³ will summarize, format, and even translate them for you; All of your notes are organized neatly so that you can find what you need     BRING DETAILS OUT OF THE DARKNESS: Brighten up your night with Nightography on S24 Ultra; Want a closer look? Zoom in from a distance, even in low light     MORE WOW, LESS WORK: Turn every photo into a post-worthy masterpiece; Move or remove objects; Fill in empty space; Simply snap a pic and take it from great to jaw-dropping with Generative Edit⁴     CAPTURE. SHARE. IMPRESS: Create crystal-clear content worth sharing; From bustling cityscape to a serene landscape, capture a masterpiece of detail with 200MP camera and let S24 Ultra adjust each hue and shade to reflect the world as you see it     OUR MOST POWERFUL GALAXY SMARTPHONE YET: Jump seamlessly between apps without the wait and see content in high quality with our fastest processor yet, Snapdragon 8 Gen 3 for Galaxy⁵",
    "details": {
      "brand": "SAMSUNG",
      "operatingSystem": "Android 14, One UI 6.1",
      "memoryStorageCapacity": "512 GB",
      "screenSize": "N/A",
      "resolution": "3120 x 1440 pixels",
      "modelName": "Galaxy S24 Ultra",
      "wirelessCarrier": "Unlocked for All Carriers",
      "cellularTechnology": "5G",
      "connectivity": "N/A",
      "color": "N/A"
    }
  },
  {
    "id": "B0DGLY4F64",
    "name": "Boost Mobile | Apple iPhone 16 Pro Max (1 TB) - Natural Titanium [Locked]. Requires Unlimited Plan. Apple Intelligence.",
    "ratings": 41,
    "price": "$0.01",
    "image": "https://m.media-amazon.com/images/I/61qV17Px4NL.__AC_SY445_SX342_QL70_FMwebp_.jpg",
    "description": "WHAT'S INCLUDED? You get the new iPhone 16, complete with unlimited talk, text, and data. You can upgrade to the latest iPhone every year—no trade-in required to get started. Yes, seriously.     NO CATCH! This unbeatable deal offers you all these benefits under the Infinite Access for iPhone plan from Boost Mobile starting at just $65 per month.     STUNNING TITANIUM DESIGN—iPhone 16 Pro Max has a strong and light titanium design with a larger 6.9-inch Super Retina XDR display.♢ It’s remarkably durable with the latest-generation Ceramic Shield material that’s 2x tougher than any smartphone glass.     BUILT FOR APPLE INTELLIGENCE—Apple Intelligence is the personal intelligence system that helps you write, express yourself, and get things done effortlessly.♢ With groundbreaking privacy protections, it gives you peace of mind that no one else can access your data.     TAKE TOTAL CAMERA CONTROL—Camera Control gives you an easier way to quickly access camera tools, like zoom or depth of field, so you can take the perfect shot in record time.     MAGNIFICENT SHOTS—Take your videos to a whole new level with 4K 120 fps Dolby Vision, enabled by the 48MP Fusion camera. The improved 48MP Ultra Wide camera lets you capture mesmerizing detail in macro photos and wide-angle shots.     PHOTOGRAPHIC STYLES—The latest-generation Photographic Styles give you greater creative flexibility, so you can make every photo even more you. And thanks to advances in the image pipeline, you can now reverse any style, any time.",
    "details": {
      "brand": "Boost Mobile",
      "operatingSystem": "iOS",
      "memoryStorageCapacity": "1 TB",
      "screenSize": "N/A",
      "resolution": "2868-by-1320-pixel resolution at 460 ppi",
      "modelName": "iPhone 16 Pro Max",
      "wirelessCarrier": "Boost Mobile",
      "cellularTechnology": "5G",
      "connectivity": "5G, Bluetooth, Wi-Fi, USB, NFC",
      "color": "N/A"
    }
  },
  {
    "id": "B0CNL4VKWN",
    "name": "Apple iPhone 7 32GB Unlocked - Silver",
    "ratings": 35,
    "price": "$106.02",
    "image": "https://m.media-amazon.com/images/I/61XZo5E910L._AC_SX300_SY300_.jpg",
    "description": "Preowned - Excellent Condition - Factory Unlocked - Compatible with All service Providers     Minimum 80% Battery Life as compare to a new     Includes Charger and Cable - Packed in Generic Box     Sim card is not included     4.7-Inch Retina HD display; A10 Fusion; Accelerometer; Compass; Gyroscope     12MP iSight Camera with live Photos and 4K Video; 32GB of internal memory to store your apps, music, photos, and videos",
    "details": {
      "brand": "Plum",
      "operatingSystem": "iOS 15",
      "memoryStorageCapacity": "32 GB",
      "screenSize": "N/A",
      "resolution": "1334 x 750",
      "modelName": "IP732SLV-1",
      "wirelessCarrier": "Unlocked for All Carriers",
      "cellularTechnology": "4G",
      "connectivity": "N/A",
      "color": "N/A"
    }
  },
  {
    "id": "B0CH8BS44W",
    "name": "Phone 6s 16gb Gold (New)- Unlocked",
    "ratings": 5,
    "price": "$112.00",
    "image": "https://m.media-amazon.com/images/I/41XWqUU4jdL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "",
    "details": {
      "brand": "Ubglcs i",
      "operatingSystem": "iOS 9",
      "memoryStorageCapacity": "16 GB",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "phone6s16glod",
      "wirelessCarrier": "Unlocked for All Carriers",
      "cellularTechnology": "GSM / CDMA / HSPA / EVDO / LTE",
      "connectivity": "Wi-Fi",
      "color": "Gold"
    }
  },
  {
    "id": "B08BRBX94S",
    "name": "iLight Mini 16 Pro : World's Smallest 4G LTE Android Smartphone | 3\" Touchscreen, 3GB RAM, 64GB ROM | Tiny iPhone 16 Pro Design | Perfect for Kids & Teens | USA & Global Unlocked",
    "ratings": 12,
    "price": "$107.90",
    "image": "https://m.media-amazon.com/images/I/51T5NGgvboL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "🌟 MINI MARVEL: Sleek iPhone 16 Pro-inspired design with a micro touchscreen. Full Android functionality in a compact package - perfect for on-the-go browsing and app downloads.     🇺🇸 USA-READY: Unlocked and compatible with all 4G LTE networks across the United States.     📱 FEATURE-PACKED: Despite its size, enjoy Bluetooth, Wi-Fi, voice & video calls, camera, email, MP3, GPS, messaging, and more. Access Google Play Store for all your favorite apps!     💪 POWERFUL PERFORMANCE: Equipped with MTK Quad CPU, 3GB RAM, and 64GB storage. Durable build meets cutting-edge iPhone 16 Pro Max aesthetics.     🌐 GLOBALLY CONNECTED: Wi-Fi, Bluetooth, and GPS keep you linked worldwide. Perfect for travelers! (Tip: Verify GSM/WCDMA band compatibility with your network)     🎯 VERSATILE USE: Full Android experience in a compact form. Ideal for kids, second phone users, or as a unique business gift. Download apps, stay connected, and simplify your digital life!     🎁 PERFECT GIFT: Its cute, mini design and powerful features make it an awesome, unique gift for tech enthusiasts, travelers, or anyone who appreciates innovative gadgets.",
    "details": {
      "brand": "iLight",
      "operatingSystem": "Android 10.0",
      "memoryStorageCapacity": "64 GB",
      "screenSize": "N/A",
      "resolution": "480 x 800",
      "modelName": "iTiny 16 Pro",
      "wirelessCarrier": "Unlocked for All Carriers",
      "cellularTechnology": "4G, 3G, 2G",
      "connectivity": "N/A",
      "color": "N/A"
    }
  },
  {
    "id": "B0DD38LKCV",
    "name": "Smartphone Unlocked Cell Phone IP14pro 6.7inch HD Cheap Phones 2GB/16GB Android 10 Straight Talk Phone 5000mAh 128GB Extension Dual Sim Boost Mobile Phones (Gold)",
    "ratings": 2,
    "price": "$88.88",
    "image": "https://m.media-amazon.com/images/I/61ucFeJBrtL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "📱【A Bigger Screen 6.7inch】The unlocked android phones come with a expansive 6.7\" display. Its high-definition resolution brings you real-world vividness and vibrant color. It supports view different contents on the same screen to enable entertaining while working, Dark Mode can reduce the light emitted by the screen to decrease eye strain for comfortable visuals.     【2GB RAM+ 16GB ROM】Unlocked smartphone is equipped with high-performance 2GB +16G and Android 10 system, the moblie phone can be expanded to 256GB through a microSD card,runs smoothly, and has a good user experience. Watch live broadcasts, swipe videos, play games, and video chat to enjoy a smooth and non-stuck experience.     🔋【5000mAh Long-lasting Battery】The unlocked mobile phones is equipped with 5000mAh large battery, which allows you to go on browsing, playing games, watching movies or so for hours.You can aslo enable the Face ID function to unlock the smartphone quickly at a glance.     【A Delight to Your Style】Design is an endless journey of pursuing beauty, and everything can be the spark of new inspirations.Cell phone interprets the color aesthetics in life from the splendid nature scenes to the whimsical imaginations with four invigorating hues. This android smartphone has all the features to cater to adults, elderly as well as children.     Face Unlocking Technology🖤Android unlocked cell phone advanced operating system, mobile phone Face unlocked technology. Whether the smartphones screen is on or still, the unlocking process can be completed within 0.8 seconds, making life more pleasant and convenient, and saving more precious time.",
    "details": {
      "brand": "EMUPER",
      "operatingSystem": "Android 10.0",
      "memoryStorageCapacity": "16 GB",
      "screenSize": "N/A",
      "resolution": "1600x3200",
      "modelName": "iPhone 14 Pro",
      "wirelessCarrier": "Unlocked for All Carriers",
      "cellularTechnology": "4G",
      "connectivity": "N/A",
      "color": "N/A"
    }
  },
  {
    "id": "B09LPHWK1V",
    "name": "Apple iPhone 13 Pro, 1TB, Gold - T-Mobile (Renewed)",
    "ratings": 4.93,
    "price": "$570.69",
    "image": "https://m.media-amazon.com/images/I/51tFyA6q6eL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "6.1\" Super Retina XDR display with ProMotion. 5G Superfast downloads, high?quality streaming     Cinematic mode in 1080p at 30 fps. Dolby Vision HDR video recording up to 4K at 60 fps. 6X Optical zoom range     A15 Bionic chip. New 6-core CPU with 2 performance and 4 efficiency cores. New 5-core GPU. New 16-core Neural Engine     Up to 22 hours video playback. Face ID. Ceramic Shield front. Surgical-grade stainless steel",
    "details": {
      "brand": "Apple",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "1 TB",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "13 Pro",
      "wirelessCarrier": "T-Mobile",
      "cellularTechnology": "5G",
      "connectivity": "Wi-Fi",
      "color": "Gold"
    }
  },
  {
    "id": "B0DFQ1T85J",
    "name": "Phone Tripod Stand, Aluminum Alloy Phone Stand Compatible with iPhone 16/15/14/13/12 Series, Foldable Strong Magnetic Phone Stand, Multifuctional Angle Adjustment Pocket Tripod (Grey)",
    "ratings": 56,
    "price": "$35.99",
    "image": "https://m.media-amazon.com/images/I/71dWz+xrFeL._AC_SY300_SX300_.jpg",
    "description": "Phone Stand with Stylish Design: The cell phone stand is made of new generation aluminum alloy, and the tripod stand design makes the product more stable. The hinge is solid and reliable, adjustable multiple angles. Perfect compatible with Mag-safe charger     Compatibility: 1ST IDEA Phone tripod stand compatible with iPhone 16 Pro Max, iPhone16 Pro, iPhone 16 Plus, iPhone 16, iPhone 15 Pro Max, iPhone15 Pro, iPhone 15 Plus, iPhone 15, iPhone 14 Pro Max, iPhone14 Pro, iPhone 14 Plus, iPhone 14, iPhone 13 Pro Max, iPhone 13 Pro, iPhone 13, iPhone 13 Mini, iPhone 12 Pro Max, iPhone 12 Pro, iPhone 12, iPhone 12 Mini, and compatible with MagSafe cases. For non-MagSafe phones or cases with an included Metal Ring Inside the package     Lightweight and Convenient: With a thin card-style design, pocket tripod weights less than 2.4 oz, height 0.2 inches. Unfolds up to 8.9 inches and it only takes 3 seconds to unfold and close - Recommended to use with phone case     Strong Magnetic Wireless Charger stand: The phone tripod has built-in strong magnets. tripod compatible with the Original Mag-Safe Charger. Super magnetic properties can improve wireless charging efficiency. Mag-safe charger is also quite easy to attach and detach your phone from the mag charging stand     Convenient and Reliable: The aluminum alloy magnetic phone stand has a smooth touch and is resistant to daily dirt and scratches. The aluminum alloy material is waterproof and sun-proof and has a longer service life. It is more convenient for you to use at home, in the office, on the beach, in the gym or when traveling",
    "details": {
      "brand": "1ST IDEA",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "Grey"
    }
  },
  {
    "id": "B0DCVR2NWS",
    "name": "CASETiFY Compact Case for iPhone 16 [Lightweight / 4 ft. 2X Military Grade Drop Protection/Slim] - Pastel Gradient - Clear Black",
    "ratings": 45,
    "price": "$38.25",
    "image": "https://m.media-amazon.com/images/I/41gUmN0Sc+L._AC_SY300_SX300_.jpg",
    "description": "Compatible with iPhone 16 Only (6.1 Screen Size)     4 ft. drop protection (2x MIL-STD-810G)     Slim and sleek; Anti-slip grip     Seamless access to camera control button     Wireless charging compatible",
    "details": {
      "brand": "CASETiFY",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "Pastel Gradient"
    }
  },
  {
    "id": "B0CJDTC6ZB",
    "name": "【Upgraded】 SUPERONE Retractable Car Charger 4 in 1, Fast Car Phone Charger with Cord 2.6ft, USB C and Apple Car Charger Adapter, Compatible with iPhone 16 15/15 Pro Max/14/13/12/11, Galaxy, Pixel",
    "ratings": 1.793,
    "price": "$23.99",
    "image": "https://m.media-amazon.com/images/I/61+F2Q2HxSL._AC_SY300_SX300_.jpg",
    "description": "Convenient Retractable Design: Our Retractable Car Charger features two 80cm long extendable cables, allowing for easy storage and keeping your car interior clean and organized. No more tangled cables or messy car compartments!     Upgraded 4-1 Fast Charging Solution: With a real PD30W type-C retractable cable(Yellow fast charging port), an IOS retractable cable, and additional USB-C and USB-A ports, this fast charge retractable car charger supports fast charging for up to 4 devices simultaneously. Say goodbye to the hassle of carrying multiple chargers for your different devices.【This car charger is only for charging, and cannot be used for CarPlay】     Voltage Display for Battery Health Monitoring: Our Car Charger with cord is equipped with a voltage display feature, allowing you to monitor the health of your car battery at all times. Stay informed and ensure optimal performance for your vehicle.     This 4 in 1 retractable car phone charger can be used for both 12V DC and 24V DC. Rated Power: 60W. Type-C Retractable Cable Output: PD30W Max. IOS Retractable Cable Output: 5V/2.4A. Type-C Port Output: 5V/3A. USB-A Port Output: 5V/2.4A.     Safe Usage with All-Round Protections: 18-Months Warranty. Stable plug with built-in 15A fuse and protective circuits against overcharging, over-temp and short-circuit to safeguard your precious appliances.     [Multi-Fast Charging Protocol Certification] The cigarette lighter usb c charger is compatible with devices supporting PD, QC3.0, AFC, MTK, and FCP including phones, tablets, notebooks, Switch, etc. Be like iPhone 16/15/14/13/12/11/ Plus/ Pro/ Pro Max/ mini/ XS / XS Max / XR /X /8 Plus/8/ 7 Plus /7 /6S /6, Samsung Galaxy Note 20 Ultra/ Note10 Plus/ S23/S22/S22+/S22 Ultra/S21+/S20/S10 5G /A54/S /S9 Plus/ S8+/ Note 9, Google Pixel7/ 7a/ 6/ 6a/ 5/ 4xl/ 3xl/ 2xl/ 3a/ 4/ 4a/Nexus 6P etc.",
    "details": {
      "brand": "SUPERONE",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "USB",
      "color": "Black"
    }
  },
  {
    "id": "B0CCYM3F1V",
    "name": "Ailun Glass Screen Protector for iPhone 16 / iPhone 15 / iPhone 15 Pro [6.1 Inch] Display 3 Pack Tempered Glass, Dynamic Island Compatible, Case Friendly [Not for iPhone 16 Pro 6.3 Inch]",
    "ratings": 9.789,
    "price": "$5.89",
    "image": "https://m.media-amazon.com/images/I/71S7Ej-DfQL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "WORKS FOR iPhone 16/15/15 Pro 6.1 Inch Display Screen 2024/2023 0.33mm tempered glass screen protector. Featuring maximum protection from scratches, scrapes, and bumps. [Not for iPhone 16 Pro 6.3 inch]     Specialty: HD ultra-clear rounded glass for iPhone 16/15/15 Pro is 99.99% touch-screen accurate.     99.99% High-definition clear hydrophobic and oleophobic screen coating protects against sweat and oil residue from fingerprints.     It is 100% brand new, precise laser cut tempered glass, exquisitely polished. 0.33mm ultra-thin tempered glass screen protector provides sensor protection, maintains the original response sensitivity and touch, bringing you a good touch experience.     Easiest Installation - removing dust and aligning it properly before actual installation, enjoy your screen as if it wasn't there.",
    "details": {
      "brand": "Ailun",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "N/A"
    }
  },
  {
    "id": "B0D9XJR6TH",
    "name": "SmartDevil 3 Pack Screen Protector for iPhone 16, Bubble-and-Dust-Free Box, HD Tempered Glass, Military Grade Shatterproof & Ultra Durable, Easy Installation",
    "ratings": 211,
    "price": "$12.99",
    "image": "https://m.media-amazon.com/images/I/61QKikc195L.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "Quick & Easy Installation: Say goodbye to installation hassles. SmartDevil screen protector attaches effortlessly in just a few steps for a perfect fit.And without any dust, bubble-free every time.     Premium Protection: SmartDevil glass screen protector offers ultimate durability with dual reinforcement, 9H hardness, and aerospace-grade for pristine screens and 8K crystal-clear visibility.     Scratch and Impact Protection: Safeguard your screen from scratches and impacts for lasting pristine condition.     Responsive Touch: Enjoy the same touch sensitivity, feel, and response on your Phone as you would with the original screen. The film also Features a fine oleophobic coating, it effectively resists scratches, oil, and fingerprints.     Meets International Military Standards: SmartDevil screen protector undergoes 12 rigorous engineering tests, including 220lbs impact, 8ft drops, and 10,000+ scratch tests, ranking as the top glass for strength, toughness, and durability. Ensures your Phone screen stays flawless.",
    "details": {
      "brand": "SmartDevil",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "N/A"
    }
  },
  {
    "id": "B0D9LMRR4V",
    "name": "Ailun 3 Pack Privacy Screen Protector for iPhone 16 [6.1 inch] + 3 Pack Camera Lens Protector, Anti Spy Private Tempered Glass Film, Case Friendly, [9H Hardness] - HD [6 Pack]",
    "ratings": 27.442,
    "price": "$8.89",
    "image": "https://m.media-amazon.com/images/I/71QLY9BLiWL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "[3+3 Pack] This product includes 3 pack privacy screen protectors and 3 pack camera lens protectors. Works For iPhone 16 [6.1 inch] tempered glass screen protector and camera lens protector. Featuring maximum protection from scratches, scrapes, and bumps.     Night shooting function: specially designed iPhone 16 6.1 Inch camera lens protective film. The camera lens protector adopts the new technology of \"seamless\" integration of augmented reality, with light transmittance and night shooting function, without the need to design the flash hole position, when the flash is turned on at night, the original quality of photos and videos can be restored.     High Privacy: Keeps your personal, private, and sensitive information hidden from strangers, screen is only visible to persons directly in front of screen. Good choose when you are in the bus,elevator,metro or other public occasions. (Note: Due to this privacy cover will darken the image to prevent the peeking eyes near you, you might need to turn your device display brightness up a bit when use it.)     Easiest Installation - Please watch our installation video tutorial before installation. Removing dust and aligning it properly before actual installation, no worrying about bubbles, enjoy your screen as if it wasn't there.     99.99% High-definition clear hydrophobic and oleophobic screen coating protects against sweat and oil residue from fingerprints, and enhance the visibility of the screen.",
    "details": {
      "brand": "Ailun",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "N/A"
    }
  }
]