[
  {
    "id": "B0D6VBHYS6",
    "name": "Case for iPhone 14 Pro Max/14 Pro/14, Carbon Fiber Finish Slim Fit, Scratch-Resistant, Built-in Camera Protector, Wireless Charging Compatible,Red,14 Pro Max",
    "ratings": null,
    "price": "$41.99",
    "image": "https://m.media-amazon.com/images/I/71Y0GxhqyuL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "【Elegant Design】Featuring a classic black carbon fiber pattern, this case not only provides robust protection but also enhances the aesthetic appeal of your iPhone.     【Built-in Camera Protector】All-inclusive lens protection to prevent scratches and damage, ensuring crystal-clear photos every time.     【Scratch-Resistant & Anti-Fingerprint】The surface of the case is both scratch-resistant and anti-fingerprint. This keeps your phone looking pristine and free from unsightly marks, preserving its aesthetic appeal over time.     【Precise Cutouts & Easy Access】Provides easy access to all buttons, ports, and features without removing the case, ensuring full functionality.     【Wireless Charging Compatible】Enjoy the convenience of wireless charging without the need to remove the case, ensuring a seamless and hassle-free charging experience.",
    "details": {
      "brand": "QANXGOG",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "Red"
    }
  },
  {
    "id": "B0D6WJKSHK",
    "name": "Case for iPhone 14/14 Pro/14 Plus/14 Pro Max, Front and Back Protection Aluminum Alloy Frame with Screen Protector & Camera Lens Protector,Black,14 Pro",
    "ratings": null,
    "price": "$42.99",
    "image": "https://m.media-amazon.com/images/I/71ZxfYUhO-L.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "▶【360 Degree Full Protection】Enjoy comprehensive defense with a double-sided design, including a front tempered glass cover, HD back plate, and integrated camera lens cover.     ▶【Built-in Screen Protector】The screen protector and camera cover are integrally formed, eliminating the need for a separate screen protector purchase.     ▶【Wireless Charging Compatible】This case supports wireless charging, allowing you to power up your phone without removing the case.     ▶【Camera Lens Protector】Features a lens cover with a perforated design for clearer shooting. The edge lip is higher than the lens, effectively preventing scratches and wear.     ▶【Premium Materials】Made with a high-quality aluminum alloy frame and tempered glass, providing a luxurious and durable experience.",
    "details": {
      "brand": "QANXGOG",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "Black"
    }
  },
  {
    "id": "B0DFH49C82",
    "name": "A14 Pro Cell Phone, 5G Unlocked Smartphone 8GB+256GB Smartphone Android 14, 6800mAh Battery, 6.8\" FHD+120Hz 64MP Camera, Dual SIM Octa-Core Phone GPS/Fingerprint/Face ID (White)",
    "ratings": 1,
    "price": "$159.99",
    "image": "https://m.media-amazon.com/images/I/61SEbxw3BCL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "【6800mAh Long Lasting Battery & Fast Charging】This affordable 5g unlocked smartphone with a large 6000mAh battery, 30W fast charging which can well meet your power needs throughout the day. The GPS navigation will direct you to right destinations.     【6.8\" Screen+ Android 14 OS】This A14 Pro Max unlocked cell phones with 6.8\" display,bringing you more vision to immerse in, Adopt Android 14 system, facial recognition, on-screen fingerprint unlock to protect your privacy.     【64MP Professional Photo System】The A14 Pro Max unlocked cell phones is equipped with a 64MP main camera,48MP front camera and 12MP ultra wide angle camera and telephoto cameras, making every photo particularly clear and detailed and take more creative photos.     【Octa-Core CPU+ 256GB】A14 Pro Max dual sim smartphone unlocked features the powerful Qualcomm Snapdragon 8 Gen 3 processor that boosts the overall speed in video and gaming. Up to 8GB + 256GB of memory is enough for social apps, games, movies and other applications.     Customer's satisfaction is the goal we have been striving for We enable our customers to be able to use the least amount of money and be able to buy affordable advanced and good products , if you have any questions or dissatisfaction, please contact us, we will reply you within 24 hours!",
    "details": {
      "brand": "viqee",
      "operatingSystem": "Android 14",
      "memoryStorageCapacity": "256 GB",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "Galaxy A14",
      "wirelessCarrier": "3",
      "cellularTechnology": "5G",
      "connectivity": "N/A",
      "color": "White"
    }
  },
  {
    "id": "B0D9GDBCRZ",
    "name": "Case for iPhone 14 Pro Max/14 Pro/14, Geometric Design Aluminum Alloy Frame with Suspension Spring Lens Protection & Hidden Kickstand,Titanium,14 Pro",
    "ratings": null,
    "price": "$57.99",
    "image": "https://m.media-amazon.com/images/I/61u0bh19hQL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "【Geometric Trigonometric Design】Inspired by geometric trigonometric principles, providing a sleek and stylish look.     【Invisible Support Stand】Hidden stand design allows for both portrait and landscape use with a 90° adjustable angle for versatile viewing.     【Four-Corner Airbag Protection】Enhanced protection with aluminum alloy and four-corner airbag, making the case highly durable.     【Suspension Spring Lens Protection】Unique suspension spring design offers superior lens protection without adding bulk.     【Frameless Design】Frameless design ensures efficient heat dissipation, keeping your phone cool during extended use.",
    "details": {
      "brand": "QANXGOG",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "Titanium"
    }
  },
  {
    "id": "B0D6QRNQGK",
    "name": "Metal Frame Case for iPhone 14 Pro Max/14 Pro/14, with Silicone Pads, Frameless Design, Screw Fixation,Heat Dissipation, Shockproof Protection,Dark Gray,14",
    "ratings": null,
    "price": "$39.99",
    "image": "https://m.media-amazon.com/images/I/61I5C8lZLNL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "【Innovative Design】Frameless design offers a sleek, minimalist look while maintaining full protection. The open structure enhances heat dissipation, preventing your phone from overheating during extensive use or while charging.     【Premium Protection】Built-in silicone pads provide superior shock absorption, ensuring your iPhone device remains safe from accidental drops and impacts. The durable metal frame adds an extra layer of protection without compromising on style.     【Secure Installation】Easy screw fixation system ensures a secure fit for your iPhone. The case can be quickly installed or removed, offering both convenience and peace of mind.     【Raised Protection】1mm raised edges protect your phone's camera and screen from direct contact with surfaces, reducing the risk of scratches.     【Convenient Carrying】Integrated lanyard hole design allows for easy attachment of a lanyard (sold separately), providing additional carrying options and preventing accidental drops. Ideal for on-the-go users who need their phone accessible at all times.",
    "details": {
      "brand": "QANXGOG",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "Dark Gray"
    }
  },
  {
    "id": "B07KWHK4R6",
    "name": "Nokia 7.1 TA-1085 Dual Sim 64GB/4GB (Gloss Steel) - Factory Unlocked - International Version - No Warranty in The USA - GSM ONLY, NO CDMA",
    "ratings": 5,
    "price": "$299.00",
    "image": "https://m.media-amazon.com/images/I/61D21oXmeSL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "",
    "details": {
      "brand": "Nokia",
      "operatingSystem": "Android 8.1",
      "memoryStorageCapacity": "64 GB",
      "screenSize": "N/A",
      "resolution": "1080 x 2280",
      "modelName": "7",
      "wirelessCarrier": "Unlocked",
      "cellularTechnology": "GSM",
      "connectivity": "Wi-Fi",
      "color": "N/A"
    }
  },
  {
    "id": "B0D99X79M2",
    "name": "Case for iPhone 14 Pro Max/14 Pro/14, Liquid Metal Frame Magnetic Case with 360° Rotating Stand [Compatibility with Magsafe] Sleek and Frameless Design,Black,14 Pro",
    "ratings": null,
    "price": "$68.99",
    "image": "https://m.media-amazon.com/images/I/71I-xlMLhbL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "★【Frameless Cool Touch】All-metal design offers a sleek, cool touch and improved heat dissipation, meticulously crafted for a smooth, rounded grip.     ★【360° Rotating Stand】Innovative rotating stand offers versatile viewing angles for hands-free convenience, enhancing your multimedia experience with stability and ease.     ★【Excellent Adsorption Capacity】Built-in 36 N52 magnets that tight division in the ring that will automatically aligned with magnet charger, and it can effectively prevent accidental drop when shaking.     ★【Metal Camera Protection Ring】Our iPhone case is equipped with an 4 mm high innovative metal camera protection ring, which can effectively protect the camera from impact. Making your phone most special.     ★【Well Designed】Precise cutouts design has easy access to all control buttons, ports, sensors & camera without removing the case.The unique and beautiful luster of the metal makes you love it.",
    "details": {
      "brand": "QANXGOG",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "Black"
    }
  },
  {
    "id": "B0C39ZG1YX",
    "name": "Soyes XS14Pro Mini 4G Smartphone 3.0 Inch Quad Core Dual Sim Ultra Thin Unlocked Card Mobile Phone WiFi Bluetooth Hotspot Student Pocket Cellphone Global Version (RAM 2GB+ROM 16GB, Black)",
    "ratings": 16,
    "price": "$79.99",
    "image": "https://m.media-amazon.com/images/I/51f+MGUE3AL._AC_SY300_SX300_.jpg",
    "description": "❤️Unlocked 4G mini Smart Phone: Note: The Soyes XS14Pro US version supports 2G GSM:850/900/800/1900, 3G WCDMA：B2/B4/B5, 4G FDD/TDD B2/B4/B5/B7/B17/B28/B28A/B41/B66. It can work with most sim card carriers in the world, but please still make sure your sim card carrier supporting these frequency before your order it. Thank you🌹     ❤️Mini Size Cute Card Smartphone: Compact Body and easy to carry. 3.0 Inch Screen, Phone size: 94*47.4*12.5 mm, just like a bank card；One hand control. Good gift for the students and children.     ❤️4G Quad Core Smartphone: MT6739WW Quad Core 1.28GHz Android 9.0 system. Supports Face Recognition, 3D face unlock sensor technology to unlock faster; Suport Google App Store, WhatsApp, GPRS, Bluetooth, WiFi, hotspot sharing etc.     ❤️Best Backup Cellhone: 2000 mAh Battery; Dual Camera: front 2.0 Mpx, back 5.0Mpx. Dual Sim dual standby. Other functions: calculator, alarm clock, calendar, memo, keyboard lock, timer switch     ❤️Memory Optional: (RAM+ROM): 2GB+16GB, (RAM+ROM): 3GB+32GB ;(RAM+ROM): 3GB+64GB; (RAM+ROM): 4GB+64GB, (RAM+ROM): 4GB+128GB ; Meeting your daily use needs.",
    "details": {
      "brand": "Tuanzi",
      "operatingSystem": "Android 9.0",
      "memoryStorageCapacity": "16 GB",
      "screenSize": "N/A",
      "resolution": "480 x 854",
      "modelName": "Soyes 14pro DREAM3",
      "wirelessCarrier": "Unlocked for All Carriers",
      "cellularTechnology": "2G, 3G, 4G",
      "connectivity": "N/A",
      "color": "N/A"
    }
  },
  {
    "id": "B0BJLCJGPG",
    "name": "Cuifati XS11 Mini Mobile Phone, 2.5in Cell Phone WiFi GPS 1GB 8GB Quad Core for Android Smart Phone for Students ( )",
    "ratings": 33,
    "price": "$48.25",
    "image": "https://m.media-amazon.com/images/I/51Pf4nOHqHL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "Easy to Carry Mini Phone - Cute and compact design fits in pocket like a bank card     3G Internet Access - Browse apps like Facebook, YouTube, WhatsApp, and more     Durable Aviation Plastic Body - Lightweight with good hand feel and streamlined design     Great Travel Phone - Perfect backup phone for trips or gift for kids     Supports Memory Cards - Expand storage for apps, photos, videos, and music",
    "details": {
      "brand": "Cuifati",
      "operatingSystem": "Android 6.0",
      "memoryStorageCapacity": "8 GB",
      "screenSize": "N/A",
      "resolution": "315 x 533 pixels",
      "modelName": "XS11",
      "wirelessCarrier": "3",
      "cellularTechnology": "3G",
      "connectivity": "Wi-Fi, USB",
      "color": "N/A"
    }
  },
  {
    "id": "B0B6RCKDM4",
    "name": "Wireless Charging Station, 3 in 1 Fast Wireless Charger Stand for Multiple Devices Apple Watch Ultra Series 9 8 7 6 SE 5 4 3 2, iPhone 16 15 14 13 12 11 Pro Max/Plus/Mini/X/XS/Max/XR/SE, Airpods",
    "ratings": 1.861,
    "price": "$35.58",
    "image": "https://m.media-amazon.com/images/I/61O2KiwokZL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "ONE-STOP CHARGING STATION- The Aukuse 3in1 wireless charger is a charging station for multiple devices that uses the latest Qi technology to charge your phone, earbuds and Apple watch Series( NOTE: not works for Samsung watch and Apple watch 1) at the simultaneously. It a wonderful full integrated wireless charging solution for your home, office and travel.     FAREWELL TO MESSY CABLES-Tired of rummaging for the each cable and adapter of your devices are over. Now, just one cable with our 3in1 fast wireless charging stand can give you a neat desktop and keep your favorite devices fully charged that you just need to place your devices to our wireless charger at your free time and then ready for anything your day throws at you.     SAFELY&EFFICIENTLY- Aukuse's 3in1 wireless charger stand are designed with all-round protection; providing overcharge-protection, over-current protection, over-voltage protection and foreign object detection to ensure the safe and harmless charge. With up to 15W of power and excellent cooling system can improve the charge efficiency which charging your cellphone faster than the average 5W wall charger.     NO NEED TO TAKE OFF YOUR PHONE&EARBUDS CASE-It a easy-to-use 3in1 wireless charging dock can also charge your smartphone and earbuds through the protective cases&covers up to 0.2in(5mm) and both portrait and landscape mode. NOTE: if your case&cover with the Credit Cards/Ring Plate/ Magnetic Pad/Metal, our product will stop working to protect your devices. Specially, Magsafe Case can work with our product.     WHAT YOU WILL GET-1* 3IN1 Fast Wireless Charging Station, 1*Quick Charge Adapter, 1* Quick Charge Cable, 1* User Manual.     ENVIRONMENT- Creating positive impact with clean energy; Aukuse's products and packages all using the Recyclable Materials. With Aukuse 3in1 wireless charging station we can save 3 chargers to 1 for our planet, fewer chargers mean less environmental impact.     CUSTOMER SERVICE-We provide 12-months of technical support and warranty for each product. If you have anything problem, we are willing to give you a great service; please contact us, we will respond within 24 hours.",
    "details": {
      "brand": "AUKUSE",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "Wireless Charging",
      "color": "White"
    }
  },
  {
    "id": "B0DH374PVC",
    "name": "Case for iPhone 16 Pro Max/16 Pro/16, Sleek Aluminum Alloy Frameless Case, Cool Design Luxury Metal Shockproof Anti-Scratch Slim Borderless Case",
    "ratings": null,
    "price": "$53.99",
    "image": "https://m.media-amazon.com/images/I/61iu+gl7GEL._AC_SY300_SX300_.jpg",
    "description": "Premium Material : Made from high-quality aluminum alloy for durability and a sleek, modern look. The hard frame provides robust protection against drops and impacts.     Heat Dissipation : Innovative design with heat dissipation holes to keep your iPhone cool during heavy usage, preventing overheating.     Invisible Stand : Built-in invisible stand allows for easy multi-angle viewing, perfect for video calls, streaming, or studying. Switch between landscape and portrait modes effortlessly.     Ergonomic Grip : Designed for a comfortable hold with a smooth finish to reduce hand fatigue during extended use.     Slim & Frameless Design : Minimalist frameless design preserves the iPhone's original aesthetics, maintaining a slim profile while offering full protection.",
    "details": {
      "brand": "QANXGOG",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "Desert Titanium"
    }
  },
  {
    "id": "B0D6RS4FNH",
    "name": "Case for iPhone 14 Pro Max/14 Pro/14, Lightweight PC Frame Shell [Compatible with MagSafe] Streamlined Design, Comfortable Grip,Titanium,14 Pro",
    "ratings": null,
    "price": "$47.99",
    "image": "https://m.media-amazon.com/images/I/611KpKXKZdL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "【Lightweight & Durable】Made from ultra-light PC material, ensuring durability without adding bulk to your device.     【Creative Design】Unique liquid metal aesthetic that blends seamlessly with your iPhone, giving it a nearly bare-hand feel.     【Excellent Adsorption Capacity】Built-in 36 N52 magnets that tight division in the ring that will automatically aligned with magnet charger, and it can effectively prevent accidental drop when shaking.     【Enhanced Protection】Raised edges (0.5mm) around the camera to protect against scratches and drops.     【Comfortable Grip: Streamlined design and precise cutouts for easy access to all buttons and ports, providing a comfortable and secure grip.",
    "details": {
      "brand": "QANXGOG",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "Titanium"
    }
  },
  {
    "id": "B0DGL4KF4B",
    "name": "Case for iPhone 16/16 Plus/16 Pro/16 Pro Max, Clear [Not-Yellowing] with 360° Rotating Stand, Soft TPU & Hard PC Frame, Metal Buttons for Precision",
    "ratings": null,
    "price": "$49.99",
    "image": "https://m.media-amazon.com/images/I/61DCrStOERL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "Military-Grade Shock Protection: Built to withstand drops up to 20ft, offering 50% more protection than standard cases. Safeguard your iPhone 16 with confidence, no matter the adventure.     360° Rotating Stand: Enjoy hands-free convenience with the built-in 360° ring stand, perfect for watching videos, video calls, or using your phone as a stand at any angle.     Crystal Clear & Anti-Yellow Design: Featuring an upgraded antioxidant layer to keep your case crystal clear over time, ensuring long-lasting clarity and a sleek look.     Independent Metal Buttons: Experience a premium touch with precise, responsive metal buttons that give you a bare-phone feel with every press.     Screen & Camera Protection: Raised edges (1.3mm for the screen, 0.8mm for the camera) provide extra protection from scratches and cracks, keeping your device looking flawless.",
    "details": {
      "brand": "QANXGOG",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "Black"
    }
  },
  {
    "id": "B0DGKYFZ97",
    "name": "Retro PU Leather Wallet Case for iPhone 16/16 Plus/16 Pro/16 Pro Max, with Card Holder, Kickstand Function, Magnetic Closure, Soft Nature Feel",
    "ratings": null,
    "price": "$49.99",
    "image": "https://m.media-amazon.com/images/I/81bJLf7fBVL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "Premium Retro PU Leather : Crafted from high-quality PU leather, this iPhone wallet case offers a soft, luxurious texture with an elegant, timeless look.     Convenient Wallet Design : Includes 2 card slots for credit cards or IDs and 1 cash slot, perfect for carrying essentials like business cards, receipts, or bills without extra bulk.     Full Protection : Equipped with a secure magnetic closure, this case keeps your phone, cards, and cash safe while shielding your device from dirt, bumps, and scratches.     Hands-Free Kickstand : The built-in foldable stand lets you easily prop your phone for reading, watching videos, or video calls without holding it.     Perfect Gift Choice : Ideal for birthdays, Valentine’s Day, Christmas, or business gifts, this case combines practicality with style, making it a thoughtful present for loved ones.",
    "details": {
      "brand": "QANXGOG",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "Black"
    }
  },
  {
    "id": "B0D9HKDFRT",
    "name": "Case for iPhone 14/14 Pro/14 Pro Max, Aluminum Alloy, 360° Rotation, Four-Corner Impact Protection [Compatibility with Magsafe] Reinforced Corners,Gray,14 Pro Max",
    "ratings": null,
    "price": "$46.99",
    "image": "https://m.media-amazon.com/images/I/61la3SGH+9L._AC_SY300_SX300_.jpg",
    "description": "★【Frameless Design】Showcases the true color of your phone while ensuring efficient heat dissipation with an aluminum alloy construction.     ★【360° Rotation】The cardan rotation design allows 360° free rotation, providing smooth and stable adjustment for perfect viewing angles.     ★【Excellent Adsorption Capacity】Built-in 36 N52 magnets that tight division in the ring that will automatically aligned with magnet charger, and it can effectively prevent accidental drop when shaking.     ★【Durable Construction】Made from aerospace-grade aluminum alloy with an anodized surface for long-lasting durability.     ★【Screen and Camera Protection】Raised edges around the screen and camera guard against scratches and impact.",
    "details": {
      "brand": "QANXGOG",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "Gray"
    }
  },
  {
    "id": "B0D9HDXTDQ",
    "name": "Case for iPhone 14/14 Pro/14 Pro Max, Military-Grade Aluminum Alloy Frame, 360° Rotating Magnetic Suction Bracket, Sleek Design,Titanium,14",
    "ratings": null,
    "price": "$56.99",
    "image": "https://m.media-amazon.com/images/I/71h5yKD6ytL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "★【360° Rotating Kickstand】Enjoy ultimate convenience with a built-in 360° rotating kickstand, perfect for hands-free viewing and versatile positioning.     ★【Military-Grade Protection】Engineered with a durable aluminum alloy frame and four-corner bumpers, providing robust protection against drops and impacts.     ★【Excellent Adsorption Capacity】Built-in 36 N52 magnets that tight division in the ring that will automatically aligned with magnet charger, and it can effectively prevent accidental drop when shaking.     ★【Sleek & Slim Design】Crafted to be ultra-thin at only 0.3mm, maintaining the sleek profile of your iPhone without adding bulk.     ★【Three Section Splicing Structure】Innovative three-section splicing structure with a high transparency PC backboard for easy installation and enhanced device protection.",
    "details": {
      "brand": "QANXGOG",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "Titanium"
    }
  },
  {
    "id": "B0DG3FSVCB",
    "name": "2024 Upgraded 3-in-1 Wireless Charger for iPhone,Travel Magnetic Charger Stand Nightlight Foldable Wireless Charging Station Compatible with Magsafe Charger&iPhone 16/15/14/13/12,Apple Watch&AirPods",
    "ratings": 22,
    "price": "$39.95",
    "image": "https://m.media-amazon.com/images/I/61WwJGaSAtL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "【Wireless Charger for iPhone/Apple Watch/AirPods】Wireless magnetic portable charger compatible with MagSafe magnetic case, iPhone 16/ 16 Plus/ 16 Pro/ 16 Pro Max/iPhone 15/ 15 Plus/ 15 Pro/ 15 Pro Max/ 14/ 14 Plus/ 14 Pro/ 14 Pro Max/ 13/ 13 mini/ 13 Pro/ 13 Pro Max/ 12/ 12 mini/ 12 Pro/ 12 Pro Max, Apple Watch 9/8/7/6/5/4/3/2/Ultra 2/Ultra 1/SE, AirPods 3/2 Pro 2/Pro. (Note: Please use Mag-Safe phone case or without case for wireless charging)     【Fast Wireless Charger Foldable Stand】Effortlessly charge for iPhone at a lightning-fast 15 W, for Apple Watch at a reliable 2.5 W, and for AirPods at a steady 5 W—all at once. Each device charges independently, without affecting the performance of the others. It takes only 2-3 hours to fully charge your devices, allowing you to enjoy the convenience of a single, fast, unified charging solution.[Note: To charge at full speed, please use a PD charger of 20 W or higher.]     【Upgrade Powerful Mag-Safe Charger Stand】Mag-Safe charger 3 in 1 makes fast charging safe and easy. The built-in super strong magnet makes alignment instantly and precisely, just 1 second to achieve lightning fast wireless charging. The magnetic charger can hold your iPhone horizontally and vertically, or in any directions, the phone charging area can adjust the angle up and down by 120°, you can enjoy all your comfortable viewing from any angle.     【Intergrated Smart for Apple Ecosystem】 Many smart devices have become companions in our lives, and it has become important to simplify how to power them. Carrying multple charging cables to power your devices can become a hassle, but our 3 in 1 charging station for apple can take on the work of three cables by connecting to just one power adapter. Note: Does not come with an adapter, you need to pair it with an adapter of at least 25W for fast charging!     【Your Safety Companion】Our wireless chargers have passed various certifications with professional circuit design and intelligent protection technology. It has overcurrent, overvoltage, and temperature control to ensure safe and fast charging of your device. This wireless charging station is not only the best charging accessory for the desktop and bedside, but the perfect gift for your friends and family! You will get a 3 in 1 charging station, a 5ft charging cable, a user guide.",
    "details": {
      "brand": "BODSEIEOU",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "USB",
      "color": "Black"
    }
  },
  {
    "id": "B0B17KX8XH",
    "name": "Unlocked Android Smartphone，Dual Cards Dual Standby Smartphone, 4.66 Inch Display Cell Phone with Front Rear High Definition Dual Cameras，Mobile Unlocked Phone",
    "ratings": 13,
    "price": "$57.98",
    "image": "https://m.media-amazon.com/images/I/71MnLmPnL-S.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "4.66 inch HD display for an immersive visual experience     Dual SIM card slots to use two networks simultaneously     2MP rear camera captures vivid, lifelike photos and videos     Up to 128GB expandable storage to store media and files     Powerful processor delivers smooth performance for gaming and multitasking",
    "details": {
      "brand": "Pomya",
      "operatingSystem": "Android 4.4",
      "memoryStorageCapacity": "4 GB",
      "screenSize": "N/A",
      "resolution": "480 x 854",
      "modelName": "iPhone 12 Pro",
      "wirelessCarrier": "Unlocked",
      "cellularTechnology": "3G",
      "connectivity": "N/A",
      "color": "N/A"
    }
  },
  {
    "id": "B0B7B8FRNN",
    "name": "Diyeeni 3G Android Phone, IP12 Pro 4.66inch Cell Phone, 512MB 4GB Unlocked Smartphone for Android 4.4.2, 2MP Rear Camera, 1500mah Battery, Dual Card Dual Standby(Gold)",
    "ratings": null,
    "price": "$68.55",
    "image": "https://m.media-amazon.com/images/I/71Jksiuw3aS.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "【4.66 inch Screen 】The large screen allows you to experience a broader view. In games and videos, the content is displayed more, but the phone is still small and light.     【MTK6572 dual-core CPU】Powerful processor greatly improves the network speed, frame rate and picture smoothness when playing games and multitasking.     【Dual Cards Dual Standby】Up to 128GB of expandable storage, supports simultaneous use of a standard SIM card and a card and a Memory card (three card slots) for phone calls and data storage.     【0.3MP Front+2MP Rear Camera】High‑definition camera for vivid and lifelike colors, every photo is as beautiful, and the front and rear dual cameras can be used more widely.     【For Android 4.4.2】The system is based on the in‑depth development for Android system, which is more complete and smooth.",
    "details": {
      "brand": "Diyeeni",
      "operatingSystem": "Android 4.4",
      "memoryStorageCapacity": "4 GB",
      "screenSize": "N/A",
      "resolution": "480 x 854",
      "modelName": "iPhone 12 Pro",
      "wirelessCarrier": "Unlocked",
      "cellularTechnology": "3G",
      "connectivity": "Wi-Fi, USB",
      "color": "Gold"
    }
  },
  {
    "id": "B0CTBBBP1X",
    "name": "3 in 1 Charging Station for iPhone 16/15/14/13/12 Series, Travel Charger for Multiple Devices for AirPods 4/3/2/Pro,Wireless Charger Magnetic Charging for Apple Watch S10 Series(Black)",
    "ratings": 522,
    "price": "$39.99",
    "image": "https://m.media-amazon.com/images/I/81ZiiJn8eVL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "What is: It's a foldable, small, travelable, travel charger station! JARGOU charging station can charge for iPhone, for Apple watch, and for AirPods at the same time, charger station is simply a little helper to keep the desktop tidy! Exclusively designed for Apple fans     Feature: It takes 3.5 hours to fully charge iPhone 14, and charging efficiency is accelerated by 22%. 3 in 1 wireless charging station also has many designs, such as over-current protection, over-voltage protection, over-temperature protection. More importantly, We've researched the wireless chargers on the market and got inspired by: Foldable phone stand, multiple charging methods, easy to carry, 3 in 1, colorful colors. We put these ideas into this charging station     How to work: 3 in 1 wireless charging station equipped with a 47.2in Type-C cable, only need to connect the power to the device for charger. So enjoy the convenience of wireless charging     Compatible models: JARGOU 3 in 1 charging station is compatible for iPhone 16/15/14/13/12 series, for iWatch series 10/9/8/7/6/5/4/3/2/Ultra/Ultra2/SE, for AirPods 4/3/2/Pro/Pro 2. The magnetic attraction function is only for iPhone 16-12 series     Else: This is the only wireless charging station on the market that has a stand and is foldable for travel! Let me introduce to you the two feature of wireless charging station: the first is that our 3 in 1 wireless charging station stand has more functional designs at the same price, the second is the self-developed wireless charging station     You will get: The accessories included in this wireless charging station are: 1 * Charging Station, 1 * Fast Adapter, 1 * USB Cable, 1 * Storage Box, 1 * User Manual. JARGOU 3 in 1 wireless charging station is also a great gift for family and friends",
    "details": {
      "brand": "JARGOU",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "USB",
      "color": "Black"
    }
  },
  {
    "id": "B0C4PJKSTH",
    "name": "VRURC for Apple Watch Charger, 20W PD 3-in-1 Charger with Magnetic Wireless Charging and Dual Ports, Portable USB C Wall Charging Block Compatible with iPhone, Anfroid etc-Purple",
    "ratings": 1.201,
    "price": "$33.99",
    "image": "https://m.media-amazon.com/images/I/61azOxP+KPL._AC_SY300_SX300_.jpg",
    "description": "🎁【Charger for Apple Watch】Unique cordless charger for Apple Watch series, equipped with a 2.5W magnetic wireless watch charger compatible with Apple Watch, no extra cables need and you can direclty charging for your iWatch. perfect for travel charging block.（wireless charger only support for Apple Watch ）     🎁【Dual Port Fast Charging Block】Charging block with dual port fast charging, 20W USB-C port and 18W USB port, supports fast charge for mostly PD QC 3.0 protocol devices, you can quick charger for you new iPhone to 60% battery in 30 mins. meets your daily charging needs.     🎁【Foldable Plug and Compact Design】USB C wall charger only 2.15* 1.69* 1.18 inch and 2.46 oz, 90 degrees foldable plug design, which is easy to carry without occupying space, and will not scratch your other items in bag. excellent charger for travel, business,office.     🎁【Wide Compatibility 3-in-1 Charger】Power adapter with dual port and wireless charger, 3 outputs charger brick, compatible with iPhone 12/11/14/13/Pro/Pro Max/Mini/X/8, for Samsung and Android, tablets. wireless charger for Apple Watch series. you can charge for 3 devices simultaneously.     🎁【Safe Charging and Reliable】Power adapter with smart chip, avoid over-charge, over-current, over-voltage and over-heating, Intelligent protect your devices. [You will get]: wall charger *1, user manual*1, 12 month friendly replacement service.",
    "details": {
      "brand": "VRURC",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "USB-C(20W), USB-A(18W), Wireless Charger for Apple Watch",
      "color": "Purple"
    }
  },
  {
    "id": "B0C4PJ3KQ8",
    "name": "VRURC for Apple Watch Charger, 20W PD 3-in-1 Charger with Magnetic Wireless Charging and Dual Ports, Foldable Plug Portable USB C Wall Charging Block for iPhone 15 14 13 12, Android Tablets etc-Green",
    "ratings": 1.201,
    "price": "$33.99",
    "image": "https://m.media-amazon.com/images/I/61eoaCXZtjL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "Charger for Apple Watch: Unique cordless charger for Apple Watch series, equipped with a 2.5W magnetic wireless watch charger compatible with Apple Watch, no extra cables need and you can direclty charging for your iWatch. perfect for travel charging block.（wireless charger only support for Apple Watch     Dual Port Fast Charging Block: Charging block with dual port fast charging, 20W USB-C port and 18W USB port, supports fast charge for mostly PD QC 3.0 protocol devices, you can quick charger for you new iPhone to 60% battery in 30 mins. meets your daily charging needs.     Foldable Plug and Compact Design: USB C wall charger only 2.15* 1.69* 1.18 inch and 2.46 oz, 90 degrees foldable plug design, which is easy to carry without occupying space, and will not scratch your other items in bag. excellent charger for travel, business,office.     Wide Compatibility 3-in-1 Charger: Power adapter with dual port and wireless charger, 3 outputs charger brick, compatible with iPhone 12/11/14/13/Pro/Pro Max/Mini/X/8, for Samsung and Android, tablets. wireless charger for Apple Watch series. you can charge for 3 devices simultaneously.     Safe Charging and Reliable: Power adapter with smart chip, avoid over-charge, over-current, over-voltage and over-heating, Intelligent protect your devices. [You will get]: wall charger *1, user manual*1",
    "details": {
      "brand": "VRURC",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "USB-C(20W), USB-A(18W), Wireless Charger for Apple Watch",
      "color": "Green"
    }
  },
  {
    "id": "B0D95DJY12",
    "name": "VRURC for Apple Watch Charger, PD 20W 3-in-1 Fast Charging Block with Magnetic Wireless Charging & Dual Ports, Foldable Plug USB C Wall Charger for iPhone 15 14 13,Android,Tablets etc-Pink",
    "ratings": 1.201,
    "price": "$33.99",
    "image": "https://m.media-amazon.com/images/I/61VfRaddaZL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "Charger for Apple Watch: Unique cordless charger for Apple Watch series, equipped with a 2.5W magnetic wireless watch charger compatible with Apple Watch, no extra cables need and you can direclty charging for your iWatch. perfect for travel charging block.（wireless charger only support for Apple Watch     Dual Port Fast Charging Block: Charging block with dual port fast charging, 20W USB-C port and 18W USB port, supports fast charge for mostly PD QC 3.0 protocol devices, you can quick charger for you new iPhone to 60% battery in 30 mins. meets your daily charging needs.     Foldable Plug and Compact Design: USB C wall charger only 2.15* 1.69* 1.18 inch and 2.46 oz, 90 degrees foldable plug design, which is easy to carry without occupying space, and will not scratch your other items in bag. excellent charger for travel, business,office.     Wide Compatibility 3-in-1 Charger: Power adapter with dual port and wireless charger, 3 outputs charger brick, compatible with iPhone 12/11/14/13/Pro/Pro Max/Mini/X/8, for Samsung and Android, tablets. wireless charger for Apple Watch series. you can charge for 3 devices simultaneously.     Safe Charging and Reliable: Power adapter with smart chip, avoid over-charge, over-current, over-voltage and over-heating, Intelligent protect your devices. [You will get]: wall charger *1, user manual*1",
    "details": {
      "brand": "VRURC",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "USB-C(20W), USB-A(18W), Wireless Charger for Apple Watch",
      "color": "Pink"
    }
  }
]