[
    {
        "id": "B00A8DI7OK",
        "name": "iPhone 12 Black T Mobile Locked Phone",
        "ratings": null,
        "price": "$0.01",
        "image": "https://m.media-amazon.com/images/I/21Mz6WqpAqL.__AC_QL70_FMwebp_.jpg",
        "description": "Dual 12MP camera system: Main and Ultra Wide cameras Main: ƒ/1.6 aperture     Ultra Wide: ƒ/2.4 aperture and 120° field of view 2x optical zoom out Digital zoom up to 5x Portrait mode with advanced bokeh and Depth Control Portrait Lighting with six effects (Natural, Studio, Contour, Stage, Stage Mono, High‑Key Mono) Optical image stabilization (Main)     Seven‑element lens (Main); five‑element lens (Ultra Wide) True Tone flash with Slow Sync Panorama (up to 63MP) Sapphire crystal lens cover 100% Focus Pixels (Main) Night mode Deep Fusion Smart HDR 3     Wide color capture for photos and Live Photos Lens correction (Ultra Wide) Advanced red‑eye correction Auto image stabilization Burst mode Photo geotagging Image formats captured: HEIF and JPEG",
        "details": {
            "brand": "Generic",
            "operatingSystem": "iOS 14",
            "memoryStorageCapacity": "64 GB",
            "screenSize": "N/A",
            "resolution": "2532 x 1170",
            "modelName": "iPhone 12",
            "wirelessCarrier": "T-Mobile",
            "cellularTechnology": "5G",
            "connectivity": "Bluetooth",
            "color": "N/A"
        }
    },
    {
        "id": "B09JTRHXWT",
        "name": "Apple iPhone SE 16GB Unlocked, 2016 1st Gen, Silver",
        "ratings": 162,
        "price": "$22.89",
        "image": "https://m.media-amazon.com/images/I/4193K9fiSqL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
        "description": "Factory unlocked iPhone and compatible with AT&T, T-Mobile, Mint, Us Mobile, Ting Mobile, Simple Mobile, Tello, Consumer Cellular etc - NOT COMPATIBLE with Verizon or Straight Talk     Ready out of the box, Phone included with generic box with a charger, cable, and handsfree     Inspected and guaranteed to have minimal to no cosmetic damage, which is not noticeable when the device is held at arms length. Successfully passed a full diagnostic test which ensures perfect functionality. Tested for battery health and guaranteed to have a minimum battery capacity of +90%     The Apple iPhone SE is the 1st Generation iPhone SE made in 2016 along with the iPhone 6s and iPhone 6s Plus. The iPhone SE has the same shape as the iPhone 5 and iPhone 5s, but is a lot more powerful. The iPhone 5 and 5s cases will also fit the iPhone SE and vice versa     This iPhone is able to update to the latest version of iOS 15     Connector type: lightning",
        "details": {
            "brand": "Azumi",
            "operatingSystem": "IOS",
            "memoryStorageCapacity": "64 GB",
            "screenSize": "N/A",
            "resolution": "N/A",
            "modelName": "SE64-SILVER",
            "wirelessCarrier": "Unlocked for All Carriers",
            "cellularTechnology": "LTE, UMTS, HSPA, HSDPA, GSM, EDGE",
            "connectivity": "USB",
            "color": "N/A"
        }
    },
    {
        "id": "B0CHPWQTZF",
        "name": "Boost Mobile Apple iPhone 6 32GB Gray - Unlocked",
        "ratings": 6,
        "price": "$0.01",
        "image": "https://m.media-amazon.com/images/I/51qBkb61cXL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
        "description": "Boost Mobile Apple iPhone 6 32GB Gray - Unlocked     Factory Unlocked iPhone 6S Factory Unlocked, Compatible With AT&T, T-Mobile, Mint, US Mobile, Ting Mobile, Simple Mobile and any service that uses ATT and Tmobile Network     Inspected to have minimal to no cosmetic damage, which Is not noticeable when the device Is held at arm'S length. Successfully Passed A Full Diagnostic Test Which Ensures Perfect Functionality. Tested For Battery Health And Assured To have A minimum Battery Capacity Of +80%     Includes - All New, Charger, Cable Packed in White Box     Factory Unlocked, Upgradeable To IOS 12.5     Not upgradable to the latest version of IOS     Sim card is not included - It is always provided by your service provider.     If you already have service then just swap the sim card from your old phone into this phone. All set",
        "details": {
            "brand": "Plum",
            "operatingSystem": "iOS 14",
            "memoryStorageCapacity": "32 GB",
            "screenSize": "N/A",
            "resolution": "1334 x 750",
            "modelName": "IP632GRY-BOOST",
            "wirelessCarrier": "Boost Mobile",
            "cellularTechnology": "4G",
            "connectivity": "Bluetooth",
            "color": "Gray"
        }
    },
    {
        "id": "B09SBRDNHH",
        "name": "Tracfone Apple iPhone 8 Plus 4G LTE Prepaid Smartphone - 64GB - Space Gray - Carrier Locked",
        "ratings": 60,
        "price": "$158.99",
        "image": "https://m.media-amazon.com/images/I/61+rHTAfQVL._AC_SY300_SX300_.jpg",
        "description": "5.5-Inch Retina HD display; A11 Bionic Chip; Accelerometer; Compass; Gyroscope     12MP iSight Camera with live Photos and 4K Video; 64GB Internal Memory; 3GB RAM; 2691mAh battery     Find freedom with a flexible prepaid plan, with no activation or cancellation fees, ever. Get Unbeatable Nationwide Coverage on the largest and most dependable 4G LTE Networks.     Note: This phone is carrier locked; Customers must have had their locked device activated on Tracfone service for no fewer than 12 months, redeemed air time cards in no fewer than 12 months, and not have had their telephone number recycled or ported.",
        "details": {
            "brand": "TracFone",
            "operatingSystem": "iOS 14",
            "memoryStorageCapacity": "64 GB",
            "screenSize": "N/A",
            "resolution": "N/A",
            "modelName": "iPhone 8 Plus",
            "wirelessCarrier": "Tracfone",
            "cellularTechnology": "4G",
            "connectivity": "Bluetooth, Wi-Fi, NFC",
            "color": "Space Gray"
        }
    },
    {
        "id": "B0DFH49C82",
        "name": "A14 Pro Cell Phone, 5G Unlocked Smartphone 8GB+256GB Smartphone Android 14, 6800mAh Battery, 6.8\" FHD+120Hz 64MP Camera, Dual SIM Octa-Core Phone GPS/Fingerprint/Face ID (White)",
        "ratings": 1,
        "price": "$159.99",
        "image": "https://m.media-amazon.com/images/I/61SEbxw3BCL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
        "description": "【6800mAh Long Lasting Battery & Fast Charging】This affordable 5g unlocked smartphone with a large 6000mAh battery, 30W fast charging which can well meet your power needs throughout the day. The GPS navigation will direct you to right destinations.     【6.8\" Screen+ Android 14 OS】This A14 Pro Max unlocked cell phones with 6.8\" display,bringing you more vision to immerse in, Adopt Android 14 system, facial recognition, on-screen fingerprint unlock to protect your privacy.     【64MP Professional Photo System】The A14 Pro Max unlocked cell phones is equipped with a 64MP main camera,48MP front camera and 12MP ultra wide angle camera and telephoto cameras, making every photo particularly clear and detailed and take more creative photos.     【Octa-Core CPU+ 256GB】A14 Pro Max dual sim smartphone unlocked features the powerful Qualcomm Snapdragon 8 Gen 3 processor that boosts the overall speed in video and gaming. Up to 8GB + 256GB of memory is enough for social apps, games, movies and other applications.     Customer's satisfaction is the goal we have been striving for We enable our customers to be able to use the least amount of money and be able to buy affordable advanced and good products , if you have any questions or dissatisfaction, please contact us, we will reply you within 24 hours!",
        "details": {
            "brand": "viqee",
            "operatingSystem": "Android 14",
            "memoryStorageCapacity": "256 GB",
            "screenSize": "N/A",
            "resolution": "N/A",
            "modelName": "Galaxy A14",
            "wirelessCarrier": "3",
            "cellularTechnology": "5G",
            "connectivity": "N/A",
            "color": "White"
        }
    },
    {
        "id": "B0BJFJX1LC",
        "name": "IP14 Pro 6.1 Inch Smartphone, 4GB 32GB ROM Dual Dual Standby Cellphone for Android 10.1, Face Recognition Mobile Phone for Daily Life(Gold)",
        "ratings": 4,
        "price": "$98.62",
        "image": "https://m.media-amazon.com/images/I/71NLq6oGzpL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
        "description": "6.1 Inch HD Screen: 6.1 inch full screen gives you a wider view. Every time screen is lit, smartphone will bring you a new experience. In games and videos, more content is displayed, and mobile phone is still small and light.     Large Storage: phone has 4GB and 32GB ROM to ensure stable loading of images. Common game processes can reside in background, and other applications can be switched quickly in seconds. phone is not afraid of crashes even if game hangs up for a long time. It also supports up to 128GB of expandable storage, and can use 2 SIM cards and 1 small memory for phone calls and data storage at same time.     Clear Pixels: This phone is also equipped with a 5MP front camera and an 8MP rear camera, allowing you to retain your smile or precious memory with excellent clarity. With dual core sensors, phone becomes your professional imaging team. It is also equipped with face recognition, which can accurately identify faces at any time, bringing about a science siction unlocking experience.     System and CPU Processor: for Android system greatly reduces probability of stuck, dead, etc, allowing you to grab red packets more quickly, experience key experience between game engines, and play large games. MTK6799 CPU processor greatly improves network, running speed, frame rate and image smoothness when playing games and multitasking.     Ultra Long Standby: This smartphone has a 3500mAh large capacity battery. As a smart phone, watching videos, chatting on , and listening to music are all essential things. After fully charged, you can play happily for an extra long time with phone. Also do not forget to it at night.",
        "details": {
            "brand": "Pomya",
            "operatingSystem": "N/A",
            "memoryStorageCapacity": "32 GB",
            "screenSize": "N/A",
            "resolution": "720 x 1560",
            "modelName": "iPhone 14 Pro",
            "wirelessCarrier": "NET",
            "cellularTechnology": "4G",
            "connectivity": "Wi-Fi, USB",
            "color": "Gold"
        }
    },
    {
        "id": "B0CYMCLC8K",
        "name": "[4 in 1 Designed for iPhone 14 Case/iPhone 13 Case, with 3 Pack Tempered Glass Screen Protector [Non-Yellowing ] [Military Drop Protection] Shockproof Slim Fit 6.1 Inch (Clear)",
        "ratings": null,
        "price": "$5.99",
        "image": "https://m.media-amazon.com/images/I/71pSIib5NsL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
        "description": "【Compatible With 】Fit for iPhone 14 and iPhone 13 (6.1 Inch), fit in pockets easily. Our product package contains: A case and 3 packs tempered glass screen protector.     【Excellent materials and workmanship】Ultral Clear, Anti-yellowing: Using high-definition tpu and pc material, which effectively resist stains and sweat, not easy to get greasy and yellow over time,perfectly shows the original color of your phone.     【Military Grade Protection】Certified drop test, features 4 built-in corner Airbags to absorb impact, 1.3 mm raised screen frame and 3.1 mm raised frame around the camera can prevent your phone from accidental drops, bumps and scratches.     【Precise Cutouts】Precision cutouts, easy access to all ports, buttons and functions. Convenient to wireless Charge without removing the case, Prevent damage from scratches and dust.     【Fadnou Clear Case】Any product issues, please contact us via Amazon Message Center. We will provide you with quality service.",
        "details": {
            "brand": "Fadnou",
            "operatingSystem": "N/A",
            "memoryStorageCapacity": "N/A",
            "screenSize": "N/A",
            "resolution": "N/A",
            "modelName": "N/A",
            "wirelessCarrier": "N/A",
            "cellularTechnology": "N/A",
            "connectivity": "N/A",
            "color": "Clear"
        }
    },
    {
        "id": "B0CMHRQB97",
        "name": "Mini Smartphone Students Quad Core Smallest Mobile Phone 3.0 Inch Unlocked Android Kids Cell Phones Dual Sim Card Cute Palm Child 3G Students Small Smartphone (Blue,2GB+16GB)",
        "ratings": 147,
        "price": "$49.99",
        "image": "https://m.media-amazon.com/images/I/71s72QE+voL._AC_SY300_SX300_.jpg",
        "description": "❤️3G Mini Smart Phone: Lead to the trend of the mini smart phone. Please make sure your sim card supports more than one frequency: 2G GSM 850/900/1800/1900; 3G WCDMA/B1/B2/B5/B8     ❤️Super Mini Smartphone: phone size: 88.40*45.20*11, just like a bank card. Compact Body and easy to carry, One hand control.     ❤️Quad Core Smartphone: Android 8.1 system. Supports Google App Store, WhatsApp, GPRS, Bluetooth, WiFi, hotspot sharing etc. RAM 2GB+ROM 16GB     ❤️Large capacity battery: 1000mAh Battery; Dual Camera: front 0.3 Mpx(with Beautifying), back 2Mpx.Dual Sim dual standby     ❤️Other functions: Dual sim ; GPRS; WiFi; hotspot sharing; EDGE; Inner FPC antenna;Bluetooth; IP Call;Handsfree; Call history;Talk time; Speedy dial；WAP; MMS；SMS；Calculator; Alarm; Calendar;Memo; Fixed time on and off; key lock; U disk     ❤️Great Gift for Kids: It's soo Cute and Functional, suitable for kid's hands. Children will be fell in love with it's MINI, FUNCTIONAL, CUTE, EASY CARRY, INTERESTING. It has four color you can choose: Black, White and Pink,Green. It will be an indispensable gift for children in the Thanksgiving Day,Christmas,New Year.     ❤️Warranty:If the product has any quality problems. We will provide you with a refund or exchange.",
        "details": {
            "brand": "Hipipooo",
            "operatingSystem": "Android",
            "memoryStorageCapacity": "16 GB",
            "screenSize": "N/A",
            "resolution": "480 x 854",
            "modelName": "XS15",
            "wirelessCarrier": "Unlocked for All Carriers",
            "cellularTechnology": "3G",
            "connectivity": "Bluetooth, Wi-Fi, USB",
            "color": "Blue"
        }
    },
    {
        "id": "B0D8HYKSH6",
        "name": "Smartphone Unlocked Cell Phones I15 Promax 6.7in HD Screen 8GB/512GB Android 13 Straight Talk Phone 6800mAh Dual Sim Boost Mobile Phones Real 5G Telefonos (dark blue)",
        "ratings": 4,
        "price": "$156.88",
        "image": "https://m.media-amazon.com/images/I/71s1i3m9WfL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
        "description": "🚀【Global band and dual SIM 5G mobile phone】This machine adopts 5G smartphone 5G smartphone has faster transmission speed, short time delay, high positioning accuracy, wide link for customers to feel a more advanced experience. experience.     📱【Real 6.7inch HD Full Screen】Android phone unlocked with 6.7 Inch screen allows you to experience a wider field of view,showing more content in games and videos,The wide screen view and the high color reproduction make the screen look very clear and the fine quality is better.     🚀【Android 13.0, 8GB RAM+ 512GB ROM】The latest upgraded OS Android 13.0 cheap phones brings more friendly features for the intuitive visuals and smooth controls, it also further strengthens the protection of your privacy.You also could use a SD card to extend the memory to satisfy your productivity and entertainment needs.     💯【10 Core Snapdragon8 Gen2+6800mAh Battery】Tmobile cell phones with powerful processor and long-lasting battery greatly improved network, runtime speed, frame rate and image smoothness when playing large games and multitasking.     🎁【Gift For Children or the Old People】Design is an endless journey of pursuing beauty, and everything can be the spark of new inspirations. S22 Ultra cell phone interprets the color aesthetics in life from the splendid nature scenes to the whimsical imaginations with four invigorating hues. This android unlocked smartphone has all the features to cater to adults, elderly as well as children.",
        "details": {
            "brand": "FUALYOU",
            "operatingSystem": "Android 13.0",
            "memoryStorageCapacity": "512 GB",
            "screenSize": "N/A",
            "resolution": "1440 x 3040",
            "modelName": "ip15promax",
            "wirelessCarrier": "Unlocked for All Carriers",
            "cellularTechnology": "5G",
            "connectivity": "N/A",
            "color": "N/A"
        }
    },
    {
        "id": "B0CWLH5RDR",
        "name": "USB C Wall Fast Charger Block, 40W 4-Port Type C Charger Fast Charging Blocks PD Power Charger Adapter+QC 3.0 USB Multiport Charger Brick for iPhone 16/15/14/13/12 Pro Max, iPad, Galaxy S24/23-2Pack",
        "ratings": 794,
        "price": "$19.99",
        "image": "https://m.media-amazon.com/images/I/6199osd13KL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
        "description": "【40W USB C Charger Fast Charging Blocks】:The 40W USB C Charger Fast Charging Blocks supports the Power Delivery and Quick Charge 3.0 fast charging functions with a total power of up to 40W.The USB-A port offers an output power of 3.1 A/5 V, while the USB-C port offers a charging speed of 20W.Charge your i Phone 15/14 devices from 0% to 58% in just 30 minutes.     【Multi 4-Port Fast Charging Plug】:The 40W USB C Charger block has two USB-C ports and two USB-A ports output, support total power up to 40W. Allows you to charge 4 devices simultaneously to minimize waiting time, also save your space, one of our wall charger can instead of 4 single USB port wall chargers.     【Universal Compatibility】: The USB C multiport adapter is compatible with almost all electronic devices, charging for iPhone 16 / 16 Pro / 16 Pro Max / 16 Plus/i Phone 15/15 Pro /15 Pro Max/14/14 Pro/14 Pro Max/13/13 Mini/13 Pro Max/12/12 Pro Max/12 Pro Max/12 Mini/SE 2020/11/11 Pro/11 Pro Max/XR/XS/X/8/7,iPadAir/Pro/Mini, Galaxy S24 Ultra/S24Plus /S24/S23 Ultra/S23 Plus/S23 /S22 Ultra/S22/S21/S20/S10/S9/S8/Tablets and other digital devices compatible.     【Compact Portable &Safty Reliable】: This USB C Wall charger block is Incredibly compact for enhanced portability. All this power comes installed in a pocket-friendly compact body, to go wherever the journey takes you. Ideal for home, office, and on the go. Equipped with a smart chip, which can adjust the input power of the Phone to prevent the Phone from overcharging and overheating.     【What You Get】: 40W 4 ports USB Wall Charger block*2. 18-month guarantee. if you have any questions, please contact us,We promise to solve your problems within 24 Hours.",
        "details": {
            "brand": "N/A",
            "operatingSystem": "N/A",
            "memoryStorageCapacity": "N/A",
            "screenSize": "N/A",
            "resolution": "N/A",
            "modelName": "N/A",
            "wirelessCarrier": "N/A",
            "cellularTechnology": "N/A",
            "connectivity": "N/A",
            "color": "N/A"
        }
    },
    {
        "id": "B0D63HHRD1",
        "name": "Fast Charging Cable/for Apple Phone 13,12,11,14 Pro Max 30w /2m",
        "ratings": null,
        "price": "$5.00",
        "image": "https://m.media-amazon.com/images/I/41yVeTMDo6L._SY445_SX342_QL70_FMwebp_.jpg",
        "description": "fast charge",
        "details": {
            "brand": "Generic",
            "operatingSystem": "N/A",
            "memoryStorageCapacity": "N/A",
            "screenSize": "N/A",
            "resolution": "N/A",
            "modelName": "N/A",
            "wirelessCarrier": "N/A",
            "cellularTechnology": "N/A",
            "connectivity": "N/A",
            "color": "N/A"
        }
    },
    {
        "id": "B0CH964JZ8",
        "name": "LIVELY Jitterbug Smart4 Smartphone for Seniors - Cell Phone for Seniors - Not Compatible with Other Wireless Carriers - Must Be Activated Phone Plan",
        "ratings": 1.903,
        "price": "$13.74",
        "image": "https://m.media-amazon.com/images/I/71x1ELFnzoL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
        "description": "Only Compatible with Lively Phone Service: The Jitterbug Smart4 is only compatible with Lively phone service; plans include unlimited talk, text and 24/7 access to Lively’s caring team     Simple Cell Phone: This is our simplest smartphone yet, with a larger 6.7” screen, easy-to-navigate menu, voice calling, real-time call captioning and Urgent Response button     Help When You Need It: Once your new phone is activated with Lively, the Lively team is here to help if you want to learn more about your phone, need a ride, have a health concern or have an emergency     Online Activation: Activate phone online for easy setup, and for additional questions, call our customer service agents for questions about your service and phone     Why Lively: Lively offers Jitterbug cell phones and Lively medical alert devices that help seniors stay connected, safe and healthy",
        "details": {
            "brand": "LIVELY",
            "operatingSystem": "Android 14, Android 13.0",
            "memoryStorageCapacity": "32 GB",
            "screenSize": "N/A",
            "resolution": "N/A",
            "modelName": "PN035089",
            "wirelessCarrier": "MVNO",
            "cellularTechnology": "4G",
            "connectivity": "Wireless",
            "color": "Black"
        }
    },
    {
        "id": "B0DD3XBTRW",
        "name": "A15 Pro Max Cell Phones,Android 14.0 Unlocked Phone,8+256GB Smartphone,Support Dual SIM Dual Standby Face Recognition 6800mAh Ultra Long Life Battery.(Grey)",
        "ratings": 12,
        "price": "$179.99",
        "image": "https://m.media-amazon.com/images/I/61UUeDvWLyL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
        "description": "🌹【6.82 HD+ for Android 14.0】Please note that this is an Android phone with a large perforated screen, 2.5D curved edges, and a premium heat bending glass back cover. 5-point capacitive touchscreen. Magnesium aluminum body. Facial recognition, on-screen fingerprint unlock to protect your privacy. comfortable to hold. Adopts facial recognition and on-screen fingerprint unlocking to better protect your privacy.     🌹【Octa-core CPU + 256GB Expandable TF card slot】8GB + 256GB of memory is enough for social apps, games, movies and other applications. You can smoothly switch between running multiple apps at the same time. A great replacement phone with smartphone features. Ensure you get the best for the least amount of money!     🌹【LONG LASTING BATTERY CAPACITY】Professional unlocked phone with up to 6800mAh battery capacity. Equipped with 64MP front camera and 12MP rear camera, WIFI+BT+FM+GPS, it's the best companion to take photos for daily play and travel. The phone is available in 3 colors, loved by all customers. different pixels according to different light conditions and merges them to optimize them for excellent performance. Optimized for better imaging characteristics.     🌹【Global band and dual SIM 5G mobile phone】This machine adopts 5G smartphone 5G smartphone has faster transmission speed, short time delay, high positioning accuracy, wide link for customers to feel a more advanced experience. experience.     🌹【Mobile phones and giveaways】When you make your purchase, you will not only receive the phone, but also a beautiful box, a manual, a charger and USB cable, as well as a pair of headphones, a protective screen for the phone and a case.     🌹【100% Satisfaction Guarantee】If you have any questions or dissatisfaction with the product, please feel free to contact us, we will provide you with the best solution within 24 hours. Customer satisfaction has always been our goal!",
        "details": {
            "brand": "WV LeisureMaster",
            "operatingSystem": "Android 14",
            "memoryStorageCapacity": "256 GB",
            "screenSize": "N/A",
            "resolution": "N/A",
            "modelName": "A15 Pro Max",
            "wirelessCarrier": "Unlocked for All Carriers",
            "cellularTechnology": "5G",
            "connectivity": "Wi-Fi",
            "color": "Grey"
        }
    },
    {
        "id": "B08JSMQ2GC",
        "name": "Phone Timed Lock Box,Phone Lock Box with Timer for Android Sumsung/Google/iPhone 15/14/13/13 pro/12/11/X/XR/XS/8/ for Kids/Students/Parents to Unplug from Phones, Video Games, Social Media",
        "ratings": 818,
        "price": "$27.99",
        "image": "https://m.media-amazon.com/images/I/71iqHNdQLfL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
        "description": "【WHO NEED IT】– Those who spend too much time on their phones,pads, social media & other unhealthy habits and eager to improve their mental and physical health by living in the moment and reducing consumption     【 FIT MOST PHONES WITH AUTOMTIC TIMER】- the box is help to lock away your phone and keeps it out of reach for as long as you chose,large phones such as iPhone 6/7/8 plus or 10/11 max or Samsung S, Note or Ultra series will fit.     【SUPERIOR STANDBY PERFORMANCE】-You can set the timer from 1 minutes to 99 hours,the standby time can reach up to 30days.     【 FASHIONABLE AND PORTABLE DESIGN】- Light weight and fashionable size make it convenient to carry and bring more fun for kids.     【Emergency hole for answering calls】- there are holes desiigned for emergency calls or messages, and you will never miss important calls/messages     【TRANSPARANT COVER WITH FUNCTIONAL SLOTS】-the functional slots make it to receive the call or messages during emergency time, and you can also recharge your phone through the slot using cables.",
        "details": {
            "brand": "iDiskk",
            "operatingSystem": "N/A",
            "memoryStorageCapacity": "N/A",
            "screenSize": "N/A",
            "resolution": "N/A",
            "modelName": "N/A",
            "wirelessCarrier": "N/A",
            "cellularTechnology": "N/A",
            "connectivity": "N/A",
            "color": "Small Ccrystal"
        }
    },
    {
        "id": "B0CD4K1PT2",
        "name": "Yoidesu 3G Mini Smartphone, 3in Super Small Cell Phone, Dual SIM 2GB 16GB ROM for Android 8.1 Ultra Thin Mobile Phone, 1000mAh The World's Smallest Backup Phone (Violet)",
        "ratings": 41,
        "price": "$55.25",
        "image": "https://m.media-amazon.com/images/I/51A5WHfn8JL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
        "description": "Mini Cute Phone: The Dual SIM Mobile Phone is small enough to carry around like a bank card, use it like any other for Android phone and you can browse the internet from anywhere and download apps from for Play store.     3G Mini Smartphone: Please make sure your SIM card supports 2G GSM 850, 900, 1800, 1900;3G WCDMA B1, B5, B8, for Android 8.1 version, Mini 3G Smartphone support application downloads.     3G Network: Tiny Smartphone supports 3G network, so you can browse the internet from anywhere and use for Play store to download various apps on your phone.     Best Backup Phone: This Pocket Smart Cell Phone has great features, 1000mAh battery, dual cameras, 0.3MP front (with beautification) and 2MP rear. Dual SIM.     Gift: This Smallest 3G smartphone is convenient and practical, the best kids and parents, brings good using experience.",
        "details": {
            "brand": "Yoidesu",
            "operatingSystem": "Android 8.1",
            "memoryStorageCapacity": "16 GB",
            "screenSize": "N/A",
            "resolution": "N/A",
            "modelName": "Yoidesua5tdmp4n0k-12",
            "wirelessCarrier": "3",
            "cellularTechnology": "2G",
            "connectivity": "Wi-Fi",
            "color": "Violet"
        }
    },
    {
        "id": "B0CQQL6SC2",
        "name": "4G Mini Phone Unlocked Mini Smartphone with 3.0\" HD Screen,3GB+32GB, 2000mAh Battery, Ultra Thin Body, 5MP Camera, Dual SIM, Best Gift for Kids, Mini Phone for Kids -Purple",
        "ratings": 63,
        "price": "$69.99",
        "image": "https://m.media-amazon.com/images/I/61SY6Ke+OBL._AC_SY300_SX300_.jpg",
        "description": "【4G MINI Samrtphone Body】-This is a 4G MINI smartphone. Size: 3.7*1.86*0.49inch. The weight of the phone is 0.3LB, which is equivalent to a bank card. It is easy to carry and can be operated with one hand.     【Samrtphone with 2MP+5MP Camera】-The MINI smartphone has a 2MP front camera and a 5MP rear camera, allowing you to take beautiful photos in a compact phone.     【RAM 3GB+ROM 32GB】-The mini smartphone is equipped with RAM 3GB + ROM 32GB, and the maximum memory that supports T card is 128GB. Its system is Android 9.0 and supports multiple APP downloads, such as Google App Store, WhatsApp, etc.     【Samrtphone with 2000mAh Battery】-The battery capacity of this smartphone is 2000mAh. It also supports voice calls, video calls, photography, recording, email, MP3, GPRS, FM radio, touch screen, GPS navigation, messaging, SMS, MMS, video player, memory card insertion trough, internet browser, Google Maps, etc.     【Best Gift for Kids】-The MINI smartphone is very small and cute, suitable for children's hands, very interesting for children, easy to carry, and fully functional. We have three colors to choose from: purple, black and pink. It is the best gift for children.",
        "details": {
            "brand": "ATEVENSEE",
            "operatingSystem": "Android 9.0",
            "memoryStorageCapacity": "32 GB",
            "screenSize": "N/A",
            "resolution": "854*480",
            "modelName": "15 Mini-Purple",
            "wirelessCarrier": "Unlocked for All Carriers",
            "cellularTechnology": "4G",
            "connectivity": "Wi-Fi",
            "color": "Violet"
        }
    },
    {
        "id": "B07SCJNSRT",
        "name": "Samsung Galaxy A10 32GB A105G/DS LTE Unlocked GSM 6.2\" HD+ Smartphone - International Version, No Warranty (Blue)",
        "ratings": 365,
        "price": "$129.99",
        "image": "https://m.media-amazon.com/images/I/615wcLMDicL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
        "description": "3G UMTS 850/900/1900/2100 - LTE Cat4 (Bands 1, 2, 3, 5, 7, 8, 20, 28) TD-LTE (Bands 38, 40, 41) - Dual SIM Standby > (ensure to check compatibility with your carrier before purchase)     6.2 inches 720 x 1520 pixels, 19:9 ratio (~271 ppi density) Infinity-V Display, Capacitive Multitouch - Slim Design     32GB ROM + 2GB RAM - microSD, up to 512GB - Non-removable Li-Ion 3400 mAh battery - Samsung Exynos 7 Octa 7884 (14nm) - WiFi: 802.11 b/g/n (2.4Ghz)     Rear Camera: 13.0 MP - Front (Selfie) Camera: 5.0MP - Video: Full HD (1920x1080 pixels) 30 fps - EIS: Digital stabilization - Face detection, Smile detection     Unlocked cellphones are compatible with most of the GSM carriers ( Like T-Mobile or AT&T ) but please be aware that are not compatible with CDMA carriers ( Like Sprint or Verizon Wireless for example )",
        "details": {
            "brand": "SAMSUNG",
            "operatingSystem": "Android",
            "memoryStorageCapacity": "32 GB",
            "screenSize": "N/A",
            "resolution": "720 x 1520",
            "modelName": "Galaxy A10",
            "wirelessCarrier": "T-Mobile",
            "cellularTechnology": "N/A",
            "connectivity": "N/A",
            "color": "N/A"
        }
    },
    {
        "id": "B0D372VZ11",
        "name": "Waterproof Phone Pouch, Water Proof Case Compatible With iPhone 14/13/12/12 Pro Max/11/11 Pro/SE/XS Max/XR/8P/7 Galaxy & More | Beach & Pool Essentials For Ultimate Protection (4\"x7.5\", 2 Pack)",
        "ratings": 2,
        "price": "$9.99",
        "image": "https://m.media-amazon.com/images/I/81hNZmpMfTL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
        "description": "📱🌊 Ultimate Waterproof Protection: Keep your precious phone safe and dry with hulms Waterproof Phone Pouch! Perfect for beach days, pool parties, and rainy adventures.     🏖️ Universal Compatibility: Designed to fit all major smartphone models including iPhone 14/13/12/12 Pro Max/11/11 Pro/SE/XS Max/XR/8P/7, Samsung Galaxy, and more! Enjoy worry-free protection for your device wherever you go.     🛡️ High-Quality Material: Crafted from durable plastic, our waterproof pouch ensures maximum protection against water, sand, dust, and dirt. Say goodbye to water damage and hello to peace of mind!     📏 Perfect Size: With dimensions of 4.2\"x7.5\", our pouch comfortably accommodates phones up to 7 inches in length. Carry your device with confidence knowing it's snug and secure inside our innovative pouch     🎁 Bonus Pack: Get not one, but two waterproof phone pouches in each pack! Share one with a friend or keep a spare for yourself. Don't let water ruin your day - grab your hulms Waterproof Phone Pouch today!",
        "details": {
            "brand": "Hulms",
            "operatingSystem": "N/A",
            "memoryStorageCapacity": "N/A",
            "screenSize": "N/A",
            "resolution": "N/A",
            "modelName": "N/A",
            "wirelessCarrier": "N/A",
            "cellularTechnology": "N/A",
            "connectivity": "N/A",
            "color": "Black"
        }
    },
    {
        "id": "B0DG3FSVCB",
        "name": "2024 Upgraded 3-in-1 Wireless Charger for iPhone,Travel Magnetic Charger Stand Nightlight Foldable Wireless Charging Station Compatible with Magsafe Charger&iPhone 16/15/14/13/12,Apple Watch&AirPods",
        "ratings": 22,
        "price": "$39.95",
        "image": "https://m.media-amazon.com/images/I/61WwJGaSAtL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
        "description": "【Wireless Charger for iPhone/Apple Watch/AirPods】Wireless magnetic portable charger compatible with MagSafe magnetic case, iPhone 16/ 16 Plus/ 16 Pro/ 16 Pro Max/iPhone 15/ 15 Plus/ 15 Pro/ 15 Pro Max/ 14/ 14 Plus/ 14 Pro/ 14 Pro Max/ 13/ 13 mini/ 13 Pro/ 13 Pro Max/ 12/ 12 mini/ 12 Pro/ 12 Pro Max, Apple Watch 9/8/7/6/5/4/3/2/Ultra 2/Ultra 1/SE, AirPods 3/2 Pro 2/Pro. (Note: Please use Mag-Safe phone case or without case for wireless charging)     【Fast Wireless Charger Foldable Stand】Effortlessly charge for iPhone at a lightning-fast 15 W, for Apple Watch at a reliable 2.5 W, and for AirPods at a steady 5 W—all at once. Each device charges independently, without affecting the performance of the others. It takes only 2-3 hours to fully charge your devices, allowing you to enjoy the convenience of a single, fast, unified charging solution.[Note: To charge at full speed, please use a PD charger of 20 W or higher.]     【Upgrade Powerful Mag-Safe Charger Stand】Mag-Safe charger 3 in 1 makes fast charging safe and easy. The built-in super strong magnet makes alignment instantly and precisely, just 1 second to achieve lightning fast wireless charging. The magnetic charger can hold your iPhone horizontally and vertically, or in any directions, the phone charging area can adjust the angle up and down by 120°, you can enjoy all your comfortable viewing from any angle.     【Intergrated Smart for Apple Ecosystem】 Many smart devices have become companions in our lives, and it has become important to simplify how to power them. Carrying multple charging cables to power your devices can become a hassle, but our 3 in 1 charging station for apple can take on the work of three cables by connecting to just one power adapter. Note: Does not come with an adapter, you need to pair it with an adapter of at least 25W for fast charging!     【Your Safety Companion】Our wireless chargers have passed various certifications with professional circuit design and intelligent protection technology. It has overcurrent, overvoltage, and temperature control to ensure safe and fast charging of your device. This wireless charging station is not only the best charging accessory for the desktop and bedside, but the perfect gift for your friends and family! You will get a 3 in 1 charging station, a 5ft charging cable, a user guide.",
        "details": {
            "brand": "BODSEIEOU",
            "operatingSystem": "N/A",
            "memoryStorageCapacity": "N/A",
            "screenSize": "N/A",
            "resolution": "N/A",
            "modelName": "N/A",
            "wirelessCarrier": "N/A",
            "cellularTechnology": "N/A",
            "connectivity": "USB",
            "color": "Black"
        }
    },
    {
        "id": "B0CMQJSFWD",
        "name": "Mini Smartphone, Child Phone The World's Smallest Cell Phone 3.0 Inch Android Small Phone Quad Core 2G+16G 5.0MP Dual SIM High Definition Mini Phones Unlocked 3G Mobile Phone (Black)",
        "ratings": 100,
        "price": "$49.99",
        "image": "https://m.media-amazon.com/images/I/51Nnp56PlbL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
        "description": "SUPER 3G Mini Smartphone: As a smartphone, you can use it like any other mobile phone, browsing the Internet anywhere and using Google Play Store to download apps. Frequency: GSM: 850/900/1800/1900; WCDMA: B1/B2/B5/B8.     Tiny But Functional: The mini smartphone supports voice calls, video calls, camera, recording, email, MP3, GPRS, FM radio, touch screen, GPS navigation, message, SMS, MMS, video player, memory card slot, Internet browser, Google map, etc.     Support Most Apps: This unlocked mobile phone supports most apps in Google Play Store such as Facebook, Youtube, Instagram, Whats app, Tiktok, Twitter, etc.     Great Gift for Kids: It's soo Cute and Functional, suitable for kid's hands. Children will be fell in love with it's MINI, FUNCTIONAL, CUTE, EASY CARRY, INTERESTING. It has three color you can choose: Black, Purple and Blue. It will be an indispensable gift for children in the Festival.     Good Backup Phone: Dual Sim Dual Standby, meeting your daily use needs. When you go cycling, hiking, traveling, mountain climbing, seaside vacation, the advantages of lightness and portability are reflected. It meets your daily needs, while having a smaller size, so that your backpack is no longer heavy and your Life is easier.     All under control by single hand: Very suitable for our palm which makes you feel comfortable from all sides due to our high tech artwork and precise design.",
        "details": {
            "brand": "Cutwif",
            "operatingSystem": "Android 8.1",
            "memoryStorageCapacity": "16 GB",
            "screenSize": "N/A",
            "resolution": "480 x 854",
            "modelName": "mini phone--XS15",
            "wirelessCarrier": "Unlocked",
            "cellularTechnology": "3G",
            "connectivity": "Bluetooth",
            "color": "N/A"
        }
    }
]
