{
  "totalProducts": 128,
  "products": [
    {
      "id": "B091FXLMS8",
      "name": "Kasa Smart Plug Mini 15A, Smart Home Wi-Fi Outlet Works with Alexa, Google Home & IFTTT, No Hub Required, UL Certified, 2.4G WiFi Only, 4-Pack(EP10P4) , White",
      "ratings": 22.515,
      "price": "$18.99",
      "image": "https://m.media-amazon.com/images/I/51L3mlb5BXL.__AC_SY300_SX300_QL70_FMwebp_.jpg",
      "description": "Voice control: Kasa smart plugs that work with Alexa and Google Home Assistant. Enjoy the hands free convenience of controlling any home electronic appliances with your voice via Amazon Alexa or Google Assistant     Easy set up and use: 2.4GHz Wi-Fi connection required. Plug in, open the case app, follow the simple instructions and enjoy. Kasa app reqiured     Scheduling: Use timer or countdown schedules set your smart plug to automatically turn on and off any home electronic appliances such as lamps, fan, humidifier, Christmas lights etc.     Smart Outlet Control from Anywhere: Turn electronics on and off from anywhere with your smartphone using the Kasa app, whether you are at home, in the office or on vacation.     Trusted and Reliable: Kasa is trusted by over 6 Million users and being the Reader’s Choice of PCMag 2020. UL certified for safety use. 2-year warranty.     Voice Control : Use simple voice commands with your smart plug and Alexa or Google Assistant.",
      "details": {
        "brand": "Kasa Smart",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "White",
        "ram": "N/A",
        "detail_item": "Voice control: Kasa smart plugs that work with Alexa and Google Home Assistant. Enjoy the hands free convenience of controlling any home electronic appliances with your voice via Amazon Alexa or Google Assistant"
      }
    },
    {
      "id": "B091FXQQMQ",
      "name": "Kasa Smart Plug Ultra Mini 15A, Smart Home Wi-Fi Outlet Works with Alexa, Google Home & IFTTT, No Hub Required, UL Certified, 2.4G WiFi Only, 2 Count (Pack of 1)(EP10P2) , White",
      "ratings": 13.881,
      "price": "$10.99",
      "image": "https://m.media-amazon.com/images/I/31d+RuyyC5S._SX342_SY445_.jpg",
      "description": "Voice control: Kasa smart plugs that work with Alexa and Google Home Assistant. Enjoy the hands free convenience of controlling any home electronic appliances with your voice via Amazon Alexa or Google Assistant     Easy set up and use: 2.4GHz Wi-Fi connection required. Plug in, open the Kase app, follow the simple instructions and enjoy     Scheduling: Use timer or countdown schedules set your smart plug to automatically turn on and off any home electronic appliances such as lamps, fan, humidifier, Christmas lights etc.     Smart Outlet Control from Anywhere: Turn electronics on and off from anywhere with your smartphone using the Kasa app, whether you are at home, in the office or on vacation.     Trusted and Reliable: Kasa is trusted by over 6 Million users and being the Reader’s Choice of PCMag 2020. UL certified for safety use. 2-year warranty.",
      "details": {
        "brand": "Kasa Smart",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "Voice control: Kasa smart plugs that work with Alexa and Google Home Assistant. Enjoy the hands free convenience of controlling any home electronic appliances with your voice via Amazon Alexa or Google Assistant"
      }
    },
    {
      "id": "B07RCNB2L3",
      "name": "Kasa Smart Plug HS103P4, Smart Home Wi-Fi Outlet Works with Alexa, Echo, Google Home & IFTTT, No Hub Required, Remote Control, 15 Amp, UL Certified, 4-Pack, White",
      "ratings": 55.556,
      "price": "$19.99",
      "image": "https://m.media-amazon.com/images/I/41JnNfpIRXL._SY445_SX342_QL70_FMwebp_.jpg",
      "description": "Voice control: Kasa smart plugs that work with Alexa and Google Home Assistant. Enjoy the hands free convenience of controlling any home electronic appliances with your voice via Amazon Alexa or Google Assistant. Compatible with Android 5.0 or higher and iOS 10.0 or higher     Smart Outlet Control from anywhere: Turn electronics on and off your smart home devices from anywhere with your smartphone using the Kasa app, whether you are at home, in the office or on vacation     Scheduling: Use timer or countdown schedules to set your wifi smart plug to automatically turn on and off any home electronic appliances such as lamps, fan, humidifier, Christmas lights etc. The Kasa app is free and compatible with iOS 10.0 or later.     Easy set up and use: 2.4GHz Wi-Fi connection required. Plug in, open the Kasa app, follow the simple instructions and enjoy     Trusted and reliable: Designed and developed in Silicon Valley, Kasa is trusted by over 5 Million users and being the reader’s choice for PCMag 2020. UL certified for safety use.",
      "details": {
        "brand": "Kasa Smart",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "Voice control: Kasa smart plugs that work with Alexa and Google Home Assistant. Enjoy the hands free convenience of controlling any home electronic appliances with your voice via Amazon Alexa or Google Assistant. Compatible with Android 5.0 or higher and iOS 10.0 or higher"
      }
    },
    {
      "id": "B07B8W2KHZ",
      "name": "Kasa Smart Plug HS103P2, Smart Home Wi-Fi Outlet Works with Alexa, Echo, Google Home & IFTTT, No Hub Required, Remote Control,15 Amp,UL Certified, (Pack of 2) White",
      "ratings": 90.333,
      "price": "$11.59",
      "image": "https://m.media-amazon.com/images/I/318hT1pOvRL._SY445_SX342_QL70_FMwebp_.jpg",
      "description": "Voice Control: Add voice control to any outlet. Enjoy the hands-free convenience of controlling any home electronic appliances with your voice via Amazon Alexa or Google Assistant.     Control From Anywhere: Turn electronics on and off from anywhere with your smartphone using the Kasa app, whether you are at home, in the office or on vacation.     Scheduling: Use timer or countdown schedules set your smart plug to automatically turn on and off any home electronic appliances such as lamps, fan, humidifier, Christmas lights etc. The button on the side of each HS103 Smart Plug will toggle the power state of the Smart Plug, and the appliance connected to it.     Easy Set Up and Use: 2.4GHz Wi-Fi connection required. Plug in, open the Kasa app, follow the simple instructions and enjoy.     Trusted and Reliable: Designed and developed in Silicon Valley, Kasa is trusted by over 4 Million users and being the reader’s choice for PCMag 2020. UL certified for safety use.     Maximum Load *for The New Version : 15 Amps Resistive @ 120VAC*",
      "details": {
        "brand": "Kasa Smart",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "Voice Control: Add voice control to any outlet. Enjoy the hands-free convenience of controlling any home electronic appliances with your voice via Amazon Alexa or Google Assistant."
      }
    },
    {
      "id": "B091FXH2FR",
      "name": "Kasa Outdoor Smart Plug, Smart Home Wi-Fi Outlet with 2 Sockets, IP64 Weather Resistance, Compatible with Alexa, Google Home & IFTTT, No Hub Required, ETL Certified(EP40), Black",
      "ratings": 15.89,
      "price": "$14.99",
      "image": "https://m.media-amazon.com/images/I/61soGaMHzrL.__AC_SY300_SX300_QL70_FMwebp_.jpg",
      "description": "Individual Control of 2 IN 1 Outlets: 2 AC outlets are working and controlled independently.15A/1875W Max for each. Waterproof cover is attached to protect it from dirt when not in use. Long Wi-Fi range up to 300 feet with IP64 weather resistance. Group your Kasa Smart light bulbs, plugs and switches for seamless control. Ideal for controlling all your devices simultaneously with a single tap.     Voice & Remote Control: Add voice control to any outdoor outlet. Enjoy the hands-free convenience of controlling any outdoor electronic appliances with your voice via Alexa or Google Home Assistant. Turn electronics on and off from anywhere with your smartphone using the Kasa app, whether you are at home, in the office or on vacation.     Easy Set Up and Use: 2.4GHz Wi-Fi connection required. Plug in, open the Kasa app, follow the simple instructions and enjoy the wifi smart plug. Ideal for landscape lighting, swimming pool pumps, holiday lights, or other appliances.     Scheduling: Use schedules or countdown timer to set your smart plug to automatically turn on and off at the time you want. Sunset/sunrise offset makes it even smarter to act according to the real daytime.     Trusted and Reliable: Kasa is trusted by over 6 Million users and being the Reader’s Choice of PCMag 2020. 2-year warranty.     Refer user manual for better understanding of the product     An outdoor plug needs a strong Wi-Fi signal and the Kasa Smart Wi-Fi Outdoor Plug has one of the strongest. With a built-in power amplifier for long range Wi-Fi, the outdoor plug has a reach of up to 300 ft. in open space. Kasa Smart App System Requirement iOS 10 or Android 5.0 or higher",
      "details": {
        "brand": "Kasa Smart",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "Individual Control of 2 IN 1 Outlets: 2 AC outlets are working and controlled independently.15A/1875W Max for each. Waterproof cover is attached to protect it from dirt when not in use. Long Wi-Fi range up to 300 feet with IP64 weather resistance. Group your Kasa Smart light bulbs, plugs and switches for seamless control. Ideal for controlling all your devices simultaneously with a single tap."
      }
    },
    {
      "id": "B08731J1L4",
      "name": "Govee Smart Plug, WiFi Plugs Work with Alexa & Google Assistant, Smart Outlet with Timer & Group Controller, WiFi Outlet for Home, No Hub Required, ETL & FCC Certified, 2.4G WiFi Only, 4 Pack",
      "ratings": 10.564,
      "price": "$28.99",
      "image": "https://m.media-amazon.com/images/I/310tVwCQrVL._SY445_SX342_QL70_FMwebp_.jpg",
      "description": "Stability Upgrade: Supports Bluetooth or WiFi connection, which is more stable and faster than plugs that can only be connected through WiFi. No disconnection worries, control all your home appliances and devices anytime & anywhere.     Smart Voice Control: WiFi Plugs Work with Amazon Alexa and Google Assistant, so you can control the smart home devices using simple voice commands. Free hands by using smart plugs and enjoy the funny interactive process. Note: Don't support 5G WiFi.     Scheduling & Group Controller: Create customized schedules to power your electronic appliances on/off automatically for helping save energy and money. And with a single tough of one button, you can manage multiple smart plugs simultaneously.     Multiple safeguards & Small Size: With ETL & FCC certified, the quality of smart plug is assessed. Our product is rated: 10A, 1200W and support 120V. Compact and flexible design can save space, smart home plugs fit for every corner of your room.     Easy Install and Use: Download the Govee Home App and search for H5083, you can pair smart outlet successfully in minutes without barrier in smart home; share with your family on Govee app via phones so you can enjoy the smart life together.     This smart plug is ETL certified, ensuring it meets stringent safety standards for reliable and secure operation.",
      "details": {
        "brand": "Govee",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "White",
        "ram": "N/A",
        "detail_item": "Stability Upgrade: Supports Bluetooth or WiFi connection, which is more stable and faster than plugs that can only be connected through WiFi. No disconnection worries, control all your home appliances and devices anytime & anywhere."
      }
    },
    {
      "id": "B09JZKK3KS",
      "name": "GHome Smart Mini Plug Compatible with Alexa and Google Home, WiFi Smart Outlet Socket Remote Control with Timer Function, Only Supports 2.4GHz Network, No Hub Required, ETL FCC Listed (4 Pack), White",
      "ratings": 2.34,
      "price": "$25.99",
      "image": "https://m.media-amazon.com/images/I/41kAQMtriOL._SY445_SX342_QL70_FMwebp_.jpg",
      "description": "SAFE DESIGNED&QUICK CONNECTION: Simply plugin and keep the smart outlet connected to your stable 2.4GHz network, the improved WiFi technology let you quick connection and stay stable.     HAND-FREE VOICE CONTROL: Smart plugs that work with Alexa and Google Home Assistant. Just give a simple voice command to Alexa or Google Assistant to control your connected home devices.     APP REMOTE CONTROL FROM ANYWHERE: You also can control your smart plug via the APP directly when you are away, so long as your phone access a secure network (2.4G,4G, or 5G Wi-Fi).     SCHEDULES&AUTO-OFF TIMER: Easy to set timers and add schedules to connected devices circularly or randomly, making them work as scheduled like auto-off and auto-on.     GROUPING CONTROL & SHARING: Set a group for all wifi smart plugs and control them with simply one tap. Share your wifi plug smart outlets with all family members in a minute.",
      "details": {
        "brand": "GHome Smart",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "White",
        "ram": "N/A",
        "detail_item": "SAFE DESIGNED&QUICK CONNECTION: Simply plugin and keep the smart outlet connected to your stable 2.4GHz network, the improved WiFi technology let you quick connection and stay stable."
      }
    },
    {
      "id": "B099KLNM24",
      "name": "Kasa Outdoor Smart Plug, Smart Home Wi-Fi Outlet Timer, Max Load 15A/1875W, IP64 Weather Resistance, Compatible with Alexa, Google Home & SmartThings, No Hub Required, ETL Certified(KP401)",
      "ratings": 9.882,
      "price": "$11.99",
      "image": "https://m.media-amazon.com/images/I/613VWkNY3ZL.__AC_SY300_SX300_QL70_FMwebp_.jpg",
      "description": "【Long Wi-Fi Range and IP64】Long Wi-Fi range up to 300 feet with IP64 weather resistance. Waterproof cover is attached to protect it from dirt when not in use. Supports up to 15A/1875W.     【Voice and Remote Control】Add voice control to any outdoor outlet. Enjoy the hands-free convenience of controlling any outdoor electronic appliances with your voice via Alexa or Google Home Assistant. Turn electronics on and off from anywhere with your smartphone using the Kasa app, whether you are at home, in the office or on vacation.     【Easy Set Up and Use】2.4GHz Wi-Fi connection required. Plug in, open the Kasa app, follow the simple instructions and enjoy the wifi smart plug. For landscape lighting, swimming pool pumps, holiday lights, or other appliances.     【Scheduling】Use schedules or countdown timer to set your smart plug to automatically turn on and off at the time you want. Sunset/sunrise offset makes it even smarter to act according to the real daytime.",
      "details": {
        "brand": "Kasa Smart",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "【Long Wi-Fi Range and IP64】Long Wi-Fi range up to 300 feet with IP64 weather resistance. Waterproof cover is attached to protect it from dirt when not in use. Supports up to 15A/1875W."
      }
    },
    {
      "id": "B0792V2GQX",
      "name": "WiFi Smart Echo Power Strip Surge Protector,4 Smart Plugs and 4 USB Charging Ports for Multi Outlet Socket Extension Cord, Compatible with Alexa, Voice Controlled by Amazon Echo Dot (White)",
      "ratings": 4,
      "price": "$130.00",
      "image": "https://m.media-amazon.com/images/I/31XvdrwK4+L._SX342_SY445_.jpg",
      "description": "",
      "details": {
        "brand": "N/A",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "N/A"
      }
    },
    {
      "id": "B07XD578LD",
      "name": "Philips Hue Smart Plug, White - 1 Pack - Turns Any Light Into a Smart Light - Control with Hue App - Compatible with Alexa, Google Assistant, and Apple HomeKit",
      "ratings": 10.702,
      "price": "$27.89",
      "image": "https://m.media-amazon.com/images/I/61ECIO5NqnL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "WHAT’S IN THE BOX - Includes one smart plug; Turns any light, even one in which you can’t place a Hue bulb—into a smart light     UNLOCK THE FULL POWER OF HUE - Add a Hue Bridge to enjoy automations, control from anywhere in the world, and a secure, stable connection that won’t drain your Wi-Fi. Use Matter to connect your smart home devices to your Hue smart lighting system.     INCONSPICUOUS, COMPACT DESIGN - Small, white, and with a subtle design, the Philips Hue Smart Plug was designed to blend into any environment. It allows you to add any light to your Hue system without any added wires or hassle.     VOICE CONTROL - Convenient smart control; Set up voice control in the Hue app and use simple voice commands to control your lights with Alexa or Google Assistant     SET UP - Simply plug the switch into the outlet, plug in your light, and use Bluetooth for instant light control or connect to the Hue Bridge to unlock more features.     COMPACT DESIGN - The smart plug's compact design fits neatly in your outlet without blocking other sockets.",
      "details": {
        "brand": "Philips Hue",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "WHAT’S IN THE BOX - Includes one smart plug; Turns any light, even one in which you can’t place a Hue bulb—into a smart light"
      }
    },
    {
      "id": "B07G95FFN3",
      "name": "Kasa Smart Plug Power Strip HS300, Surge Protector with 6 Individually Controlled Smart Outlets and 3 USB Ports, Works with Alexa & Google Home, No Hub Required , White",
      "ratings": 8.468,
      "price": "$39.99",
      "image": "https://m.media-amazon.com/images/I/61PI8akrKOL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "6 smart outlets: Independently control 6 smart outlets, and charge 3 devices with built in USB ports; Ideal for controlling electronics in your home, home office, or small business     Surge protection: ETL certified surge protection shields sensitive electronics and appliances from sudden power surges that can occur during weather storms and cause irreparable damage     Energy monitoring : Monitor how much energy devices connected to the power strip consume; Check on each one from your Kasa smart app and turn off ones that are using too much power     Control from anywhere: Control connected devices from anywhere with the Kasa Smart app. Power up your office remotely and even your holiday lights from the app     Voice control: Remotely control your smart plug and use voice commands with Alexa, Google Assistant, or MicroSoft Cortana. Plug type:3-prong plug     Input: 100-125V~, 60Hz, 15A; Output: 15A 1875W maximum load in total; Vpr:500V(L-N) 500V(L-G) 500V(N-G) Type 3 SPD; Usb: 5V/2.4A each & total",
      "details": {
        "brand": "Kasa Smart",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "White",
        "ram": "N/A",
        "detail_item": "6 smart outlets: Independently control 6 smart outlets, and charge 3 devices with built in USB ports; Ideal for controlling electronics in your home, home office, or small business"
      }
    },
    {
      "id": "B083JKSSR5",
      "name": "Kasa Smart Plug Power Strip KP303, Surge Protector with 3 Individually Controlled Smart Outlets and 2 USB Ports, Works with Alexa & Google Home, No Hub Required , White",
      "ratings": 15.007,
      "price": "$18.99",
      "image": "https://m.media-amazon.com/images/I/61yUqv7M9VL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "3 smart outlets plus 2 USB ports: Support 5 appliances simultaneously with 3 independently controllable smart outlets and 2 always-on USB ports. Ideal for charging devices in the home and office.     Voice control: Compatible with Alexa and Google Assistant. Free up your hands by using voice commands to control plugged in devices.     Surge protection: ETL-certified surge protection shields sensitive electronics and appliances from sudden power surges.     Control from anywhere: Use the intuitive Kasa smart app to remotely control connected devices through your mobile device.     Set schedules and timers: Create schedules/timers to turn individual outlets, on/off at specific times to increase efficiency and save money on your power bill.     Simple setup: Download the Kasa Smart app (Android, iOS), plug in your smart power strip and connect to WiFi to start controlling your devices.",
      "details": {
        "brand": "Kasa Smart",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "3 smart outlets plus 2 USB ports: Support 5 appliances simultaneously with 3 independently controllable smart outlets and 2 always-on USB ports. Ideal for charging devices in the home and office."
      }
    },
    {
      "id": "B094YHJJVG",
      "name": "Amazon Basics - Outdoor Smart Plug with 2 Individually Controlled Outlets, Works with Alexa Only, 2.4 GHz Wi-Fi, No Hub Required, Black, 3.71 x 1.81 x 5.04 inches",
      "ratings": 2.597,
      "price": "$19.99",
      "image": "https://m.media-amazon.com/images/I/61XLOcCypdL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "SMART UPGRADE: Amazon Basics Smart Outdoor Plug works with Alexa to add remote and voice control to traditional outdoor lightings and devices     CONTROL FROM ANYWHERE: Schedule lights and outdoor electronic appliances to turn on and off automatically, or control them remotely when you’re away     SIMPLE TO SET UP WITH ALEXA: Plug in the smart outdoor plug, open the Alexa app, and get started in minutes as you get notified “device found and connected”. Otherwise, you can add your outdoor plug directly from Alexa app. No hubs or 3rd party apps or skills required. For zero touch set up experience, check “Link device to your Amazon account to simplify setup” during checkout and get started with your smart outdoor plug in no time. Note: Amazon Basics smart outdoor plug work exclusively with Alexa to be set up with 2.4GHz Wi-Fi only.     INDIVIDUAL CONTROL OR GROUPING: Includes 2 independently controllable outlets. Control each outlet individually by voice or remotely; or create groups in the Alexa app to combine devices together     NO SMART HOME HUB REQUIRED: Set up routines and schedules through the Alexa app; 2.4GHz Wi-Fi required; works exclusively with Alexa     WEATHER RESISTANT: IP65 rated enclosure gives protection against low pressure water jets from any direction, as well as condensation and water spray.",
      "details": {
        "brand": "Amazon Basics",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "Black",
        "ram": "N/A",
        "detail_item": "SMART UPGRADE: Amazon Basics Smart Outdoor Plug works with Alexa to add remote and voice control to traditional outdoor lightings and devices"
      }
    },
    {
      "id": "B07GNJ36CG",
      "name": "LoraTap Mini Remote Control Outlet Plug Adapter with Remote, 656ft Range Wireless Light Switch for Household Appliances, No Hub Required, 10A/1100W, White, 2 Years Warranty",
      "ratings": 1.642,
      "price": "$20.99",
      "image": "https://m.media-amazon.com/images/I/31SMYYqnw0L._SY445_SX342_QL70_FMwebp_.jpg",
      "description": "Wall Switch and Portable Remote 2 in 1: LoraTap remote switch can mount on the magnetic plate base (fixed with magnet or double sided tape on the back) or place directly on a magnetic surface like fridge and works as a traditional switch, or be taken off and used as a portable remote, which allows you to place it anywhere easy to reach     Compact Design & Easy to Use: Mini 3 prong grounded single port power adapter with on off switch button, energy saving design, blue led light indicator, plug and play, just plug in the outlet socket, you can remotely control the device from anywhere in your house     Long Range Control: 915MHz RF wireless signal strong enough to go through walls and windows, indoor wireless appliance control ranges up to 100ft/30m, outdoor ranges up to 656ft without interfering other electronics, ideal for hard-to-reach lights or appliances that do not have a switch     Convenient for Everyone: Simple, app-free control of your devices, each kit is pre-paired in the factory, no need to do pairing before use, easy for the elderly, children and people with limited mobility to use, giving users instant control over lamps, television, router, fan and more with a simple press of a button     Non-Interference & Memory Function: Each item has its unique ID, each kit is pre-programmed by default, several remote plug kits can work in one room without signal interference; LoraTap wireless light switch plug has memory function, it will remember the previous on/off mode after power is restored, if it was off, it remains off after a power outage to save energy and your electrical bill; LoraTap patented product with 2 years warranty, FCC, CE and RoHS certified",
      "details": {
        "brand": "LoraTap",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "Wall Switch and Portable Remote 2 in 1: LoraTap remote switch can mount on the magnetic plate base (fixed with magnet or double sided tape on the back) or place directly on a magnetic surface like fridge and works as a traditional switch, or be taken off and used as a portable remote, which allows you to place it anywhere easy to reach"
      }
    },
    {
      "id": "B07XZT24B8",
      "name": "Wyze Plug, 2.4GHz WiFi Smart Plug, Works with Alexa, Google Assistant, IFTTT, No Hub Required, Two-Pack, White",
      "ratings": 12.345,
      "price": "$19.98",
      "image": "https://m.media-amazon.com/images/I/61WfQ4LSdyL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Command your home with your voice: when your hands are full or you just don’t want to move, use your voice to turn things on and off by asking your smart Assistant. We made Wyze plug work with Alexa and the Google Assistant so it’s easier said and done.     Control your home from anywhere: check the status of all of your Wyze plugs and turn them on or off remotely so you can avoid high energy bills and fire-hazards.     On when you need it, off when you don’t: Wake Up to the smell of fresh brewed Coffee in the morning with scheduling in the Wyze app. Custom scheduling in the Wyze app lets you turn Wyze plug on or off at specific times of the day so you can have your Coffee start at 6: 00 AM and turn off at 6: 15 AM.     Manage an entire room with grouping: grouping in the Wyze app lets you connect multiple Wyze plugs to one room so you can turn everything on or off at once at the tap of a finger or command to your smart Assistant.     Vacation mode makes it look like someone’s home: vacation mode can turn your stuff on and off at random making it appear you’re home so people think twice about coming over uninvited. Automate actions with Wyze sense: use Wyze sense to control your stuff based on motion and open/close events so things turn on when people are around and off when they’re gone. Connects to other smart home devices with IFTTT.",
      "details": {
        "brand": "WYZE",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "Command your home with your voice: when your hands are full or you just don’t want to move, use your voice to turn things on and off by asking your smart Assistant. We made Wyze plug work with Alexa and the Google Assistant so it’s easier said and done."
      }
    },
    {
      "id": "B07CVPKD8Z",
      "name": "BN-LINK WiFi Heavy Duty Smart Plug Outlet, No Hub Required with Timer Function, White, Compatible with Alexa and Google Assistant, 2.4 Ghz Network Only (2 Pack)",
      "ratings": 21.567,
      "price": "$12.99",
      "image": "https://m.media-amazon.com/images/I/51FpsvJlDAS.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "[VOICE CONTROL]: Simply voice command to control multiple home devices with our smart outlet via Alexa or Google Home. Enjoy the hands-free convenience of controlling any home electronic appliances. Made for everyone, perfect for elderly, disabled, or for hard-to-reach plugs     [CONTROL FROM ANYWHERE]: Turn electronics on or off from anywhere in the world with your smartphone using the BN-LINK Smart app or by simply giving voice commands to Amazon Alexa or Google Home Assistant. No Hub Required, works with 2.4GHz network. Works with Smart Life app     [SMART SCHEDULING]: Set the wifi smart plug to automatically power most electronics on and off as needed. With timer function setting lamps, fan, humidifier, any lights to come on at dusk and turn off at anytime     [GROUP & SHARE CONTROL]: The convenient and efficient group control function allows you to share these wifi smart plugs to all family members in a minute. Let no more worries. Everyone can control it easily     [EASY TO SET UP,SAFE TO USE]: Requires a secured 2.4 GHz Wi-Fi network connection. ETL certified. Rated: 15 A, 125 V, 1875 W",
      "details": {
        "brand": "BN-LINK",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "[VOICE CONTROL]: Simply voice command to control multiple home devices with our smart outlet via Alexa or Google Home. Enjoy the hands-free convenience of controlling any home electronic appliances. Made for everyone, perfect for elderly, disabled, or for hard-to-reach plugs"
      }
    },
    {
      "id": "B08NXY7WWX",
      "name": "Wyze Plug Outdoor, Dual Outlets Energy Monitoring, IP64, 2.4GHz WiFi Smart Plug, Works with Alexa, Google Assistant, IFTTT, No Hub Required, Black – A Certified for Humans Device",
      "ratings": 3.098,
      "price": "$15.98",
      "image": "https://m.media-amazon.com/images/I/51N4mIL+E+L._AC_SY300_SX300_.jpg",
      "description": "Consume less energy: Set energy consumption alerts and see historical energy usage in the Wyze app.     Long-range WiFi: Confidently control outlets around your home with Wyze Plug Outdoor's extended WiFi range (300 ft. in open space).     Made for the outdoors: IP64 Weather Resistant. Safely plug into areas that are exposed to rain, dust, dirt, and snow.     Two outlets in one: Independent control of both outlets at any given time. Turn off your outdoor lights, but leave your inflatable snowman standing strong.     App & Voice Control: Turn your lights off without putting your boots on. Light up your block in seconds by asking your voice assistant or pulling up the Wyze app on your phone. Works with Alexa and Google.",
      "details": {
        "brand": "WYZE",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "Consume less energy: Set energy consumption alerts and see historical energy usage in the Wyze app."
      }
    },
    {
      "id": "B07N3CK3MM",
      "name": "Kasa Smart Plug KP200, In-Wall Smart Home Wi-Fi Outlet Works with Alexa, Google Home & IFTTT, No Hub Required, Remote Control, ETL Certified , White, 1 Pack",
      "ratings": 6.905,
      "price": "$14.99",
      "image": "https://m.media-amazon.com/images/I/41R4R8rlf-L._SY445_SX342_QL70_FMwebp_.jpg",
      "description": "Smart in wall outlets: Kasa smart’s in wall outlet lets you control 2 plugged in devices from anywhere at the same time or individually; All the features and benefits of a Kasa smart plug multiplied; Take up less space with this in wall option that’s ideal for Your living room, kitchen, even your bedroom     Control from anywhere: Turn your in wall outlet on or off, set schedules or scenes from anywhere with your smartphone using the Kasa smart app; Remotely turn your holiday lights on while you’re at the office or away from home     Voice control: Use simple voice commands with you in wall smart outlet and any Alexa or Google Assistant. You can give each outlet a unique name and use them separately; Ask Alexa to turn your bedroom lamps off when it’s bedtime, so you don’t have to get up and do it yourself     Grouping: In the Kasa Smart app you can combine devices together for unified control with one single tap on your smartphone; Combine living room bulbs, plugs and switches together for more convenient access     Away mode: Improve your home’s security by setting your outlet to turn connected devices on and off randomly throughout the day to make it appear you’re home even while you’re away. Operating temperature-32°F-104°F (0ºC-40ºC). Operating humidity-10%-90%RH, non-condensing. Wi-fi Protocol: IEEE 802.11b/g/n . Output : 15A maximum load in total     Power Rating: 1875W MAX in total",
      "details": {
        "brand": "Kasa Smart",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "Smart in wall outlets: Kasa smart’s in wall outlet lets you control 2 plugged in devices from anywhere at the same time or individually; All the features and benefits of a Kasa smart plug multiplied; Take up less space with this in wall option that’s ideal for Your living room, kitchen, even your bedroom"
      }
    },
    {
      "id": "B08D4RQR1T",
      "name": "HBN Outdoor Smart Plug Waterproof WiFi Outdoor Outlet Timer with 6 Grounded Outlets, Remote & Voice Control Heavy Duty Yard Stake Plug Compatible with Alexa and Google Assistant No Hub Required",
      "ratings": 1.24,
      "price": "$22.39",
      "image": "https://m.media-amazon.com/images/I/71EDZNK+afL._AC_SY300_SX300_.jpg",
      "description": "【APP & Voice Control】Maximize home convenience with our Outdoor Smart Plug, requiring integration with HBN Smart, Smart Life, or TUYA Smart Apps. Designed for full compatibility with Amazon Alexa and Google Home Assistant, it enables essential voice control for your home electronics     【Smart Scheduling & Voice Control】 Our outdoor plug offers the convenience of setting schedules and timers for your devices using a smartphone app. Perfect for managing holiday lights or any outdoor electronics, it allows for both manual and voice-activated control via Amazon Alexa. Save energy and enhance your home's functionality effortlessly!     【Versatile & Safe Outdoor Power Solution】Our yard stake timer, doubling as an outdoor outlet timer, features 6 grounded outlets with a 6ft cord, allowing simultaneous power for multiple devices. Equipped with IP44 waterproofing and built-in overload protection, this outdoor power stake timer ensures safe and extensive coverage for all your outdoor electrical needs.     【Simple and Smart Connectivity】 Connect effortlessly to your 2.4GHz home Wi-Fi network to set up our Outdoor Wi-Fi Plug. Designed with a 12-inch green stake, it seamlessly integrates into your garden or lawn and withstands harsh weather conditions. Its compatibility with Alexa enables voice-activated control, offering convenience and ease of use exclusively with 2.4GHz Wi-Fi networks.     【Enhance Your Outdoors】 Our Outdoor Smart Plug is perfect for lighting up holiday decorations, Halloween/Christmas decor, and fountains. This yard stake plug is versatile for gardens, patios, and more, with a robust 125V, 15A capacity. It's durable, easy to use, and backed by a 1-year warranty, making it ideal for all your outdoor lighting needs.",
      "details": {
        "brand": "N/A",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "【APP & Voice Control】Maximize home convenience with our Outdoor Smart Plug, requiring integration with HBN Smart, Smart Life, or TUYA Smart Apps. Designed for full compatibility with Amazon Alexa and Google Home Assistant, it enables essential voice control for your home electronics"
      }
    },
    {
      "id": "B07N1JPPXK",
      "name": "Aoycocr Smart Plug 4-Pack, Bluetooth Wi-Fi Smart Outlet for Smart Home, Remote Control Lights and Devices from Anywhere, No Hub Required, ETL Certified",
      "ratings": 24.571,
      "price": "$27.99",
      "image": "https://m.media-amazon.com/images/I/41XL2vAnIjL._SY445_SX342_QL70_FMwebp_.jpg",
      "description": "Easier Faster Connection: Upgraded bluetooth wifi technology allows you could connect your mini wifi smart outlet with your smartphone automatically on POPOTAN app via your bluetooth function (Compatible with Smart Life app too). Only support 2.4Ghz wifi network.     Manual Remote Control : Plug the home equipment into mini smart plug, download the free app, Smart Life, then control your home appliances from your phone . Wi-Fi enabled, No hub or subscription required.     Voice Control : Control your home appliances with the smart home outlet by giving voice command. it will automatically turn on/off.     Schedule Setting : Create customized timer to automatically turn on or off your home electronics and appliances. Allow you to prevent power-hungry devices from being left on longer than needed. It will make your life easier and smarter.     Create Group & Share to All : Set a group for all Wi-Fi Smart Plugs and control them in one command. Share your smart plug to all family members in a minute. No more worries, everyone can control it easily.",
      "details": {
        "brand": "Aoycocr",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "Easier Faster Connection: Upgraded bluetooth wifi technology allows you could connect your mini wifi smart outlet with your smartphone automatically on POPOTAN app via your bluetooth function (Compatible with Smart Life app too). Only support 2.4Ghz wifi network."
      }
    },
    {
      "id": "B0948ZZZJP",
      "name": "Govee Smart Plug 15A, WiFi Bluetooth Outlets 4 Pack Work with Alexa and Google Assistant, WiFi Plugs with Multiple Timers, Govee Home APP Group Control Remotely, No Hub Required, ETL&FCC Certified",
      "ratings": 5.072,
      "price": "$29.99",
      "image": "https://m.media-amazon.com/images/I/319nDi8kRhL._SY445_SX342_QL70_FMwebp_.jpg",
      "description": "More Stable Connectivity: Use Govee Home App to access the Smart Plug via WiFi and Bluetooth, enjoy powerful control and convenient features with wifi plug control all your home appliances and devices anywhere & anytime. Note: Don't support 5G WiFi.     Smart Voice Control: Simply say a few words to Alexa or Google Home for true hands-free control of wifi smart outlets, meaning more time resting on the sofa, gaming and watching movies. Note: Please download Govee Home App to control wifi plugs.     Scheduling & Group Controller: Create customized schedules to power your electronic appliances on/off automatically for helping save energy and money. And with a single tough of one button, you can manage multiple smart plug for alexa simultaneously.     Designed for Practicality: Specially compact sized and shaped to only take up one outlet at a time and leave others free. And 15A 120V smart plug is suitable for more high-power appliances such as coffee maker than 10A.     Safety as Priority: Wifi outlet not only fully FCC and ETL certified, but also uses fire-resistant material and construction to be a safe smart partner. Note: Users must create a new Govee Home App account or be logged in to use this Wi-Fi Plug.     This smart plug is ETL certified, ensuring it meets stringent safety standards for reliable and secure operation.",
      "details": {
        "brand": "Govee",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "White",
        "ram": "N/A",
        "detail_item": "More Stable Connectivity: Use Govee Home App to access the Smart Plug via WiFi and Bluetooth, enjoy powerful control and convenient features with wifi plug control all your home appliances and devices anywhere & anytime. Note: Don't support 5G WiFi."
      }
    },
    {
      "id": "B07WRFCXL9",
      "name": "HBN Smart Plug Mini 15A, WiFi Smart Outlet Works with Alexa, Google Home Assistant, Remote Control with Timer Function, No Hub Required, ETL Certified, 2.4G WiFi Only, 4-Pack",
      "ratings": 16.412,
      "price": "$19.99",
      "image": "https://m.media-amazon.com/images/I/3128eThUaPL._SY445_SX342_QL70_FMwebp_.jpg",
      "description": "CONTROL FROM ANYWHERE - Turn lights, fans, and appliances on or off automatically from anywhere in the world with your smartphone anytime via the HBN Smart app.     TIMER AND SCHEDULE SETTING- Use timer or countdown schedules to automatically turn on and off any home electronics and appliances such as lamps, fans, humidifier, Christmas lights etc. For example, setting lights to come on at dusk or turning off at sunrise to reduce energy consumption and save money.     VOICE CONTROL - Simply voice command to control multiple home devices with our smart outlet via Alexa or Google Home. Enjoy the hands convenience of controlling any home electronic appliances. Made for everyone, Perfect for elderly, disabled or if the plug is hard-to-reach.     GROUP CONTROL & FAMILY SHARE- Set a scene for controlling all outlets with one command. Share the HBN Smart app with your family members to control devices.     EASY TO INSTALL - Download the HBN Smart App and follow the instructions to connect the smart plugs. No Hub Required, works with 2.4GHz network. ETL certified for safety use.",
      "details": {
        "brand": "HBN",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "CONTROL FROM ANYWHERE - Turn lights, fans, and appliances on or off automatically from anywhere in the world with your smartphone anytime via the HBN Smart app."
      }
    },
    {
      "id": "B095KG3M4Y",
      "name": "Govee Dual Smart Plug 4 Pack, 15A WiFi Bluetooth Outlet, Work with Alexa and Google Assistant, 2-in-1 Compact Design, Govee Home App Control Remotely with No Hub Required, Timer, FCC and ETL Certified",
      "ratings": 5.335,
      "price": "$39.99",
      "image": "https://m.media-amazon.com/images/I/31IG6Y+uJzL._SX342_SY445_.jpg",
      "description": "Wireless App Control: Use the Govee Home App to access the Smart Plug via WiFi and Bluetooth to enjoy powerful control and convenient features no matter where you are. Note: Don't support 5G WiFi.     Smart Voice Control: Compatible with Alexa and Google Assistant for hands-free on/off control of your plugged-in devices and appliances. Note: Users must create a new Govee Home App account or be logged in to use this Wi-Fi Plug.     Compact 2-in-1 Design: With 2 horizontally-positioned plugs, Dual Smart Plug only covers a single outlet in a normal vertical outlet fixture. Which expand your 2-socket fixtures into 4 smart outlets. Each sockets can be controlled independently.     Set Automated Timers: Create customized timers and on/off schedules for all your devices and electronic appliances powered by Smart Plug, helping to save on energy and monthly bills.     Easy to Set Up: Simply plug in Smart Plug, download the free Govee Home App to your phone, then follow the simple instructions to add the \"H5082\" Smart Plug. Set up only takes a minute and no other physical hub is required for wireless control.     This smart plug is ETL certified, ensuring it meets stringent safety standards for reliable and secure operation.",
      "details": {
        "brand": "Govee",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "Wireless App Control: Use the Govee Home App to access the Smart Plug via WiFi and Bluetooth to enjoy powerful control and convenient features no matter where you are. Note: Don't support 5G WiFi."
      }
    },
    {
      "id": "B084JHJBQT",
      "name": "meross Smart Plug Mini, 15A & Reliable Wi-Fi, Support Apple HomeKit, Siri, Alexa, Echo, Google Assistant and Nest Hub, App Control, Timer, No Hub Needed, 2.4G WiFi Only, 4 Pack",
      "ratings": 6.585,
      "price": "$39.99",
      "image": "https://m.media-amazon.com/images/I/61KNmAv7oJL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Remote Control: To enable HomeKit remote control, you need a HomePod, an Apple TV 4K, Apple TV HD, or an iPad. Set any of these Apple devices in your house as a HomeKit bridge and connect it to your home 2.4GHz Wi-Fi network. Keep in mind that once your HomeKit bridge is set up, it has to be kept online. If it is powered off or disconnected from the Wi-Fi, it will fail to respond when you intend to control the device remotely.     Voice Control: You can control your devices hands free, just give voice commands to turn on/off the connected devices. Compatible with Apple HomeKit, Apple Watch, Siri, Carplay, Amazon Alexa, Google Assistant.     Compact Size: Smart plug occupies only one socket, the device allows you to stack two mini smart plugs in the same outlet, which is convenient and practical.     Schedule: You can schedule connected devices to turn on and off automatically by smart plugs. Save energy when lights are not needed or left on by accident. Sunrise and sunset setting are supported.     Quality: Smart outlet is made of PC flame retardant material, and has been approved for safety and quality assurance. Certified by ETL and FCC, it supports home appliance up to 15A.",
      "details": {
        "brand": "meross",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "Remote Control: To enable HomeKit remote control, you need a HomePod, an Apple TV 4K, Apple TV HD, or an iPad. Set any of these Apple devices in your house as a HomeKit bridge and connect it to your home 2.4GHz Wi-Fi network. Keep in mind that once your HomeKit bridge is set up, it has to be kept online. If it is powered off or disconnected from the Wi-Fi, it will fail to respond when you intend to control the device remotely."
      }
    },
    {
      "id": "B07QPZ5WMW",
      "name": "KMC Smart Plug Mini 4-Pack, Wi-Fi Outlets for Smart Home, Remote Control Lights and Devices from Anywhere, No Hub Required, ETL Certified, Works with Alexa and Google Home",
      "ratings": 11.076,
      "price": "$19.99",
      "image": "https://m.media-amazon.com/images/I/61pYQz04ifL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "COMPATIBILITY: Works with Alexa & Google Assistant. No Hub Required. Requires a secured 2.4 GHz Wi-Fi network and a device running Android or iOS.     VOICE CONTROL: Control your Smart Plug Mini by saying \"Alexa\" or \"Hey Google\". Seamlessly integrates with your existing smart speakers and routines.     SCHEDULING & AUTOMATION: The KMC Smart app allows you to automate your connected devices based on conditions like time, sunrise/sunset, weather, device status and more.     EASY SETUP & SHARING: Simply download the KMC Smart app and follow the in-app instructions to get started. With a few taps you can also share control of your device with family or friends.     WARRANTY & SUPPORT: UL/ETL Certified. Lifetime Warranty. US-based Customer Support.     ELECTRICAL RATING: 15A 125V 60Hz 1875W",
      "details": {
        "brand": "KMC",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "COMPATIBILITY: Works with Alexa & Google Assistant. No Hub Required. Requires a secured 2.4 GHz Wi-Fi network and a device running Android or iOS."
      }
    },
    {
      "id": "B082YD8C4R",
      "name": "Geeni DOT Smart Wi-Fi Outlet Plug, White, (2 Pack) – No Hub Required – Works with Amazon Alexa and Google Assistant, Requires 2.4 GHz Wi-Fi",
      "ratings": 5.192,
      "price": "$19.99",
      "image": "https://m.media-amazon.com/images/I/81if14cGLdL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "SMART OUTLET PLUG: Each Geeni DOT Smart Wi-Fi Outlet Plug lets you control your plugged in device from anywhere, at any time. Take up less space with this in-wall option that’s ideal for your living room, kitchen, even your bedroom.     NO HUB REQUIRED: This smart plug works with your home Wi-Fi—no hub required! Simply download the Geeni app, install your outlet and connect. It also works with Alexa and Google Assistant     COMPATIBILITY: The Geeni DOT Smart Wi-Fi Outlet Plug is only compatible with 2. 4GHz Wi-Fi networks. Installation is easy. Simply plug in your DOT Smart outlet and plug in your device to start using!     CONTROL FROM ANYWHERE: Using your home Wi-Fi, remotely control your outlet from anywhere. Give your outlet a unique name for accurate control. Too tired to get up? Ask Alexa to turn your bedroom lamps off when it’s bedtime     UNIVERSAL APP: The Geeni app works with all Geeni smart home devices, allowing easy control of your home from your Android or iOS smartphone. Your home, One app for all. Allow your family, neighbors, and guests to access all your Geeni Smart Home devices.",
      "details": {
        "brand": "Geeni",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "White",
        "ram": "N/A",
        "detail_item": "SMART OUTLET PLUG: Each Geeni DOT Smart Wi-Fi Outlet Plug lets you control your plugged in device from anywhere, at any time. Take up less space with this in-wall option that’s ideal for your living room, kitchen, even your bedroom."
      }
    },
    {
      "id": "B08YPFFM58",
      "name": "Lutron Caseta Smart Lighting Weatherproof+ Outdoor Smart Plug for Lights and Motors, Works w/ Alexa, Apple Homekit, Google Home (Hub Required), 15A LED Fixtures & 1/2 HP Motors, PD-15OUT-BL, Black",
      "ratings": 1.107,
      "price": "$79.93",
      "image": "https://m.media-amazon.com/images/I/51BAUATusnL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "MEET YOUR SMART YARD: Experience the delight of returning to a home alive with light; perfect for patio string lights, landscape lights, holiday lights (up to 1,000 ft!), pond or fountain pumps, and more     BUILT TO LAST: Polycarbonate body, and fully protected internal electronics, make for a smart outdoor plug that just works - year after year     WEATHERPROOF+: IP66 rated; built to protect against severe rainfall, dust, and dirt     CONTROL YOUR WAY: Caseta puts the smarts in the switch so you can control your lights a variety of ways - via the free Lutron app, your voice, with a wireless Pico remote, or from the switch itself (Caseta Smart Hub, L-BDG2-WH, required; Pico sold separately)     ULTRA-RELIABLE AND ULTRA-FAST: Uses Clear Connect technology (not Wi-Fi), so your connection is strong and responsive, and avoids issues like Wi-Fi drop out and lag (Caseta Smart Hub required)     WORKS WITH: Add a Caseta Smart Hub (L-BDG2-WH) to use with Alexa, Google Assistant, Apple Home, Ring, and more     TOSS THE TIMER: Unlike traditional timers, the outdoor smart plug stays on the right time year-round, even as the seasons change and with Daylight Savings (Lutron Caseta Smart Hub required)",
      "details": {
        "brand": "N/A",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "Black",
        "ram": "N/A",
        "detail_item": "MEET YOUR SMART YARD: Experience the delight of returning to a home alive with light; perfect for patio string lights, landscape lights, holiday lights (up to 1,000 ft!), pond or fountain pumps, and more"
      }
    },
    {
      "id": "B08HQ2N235",
      "name": "meross Outdoor Smart Plug Compatible with Apple HomeKit, Siri, Alexa, Google Assistant and SmartThings, Waterproof Outdoor Outlet, Remote & Voice Control, Timer, FCC and ETL Certified",
      "ratings": 3.63,
      "price": "$20.99",
      "image": "https://m.media-amazon.com/images/I/41Mo+KX5GuL._SX342_SY445_.jpg",
      "description": "Ideal for Outdoor Use: IP44 weatherproof housing and sockets cover which help prevent rain from getting in. Outdoor smart plug is made for Garden, Backyard, Christmas tree, Kitchen, Landscape lighting, Bathroom, Porch, Balcony, Garage, Basement, Patio or Electric grill, Sprinkler, Washing machine, Lamps and other outdoor or indoor-use electric appliances, etc. Do not use it for pump     2 Individual Outlets and reliable connection: Comes with 2 AC sockets that can be controlled independently. Powered by Mediatek IoT chipset, meross outdoor smart outlet has longer connection range and lower offline rate     Remote and Voice Control: Only supports meross app. Compatible with Apple HomeKit (iOS 13 or above), Apple Watch, Siri, Amazon Alexa, Google Assistant and SmartThings. All data is securely transmitted and stored using Amazon AWS servers in US. Note: HomeKit remote control requires additional Apple device as a home hub such as HomePod or Apple TV. Control your devices via voice command, just say:“Hey siri, turn on the Sprinkler.”     Schedule and Timer Setting: Schedule each socket to turn on and off automatically. You can prepare your schedule in advance and will not forget to turn off the outdoor plug, decreasing electrical waste. Support sunrise and sunset setting     Multi-compatible & Safety: The smart outdoor plug is compatible with a variety of light bulbs: LED CFL and INC. Certified by FCC/ETL(Control Number 5012797). Upgrade Version outdoor plug equipped with fire-retardant housing and overload protection circuit",
      "details": {
        "brand": "meross",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "Ideal for Outdoor Use: IP44 weatherproof housing and sockets cover which help prevent rain from getting in. Outdoor smart plug is made for Garden, Backyard, Christmas tree, Kitchen, Landscape lighting, Bathroom, Porch, Balcony, Garage, Basement, Patio or Electric grill, Sprinkler, Washing machine, Lamps and other outdoor or indoor-use electric appliances, etc. Do not use it for pump"
      }
    },
    {
      "id": "B07SV59WXL",
      "name": "Feit Electric Smart Plug, WiFi Plug Works with Alexa and Google Home, Indoor Plug, No Hub Required, 2.4Ghz Network, Remote Control from Anywhere, 15 AMP, Smart Outlet Plug, White",
      "ratings": 2.018,
      "price": "$9.99",
      "image": "https://m.media-amazon.com/images/I/71+hsAMjrPL._AC_SY300_SX300_.jpg",
      "description": "✅ WIFI ENABLED TO CONTROL FROM ANYWHERE – Compatible with 2.4 GHz Wifi network. Control your appliances through through your wifi plug with the Feit Electric App from anywhere in or outside your home. The smartphone app allows for sharing so multiple users can control.     ✅ VOICE CONTROL FOR SMART HOME – These smart plugs are compatible with Alexa and Google Home Assistant. Enjoy hands free operation. Once connected control your indoor plugs to turn your appliances on/off or set a schedule.     ✅ SET YOUR ROUTINE & SAVE ENERGY – With the Feit Electric app you can control entire rooms, unique groupings, or set a schedule to turn your appliances off/on at a certain time to save energy.     ✅ COMPACT DESIGN – The plug design allows for easy use of other adjoining outlets. Smallest 15A outlet available; compact design; ideal for holiday lighting, heaters, fans, lamps, appliances, water kettles, coffee machine.     ✅ EFFICIENT & TRUSTED – Feit Electric completes quality testing to ensure this indoor smart plugs that work with alexa only, use15 amps, passes safety standards, and will last indoors",
      "details": {
        "brand": "Feit Electric",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "✅ WIFI ENABLED TO CONTROL FROM ANYWHERE – Compatible with 2.4 GHz Wifi network. Control your appliances through through your wifi plug with the Feit Electric App from anywhere in or outside your home. The smartphone app allows for sharing so multiple users can control."
      }
    },
    {
      "id": "B07S57PQSM",
      "name": "Kasa Smart Plug HS103P3, Smart Home Wi-Fi Outlet Works with Alexa, Echo, Google Home & IFTTT, No Hub Required, Remote Control,15 Amp,UL Certified, White, 3 Count (Pack of 1)",
      "ratings": 19.759,
      "price": "$15.99",
      "image": "https://m.media-amazon.com/images/I/311Ahak4KIL._SY445_SX342_QL70_FMwebp_.jpg",
      "description": "Voice control: Kasa smart plugs that work with Alexa and Google Home Assistant. Enjoy the hands-free convenience of controlling any home electronic appliances with your voice via Amazon Alexa or Google Assistant     Smart Outlet Control from anywhere: Turn electronics on and off your smart home devices from anywhere with your smartphone using the Kasa app, whether you are at home, in the office or on vacation     Scheduling: Use timer or countdown schedules to set your wifi smart plug to automatically turn on and off any home electronic appliances such as lamps, fan, humidifier, Christmas lights etc.     Easy set up and use: 2.4GHz Wi-Fi connection required. Plug in, open the Kasa app, follow the simple instructions and enjoy     Trusted and reliable: Designed and developed in silicon valley, Kasa is trusted by over 5 Million users and being the reader’s choice for PCMag 2020. UL certified for safety use.",
      "details": {
        "brand": "Kasa Smart",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "White",
        "ram": "N/A",
        "detail_item": "Voice control: Kasa smart plugs that work with Alexa and Google Home Assistant. Enjoy the hands-free convenience of controlling any home electronic appliances with your voice via Amazon Alexa or Google Assistant"
      }
    },
    {
      "id": "B007QVW3MO",
      "name": "Leviton 3W102-E Clamptite Hinged Cord Outlet, 2-Pole, 3-Wire, 125V, 15A, Thermoplastic, Black",
      "ratings": 3.193,
      "price": "$4.47",
      "image": "https://m.media-amazon.com/images/I/81hqiZJZX4L.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Ideal for replacement of plugs on tools, appliances and extension cords     Hinged design provides fast, easy assembly     Rugged PVC plug and connector resists moisture and chemicals     Built-in cord grip adjusts automatically for use with 18-12 AWG.     Total Power Outlets: 1",
      "details": {
        "brand": "Leviton",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "Black",
        "ram": "N/A",
        "detail_item": "Ideal for replacement of plugs on tools, appliances and extension cords"
      }
    },
    {
      "id": "B095XBHVF2",
      "name": "Amazon Basics Smart Plug Rectangular Power Strip with 3 Individually Controlled Outlets and 2 USB-A Ports, Works with Alexa Only, 2.4 GHz Wi-Fi, No Hub Required, White",
      "ratings": 4.654,
      "price": "$21.99",
      "image": "https://m.media-amazon.com/images/I/51tf6OzxwML.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "SMART UPGRADE: Amazon Basics Smart Power Strip works with Alexa to add voice control to your home; an easy upgrade from your traditional power strip     CERTIFIED FOR HUMANS: Struggle-free, tinker-free, stress-free. Smart home made easy for non-experts     CONTROL FROM ANYWHERE: Schedule lights, fans, and appliances to turn on and off automatically, or control them remotely when you’re away     SIMPLE TO SET UP AND USE: Plug in the power strip, open the Alexa app, and get started in minutes     INDIVIDUAL CONTROL OR GROUPING: Includes 3 independently controllable outlets plus 2 always-on USB ports. Control each outlet individually by voice or remotely; or create groups in the Alexa app to combine devices together     NO SMART HOME HUB REQUIRED: Set up routines and schedules through the Alexa app; 2.4GHz Wi-Fi required; works exclusively with Alexa     SURGE PROTECTION: Keeps devices safe from potentially damaging power surges",
      "details": {
        "brand": "Amazon Basics",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "White",
        "ram": "N/A",
        "detail_item": "SMART UPGRADE: Amazon Basics Smart Power Strip works with Alexa to add voice control to your home; an easy upgrade from your traditional power strip"
      }
    },
    {
      "id": "B07QR9KRJL",
      "name": "Smart plug 4 Packs, KTMC Mini Wifi Outlet Compatible with Alexa, Google Home, No Hub Required, Remote Control Your Home Appliances from Anywhere, ETL Certified",
      "ratings": 396,
      "price": "$17.49",
      "image": "https://m.media-amazon.com/images/I/51k-rGI55YL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Smart Remote: the smart plug works with amazon alexa and google home to manage your home devices via voice control. when you use the smart life app, you can remotely and intelligently control home appliances from your phone or tablet.     Smart and Easier Life: By setting schedules and timers for the tamp, you can prepare a crock pot meal and get home with dinner's ready,turn off your nightstand light after sleeping.     Forget to shut things down? Forget to turn on/off your tamp or fan? Worry about overcharging? Want to give the appearance of someone is home? KTMC Smart Plug can help you control your home appliances, eliminate wasteful standby power and reduce energy use, save on your electric bills and extend product life.     Setup Is Simple: the smart plug connects to the internet via a wifi network, no hub required, just plug it into a socket and connect to your wi-fi network via app smart life. you can wirelessly control your home appliances anytime, anywhere.     Quality and Service Guarantee: The mini plug is made of PC flame resistance material and has been approved for safety and quality assurance ( ETL and FCC certificate). If there is any quality problem with the smart plug, please feel free to contact us and we will find a solution before you are satisfied.",
      "details": {
        "brand": "KTMC",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "White",
        "ram": "N/A",
        "detail_item": "Smart Remote: the smart plug works with amazon alexa and google home to manage your home devices via voice control. when you use the smart life app, you can remotely and intelligently control home appliances from your phone or tablet."
      }
    },
    {
      "id": "B082TT98GB",
      "name": "Outdoor Smart WiFi Plug, HBN Heavy Duty Wi-Fi Timer with Two Grounded Outlet, Wireless Remote Control by App Compatible with Alexa and Google Home Assistant 2.4 GHz Network only, ETL Listed (1 Pack)",
      "ratings": 7.929,
      "price": "$15.19",
      "image": "https://m.media-amazon.com/images/I/61zgKIHb1mL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Independent Outlet Controls：HBN outdoor smart plugs with 2 individually controlled outlets feature space-saving for users, which can work independently of one another.     Remote and Voice Control：Turn electronics on or off from anywhere with your smartphone using the HBN Smart App or by simply giving voice commands to Amazon Alexa or Google Home Assistant. No Hub Required     Schedule and Timer Setting: Schedule the Smart Plug to automatically power most heavy duty electronics on and off as needed, like setting lights to come on at dusk or turn off at sunrise.     Outdoor & Indoor Use: Our plug is built with IP44 weatherproof, perfect for Landscape lighting, Garden, Backyard, Porch, Balcony, Christmas Tree, Sprinkler or other outdoor and indoor-use electric appliances where the home WiFi signal is stable.     Network security: Requires a secured 2.4 GHz wifi only network connection(does not support 5.0Ghz networks.) Trouble connecting? Try AP mode, ETL Listed (Products are guaranteed with our Hassle-free 15 months warranty).",
      "details": {
        "brand": "HBN",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "Black",
        "ram": "N/A",
        "detail_item": "Independent Outlet Controls：HBN outdoor smart plugs with 2 individually controlled outlets feature space-saving for users, which can work independently of one another."
      }
    },
    {
      "id": "B09BQRPM9V",
      "name": "meross Outdoor Smart Plug, Outdoor Wi-Fi Outlet with 3 Sockets Independently Compatible with Alexa, Google Home and SmartThings, IP44 Waterproof, Voice & Remote Control,Timer, FCC and ETL Certified",
      "ratings": 2.966,
      "price": "$19.99",
      "image": "https://m.media-amazon.com/images/I/41jHbDNWilL._SY445_SX342_QL70_FMwebp_.jpg",
      "description": "Ideal for Outdoor Use: IP44 weatherproof housing and sockets cover which help prevent rain from getting in. Outdoor smart plug is made for Garden, Backyard, Christmas tree, Kitchen, Landscape lighting, Bathroom, Porch, Balcony, Garage, Basement, Patio or Electric grill, Sprinkler, Washing machine, Lamps and other outdoor or indoor-use electric appliances, etc. Do not use it for pump.     3 Outlets Design: Equipped with 3 individually controlled sockets. 3 outlets WORK INDEPENDENTLY of one another. meross outdoor smart outlet has longer Wi-Fi connection range and lower offline rate. Please also make sure connect your Phone to 2.4GHz home Wi-Fi while setting up the outdoor Wi-Fi plug.     Remote and Voice Control: Compatible with Amazon Alexa, Google Home and SmartThings. All data is securely transmitted and stored using Amazon AWS servers in US. Control your devices via voice command, just say:“Alexa, turn on the Chrismas Tree.”     Schedule and Timer: Schedule each socket to turn on and off automatically. You can prepare your schedule in advance and will not forget to turn off the outdoor plug, decreasing electrical waste and environmentally friendly. Support sunrise and sunset setting.     Safety Guarantee: Certified by FCC/ETL(Control Number 5012797).Smart Wi-Fi outdoor plug is equipped with fire-retardant housing and overload protection circuit. Never allow other low quality plug endanger the safety of your family.",
      "details": {
        "brand": "meross",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "Ideal for Outdoor Use: IP44 weatherproof housing and sockets cover which help prevent rain from getting in. Outdoor smart plug is made for Garden, Backyard, Christmas tree, Kitchen, Landscape lighting, Bathroom, Porch, Balcony, Garage, Basement, Patio or Electric grill, Sprinkler, Washing machine, Lamps and other outdoor or indoor-use electric appliances, etc. Do not use it for pump."
      }
    },
    {
      "id": "B0948L7Z5W",
      "name": "GE CYNC Smart Plug, Indoor Bluetooth and Wi-Fi Outlet Socket, Works with Alexa and Google, Great Christmas Gifts for Men, Holiday Gift for Women, Perfect Dad Gifts (1 Pack)",
      "ratings": 2.656,
      "price": "$14.99",
      "image": "https://m.media-amazon.com/images/I/71bI50byP0L.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Smart Home Gift: Compatible with Google Home and Alexa (sold separately), smart plugs from Cync make your traditional devices smart by providing voice and app control at all times, even when you're away. Turn any Christmas Lights into smart ones.     Smart outlets make any electronic device smart: The Cync smart plug makes any lamp or electric device smart, so smart plugs and devices respond to voice commands as an entire smart home system.     Control smart plugs while away from home: Get added home security and convenience with the ability to control your electric devices away from home with these Wi-Fi outlets, so you never worry about leaving your iron on or coming home to a dark house.     Build your smart home with no hub required: The Cync smart plugs that work with Google Home and Alexa include a hub that connects directly to voice assistant devices, so you don't need to purchase a standalone bridge or hub.     Smart plug comes in a compact size: The Cync smart plugs that work with Alexa and Google Home feature a slim design that keeps the second outlet in standard wall outlets available to plug in another device or smart plug.",
      "details": {
        "brand": "Cync",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "Smart Home Gift: Compatible with Google Home and Alexa (sold separately), smart plugs from Cync make your traditional devices smart by providing voice and app control at all times, even when you're away. Turn any Christmas Lights into smart ones."
      }
    },
    {
      "id": "B086V3S2Q7",
      "name": "TREATLIFE Smart Dimmer Plug Outdoor Smart Plug Works with Alexa and Google Home, Light Dimmer APP Remote Control, Max Power 400W, IP44 for Dimmable Outdoor String Lights, Floor Lamp, Table Lamp",
      "ratings": 10.658,
      "price": "$22.99",
      "image": "https://m.media-amazon.com/images/I/61hshpK0rbL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Voice Control & 1%-100% Dimming: Enjoy seamless control over your outdoor lighting by adjusting brightness levels from 1% to 100% with Alexa or Google Assistant. Simply say, “Alexa, set my patio lights to 50%,” and control your lights hands-free. Compatible with up to 150W LED, 150W CFL, and 400W Incandescent bulbs, this feature is ideal for setting the perfect mood for special occasions like Thanksgiving, Christmas, or Valentine's Day, with precise dimming for any atmosphere     No Hub Required & App Control: Easily control your outdoor smart plug without the need for a hub. Simply plug it in and manage it remotely through the Smart Life or TreatLife app from anywhere, as long as your phone is connected to a secure 2.4 GHz Wi-Fi network (not compatible with 5.0 GHz). Wi-Fi coverage extends up to 300FT with no obstacles     Schedule & Sunrise/Sunset Mode: Set personalized schedules to automatically turn your lights on or off based on your daily routine. The outdoor dimmer also features sunrise and sunset modes, allowing you to automate lighting to turn on at dusk and off at dawn     Group Control & Vacation Mode: Easily group multiple smart plugs and control them all with a single command. Activate vacation mode to randomly turn lights on and off, creating the illusion that someone is home while you're away, enhancing your home's security     Reliable Support: With IP44 waterproofing, FCC certification, and fireproof ABS materials, this dimmer plug is safe for both indoor and outdoor use. For any issues, contact us to activate your warranty for quick assistance and complete peace of mind",
      "details": {
        "brand": "TREATLIFE",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "Black",
        "ram": "N/A",
        "detail_item": "Voice Control & 1%-100% Dimming: Enjoy seamless control over your outdoor lighting by adjusting brightness levels from 1% to 100% with Alexa or Google Assistant. Simply say, “Alexa, set my patio lights to 50%,” and control your lights hands-free. Compatible with up to 150W LED, 150W CFL, and 400W Incandescent bulbs, this feature is ideal for setting the perfect mood for special occasions like Thanksgiving, Christmas, or Valentine's Day, with precise dimming for any atmosphere"
      }
    },
    {
      "id": "B08BFGRY9C",
      "name": "meross Outdoor Smart Plug, Outdoor Wi-Fi Outlet with 3 Independent Sockets Compatible with Apple Homekit, Alexa and SmartThings, Voice & Remote Control, Timer, 2.4 GHz only",
      "ratings": 2.151,
      "price": "$24.80",
      "image": "https://m.media-amazon.com/images/I/41cV9rRaqgL._SY445_SX342_QL70_FMwebp_.jpg",
      "description": "3 Independent Outlets Design: Equipped with 3 individually controlled sockets. 3 outlets WORK INDEPENDENTLY of one another. Powered by Mediatek IoT chipset, meross outdoor smart outlet has longer Wi-Fi connection range and lower offline rate. Please also make sure connect your Phone to 2.4GHz home Wi-Fi while setting up the outdoor Wi-Fi plug     Ideal for Outdoor Use: IP44 weatherproof housing and sockets cover which help prevent rain from getting in. Outdoor smart plug is made for Garden, Backyard, Christmas tree, Kitchen, Landscape lighting, Bathroom, Porch, Balcony, Garage, Basement, Patio or Electric grill, Sprinkler, Lamps and other outdoor or indoor-use electric appliances, etc. DO NOT USE IT FOR PUMP and EXTREME CONDITION     Remote Control: To enable HomeKit remote control, you need a HomePod, an Apple TV 4K, Apple TV HD. Set any of these Apple devices in your house as a HomeKit bridge and connect it to your home Wi-Fi network. Keep in mind that once your HomeKit bridge is set up, it has to be kept online. If it is powered off or disconnected from the Wi-Fi, it will fail to respond when try to control the device remotely     Schedule and Timer: Schedule each socket to turn on and off automatically. You can prepare your schedule in advance and will not forget to turn off the outdoor plug, decreasing electrical waste and. Support sunrise and sunset setting     Voice Control: Control your devices via voice command, Note: HomeKit remote control requires additional Apple device as a home hub such as HomePod or Apple TV. Control your devices via voice command, just say:“Hey siri, turn on the Sprinkler.”     For Android users: It works with any Android smartphone or tablet with OS 4.1 or higher. Android users will have an effortless experiences when configure with Meross app. Then skill 'meross' with your smart speakers as you wish",
      "details": {
        "brand": "meross",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "3 Independent Outlets Design: Equipped with 3 individually controlled sockets. 3 outlets WORK INDEPENDENTLY of one another. Powered by Mediatek IoT chipset, meross outdoor smart outlet has longer Wi-Fi connection range and lower offline rate. Please also make sure connect your Phone to 2.4GHz home Wi-Fi while setting up the outdoor Wi-Fi plug"
      }
    },
    {
      "id": "B084JML1WN",
      "name": "meross Smart Plug Mini, 15A & Reliable Wi-Fi, Support Apple HomeKit, Siri, Alexa, Echo, Google Assistant and Nest Hub, App Control, Timer, No Hub Needed, 2.4G WiFi Only, 2 pack",
      "ratings": 4.966,
      "price": "$22.99",
      "image": "https://m.media-amazon.com/images/I/41hEj8HpiGL._SX342_SY445_QL70_FMwebp_.jpg",
      "description": "Remote Control: To enable HomeKit remote control, you need a HomePod, an Apple TV 4K, Apple TV HD, or an iPad. Set any of these Apple devices in your house as a HomeKit bridge and connect it to your home 2.4GHz Wi-Fi network. Keep in mind that once your HomeKit bridge is set up, it has to be kept online. If it is powered off or disconnected from the Wi-Fi, it will fail to respond when you intend to control the device remotely.     Voice Control: You can control your devices hands free, just give voice commands to turn on/off the connected devices. Compatible with Apple HomeKit, Apple Watch, Siri, Carplay, Amazon Alexa, Google Assistant.     Compact Size: Smart plug occupies only one socket, the device allows you to stack two mini smart plugs in the same outlet, which is convenient and practical.     Schedule: You can schedule connected home devices to turn on and off automatically by smart plugs. Save energy when lights are not needed or left on by accident. Sunrise and sunset setting are supported.     Quality: The mini plug is made of PC flame retardant material, and has been approved for safety and quality assurance. Certified by ETL and FCC, it supports home appliance up to 15A.",
      "details": {
        "brand": "meross",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "White",
        "ram": "N/A",
        "detail_item": "Remote Control: To enable HomeKit remote control, you need a HomePod, an Apple TV 4K, Apple TV HD, or an iPad. Set any of these Apple devices in your house as a HomeKit bridge and connect it to your home 2.4GHz Wi-Fi network. Keep in mind that once your HomeKit bridge is set up, it has to be kept online. If it is powered off or disconnected from the Wi-Fi, it will fail to respond when you intend to control the device remotely."
      }
    },
    {
      "id": "B07TVJ23X9",
      "name": "LoraTap Remote Control Outlet Plug Adapter with Remote, 656ft Range Wireless Switch for Lights and Household Appliances, No Hub Required, 16A/1760W, White, 2 Years Warranty",
      "ratings": 559,
      "price": "$19.99",
      "image": "https://m.media-amazon.com/images/I/31SAFmdfOrL._SY445_SX342_QL70_FMwebp_.jpg",
      "description": "Wall Switch and Portable Remote 2 in 1: This remote switch can mount on the magnetic plate base (fixed with magnet or double side adhesive tape on the back) or place directly on a magnetic surface like fridge and works as a traditional switch, or be taken off and used as a portable remote, which allows you to place it anywhere easy to reach     Compact Design & Easy to Use: 3 prong grounded single port power adapter with on off switch button, compatct design keeps the second outlet free, plug and play, just plug in the outlet socket, you can remotely control the device from anywhere in your house     Long Range Control: 915MHz RF wireless signal strong enough to go through walls and windows, indoor wireless appliance control ranges up to 100ft/30m, outdoor up to 656ft without interfering other electronics, ideal for hard-to-reach lights or appliances that do not have a switch     Convenient for Everyone: Simple, app-free control of your devices, each kit is pre-paired in the factory, no need to do pairing before use, easy for the elderly, children and people with limited mobility to use, giving users instant control over lamps, television, router, fan and more with a simple press of a button     Non-Interference & Memory Function: Each item has its unique ID, each kit is pre-programmed by default, several remote plug kits can work in one room without signal interference; LoraTap wireless light switch plug has memory function, if it was off, it remains off after a power outage to save energy and your electrical bill; LoraTap patented product with 2 years warranty, FCC, CE and RoHS certified",
      "details": {
        "brand": "LoraTap",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "Wall Switch and Portable Remote 2 in 1: This remote switch can mount on the magnetic plate base (fixed with magnet or double side adhesive tape on the back) or place directly on a magnetic surface like fridge and works as a traditional switch, or be taken off and used as a portable remote, which allows you to place it anywhere easy to reach"
      }
    },
    {
      "id": "B09JZLXXRX",
      "name": "GHome Smart Mini Plug, Wi-Fi Outlet Socket Compatible with Alexa and Google Home, Remote Control with Timer Function, No Hub Required, ETL FCC Listed (1 Pack), White",
      "ratings": 2.153,
      "price": "$7.99",
      "image": "https://m.media-amazon.com/images/I/41PhI0WZjqL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "VOICE CONTROL WHEN YOUR HANDS ARE FULL: Smart plugs that work with Alexa and Google Home Assistant. Just give a simple voice command to control your home devices with smart outlets via Alexa or Google Home Assistant. No hub required easy to install the smart life plugs. Mini wifi outlet only works with stable 2.4GHz network     APP REMOTE CONTROL FROM ANYWHERE: The mini google smart plug can help you control your home appliances from anywhere. You also can control your smart outlet via the App directly when you are away, as long as your phone access a secure 2.4 GHz Wi-Fi network. Ideal gift for elderly and physically challenged people who cannot move around and needs easy access to turn on/off a device.Our smart outlets also compatible with Smart Life App and Tuya App     NO NEED TO MANUALLY TURN ON/OFF, SCHEDULE IT: Easy to set up and add schedules to home appliances. Get ready to have a smart home and create customized schedule to automatically turn on/off any home electronic appliances such as Christmas lights, lamps, humidifier, fan, coffee maker, etc. Please note that the smart plug (10A Max,1200W) is not suitable for the appliances whose power is more than 10A,1200W (eg: air conditioner, microwave oven, induction cooker etc.)     CREATE GROUP & SHARE TO FAMILIES: Set a group for all wifi smart plugs and control them in one command. Share your wifi plug smart outlet to all family members in a minute. No more worries, everyone can control them easily.     EASY & SAFE! DON'T WASTE TIME ON INSTALLATION: Simply plug a device into the wifi plug and connect to your secured 2.4GHz network with phone APP. The smart socket uses high-quality materials and technology, such as V-0 flame-retardant thermoplastics, pure copper connectors and advanced PCBA boards. It can avoid fire hazards and provide overload protection to ensure the safety of family members. And ETL certification ensures complete protection for home.",
      "details": {
        "brand": "GHome Smart",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "VOICE CONTROL WHEN YOUR HANDS ARE FULL: Smart plugs that work with Alexa and Google Home Assistant. Just give a simple voice command to control your home devices with smart outlets via Alexa or Google Home Assistant. No hub required easy to install the smart life plugs. Mini wifi outlet only works with stable 2.4GHz network"
      }
    },
    {
      "id": "B08W8MJ2DZ",
      "name": "GE CYNC Outdoor Smart Plug, Bluetooth and Wi-Fi Outlet Socket, Weather Resistant Plug, Voice Control Outlet, Works with Alexa and Google, Great Christmas Gifts for Men, Holiday Gift for Women (1 Pack)",
      "ratings": 3.75,
      "price": "$20.99",
      "image": "https://m.media-amazon.com/images/I/716TrfVf26L.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Smart Home Gift: Turn traditional lights and devices into smart devices with the enhanced functionality of the Cync Outdoor Smart Plug like out of home control, scheduling, and scene setting. Turn any Christmas Lights into smart ones.     Schedule and control each socket individually or grouped together in the Cync App.     Control your lights from inside by pairing the Outdoor Smart Plug with a Google Assistant or Amazon Alexa device (sold separately).     Designed for outdoor use with weatherproof outlet covers and 3-prong plug compatibility.     Use with other Cync and C by GE devices, including switches, remotes, and motion sensor to control your lights and devices without going outside.",
      "details": {
        "brand": "Cync",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "Black",
        "ram": "N/A",
        "detail_item": "Smart Home Gift: Turn traditional lights and devices into smart devices with the enhanced functionality of the Cync Outdoor Smart Plug like out of home control, scheduling, and scene setting. Turn any Christmas Lights into smart ones."
      }
    },
    {
      "id": "B088PNCJFQ",
      "name": "TREATLIFE 4 Pack Smart Plugs Works with Alexa and Google Home, 7 Day Heavy Duty Programmable Timer, 1800W 15A WiFi Smart Outlet, Child Lock, Vacation Mode, Reliable WiFi Connection",
      "ratings": 5.675,
      "price": "$26.99",
      "image": "https://m.media-amazon.com/images/I/31XPc9fIYJL._SY445_SX342_QL70_FMwebp_.jpg",
      "description": "Note: Please be sure to download Treatlife APP, and then connect the Treatlife APP account to Alexa through 'Skills and Game'. You cannot directly connect the smart plug to Alexa through 'Add device' on the Alexa APP. 2.4GHz WiFi is required. Rating: 120V, 60Hz, 15A/1800W     Voice Control: Treatlife electric outlet timer works with Alexa and Google Assistant, is simple to set up and use, plugin, and pair to Alexa, and gives a simple voice command to control your home devices. \"Alexa, turn on the Christmas tree light now\" \"Okay\"     APP Remote Control: Control your home devices from anywhere. Even if you're not at home, you can control your timer outlet via APP directly, to avoid high energy bills and fire-hazards. You can also set the Child Lock, to prevent children from operating the timer plug outlet by mistake     Group Control and Devices Share: Create the Group in your APP, and connect multiple plug-in timers to one room, so you can turn everything on or off at once manually or via the APP. Share your timer plug with family members as short as one minute     Smart Away Mode: Set the plug timer to turn your devices on or off randomly to make it look like you're home even if you're not, to deter intruders, avoid property loss, and save costs on electricity",
      "details": {
        "brand": "TREATLIFE",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "Note: Please be sure to download Treatlife APP, and then connect the Treatlife APP account to Alexa through 'Skills and Game'. You cannot directly connect the smart plug to Alexa through 'Add device' on the Alexa APP. 2.4GHz WiFi is required. Rating: 120V, 60Hz, 15A/1800W"
      }
    },
    {
      "id": "B07X52W1J8",
      "name": "Minoston Matter Outdoor Smart Plug WiFi Heavy Duty Plug-in Outlet IP65 Waterproof, Compatible with Alexa Apple Home SmartThings Google Home, Smart Life, Remote Control, 15Amp Black (MP22M)",
      "ratings": 5.075,
      "price": "$17.99",
      "image": "https://m.media-amazon.com/images/I/4160ij0twVL._SY445_SX342_QL70_FMwebp_.jpg",
      "description": "[ONE APP TO CONTROL ALL YOUR MATTER DEVICES] With Matter inclusion, you don’t have to download and register multiple manufacturers’ apps whenever you buy a new device. This Matter smart plug device is directly compatible with Apple Home, Alexa, Google Home, SmartThings, and those above need a hub. But if you don't have a hub, downloading the app and including it by Smart Life or Minoston (update app required) works.     [Fast and Easy Setup] Simply plug in a device, connect to your Wi-Fi network, and download the app on your cellphone. No hub is required to add to Smart Life or Minoston APP. The hub and apps needs to be updated to the lastest version for Matter compatibility.. Note：It only supports 2.4GHz Wi-Fi network, not 5.0GHz Wi-Fi.     [Remote and Voice Control] Control the socket from anywhere anytime. Simply use your voice command to control your home devices. Control all your devices using your smartphone from anywhere, at any time. All you need is your home 2.4Ghz WiFi network and the free SmartLife app (on iOS or Android)     [Outdoor and Indoor Use] IP65 weather-resistant housing. Ideal for Garden, Backyard, Kitchen, Bathroom, Porch, Balcony, Garage, Basement, Patio or Electric grill, Sprinkler, Washing machine, Christmas tree, landscape lighting, fountains, lamps, pumps, and other outdoor or indoor-use electric appliances, etc.     [Schedule and Timer] You can schedule socket to turn on and off automatically. And added benefit of saving energy when the plugged-in appliances are not needed or are left on by accident. This smart plug supports setting dusk and sunset timers. The device can be turned on or off based on astronomical timing     [Child Lock and Sharing Device] The child lock of this smart plug can be set for the device to prevent it from accidentally opening or closing the device due to accidental touch. It is able to share the smart plug with your family or friends and control the device with them     [Association Controls and Scene Settings] This smart plug can be associated with other devices for one-click control. Supports setting scene settings for it to trigger controls based on the scene",
      "details": {
        "brand": "Minoston",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "Black",
        "ram": "N/A",
        "detail_item": "[ONE APP TO CONTROL ALL YOUR MATTER DEVICES] With Matter inclusion, you don’t have to download and register multiple manufacturers’ apps whenever you buy a new device. This Matter smart plug device is directly compatible with Apple Home, Alexa, Google Home, SmartThings, and those above need a hub. But if you don't have a hub, downloading the app and including it by Smart Life or Minoston (update app required) works."
      }
    },
    {
      "id": "B083JLS7KQ",
      "name": "BN-LINK Smart Wi-Fi Plug Outlet, Remote Control by App, Compatible with Alexa and Google Assistant, Weatherproof, Requires 2.4 GHz Wi-Fi, ETL Listed",
      "ratings": 2.103,
      "price": "$13.59",
      "image": "https://m.media-amazon.com/images/I/31w94NgZeyL._SY445_SX342_QL70_FMwebp_.jpg",
      "description": "The BN-LINK Outdoor Smart Plug allows you to control your outdoor lights, appliances, or any other device via Smartlife app or BN-LINK Smart app from wherever you are.     The BN-LINK Outdoor Smart Plug allows you to use your voice to turn on or off the device of your choice. You can also pre-set on/off schedules via app. No hub is required.     Ideal for controlling landscape lighting, holiday lights or other appliances. Suitable for outdoor applications under IP44 rating.     Simple set up, ready to go immediately. Plug in, download the free Smartlife app or BN-LINK Smart app and start controlling your lights and outdoor electronics from anywhere.     You can share control with your family, roommates or visitors. Only compatible with all 2.4 GHz Wi-Fi networks. 1875 watts 15 apm.",
      "details": {
        "brand": "BN-LINK",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "The BN-LINK Outdoor Smart Plug allows you to control your outdoor lights, appliances, or any other device via Smartlife app or BN-LINK Smart app from wherever you are."
      }
    },
    {
      "id": "B094YN5VZH",
      "name": "Amazon Basics - Smart In-Wall Outlet, Works with Alexa Only, 2.4 GHz Wi-Fi, No Hub Required, White, 2.8 x 1.85 x 4.57 inches",
      "ratings": 1.1,
      "price": "$26.99",
      "image": "https://m.media-amazon.com/images/I/71E8kyucaAL.__AC_SY300_SX300_QL70_FMwebp_.jpg",
      "description": "SMART UPGRADE: Amazon Basics Smart Outlet works with Alexa to add voice control to your home; an easy upgrade from your traditional outlet     SETUP REQUIREMENTS: Neutral wire and standard outlet box required (at least 2-inch deep), 2.4 GHz Wi-Fi     GUIDED INSTALLATION: The installation video gives you step-by-step guidance to setup your outlet; more support also provided in the user manual and troubleshooting guide     CONTROL FROM ANYWHERE: Schedule lights, fans, and appliances to turn on and off automatically, or control them remotely when you’re away     INDIVIDUAL CONTROL OR GROUPING: Control each socket individually by voice or remotely; or create groups in the Alexa app to combine devices together     NO SMART HOME HUB REQUIRED: Set up routines and schedules through the Alexa app; works exclusively with Alexa",
      "details": {
        "brand": "Amazon Basics",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "SMART UPGRADE: Amazon Basics Smart Outlet works with Alexa to add voice control to your home; an easy upgrade from your traditional outlet"
      }
    },
    {
      "id": "B07SXDCF7R",
      "name": "Feit Electric Smart Outdoor Plug, WiFi Waterproof Plug, 2 Grounded Sockets, Works with Alexa and Google Assistant, App Controlled, 15 Amp Indoor/Outdoor 2 Outlet Plug, Black, Plug/WiFi/WP",
      "ratings": 2.019,
      "price": "$23.23",
      "image": "https://m.media-amazon.com/images/I/31nIh5DLr4L._SY445_SX342_QL70_FMwebp_.jpg",
      "description": "✅ WIFI ENABLED TO CONTROL FROM ANYWHERE – Compatible with 2.4 GHz Wifi network. Control your outdoor lights through your outdoor smart outlet with the Feit Electric App from inside or outside your home. The smartphone app allows for sharing so multiple users can control.     ✅ CONTROL 2 OUTLETS AT ONCE – Outlets are not individually controlled but can be controlled together. These smart plugs are compatible with Alexa and Google Home Assistant. Enjoy hands free operation. Once connected control your smart plugs to turn your appliances on/off or set a schedule.     ✅ HOLIDAY GAME CHANGER – With the Feit Electric app you can control entire rooms, unique groupings, or set a schedule to turn your appliances off/on making it perfect for outdoor holiday lights, string lights or pathway lights.     ✅ WEATHERPROOF – ETL and wet location rated to withstand the tough weather. Ideal for outdoor applications such as fountains, ponds, small pools, lights and indoor applications as well.     ✅ EFFICIENT & TRUSTED – Feit Electric completes quality testing to ensure this indoor smart plug only, uses 15 amps, passes safety standards, is wet location rated and will last through the seasons",
      "details": {
        "brand": "Feit Electric",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "BLACK",
        "ram": "N/A",
        "detail_item": "✅ WIFI ENABLED TO CONTROL FROM ANYWHERE – Compatible with 2.4 GHz Wifi network. Control your outdoor lights through your outdoor smart outlet with the Feit Electric App from inside or outside your home. The smartphone app allows for sharing so multiple users can control."
      }
    },
    {
      "id": "B07JB5TQSG",
      "name": "Smart Plug, Smart Home Outdoor Etekcity WiFi Outlet with 2 Sockets for Outdoor Lights, Timer Function & Energy Monitoring, Works with Alexa & Google Home, Wireless Remote Control, ETL Listed, 1PACK",
      "ratings": 4.482,
      "price": "$25.60",
      "image": "https://m.media-amazon.com/images/I/61srharATLL.__AC_SY300_SX300_QL70_FMwebp_.jpg",
      "description": "Easy To Use: Control devices from your smartphone or through voice command with Alexa or Google Assistant with a one-time easy setup; It requires secured 2.4GHz Wi-Fi     Individual Outlet Design: Custom control each socket via VeSync app; 15A/1800W power rating supports two appliances; It's perfect for holiday lights, fountains, and indoor use     Schedules & Timers: Automatically schedule each socket; It monitors total power consumption with energy-monitoring function     Sunset & Sunrise Options: Coordinate socket schedules with local sunset and sunrise times; Ideal for automating holiday lights and patio decorations     Built Safe & Weatherproof Design: Includes surge, overload, overcurrent, and overheat protections; IPX4 waterproof, ETL listed, FCC certified",
      "details": {
        "brand": "Etekcity",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "Easy To Use: Control devices from your smartphone or through voice command with Alexa or Google Assistant with a one-time easy setup; It requires secured 2.4GHz Wi-Fi"
      }
    },
    {
      "id": "B07GS321RR",
      "name": "LoraTap Mini Remote Control Outlet Plug Adapter with Remote, 656ft Range Wireless Light Switch for Household Appliances, No Hub Required, 10A/1100W, White, 2 Years Warranty (One Remote + 2 Outlets)",
      "ratings": 801,
      "price": "$29.99",
      "image": "https://m.media-amazon.com/images/I/41FKQPm5J1L._SY445_SX342_QL70_FMwebp_.jpg",
      "description": "Wall Switch and Portable Remote 2 in 1: This remote switch can mount on the magnetic plate base (fixed with magnet or double side adhesive tape on the back) or place directly on a magnetic surface like fridge and works as a traditional switch, or be taken off and used as a portable remote, which allows you to place it anywhere easy to reach     Compact Design & Easy to Use: Mini 3 prong grounded single port power adapter with on off switch button, energy saving design, blue led light indicator, plug and play, just plug in the outlet socket, you can remotely control the device from anywhere in your house     Long Range Control: 915MHz wireless signal strong enough to go through walls and windows, indoor wireless appliance control ranges up to 100ft/30m, outdoor up to 656ft without interfering other electronics, ideal for hard-to-reach lights or appliances that do not have a switch     Convenient for Everyone: Simple, app-free control of your devices, each kit is pre-paired in the factory, no need to do pairing before use, easy for the elderly, children and people with limited mobility to use, giving users instant control over lamps, television, router, fan and more with a simple press of a button     Non-Interference & Memory Function: Each item has its unique ID, each kit is pre-programmed by default, several remote plug kits can work in one room without signal interference; LoraTap wireless light switch plug has memory function, it will remember the previous on/off mode after power is restored, if it was off, it remains off after a power outage to save energy and your electrical bill; LoraTap patented product with 2 years warranty, FCC, CE and RoHS certified",
      "details": {
        "brand": "LoraTap",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "Wall Switch and Portable Remote 2 in 1: This remote switch can mount on the magnetic plate base (fixed with magnet or double side adhesive tape on the back) or place directly on a magnetic surface like fridge and works as a traditional switch, or be taken off and used as a portable remote, which allows you to place it anywhere easy to reach"
      }
    },
    {
      "id": "B094NHXDMP",
      "name": "Mini Smart Plugs That Work with Alexa and Google Home, MONGERY WiFi Outlet Socket with Remote Control & Timer Function, No Hub Required, 2.4G WiFi (2 Pack)",
      "ratings": 822,
      "price": "$11.99",
      "image": "https://m.media-amazon.com/images/I/31gShzhJ-IL._SY445_SX342_QL70_FMwebp_.jpg",
      "description": "Voice Control- Smart plugs that work with Alexa and Google Home Assistant. Just give a simple voice command to control your home device with smart outlet via Alexa or Google Home Assistant. No hub required to install the wifi plug. The alexa outlet plug works with stable 2.4GHz network     Remote Control- Remote control to turn on or off the connected devices at any time through the Smart Life app even you are traveling outdoors. The wifi outlet plug only requires 2.4 GHz network, without the need for additional paid services. Just download \"Smart Life\" APP, then add the smart plug. Only need one minute to start your smart life     Timer Schedule Function- The timer outlet plug socket allows you to create schedules to automatically power on/ off your home appliances. You can control your home electronics according to your living habits, which not only facilitates life, but also saves energy     Device Sharing- Can share the smart plug with your family, multiple mobile phones are allowed to control one device. And you can create a group to turn on/off your home appliances with one tap. The Smart Wifi Plug made the relationships of you and your families more intimate     What you get- Smart plugs 2 pack with 12-Month Warranty and Lifetime Technology Support. Our smart home plug are of good quality, please contact us if you have any question",
      "details": {
        "brand": "MONGERY",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "Voice Control- Smart plugs that work with Alexa and Google Home Assistant. Just give a simple voice command to control your home device with smart outlet via Alexa or Google Home Assistant. No hub required to install the wifi plug. The alexa outlet plug works with stable 2.4GHz network"
      }
    },
    {
      "id": "B07BGLZKH1",
      "name": "Geeni Indoor/Outdoor Smart Plug Weatherproof, 1 Socket –No Hub Wireless Remote Control and Timer –Works with Amazon Alexa, Google Assistant, Requires 2.4 GHz Wi-Fi, Black",
      "ratings": 3.289,
      "price": "$14.99",
      "image": "https://m.media-amazon.com/images/I/71YuSoxtTTL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "OUTDOOR SMART PLUG: With Geeni’s Outdoor Wi-Fi Smart Plug, you can control your lighting, pumps, and other devices using your smartphone from anywhere, anytime. Turn on your holiday lights or schedule the sprinklers without even having to step outside.     NO HUB REQUIRED: This outdoor smart plug works with your home Wi-Fi—no hub required. Simply download the Geeni app, power your smart plug on or off and connect. It also works with Alexa, Google Assistant and Microsoft Cortana.     COMPATIBILITY: The weatherproof Geeni Outdoor Smart Plug is only compatible with 2. 4GHz Wi-Fi networks. When not in use, the sockets should remain capped with the included weather-resistant cover.     CONTROL FROM ANYWHERE: Using your home Wi-Fi, remotely turn your seasonal lights on or off from anywhere. Give your outdoor smart outlet a unique name for accurate control. Ask your voice assistant to turn your stereo on and get the pool party started.     UNBEATABLE FEATURES: The compact design allows for easy installation. Features like a hanging buckle, protection from dust and harsh weather, and shared access, the Geeni Outdoor Smart Plug makes controlling your outdoor spaces more convenient.",
      "details": {
        "brand": "N/A",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "OUTDOOR SMART PLUG: With Geeni’s Outdoor Wi-Fi Smart Plug, you can control your lighting, pumps, and other devices using your smartphone from anywhere, anytime. Turn on your holiday lights or schedule the sprinklers without even having to step outside."
      }
    },
    {
      "id": "B09JZDL3JN",
      "name": "GHome Smart Mini Smart Plug, WiFi Plug Outlet Timer Smart Socket Works with Alexa and Google Home, APP Control, No Hub Required, ETL FCC Listed, 2.4GHz WiFi Only",
      "ratings": 2.162,
      "price": "$25.99",
      "image": "https://m.media-amazon.com/images/I/615Twdlwu9L.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Voice Control: Mini smart plugs that work with Alexa and Google Home Assistant. Just give a simple voice command to control your home device. No hub is required to install the Alexa compatible plugs. Alexa outlet plugs work with a stable 2.4GHz network.     Use Smart Outlet for Christmas: Google smart Alexa plug can help you control your home appliances from anywhere. Even you are not at home, you can control your smart plug outlet via App directly. Ideal for someone who cannot move around very well and needs easy access to turn on/off a device.     Timer and Schedule: Create a customized timer and schedule to automatically power on or off any home electronics and appliances, such as disconnecting the charger from your fully charged phone, setting lights to come on at dusk, or turning off at sunrise, and so on. Reduce energy consumption and save money.     Safe and Reliable WiFi Plug: The Alexa controlled outlet adopts premium materials and techniques, such as V-0 flame retardant grade thermoplastics, pure copper connects, and advanced PCBA, which can avoid fire hazards and offer overload protection to keep your family safe. And ETL certification ensures complete protection.     Easy Setup and Quality Assured: Just plug a device into the mini wifi smart socket and connect to your secured 2.4GHz network with App. If you encounter any problem or need support, please do not hesitate to contact us. Our goal is customer satisfaction and we are committed to making it right for you.",
      "details": {
        "brand": "GHome Smart",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "New Mini Plug 4-Pack",
        "ram": "N/A",
        "detail_item": "Voice Control: Mini smart plugs that work with Alexa and Google Home Assistant. Just give a simple voice command to control your home device. No hub is required to install the Alexa compatible plugs. Alexa outlet plugs work with a stable 2.4GHz network."
      }
    },
    {
      "id": "B079KYHLDZ",
      "name": "meross Wi-Fi Smart Plug Mini, 15 Amp & Reliable Wi-Fi Connection, Support Alexa, Google Home, Remote Control, Timer, Occupies Only One Socket, 2.4G WiFi Only, 4 Pack",
      "ratings": 10.847,
      "price": "$24.99",
      "image": "https://m.media-amazon.com/images/I/31grrIzA29L._SX342_SY445_QL70_FMwebp_.jpg",
      "description": "Off-Line Control: When the internet is down, you can still use Meross app to control the devices under the same wifi. Routine Offline Control allows schedule and timer to be running even when internet is down. No hub Required, works with 2.4GHz network.     App Remote Control & Scene: The smart plug turn electronics on/off from anywhere anytime with Meross app. You can check to see the status of connected devices from anywhere anytime. A scene allows you to group your smart devices as you wish and control them simply by one tap. Create your ideal scene, to turn on/off fan, lamp, humidifier, coffee maker or any lights. Rated: 15A, 120V, 1800W (New Packaging).     Voice Control: Control your devices hands free with wifi smart outlet, just make a voice commands to turn on/off the connected devices. This wifi outlet compatible with the Amazon Alexa, Google Home and SmartThings.     Schedule and Timer: Set wifi smart plug connected devices to turn on and off automatically. With timer function, customize devices to turn on/off at certain time. A routine allows you to set schedule for you smart devices. Each device supports 32 routines.     Quality and Service : The mini smart plug is made of PC flame retardant material, has been approved for safety and quality assurance. Certified by ETL(5009830) and FCC(2AMUU-MSS110) in USA, PSE(18031354) and Telec(Mark Number JN0810 i01) in Japan. Any problem, please feel free to contact us without any hesitation and we’ll find a solution until you are satisfied.",
      "details": {
        "brand": "meross",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "white",
        "ram": "N/A",
        "detail_item": "Off-Line Control: When the internet is down, you can still use Meross app to control the devices under the same wifi. Routine Offline Control allows schedule and timer to be running even when internet is down. No hub Required, works with 2.4GHz network."
      }
    },
    {
      "id": "B08LPYXK6L",
      "name": "Alexa Smart Dimmer Plug, Treatlife Plug-in Lamp Dimmer Switch for Dimmable LED, CFL, Halogen and Incandescent Bulbs, Lamps, String Lights, Max Power 300W, Dual Outlets, 2.4GHz WiFi Only",
      "ratings": 1.772,
      "price": "$26.99",
      "image": "https://m.media-amazon.com/images/I/41awJ5ZUh6L._SY445_SX342_QL70_FMwebp_.jpg",
      "description": "Compatibility Alert: This Alexa smart plug is specifically designed for use with none-smart but dimmable LED bulbs (150W Max), CFLs (150W Max), and Halogens/Incandescents (300W Max). It is not compatible with smart bulbs or suitable for use with table or floor lamps controlled by their remote     Dual Outlet Convenience: Featuring two US-standard outlets, this smart plug allows simultaneous control of two lamps or string lights. Note that the outlets are not independently controllable, making it a convenient solution for areas with limited outlets. The space-saving design ensures the bottom outlet remains free when plugged into the top outlet     Seamless Voice Control & Dimming: Effortlessly integrate these smart plugs with Alexa, Google Assistant, and SmartThings for hands-free control. Enjoy the flexibility of adjusting brightness levels from 0-100%. Simply give a voice command like \"Alexa, dim the floor lamp to 80%\" to enhance your lighting experience     Sunrise Simulation & Sleep Aid: Elevate your daily routine with sunrise and sunset simulation. Customize fade in/out times and brightness levels to create a personalized ambiance for waking up or winding down. Ideal for Christmas decorations, this plug in dimmer caters to diverse lighting needs with user-friendly functionalities     Security and Convenience in One: Activate the Vacation Mode via the app to randomize ON/OFF schedules, creating the appearance of an occupied home while you're away. This not only deters intruders but also helps reduce electricity costs. The smart WiFi outlet operates independently without the need for a hub, ensuring a hassle-free experience. FCC Certified for peace of mind. Make your space smarter and more efficient with Treatlife's Alexa-compatible dimmable plug",
      "details": {
        "brand": "TREATLIFE",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "Compatibility Alert: This Alexa smart plug is specifically designed for use with none-smart but dimmable LED bulbs (150W Max), CFLs (150W Max), and Halogens/Incandescents (300W Max). It is not compatible with smart bulbs or suitable for use with table or floor lamps controlled by their remote"
      }
    },
    {
      "id": "B088FCQHF8",
      "name": "meross WiFi Dual Smart Plug, 15A 2-in-1 Smart Outlet, Support Apple HomeKit, Siri, Alexa, Echo, Google Home and SmartThings, Voice & Remote Control, Timer, No Hub Required, 2.4G Only, 2 Pack",
      "ratings": 2.961,
      "price": "$29.99",
      "image": "https://m.media-amazon.com/images/I/51vcyMTSoJL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Compact 2-in-1 Design: Meross 2 in 1 smart plug compatible with Alexa smart plugs allow you to get 2 spaced outlets with one plug. Mini enough but there is a wide place between the two sockets, no interference and more space-saving. It supports max total output of 15A.     Remote Control: To enable HomeKit remote control, you need a HomePod, an Apple TV 4K, Apple TV HD, or an iPad. Set any of these Apple devices in your house as a HomeKit bridge and connect it to your home WiFi network. Keep in mind that once your HomeKit bridge is set up, it has to be kept online. If it is powered off or disconnected from the WiFi, it will fail to respond when you intend to control the device remotely.     Voice Control: Compatible with Apple HomeKit, Apple Watch, Siri, Carplay, Amazon Alexa, Google Assistant and SmartThings. You can give simple voice commands to turn on/off the devices that are connected to smart plug dual. Just say \"Hey Siri, turn off the lamps.\" All data is securely transmitted and stored using AWS servers in US.     Timer Setting: Schedule the smart plugs or set auto-off timer routine to work automatically as needed, saving energy and money. Your data is securely transmitted and stored using AWS servers in US.     Easy Set up & Reliable Connection: Simply download the App, power on and configuration then you can enjoy the convenience of our products. And they have longer WiFi connection range and lower offline rate. FCC & ETL Certified.",
      "details": {
        "brand": "meross",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "Compact 2-in-1 Design: Meross 2 in 1 smart plug compatible with Alexa smart plugs allow you to get 2 spaced outlets with one plug. Mini enough but there is a wide place between the two sockets, no interference and more space-saving. It supports max total output of 15A."
      }
    },
    {
      "id": "B08D115X13",
      "name": "Geeni Smart Wi-Fi 4 Outlet Plug with Surge Protection, – No Hub Required – Compatible with Alexa, Google Home, White – 1-Pack",
      "ratings": 726,
      "price": "$19.99",
      "image": "https://m.media-amazon.com/images/I/41x6Y+C0LDL._SX342_SY445_.jpg",
      "description": "A SMART HOME SOLUTION: Geeni smart outlet plug extender is a hassle-free way to integrate your outlets with modern smart home technology. Works with Alexa and Google Home and for seamless operation using your homes 2.4 GHz WIFI.     SET TIMERS AND ROUTINES: Power small appliances, lamps and any plug-in device when and where you want. Set schedules and routines using the Geeni app that turn devices on and off at certain times throughout the day.     PLUG EXTENDER: Convert a standard 2-plug outlet into 4 plugs for more convenient power sourcing. These electric outlet extenders allow you to control each outlet individually, giving you full control     VOICE COMMAND POWER: Smart outlets that work with Google Home devices and Alexa so you can command power with the sound of your voice. Ensure there is power when you need it, and save money knowing it's off when you don't.     EASY TO INSTALL: Simply plug in, download the Geeni app and connect your smartphone to your Wi-Fi outlet plug or any of your Geeni smart devices. Bring everything together, group fixtures, and set light timers for lamps and other devices.",
      "details": {
        "brand": "Geeni",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "A SMART HOME SOLUTION: Geeni smart outlet plug extender is a hassle-free way to integrate your outlets with modern smart home technology. Works with Alexa and Google Home and for seamless operation using your homes 2.4 GHz WIFI."
      }
    },
    {
      "id": "B07DB3W915",
      "name": "Geeni Smart Surge Protector 6-Outlet Power Strip – Wi-Fi Enabled with Voice Control (Alexa, Google Assistant), Energy Monitoring, Surge Protection, 3ft Extension Cord, Remote Access",
      "ratings": 3.273,
      "price": "$24.99",
      "image": "https://m.media-amazon.com/images/I/518rdPoSOVL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "SMART EXTENSION CORD: With 6 individual smart outlets, everything you plug in can be independently turned on and off from anywhere using the Geeni app. 6 outlet, 460 joules surge protected, 125V, 3 ft cable     NO HUB REQUIRED: This smart surge protector works with your home Wi-Fi, no hub required! Simply download the Geeni app, power your extension cable on or off and connect wirelessly. Also works with Amazon Alexa, Google Assistant.     COMPATIBILITY: The Geeni 6-Outlet Extension Cord Smart Surge Protector is compatible with all 2.4GHz Wi-Fi networks. With 460 joules surge protected, 125V and the 3-foot cable, you can safely and conveniently plug in any device you want. Maximum Current:10     CONTROL FROM ANYWHERE: Using your home Wi-Fi, set a schedule or remotely control up to 6 different devices from anywhere. Give each outlet a unique name and use them separately. Ask your voice assistant to turn your stereo on or turn the lights on/off.     UNIVERSAL APP: The Geeni app works with all Geeni smart home devices, allowing easy control of your home from your Android or iOS smartphone. Allow your family, neighbors, and guests to access all your Geeni Smart Home devices.",
      "details": {
        "brand": "Geeni",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "White",
        "ram": "N/A",
        "detail_item": "SMART EXTENSION CORD: With 6 individual smart outlets, everything you plug in can be independently turned on and off from anywhere using the Geeni app. 6 outlet, 460 joules surge protected, 125V, 3 ft cable"
      }
    },
    {
      "id": "B081DWCYP3",
      "name": "Minoston Zwave Outlet Plug, Outdoor Z-Wave Plus Smart Plug, On/Off Switch, Z Wave Hub Required, IP65 Weather-Resistant, Built-in Repeater, Work with SmartThings, Wink, Alexa, Black (MP22Z)",
      "ratings": 1.036,
      "price": "$31.00",
      "image": "https://m.media-amazon.com/images/I/41NXAT8BBbL._SY445_SX342_QL70_FMwebp_.jpg",
      "description": "[Z-Wave 700 Chip Plug] This zwave outlet is bulit-in a zwave 700 chip. The zwave 700 series smart plugs are faster wireless, have a longer range and are more secure than the 500 series. It can up to 150ft in the open range.     [Compatibility] This z-wave outdoor plug can remotely control. It works with SmartThings, Vera, Wink, Fibaro, Homeseer, Ring, 2GIG, and Hubitat (change device type). CANNOT connect directly with ECHO PLUS! It is also compatible with ALEXA and GOOGLE ASSISTANT (requires a Z-Wave certified hub). Able to control with voice command.     [Ideal for Outdoor] The IP65 Weather-resistant housing of this zwave plug is ideal for the Garden, Backyard, Kitchen, Bathroom, Porch, Balcony, Garage, Basement, Patio or Electric grill, Sprinkler, Washing machine, Christmas tree, landscape lighting, fountains, lamps, pumps, and other outdoor or indoor-use electric appliances, etc.     [Compact but Powerful] This 700 Z-Wave outlet is mini but its max loading is up to 15A and 1875W. Its power is 125V, 60Hz. Z-Wave Frequency: 908.42MHz. FCC and ETL listed. It's compatible with LED, halogen, incandescent, xenon, fluorescent and compact fluorescent bulbs.     [Schedule and Countdown Timer] You can set automatic daily timers or create on/off routing so your outdoor smart plug can turn on and off automatically. And saving energy when the plugged-in appliances are not needed or are left on by accident.     [Easy to Setup] Pair this zwave outlet to your hub and plug in the device you want to remote control. Scan the QR code and press the button 3 times to pair it. Then you can use your cellphone to turn the device on/off, schedule an event, and group the devices you want to control together.     [Advanced Settings] If your zwave controller supports advanced settings, Minoston zwave outdoor smart plug allows setting parameters and supports scene settings.     [As a Z-Wave Repeater] This zwave plug can be used in Z-Wave home automation networks to extend the range and reliability of the Z-Wave signal. By repeating the signal, the repeater helps maintain a stable and reliable network.",
      "details": {
        "brand": "Minoston",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "Black",
        "ram": "N/A",
        "detail_item": "[Z-Wave 700 Chip Plug] This zwave outlet is bulit-in a zwave 700 chip. The zwave 700 series smart plugs are faster wireless, have a longer range and are more secure than the 500 series. It can up to 150ft in the open range."
      }
    },
    {
      "id": "B09LZ4F1CR",
      "name": "Geeni Switch Duo Double Smart Plug, White, 2 Outlets – No Hub Compatible with Alexa and Google Assistant, Requires 2.4 GHz Wi-Fi",
      "ratings": 178,
      "price": "$14.88",
      "image": "https://m.media-amazon.com/images/I/21sCADzcioL._SY445_SX342_QL70_FMwebp_.jpg",
      "description": "SMART OUTLET PLUG: Fit 2 plugs in 1 outlet with the Geeni Switch Duo Smart Wi-Fi Outlet Plug and control 2 devices from anywhere at any time. Take up less space with this 2-in-1 outlet option that’s ideal for your living room kitchen even your bedroom.     NO HUB REQUIRED: This smart outlet plug works with your home Wi-Fi—no hub required! Simply download the Geeni app install your outlet and connect. It also works with Alexa and Google Assistant.     COMPATIBILITY: The Geeni Switch Duo Smart Wi-Fi Outlet Plug is only compatible with 2.4GHz Wi-Fi networks. Installation is easy. Simply plug your devices into your smart outlet to start using!     CONTROL FROM ANYWHERE: Using your home Wi-Fi, remotely control your outlet from anywhere. Give each outlet a unique name and use them separately. Too tired to get up? Ask Alexa to turn your bedroom lamps off when it’s bedtime.     UNIVERSAL APP: The Geeni app works with all Geeni smart home devices allowing easy control of your home from your Android or iOS smartphone.",
      "details": {
        "brand": "Geeni",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "White",
        "ram": "N/A",
        "detail_item": "SMART OUTLET PLUG: Fit 2 plugs in 1 outlet with the Geeni Switch Duo Smart Wi-Fi Outlet Plug and control 2 devices from anywhere at any time. Take up less space with this 2-in-1 outlet option that’s ideal for your living room kitchen even your bedroom."
      }
    },
    {
      "id": "B08K45W4LR",
      "name": "Smart Plug, ZigBee Switch Mini Smart Outlet Works with ST, Alexa, Echo (4th gen) Echo Plus (2nd) Google Home, Works as a Range Extender, Hub Required （2 Pack）",
      "ratings": 570,
      "price": "$20.99",
      "image": "https://m.media-amazon.com/images/I/31UGvRAgZNL._SY445_SX342_QL70_FMwebp_.jpg",
      "description": "Why Zigbee?: Have a bunch of devices on your Wifi network？Overcrowded home Wifi network, internet becomging less stable？No worries! Hub + Zigbee, Very responsive, fast switching, more stable and Truly Plug and Play     Easy To Install and Wide Compatible: ZigBee smart plugs that work with alexa, , ST, Echo Studio, Echo Plus 2, Echo Show 2 and other Hub ZigBee 3.0. (Hub Required). No third party app required. NOTES: Does not work with ST(1st)     Quality: Our zigbee smart outlet block use PC fireproof material, double insulation, 750 ℃ thermo-resistant and flame retardant. Double security protection, leakage protection,high network security.     Smart Control: Alexa smart plug works with Amazon Alexa and Google home devices for complete voice control, remote control and Intelligent timing     What You Get: 2 x ZigBee Mini outlet, 1 x User Manual.Support worry-free warranty, 30 days free return, 12 months replacement/refund for manufacturer defective items. easy-to-reach customer service within 24 hours, plus lifetime technical support",
      "details": {
        "brand": "CMARS",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "Why Zigbee?: Have a bunch of devices on your Wifi network？Overcrowded home Wifi network, internet becomging less stable？No worries! Hub + Zigbee, Very responsive, fast switching, more stable and Truly Plug and Play"
      }
    },
    {
      "id": "B07DXDP662",
      "name": "Smart Light Switch, WiFi Switch Touch Wall Switch 1 Gang, Compatible with Alexa Google Home",
      "ratings": 3.334,
      "price": "$19.99",
      "image": "https://m.media-amazon.com/images/I/51awkPxvOlL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "【Easy Installation】This smart switch can replace any single-pole light switch. Not compatible with 3-way (multi-switch) lights. Neutral wire required. Not designed to work with metal face plates. Support 2.4GHz Wi-Fi Only (Not support 5G GHz Wi-Fi).     【Touch Control】The wifi light switch is with capacitive touch control, turn on/off your light at a single touch. New design with scratch resistance glass panel, gives the best look to blend with any wall design.     【Voice Control】 Compatible with Amazon Alexa (Echo/Dot/Tap) ,Google Assistant. Pair Light Switch with Amazon Alexa or Google Home to turn your lights on or off with your voice. No Hub required.     【Remote Control & Time Set】Control your lights from anywhere. Secure control using the Smart Life App when you are home or away. Custom schedules and set times, let your lights function automatically. On at sunset, off at bedtime     【GROUP CONTROL & DEVICE SHARING】Create a group in 'Smart Life' App, so you can trun on/off all the lights in the same group at the same time, And support control one device via many phones, you can share your smart switch to your family members.",
      "details": {
        "brand": "Lesim",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "【Easy Installation】This smart switch can replace any single-pole light switch. Not compatible with 3-way (multi-switch) lights. Neutral wire required. Not designed to work with metal face plates. Support 2.4GHz Wi-Fi Only (Not support 5G GHz Wi-Fi)."
      }
    },
    {
      "id": "B085XXL1GT",
      "name": "Refoss Smart Plug WiFi Outlet Work with Apple HomeKit, Siri, Alexa, Google Home, Smart Socket with Timer Function, Remote Control, No Hub Required, 15A, 2 Pack",
      "ratings": 2.166,
      "price": "$15.99",
      "image": "https://m.media-amazon.com/images/I/61bSGs4uV+S._AC_SY300_SX300_.jpg",
      "description": "Control from Anywhere: Remote Control allows you to switch your appliances on/off with a smart plug via smartphone/ Home APP whenever and wherever you are (with internet access). You can check the connected devices' status or set schedules for them.     Hands-free Voice Control: Control your smart wifi plug with just a simple voice command: \"Hey Siri, turn off the lamp\", \"Hi Alexa, turn on the washing machine\". Work with Amazon Alexa, google assistant, and Siri. Supporting 2.4 GHz secure WiFi network only.     Schedule Automatically: Set schedules as needed, then the smart plug will automatically turn on and off any home appliances according to the schedule you set even if the internet is down.     Compact Design: Use two mini smart outlets in compact size on one outlet without interfering with each other, easy to install and use.     What You Get More: Longer Wi-Fi connection range, lower offline rate. FCC & ETL Certified.",
      "details": {
        "brand": "Refoss",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "Control from Anywhere: Remote Control allows you to switch your appliances on/off with a smart plug via smartphone/ Home APP whenever and wherever you are (with internet access). You can check the connected devices' status or set schedules for them."
      }
    },
    {
      "id": "B08MFD75V5",
      "name": "Outdoor WiFi Outlet, Smart Outdoor Plug with 3 Ground Outlets, Compatible with Amazon Alexa, Google Assistant, Remote Control Outdoor Light Timer Outlet Waterproof, FCC Certified",
      "ratings": 234,
      "price": "$16.49",
      "image": "https://m.media-amazon.com/images/I/41pqbuJs6YL._SY445_SX342_QL70_FMwebp_.jpg",
      "description": "APP Remote Control & Voice Control: Remotely control the smart outlet through your phone from anywhere, anytime when you connected to 2.4 GHz WiFi; Compatible with Amazon Alexa, Google Assistant, use voice commands to control your outdoor devices, free of your hand and make your life more convenient     Timer & Schedule: Schedule the outlets to turn on or off your electronics automatically; Set timer and countdown, let your lamp lights up at dusk and off at dawn; save the energy and cut down on electricity expenses     Home Essential Tool: Ideal outdoor smart plug to control garden, backyard, porch, balcony, basement, landscape lighting; works great with holiday decorations, patio or electric grill, sprinkler, and other outdoor or indoor-use electric appliances     3 Grounded Outlets with Enhanced Durability: The 3 outlets work simultaneously to make life more efficient, no need to plug multi adapters; FCC & ETL certificated; Made of flame retardant PC material that can protect the smart outlet from high temperature; Rigorous quality control for safety in use     Outdoor Weather Resistant: You and your devices' safety is what we concerned about; Our outdoor wifi plug featured a watertight construction housing to protect the device from any damp or wet conditions; Please hang the outlet at least 2ft above the ground for safe use",
      "details": {
        "brand": "Syantek",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "Black",
        "ram": "N/A",
        "detail_item": "APP Remote Control & Voice Control: Remotely control the smart outlet through your phone from anywhere, anytime when you connected to 2.4 GHz WiFi; Compatible with Amazon Alexa, Google Assistant, use voice commands to control your outdoor devices, free of your hand and make your life more convenient"
      }
    },
    {
      "id": "B07R6CT3G7",
      "name": "Aoycocr Smart Plugs That Work with Alexa Echo Google Home for Voice Control, Smart Home Mini WiFi Outlet with Timer Remote Control Function, No Hub Required, ETL FCC Listed 4 Pack, 2.4GHz Network",
      "ratings": 5.527,
      "price": "$29.99",
      "image": "https://m.media-amazon.com/images/I/41JfqKJF4eL._SY445_SX342_QL70_FMwebp_.jpg",
      "description": "Easier Faster Connection: Upgraded bluetooth wifi technology allows you could connect your mini wifi smart outlet with your smartphone automatically on POPOTAN app via your bluetooth function. Only support 2.4Ghz wifi network.     Voice Control: Compatible with Amazon Alexa, Google Assistant, allowing control outlet through the use of simple voice commands. NOT CURRENTLY SUPPORT SmartThings, Homekit     Control from Anywhere: With the Aoycocr Smart app you can access and manage any small appliances from anywhere, creating a truly smart home experience all in one app - A secured 2.4GHz WiFi network is required     Schedule & Timer: Customized schedule lights, fans, and any home electronics or appliances to turn on and off automatically, or control them remotely when you’re away. Get ready to smart your home stuff and automation     More Important & Guaranteed: Device sharing allows you to share with your family members. FCC/ETLApproved and Overload protection provided complete security. No hub required",
      "details": {
        "brand": "Aoycocr",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "4",
        "ram": "N/A",
        "detail_item": "Easier Faster Connection: Upgraded bluetooth wifi technology allows you could connect your mini wifi smart outlet with your smartphone automatically on POPOTAN app via your bluetooth function. Only support 2.4Ghz wifi network."
      }
    },
    {
      "id": "B085M1TN58",
      "name": "Enbrighten, White, Wi-Fi Smart Light Switch, Indoor Oval Plug-in, 2-Grounded Outlet, Simultaneous Control, No Hub Required, 51253",
      "ratings": 272,
      "price": "$21.99",
      "image": "https://m.media-amazon.com/images/I/417yL8tZ+iL._SX342_SY445_.jpg",
      "description": "Voice Control     Easy-to-Use App     2.4GHz Wi-Fi Compatible     Simple Setup     Space-Saving Design",
      "details": {
        "brand": "Enbrighten",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "Voice Control"
      }
    },
    {
      "id": "B08HG81H3W",
      "name": "UltraPro Smart Plug WiFi Outlet, Smart Home, Smart Switch, Smart Outlet, Works With Alexa, Echo & Google Home, No Hub Required, App Controlled, ETL Certified, Electrical Outlet Switch, 4 Pack, 51411",
      "ratings": 945,
      "price": "$24.67",
      "image": "https://m.media-amazon.com/images/I/31WaXs-SWvL._SY445_SX342_QL70_FMwebp_.jpg",
      "description": "2.4GHz Wi-Fi Compatible – Connects to 2.4GHz networks of single-, dual- and tri-band routers through effortless pairing options for use with the latest home Wi-Fi equipment.     Voice Control – No hub required for voice commands through Amazon Alexa and Google Assistant.     Easy-to-Use App – Versatile UltraPro app available in the Apple App Store and Google Play simplifies network connection for hassle-free mobile operation of lights, fans and more. Alerts and do-not-disturb function allow personalized monitoring without inconvenient interruptions.     Simple Setup – Schedules and automations support full customization based on times, presets, weather, location and other factors. Organize devices by rooms and homes to control several locations from one app.     Space-Saving Design – 4 indoor plug-in switches each feature a grounded outlet with a manual ON or OFF button and only occupies one outlet of a duplex receptacle.",
      "details": {
        "brand": "UltraPro",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "Micro Single Outlet",
        "ram": "N/A",
        "detail_item": "2.4GHz Wi-Fi Compatible – Connects to 2.4GHz networks of single-, dual- and tri-band routers through effortless pairing options for use with the latest home Wi-Fi equipment."
      }
    },
    {
      "id": "B097P1NC65",
      "name": "Smart Wall Outlet, Tamper-Resistant Smart Electrical Outlet, Compatible with Alexa and Google Assistant, Wi-Fi Remote Control, Smart Receptacle with Timer and Schedule, ETL & FCC, 2.4 GHz Only",
      "ratings": 108,
      "price": "$10.49",
      "image": "https://m.media-amazon.com/images/I/31hm69WAHEL._SY445_SX342_QL70_FMwebp_.jpg",
      "description": "SMART IN-WALL OUTLETS: This wifi outlet lets you control 2 plugged in devices from anywhere at the same time or individually. 120VAC 15A tamper-resistant duplex receptacle.     VOICE CONTROL: The smart outlets that work with Alexa and Google assistant to enable voice control, offers smart-home integration with voice commands, totally set your hands free. Alexa Outlet gives you a convenient life     CONTROL FROM ANYWHERE: Using your home Wi-Fi, smart wall outlet let you remote control your appliances wirelessly with APP from anywhere in the world. Compatible with 2.4GHz Wi-Fi networks. No Hub required.     UNIVERSAL APP: The Smart life app works with Smartlife home devices, allowing easy control of your home from your Android or IOS smart phone. Your home, One app for all. Allow your family, neighbors, and guests to access all your Smart Home devices.     BETTER SERVICE: Thanks for shopping smart socket with us. Through our smart outlets, you can easily enjoy the convenience of smart home! If you encounter any problems during use, please contact us. We will give you a reply within 24 hours.",
      "details": {
        "brand": "junlit",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "White",
        "ram": "N/A",
        "detail_item": "SMART IN-WALL OUTLETS: This wifi outlet lets you control 2 plugged in devices from anywhere at the same time or individually. 120VAC 15A tamper-resistant duplex receptacle."
      }
    },
    {
      "id": "B01NAO4B9Z",
      "name": "Leviton DZPA1-2BW Decora Smart Plug-in Outlet with Z-Wave Technology, White, Repeater/Range Extender",
      "ratings": 1.282,
      "price": "$33.05",
      "image": "https://m.media-amazon.com/images/I/4180Db8sYmL._SY445_SX342_QL70_FMwebp_.jpg",
      "description": "Z-WAVE PLUS CERTIFIED: requires Z-Wave hub such as SmartThings or Wink     VOICE CONTROL: works with Alexa (Z-Wave hub required, Alexa device and hub sold separately)     CONTROL: Provides 15A, 120 VAC NEMA 5-15R grounding receptacle for use with a wide variety of lamps and appliances     LEVITON: Making your home smarter and safer since 1906. Designed, engineered, and supported in USA with a 5-Year Limited .     SMART: Protected memory maintains ON/OFF status of loads and during minor power fluctuations     RATINGS: LED and CFL up to 600W, incandescent/fluorescent/halogen up to 1800W, ½ HP Motor Loads",
      "details": {
        "brand": "Leviton",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "Z-WAVE PLUS CERTIFIED: requires Z-Wave hub such as SmartThings or Wink"
      }
    },
    {
      "id": "B07SYHBVY4",
      "name": "meross Smart Outdoor Plug, Waterproof WiFi Outdoor Outlet, Compatible with Apple HomeKit, Amazon Alexa, Google Assistant and SmartThings, Remote Control, Timer, FCC and ETL Certified Black",
      "ratings": 2.485,
      "price": "$25.99",
      "image": "https://m.media-amazon.com/images/I/61ana7LjYsL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "2 Individual Outlets: Comes with 2 AC sockets that can be controlled independently. 2 outlets WORK INDEPENDENTLY of one another     Ideal for Outdoor Use: IP44 weatherproof housing and sockets cover. Making the outdoor smart plug ideal for Garden, Backyard, Christmas tree, Kitchen, Landscape lighting, Bathroom, Porch, Balcony, Garage, Basement, Patio or Electric grill, Sprinkler, Washing machine, Lamps and other outdoor or indoor-use electric appliances, etc. Do not use it for pump     Remote and Voice Control: Control the two sockets individually from anywhere anytime. Supports Meross app and Home app. Compatible with Apple HomeKit (iOS 13 or above), Amazon Alexa, Google Assistant and SmartThings. All data is securely transmitted and stored using Amazon AWS servers in US. Note: iOS will guide you to HomeKit setup and management. HomeKit remote control requires additional Apple device such as HomePod or Apple TV. Control your devices via iPhone or Apple Watch     Schedule and Timer Setting: Schedule each socket to turn on and off automatically. Added benefit of saving energy when the plugged-in appliances are not needed or are left on by accident. Support sunrise and sunset setting     Safety: Certified by FCC/ETL(Control Number 5012797). Upgrade Version WiFi outdoor plug equipped with fire-retardant housing and overload protection circuit     Reliable Connection: Meross smart outdoor plug has longer WiFi connection range and lower offline rate. Perfect for your Garden, Backyard, Porch, Balcony, Garage or Basement where the home WiFi may not be well covered. Please connect your Phone to 2.4GHz home Wi-Fi while setting up the outdoor plug. Apple HomeKit website listed. Please check the wifi singal in device setting to ensure the outdoor smart plug gets a strong enough wifi coverage     For Android users: It works with any Android smartphone or tablet with OS 4.1 or higher. Android users will have an effortless experiences when configure with Meross app. Then skill 'meross' with your smart speakers as you wish",
      "details": {
        "brand": "meross",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "2 Individual Outlets: Comes with 2 AC sockets that can be controlled independently. 2 outlets WORK INDEPENDENTLY of one another"
      }
    },
    {
      "id": "B07RRRQ4KJ",
      "name": "Smart Plug（2.4G Only）, USB Wall Charger, POWRUI WIFI Surge Protector with 4 USB Charging Ports(4.8A 24W Total) and 3 Smart Outlet Extender, Compatible with Alexa Google Assistant for Voice Control",
      "ratings": 469,
      "price": "$13.49",
      "image": "https://m.media-amazon.com/images/I/31AKSBsZmIL._SY445_SX342_QL70_FMwebp_.jpg",
      "description": "Multi-Function Smart Power Strip(2.4G WIFI ONLY): 4 USB charging ports (total output DC 5V/4.8A 24W), 3 smart plug with built-in surge protector 540 Joules, the 3 AC outlets works with Alexa Google Assistant for Voice Control, Remote Control Your Home appliances from Anywhere, NOTE: the USB ports will be on once the outlet is plugged in, they are not controlled by the app.     Set Schedule & Timer with APP Control : Remote Control Your Home appliances from Anywhere, Schedule the Smart Plug to automatically power electronics on and off as needed, like setting lights to come on at dusk or turn off at sunrise. You can create a group for all of your smart devices and control them all with just one command. With the countdown timer feature, simply set a timer for the Smart Plug to turn off its appliance automatically. Each of the plugs can be controlled by the App separa     Voice Control with Alexa & Google Home:Compatible with Amazon Alexa, Google home assistant , control your home appliances with the smart plug by simply giving voice commands to Alexa or Google Assistant.     USB Charging Station： 4 USB charging ports total 5V/4.8A 24W.. It can charge almost any USB device (smartphone, tablet, Amazon Kindle, fire stick, e-reader, bluetooth headphones, portable speaker etc)     Our Support Guarantee: Our friendly and reliable customer service will respond to you within 24 hours. You can purchase with confidence, with our 30-day money back guarantee and 12-month replacement warranty",
      "details": {
        "brand": "POWRUI",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "White",
        "ram": "N/A",
        "detail_item": "Multi-Function Smart Power Strip(2.4G WIFI ONLY): 4 USB charging ports (total output DC 5V/4.8A 24W), 3 smart plug with built-in surge protector 540 Joules, the 3 AC outlets works with Alexa Google Assistant for Voice Control, Remote Control Your Home appliances from Anywhere, NOTE: the USB ports will be on once the outlet is plugged in, they are not controlled by the app."
      }
    },
    {
      "id": "B08LN2NPZ3",
      "name": "Minoston Z-Wave Outlet Mini Plug-in Socket, Z-Wave Hub Required, 800 Series Zwave Plug Built-in Repeater/Range Extender, Work with SmartThings, Wink, Alexa, Google Assistant, FCC Listed (MP21Z)",
      "ratings": 365,
      "price": "$54.99",
      "image": "https://m.media-amazon.com/images/I/41sAxUV44yL._SY445_SX342_QL70_FMwebp_.jpg",
      "description": "[RELIABLE AND STABLE ZWAVE PLUG] This z-wave plug has been upgraded with an 800 series chip. It has better signal coverage than ever, and faster communication, with S2 authenticated security and SmartStart for effortless pairing. Extend the wireless coverage up to 1300ft if your hub supports Long Range     [Wireless control] A large range of types of load are supported to be wirelessly controlled like lamps or small appliances from anywhere and any time by your mobile devices. Home automation is from a little Z-Wave Plug to control small appliances that you want     [Mini Z-Wave Outlets but Powerful] This zwave plug is mini in size. But this 15A, 125 VAC grounded receptacle is suitable for a variety of lamps and other home appliances     [Timer schedule]: Reduce your electricity bill by controlling the devices connected to the zwave plug to turn on or off at specific times of the day via a schedule. This zwave plug can also be combined with other devices to set customized scenes to provide automated living     [Easy to Setup] No wiring required. Simply plug in the device to a wall outlet and connect to your hub for convenient ON/OFF function. Z-Wave Frequency: 908.42MHz.FCC and ETL listed     [Z-Wave Hub Reuqired] This Z-Wave plug compatible with SmartThings, Vera, Wink, Fibaro, Homeseer, Ring, 2GIG, Hubitat(change device type). It is compatible with ALEXA and GOOGLE ASSISTANT (requires a Z-Wave certified hub). CANNOT connect directly with ECHO PLUS！Z-Wave Frequency: 908.42MHz. FCC and ETL listed",
      "details": {
        "brand": "Minoston",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "White",
        "ram": "N/A",
        "detail_item": "[RELIABLE AND STABLE ZWAVE PLUG] This z-wave plug has been upgraded with an 800 series chip. It has better signal coverage than ever, and faster communication, with S2 authenticated security and SmartStart for effortless pairing. Extend the wireless coverage up to 1300ft if your hub supports Long Range"
      }
    },
    {
      "id": "B07PFSRMV4",
      "name": "Avatar Controls Smart Plugs Wi-Fi Outlet 4 Pack - Smart Plugs That Work with Alexa/Google Home/Smart Life, Timer ON/Off Plug, Schedule Built-in App, Mini Wireless Socket, No Hub Required",
      "ratings": 1.77,
      "price": "$26.99",
      "image": "https://m.media-amazon.com/images/I/41QZjq209VL._SY445_SX342_QL70_FMwebp_.jpg",
      "description": "【Important Note】 1.Most of wifi plug smart outlet currently on market all only support wi-fi 2.4 GHz at first connection. 2.Make sure your smart outlet plug and your router have a good transmission of signals, avoid strong electromagnetic interference and reinforced concrete blocking wifi broadcasting     【Timer Schedule Feature】 The wifi outlet plug was programmable by app, you will never come home to a dark house. Lights will turn on at dusk and turn off at dawn automatically everyday when you set the schedule with specific times     【Voice Control Supported by Hub】 These smart outlets that work with alexa and google assistant, good compatibility let you can easily control your smart devices by giving simple voice commands to your smart dot or google home which linked to the smart wifi plugs     【Group Control & Family Sharing】 These smart plugs that work with alexa based on Tuya smart life app with 30 group timing, you can easily set up your smart home devices group in app, and one tap to share devices group to your family members and share happiness and convenience     【Wide Applications WiFi Outlets】 These smart outlets that work with alexa can be installed in many places indoor, as a switch for bed lamps, reading lamps, a table lights, TV, floor fans, etc. Just Note: Maximum 1100 Watts, so don’t use it for high-power appliances such as air conditioners",
      "details": {
        "brand": "Avatar Controls",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "White",
        "ram": "N/A",
        "detail_item": "【Important Note】 1.Most of wifi plug smart outlet currently on market all only support wi-fi 2.4 GHz at first connection. 2.Make sure your smart outlet plug and your router have a good transmission of signals, avoid strong electromagnetic interference and reinforced concrete blocking wifi broadcasting"
      }
    },
    {
      "id": "B07578W7KY",
      "name": "Zooz Z-Wave Plus Power Switch ZEN15 for 110V AC Units, Sump Pumps, Humidifiers, and More",
      "ratings": 873,
      "price": "$41.95",
      "image": "https://m.media-amazon.com/images/I/419sR-5G-jL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "POWERFUL PLUG: The only Z-Wave plug that lets you safely control and monitor heavy-duty 110V appliances from your Z-Wave smart home system. Connect your refrigerator, humidifier or dehumidifier, AC unit, fan, sump pump, or a gas clothes dryer to Z-Wave. NEW: 45 degree angled plug so you can fit 2 Smart Switches in a single receptacle!     POWERFUL Z-WAVE: With built-in Z-Wave Plus signal repeater and range test tool, the Power Switch will boost your whole Z-Wave network while keeping it protected with AES signal encryption and S2 authenticated Z-Wave security. NEW: 800 Series Z-Wave chip and Z-Wave Long Range ready. Z-Wave hub required (sold separately).     POWERFUL CONTROL: Monitor energy use of connected appliances in live mode or over time with W, kWh, A, and V reports (your Z-Wave hub needs to support this feature). NOTE: It is NOT a power outage monitor! Quick status reports to the controller and on/off state recovery after power failure.     POWERFUL HARDWARE: Made from high-quality components that will last, even when it's very cold or very hot (14° - 104°F, indoor use only). ETL certified: complies with North American electrical safety standards. Extra-thick flexible cord is perfect for installations with no immediate access to a receptacle.     COMPATIBILITY: Use the Power Switch with any certified Z-Wave hub for simple on/off control (Z-Wave alarm panels). Advanced settings and energy monitoring available for open systems only, including Z-Box Hub (recommended), works with SmartThings (custom driver required, go to Zooz Support Portal for details), Hubitat, Home Assistant, and HomeSeer.",
      "details": {
        "brand": "N/A",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "POWERFUL PLUG: The only Z-Wave plug that lets you safely control and monitor heavy-duty 110V appliances from your Z-Wave smart home system. Connect your refrigerator, humidifier or dehumidifier, AC unit, fan, sump pump, or a gas clothes dryer to Z-Wave. NEW: 45 degree angled plug so you can fit 2 Smart Switches in a single receptacle!"
      }
    },
    {
      "id": "B085XYHN3T",
      "name": "Smart Plug 4 Pack, Refoss Smart WiFi Outlet Works with Apple HomeKit, Alexa, Google Assistant, Siri, Timer & APP Remote Control, 15A",
      "ratings": 580,
      "price": "$22.99",
      "image": "https://m.media-amazon.com/images/I/41g4i199adS._SY445_SX342_QL70_FMwebp_.jpg",
      "description": "Control from Anywhere: Remote Control allows you to switch your appliances on/off with a smart plug via smartphone/Apple Home APP whenever and wherever you are (with internet access). You can check the connected devices' status or set schedules for them.     Hands-free Voice Control: Control your smart wifi plug with just a simple voice command: \"Hey Siri, turn off the lamp\", \"Hi Alexa, turn on the washing machine\". Work with Amazon Alexa, google assistant, and Siri. Supporting 2.4 GHz secure WiFi network only.     Schedule Automatically: Set schedules as needed, then the smart plug will automatically turn on and off any home appliances according to the schedule you set even if the internet is down.     Compact Design: Use two mini smart outlets in compact size on one outlet without interfering with each other, easy to install and use.     What You Get More: Longer Wi-Fi connection range, lower offline rate. FCC & ETL Certified. (NOTE: Apple HomeKit remote control requires an additional networked Apple device at home.) All data is securely transmitted and stored using Amazon AWS servers in the US.",
      "details": {
        "brand": "Refoss",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "White",
        "ram": "N/A",
        "detail_item": "Control from Anywhere: Remote Control allows you to switch your appliances on/off with a smart plug via smartphone/Apple Home APP whenever and wherever you are (with internet access). You can check the connected devices' status or set schedules for them."
      }
    },
    {
      "id": "B08Z4HK39S",
      "name": "Lutron Caseta Weatherproof+ Outdoor Smart Plug and Pico Smart Remote | for Landscape and String Lighting | P-PKG1OUT-BL | Black",
      "ratings": 93,
      "price": "$89.95",
      "image": "https://m.media-amazon.com/images/I/71zXonkuu+L._AC_SY300_SX300_.jpg",
      "description": "Includes: (1) Caseta Outdoor Smart Plug and (1) two-button Pico remote for switching; Caseta Smart Hub sold separately     MEET YOUR SMART YARD: Experience the delight of returning to a home alive with light; perfect for patio string lights, landscape lights, holiday lights (up to 1,000 ft!), pond or fountain pumps, and more     BUILT TO LAST: Polycarbonate body, and fully protected internal electronics, make for a smart outdoor plug that just works - year after year     WEATHERPROOF+: IP66 rated; protected against severe rainfall, dust, and dirt     CONTROL YOUR WAY: Caseta puts the smarts in the switch so you can control your lights a variety of ways - via the free Lutron app, your voice, with the included wireless Pico remote, or from the switch itself (Caseta Smart Hub, L-BDG2-WH, required)     ULTRA-RELIABLE AND ULTRA-FAST: Uses Clear Connect technology (not Wi-Fi), so your connection is strong and responsive, and avoids issues like Wi-Fi drop out and lag (Caseta Smart Hub required)     WORKS WITH: Add a Caseta Smart Hub (L-BDG2-WH) to use with Alexa, Google Assistant, Apple Home, Ring, and more",
      "details": {
        "brand": "N/A",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "Includes: (1) Caseta Outdoor Smart Plug and (1) two-button Pico remote for switching; Caseta Smart Hub sold separately"
      }
    },
    {
      "id": "B086V742L3",
      "name": "TREATLIFE Smart Dimmer Plug 2 Pack Outdoor Smart Plug Works with Alexa and Google Assistant, Light Dimmer Remote Control, Max Power 400W, IP44 Waterproof for Dimmable Outdoor Lights, Floor, Table Lamp",
      "ratings": 1.664,
      "price": "$39.99",
      "image": "https://m.media-amazon.com/images/I/41Oj3PugdnL._SY445_SX342_QL70_FMwebp_.jpg",
      "description": "Voice Control & 1%-100% Dimming: Control your outdoor lights effortlessly with this alexa smart plug. Adjust the brightness level from 1-100% using voice commands through SmartThings, Alexa, or Google Assistant. For example, simply say, \"Alexa, set my patio lights to 40%.\"     No Hub Required & APP Control: Enjoy the convenience of controlling your smart dimmer plug directly from your phone using the Smart Life/TreatLife app. No cumbersome hub is required. Simply plug in your device and connect to a secure 2.4 GHz Wi-Fi network (not compatible with 5.0 GHz Wi-Fi). The maximum Wi-Fi coverage is 300FT with no obstacles     Schedule & Sunrise/ Sunset Mode: Set up custom schedules to turn your lights on or off automatically according to your daily routines. The outdoor dimmer plug also supports sunrise and sunset settings, enabling you to program automation to turn on at dusk and off at dawn     Create Group & Vacation Mode: Combine several smart outlets into one command by creating a group. Set the dimmable smart plug to turn connected lights on and off randomly to give the impression that someone is home while you're away on vacation     Worry-Free Support: Our dimmer plug is weather-resistant and FCC certified, made from ABS fireproof material for safe use with outdoor string lights, bedside lamps, and party lights. If you experience any unexpected quality issues, please contact us promptly to activate your service and receive the best solution. Don't waste any money on unreliable products",
      "details": {
        "brand": "TREATLIFE",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "Black",
        "ram": "N/A",
        "detail_item": "Voice Control & 1%-100% Dimming: Control your outdoor lights effortlessly with this alexa smart plug. Adjust the brightness level from 1-100% using voice commands through SmartThings, Alexa, or Google Assistant. For example, simply say, \"Alexa, set my patio lights to 40%.\""
      }
    },
    {
      "id": "B093F4K57G",
      "name": "Sengled Smart Plug, S1 Auto Pairing with Alexa Devices, Energy Monitoring, Smart Outlet Remote Control, 15A Smart Socket, 1800W, Timer & Schedule, Bluetooth Mesh Smart Home, No Hub Required, 4-Pack",
      "ratings": 1.356,
      "price": "$49.99",
      "image": "https://m.media-amazon.com/images/I/31G51YWadIL._SY445_SX342_QL70_FMwebp_.jpg",
      "description": "Sengled S1 Auto Paring: (No registration required, No 3p account required) The Sengled Auto Pairing Kit offers a simple setup and stable links. Plug ＆ Play, start using them with Alexa Devices in seconds.     Energy Monitoring Smart Plug: Monitor every consumption of your plug-in devices and set timers and schedules to avoid waste for lamps, fans, humidifiers, Christmas lights, etc.Reduce energy consumption and save money.     Schedule and Timer: Smart outlet customized schedule lights, fans, and any home electronics or appliances to turn on and off automatically. Get ready to smart your home stuff and automation, just can be controlled locally only (Note: Can not remote control)     Smart Plug Quality Assured: Handles loads up to 15A (heavy-duty) 1800W, durable design, fire-resistant, UL/FCC/ETL/FCC/IC/BQB compliant.     OFF-Line Mode: Localized Information Security, Sengled smart plug for Localized Mesh networks without connecting to the cloud or network. Multiple mode options available in Sengled Bluetooth App, also no account required, direct local connection. More secure for smart home.",
      "details": {
        "brand": "Sengled",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "Sengled S1 Auto Paring: (No registration required, No 3p account required) The Sengled Auto Pairing Kit offers a simple setup and stable links. Plug ＆ Play, start using them with Alexa Devices in seconds."
      }
    },
    {
      "id": "B07VCDFM53",
      "name": "meross Outdoor Smart Plug, Outdoor Wi-Fi Outlet with 2 Grounded Outlets, Remote Control, Timer, Waterproof, Works with Amazon Alexa, Google Home, SmartThings, 2.4Ghz only, FCC Certified, Non-HK",
      "ratings": 3.344,
      "price": "$16.99",
      "image": "https://m.media-amazon.com/images/I/61LLlRLnyPL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Remote and Voice Control: Control the two sockets individually from anywhere anytime. Compatible with Aamzon Alexa and Google Home, simply use your voice command to control each individual socket. All data is securely transmitted and stored using AWS servers in US. Note: Connect your Phone to 2.4GHz home Wi-Fi while setting up the outdoor Wi-Fi plug.     Schedule and Timer Setting: Schedule each socket to turn on and off automatically. Added benefit of saving energy when the plugged-in appliances are not needed or are left on by accident. Support sunrise and sunset setting.     Reliable Connection: Meross smart outdoor plug has longer WiFi connection range and lower offline rate. Perfect for your Garden, Backyard, Porch, Balcony, Garage or Basement where the home WiFi may not be well covered.     For Outdoor and Indoor: IP44 weatherproof housing and sockets cover. Ideal for Garden, Backyard, Christmas tree, Kitchen, Landscape lighting, Bathroom, Porch, Balcony, Garage, Basement, Patio or Electric grill, Sprinkler, Lamps and other outdoor or indoor-use electric appliances, etc. Do not use it for pump.     Safety: Certified by FCC/ETL(Control Number 5012797). Enhanced waterproof design. Equipped with fire-retardant housing and overload protection circuit. Never allow other low quality plug endanger the safety of your family.",
      "details": {
        "brand": "meross",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "Remote and Voice Control: Control the two sockets individually from anywhere anytime. Compatible with Aamzon Alexa and Google Home, simply use your voice command to control each individual socket. All data is securely transmitted and stored using AWS servers in US. Note: Connect your Phone to 2.4GHz home Wi-Fi while setting up the outdoor Wi-Fi plug."
      }
    },
    {
      "id": "B08NL3CJD6",
      "name": "SYLVANIA Wifi Smart Plug, Voice Control, Compatible with Alexa and Google Home, Timer, On/Off, White - 4 Pack (75703)",
      "ratings": 719,
      "price": "$28.09",
      "image": "https://m.media-amazon.com/images/I/61ud5z3vM3L.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Simple Set-Up: With quick and easy set-up, experience smart living at home with the SYLVANIA SMART+ WiFi App and your home assistant – either with your voice or directly on your smartphone.     Hands-Free: Voice control works with Alexa, Google Assistant, and Siri Shortcuts. Not compatible with Apple HomeKit.     Lighting for Smarter Living: Schedule routines, alarms, and bedtimes with your SYLVANIA SMART+ WiFi LEDs. Keep your home safe and secure – anytime, anywhere. Control lighting even on vacation for security, right from your smartphone.     Instant Set-Up and Use: Instant installation means no additional hub or accessories are required.     Reliable and Trusted: Backed by our standard 2-year SYLVANIA warranty.     Must be connected to a 2.4 GHz WiFi network.     Please note that this product is intended for indoor use only.",
      "details": {
        "brand": "LEDVANCE",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "White",
        "ram": "N/A",
        "detail_item": "Simple Set-Up: With quick and easy set-up, experience smart living at home with the SYLVANIA SMART+ WiFi App and your home assistant – either with your voice or directly on your smartphone."
      }
    },
    {
      "id": "B079B7SHD8",
      "name": "Kasa Smart Plug by TP-Link, Smart Home Wi-Fi Outlet Works with Alexa, Echo, Google Home & IFTTT, No Hub Required, Remote Control, 15 Amp, UL Certified, 1-Pack(HS103) , WHITE",
      "ratings": 14.001,
      "price": "$18.99",
      "image": "https://m.media-amazon.com/images/I/41zSRDW9LIL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Voice control: Kasa smart plugs that work with Alexa and Google Home Assistant. Enjoy the hands-free convenience of controlling any home electronic appliances with your voice via Amazon Alexa or Google Assistant     Smart Outlet Control from anywhere: Turn electronics on and off your smart home devices from anywhere with your smartphone using the Kasa app, whether you are at home, in the office or on vacation     Scheduling: Use timer or countdown schedules to set your wifi smart plug to automatically turn on and off any home electronic appliances such as lamps, fan, humidifier, Christmas lights etc     Easy set up and use: 2.4GHz Wi-Fi connection required. Plug in, open the Kasa app, follow the simple instructions and enjoy     Trusted and reliable: Designed and developed in silicon valley, Kasa is trusted by over 5 Million users and being the reader’s choice for PCMag 2020. UL certified for safety use.",
      "details": {
        "brand": "N/A",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "Voice control: Kasa smart plugs that work with Alexa and Google Home Assistant. Enjoy the hands-free convenience of controlling any home electronic appliances with your voice via Amazon Alexa or Google Assistant"
      }
    },
    {
      "id": "B07D8ZNNPZ",
      "name": "TOPGREENER Smart Mini Wi-Fi Plug with Energy Monitoring, Mini Smart Outlet, Control Lights and Appliances from Anywhere, No Hub Required, Works with Alexa and Google Assistant, TGWF115PQM, 4-Pack",
      "ratings": 1.448,
      "price": "$24.99",
      "image": "https://m.media-amazon.com/images/I/31f1fL0dt9L._SY445_SX342_QL70_FMwebp_.jpg",
      "description": "4-pack Wi-Fi outlet works with Amazon Alexa and Google Assistant (sold separately) to enable voice control; no hub or subscription required     Control appliances remotely and monitor energy usage to optimize energy efficiency using the TOPGREENER app from the App store, iOS and Android compatible. Also compatible with the Tuya and Smart Life apps     Can be used with other smart plugs to control electronic appliances, or added to a group of devices for advanced scene control     Create schedules or set timers in the TOPGREENER app to turn the plug on and off automatically; TOPGREENER app runs on the secure servers of AWS     Requires a secured 2.4 GHz Wi-Fi network connection, compact design occupies just one outlet, durable design, fire resistant, UL listed, FCC compliant",
      "details": {
        "brand": "TOPGREENER",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "White",
        "ram": "N/A",
        "detail_item": "4-pack Wi-Fi outlet works with Amazon Alexa and Google Assistant (sold separately) to enable voice control; no hub or subscription required"
      }
    },
    {
      "id": "B091T81H7M",
      "name": "VOCOlinc Homekit Smart Plug Works with Alexa, Apple Home, Google Assistant, WiFi Smart Plug That Work with Alexa, Electrical Timer Outlet Support Siri, No Hub Required, 15A, 2.4GHz, 110～120V 4 Pack",
      "ratings": 2.543,
      "price": "$47.99",
      "image": "https://m.media-amazon.com/images/I/41PM5sxJD0L._SY445_SX342_QL70_FMwebp_.jpg",
      "description": "【Voice Control Made Easy】The VOCOlinc smart plug allows for effortless control with Apple HomeKit, Amazon Alexa, Google Assistant, and the VOCOlinc APP. Enjoy the convenience of hands-free operation with intelligent interaction. Please note that Apple HomeKit remote control requires an Apple home hub (such as a networked iPad, Apple TV, or HomePod).     【Simple Installation & Connection】For stability, the smart plug supports 2.4GHz Wi-Fi only. Easily add devices and set up with the VOCOlinc app for Android users, or scan the QR code on the manual for Apple users.     【Multi-functional Design】Control all your smart home devices with voice commands using Siri, Alexa, or Google Assistant. With remote control through the VOCOlinc app, you can schedule your devices to turn on or off based on your preferences.     【Certified Quality and Durability】Our smart outlet is certified by TUV and FCC, with the ability to support electrical devices up to 15A. The flame-retardant PC material of the smart plug shell provides protection and quality assurance.     【Compact & Convenient】The mini WiFi smart plug occupies only one socket, without affecting the usability of other jacks. Perfect for compact spaces and easy to carry during travel.     【Eco-friendly and Energy Saving】Experience a smarter and greener lifestyle with remote-controlled and scheduled smart outlet usage, avoiding the waste of electricity. Reduce your carbon footprint and save on energy costs.     【Customer Service】We are dedicated to provide you premium products and impeccable service. In addition, the tracker is also a great gift for your friend in need. If you have any problems, please don't hesitate to connect us.",
      "details": {
        "brand": "VOCOlinc",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "【Voice Control Made Easy】The VOCOlinc smart plug allows for effortless control with Apple HomeKit, Amazon Alexa, Google Assistant, and the VOCOlinc APP. Enjoy the convenience of hands-free operation with intelligent interaction. Please note that Apple HomeKit remote control requires an Apple home hub (such as a networked iPad, Apple TV, or HomePod)."
      }
    },
    {
      "id": "B07361JZ2H",
      "name": "Enbrighten Z-Wave Plus Smart Receptacle, Works with Alexa, Google Assistant, Tamper-Resistant, 1 Z-Wave Outlet & 1 Always On Outlet, Hub Required, White, Smart Outlet, Lamps, Small Appliances, 55256",
      "ratings": 919,
      "price": "$49.99",
      "image": "https://m.media-amazon.com/images/I/81zjscQjLoL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "VOICE CONTROL – ALEXA & GOOGLE ASSISTANT COMPATIBLE (requires a Z-Wave certified hub). Works with the following Z-Wave certified hubs: SmartThings, Ring Alarm, Wink, ADT Pulse, ADT Command, Trane, Vivint, Nexia, Honeywell, HomeSeer, Vera and more.     OUTLET OPTIONS – Use one grounded Z-Wave controlled outlet to wirelessly schedule and operate a lamp or small appliance from anywhere at any time with a mobile device. The always-on outlet provides continuous power for traditional use.     TAMPER RESISTANT – For increased safety, tamper-resistant outlets prevent foreign objects from being inserted any slot individually. The smart device is ideal for homes with pets or small children and protects against common injuries associated with electrical receptacles.     INSTALLATION AND USE – In-wall installation with hardwired connections, including a neutral wire, is required. The duplex outlet fits rocker-style wallplates – not included – and works with all types of light sources as well as other devices.     HASSLE-FREE OPERATION – Control the Z-Wave outlet remotely with your smartphone and voice commands when connected to a compatible hub or enjoy manual ON/OFF operation from the smart device. With a 150ft. Z-Wave range, home automation is simple through custom scenes, versatile scheduling and convenient alerts.",
      "details": {
        "brand": "Enbrighten",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "White",
        "ram": "N/A",
        "detail_item": "VOICE CONTROL – ALEXA & GOOGLE ASSISTANT COMPATIBLE (requires a Z-Wave certified hub). Works with the following Z-Wave certified hubs: SmartThings, Ring Alarm, Wink, ADT Pulse, ADT Command, Trane, Vivint, Nexia, Honeywell, HomeSeer, Vera and more."
      }
    },
    {
      "id": "B08G46WWBB",
      "name": "Smart Plug,DOGAIN Zigbee Smart Plugs Outlet Works with ST and Echo Plus Hub Voice Control Compatible with Alexa and The Google Assistant (Hub Required)(2 Pack)",
      "ratings": 312,
      "price": "$18.99",
      "image": "https://m.media-amazon.com/images/I/21ut9jYfseS._SY445_SX342_QL70_FMwebp_.jpg",
      "description": "Why choose Zigbee? As more and more smart devices installed in your house, your internet might becomging less stable. Hub+Zigbee,more stable,as long as there is stable Zigbee signal,a really good substitution for unstable Wi-Fi     Truly Plug and Play：Easy to install, just plug in and ask Alexa to discover devices, no need to register other app and allow it to have access to your phone,You can control the alexa plug of your phone anytime and anywhere     Widely compatible：Support ST Hub, Can connect Echo Plus(ZE39KL)/Echo Show 2nd Gen (DW84JL)/Echo Plus 2nd Gen (L9D29R)/Echo Studio ——-NOTE:Does not work with Homekit     Free your hands:Integrate voice control by pairing an Echo or Google Home smart speaker to your compatible ZigBee hub .Free your hands, voice control switch     WARM TIPS — Feel free to contact us via if you have any problems with DOGAIN products.We offer a 12-month warranty for this product, plus lifetime technical support",
      "details": {
        "brand": "DOGAIN",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "Why choose Zigbee? As more and more smart devices installed in your house, your internet might becomging less stable. Hub+Zigbee,more stable,as long as there is stable Zigbee signal,a really good substitution for unstable Wi-Fi"
      }
    },
    {
      "id": "B08NFQ5FKQ",
      "name": "Aoycocr Smart Dimmer Plug 2 Sockets, Outdoor Smart Outlet Work with Alexa Google Home Light Dimmer APP Remote Control Max Power 400W IP55 Waterproof for Dimmable Outdoor Lights Floor Lamp Table Lamp",
      "ratings": 290,
      "price": "$14.99",
      "image": "https://m.media-amazon.com/images/I/4150cL-yTeL._SY445_SX342_QL70_FMwebp_.jpg",
      "description": "【Remote Control】Just simply plug in a device and you can control your outdoor smart plug via Smart Life/popotan APP directly from anywhere, as long as your phone access to a secure 2.4 GHz Wi-Fi network. (Note: Not support 5.0 GHz Wi-Fi).     【0% - 100% Dimming】The outdoor outlet switch with 0-100% adjustable brightness, you can also edit/adjust outside string lights to achieve your desired lighting effect. Customize your daily routines into moments you can enjoy. (Don't support to program each plug individually)     【Schedule Timers & LED Compatible Dimmer】Create customized schedule or a lighting scene to automatically turn on/off. Inline light dimmer switch works with up to 150 watt dimmable LED / CFL bulbs or 400 watt Incandescent; 110 - 120Vac Input Voltage.     【Waterproof & Durable】 With ABS fireproof material and IP55 waterproof standard applied, makes this outdoor timers remote outlet popular used for outdoor devices/indoor garden, such as landscape lighting, porch light, festival decorative string light, fountains, pumps, sprinklers, swimming pool & spa, lawn mowers, irrigation systems etc.     【Voice & APP Control】Aoycocr WiFi-Bluetooth timers for electrical outlets compatible with Amazon Alexa or Google Assistant for voice control to dim, turn on /off alexa devices. Free Popotan app allows you to control the smart light switch outlet remotely on your smartphone or tablet, no hub required.",
      "details": {
        "brand": "Aoycocr",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "【Remote Control】Just simply plug in a device and you can control your outdoor smart plug via Smart Life/popotan APP directly from anywhere, as long as your phone access to a secure 2.4 GHz Wi-Fi network. (Note: Not support 5.0 GHz Wi-Fi)."
      }
    },
    {
      "id": "B07Z7R1QKN",
      "name": "Smart Outdoor Plug YoLink 1/4 Mile World's Longest Range Smart Plug Work w/Alexa Google Assistant IFTTT Individual Control 2 Outlets IP44 Waterproof for Garden Watering Lighting, YoLink Hub Required",
      "ratings": 249,
      "price": "$39.99",
      "image": "https://m.media-amazon.com/images/I/31ZMEkqheAL._SY445_SX342_QL70_FMwebp_.jpg",
      "description": "Doesn't Work without YoLink Hub - YoLink Hub is the only central controller for YoLink devices, and it connects YoLink devices into the internet and the cloud. Without YoLink Hub, this smart switch does not work with YoLink app and does not support 3rd-party integration with Alexa, Google Home and IFTTT. Please search B07TQLKQLJ for the hub or try our Smart Home Starter kit B07V246GCX     Works With Alexa & Google Voice Assistants: Supercharge your YoLink system by adding the YoLink skill to Alexa or Google Assistant. Control your YoLink devices by voice command (“Alexa, turn off the fan” – “OK!”) and control your YoLink devices as part of routines/automations that may include other, third-party, smart devices integrated with Alexa/Google. (YoLink Hub required, not included).     SAFE & RELIABLE - Durable Design & Water Resistant, ETL Listed & FCC Compliant; Loads up to 15A Resistive (125V Max 1875W), can be used to control most of the electrical appliances or can be added to a group of devices for advanced scene control     CONTROL FROM ANYWHERE - Double the Outlets Control 2 outdoor devices from anywhere together or individually, with one smart plug; Ideal for landscape lighting, swimming pool pumps, holiday lights, or other appliances     World's Longest Wireless Range: Powered by LoRa technology, the long-range yet low-power system offers the industry’s longest receiving range in the market (1/4 mile). Our long-range coverage enables its use in areas challenging for most residential Wi-Fi systems, such as basements, outdoor porch/patio areas, sheds, free-standing garages, even remote outbuildings on your property.",
      "details": {
        "brand": "YoLink",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "Doesn't Work without YoLink Hub - YoLink Hub is the only central controller for YoLink devices, and it connects YoLink devices into the internet and the cloud. Without YoLink Hub, this smart switch does not work with YoLink app and does not support 3rd-party integration with Alexa, Google Home and IFTTT. Please search B07TQLKQLJ for the hub or try our Smart Home Starter kit B07V246GCX"
      }
    },
    {
      "id": "B083KPJHVY",
      "name": "Geeni Wi-Fi Smart Wall Outlet with 2 Plugs and Wireless App Control, Compatible with Alexa and Google Home, WiFi Smart Outlet, 2 Pack",
      "ratings": 1.701,
      "price": "$31.98",
      "image": "https://m.media-amazon.com/images/I/418ipahRO2L._SY445_SX342_QL70_FMwebp_.jpg",
      "description": "SMART IN-WALL OUTLETS: The Geeni Smart Wi-Fi In-Wall Outlet lets you control 2 plugged in devices from anywhere at the same time or individually. Take up less space with this in-wall option that’s ideal for your living room, kitchen, even your bedroom     NO HUB REQUIRED: This in-wall smart plug works with your home Wi-Fi—no hub required! Simply download the Geeni app, install your outlet and connect. It also works with Amazon Alexa and Google Assistant     COMPATIBILITY: The Geeni Smart Wi-Fi In-Wall Plug is only compatible with 2.4GHz Wi-Fi networks. With easy installation, you can replace your existing switch in 10 minutes     CONTROL FROM ANYWHERE: Using your home Wi-Fi, remotely control your outlets from anywhere. Give each outlet a unique name and use them separately. Too tired to get up? Ask Alexa to turn your bedroom lamps off when it’s bedtime.     UNIVERSAL APP: The Geeni app works with all Geeni smart home devices, allowing easy control of your home from your Android or iOS smartphone. Your home, One app for all. Allow your family, neighbors, and guests to access all your Geeni Smart Home devices.",
      "details": {
        "brand": "N/A",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "SMART IN-WALL OUTLETS: The Geeni Smart Wi-Fi In-Wall Outlet lets you control 2 plugged in devices from anywhere at the same time or individually. Take up less space with this in-wall option that’s ideal for your living room, kitchen, even your bedroom"
      }
    },
    {
      "id": "B07WS9GJXZ",
      "name": "Nooie Smart Plug WiFi Outlet Mini Smart Socket Compatible with Alexa, No Hub Required. Schedule Timer Function Control Electric Devices(1pack)",
      "ratings": 91,
      "price": "$5.99",
      "image": "https://m.media-amazon.com/images/I/31AznwGc8bL._SY445_SX342_QL70_FMwebp_.jpg",
      "description": "Nooie smart plug is designed with a small size of 1.57×2.36 inch, and the household double empty socket can fully accommodate 2 × mini smart plugs. The child lock function can ensure the safety of children at home.     Voice Control — Nooie smart plugs work with Alexa and Google Home, you can bind with your speakers according to the instructions in the Nooie APP, and control the switch of the appliance by voice.     Remote Control — All you need is a mobile phone to easily control your home appliances, no matter where you are.     Device Sharing - Outlet devices can be shared with family and friends to set up and control smart plugs together. One APP can control multiple plugs at the same time to create your own smart life.     Timing & Schedule — The Nooie App can create a work schedule for the plug, and it can also be turned on or off on a regular basis. For example, you can create a morning routine that automatically runs and turns on the lights and coffee maker when the time comes.     Note — Nooie Smart Socket only supports 2.4G WiFi, you can follow the steps in Nooie App to connect.     Encounter problems? — The use of Nooie sockets is very simple. If you encounter any use problems, you can directly contact the Nooie team to solve all problems for you at all times.",
      "details": {
        "brand": "nooie",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "Nooie smart plug is designed with a small size of 1.57×2.36 inch, and the household double empty socket can fully accommodate 2 × mini smart plugs. The child lock function can ensure the safety of children at home."
      }
    },
    {
      "id": "B08KQ2SBQD",
      "name": "WiFi Smart Plugs, Mini WiFi Outlet Compatible with Alexa, Google Assistant for Voice Control, No Hub Required, WiFi Enabled Remote Control, Timer Function-4 Pack",
      "ratings": 110,
      "price": "$16.99",
      "image": "https://m.media-amazon.com/images/I/31UkZWAfREL._SY445_SX342_QL70_FMwebp_.jpg",
      "description": "VOICE CONTROL: Compatible with Alexa, Echo, Google Home. Enjoy hands-free convenience of controlling any home appliances with the mini smart plug by giving voice commands to Amazon Alexa or Google Assistant.     REMOTE CONTROL FROM ANYWHERE: WOOSTAR smart wifi outlet can help to turn electronic appliances on and off from anywhere via smartphone app under cellular networking, even though you are in the office or on vacation.     SCHEDULE & TIMER FUNCTION: By setting customized schedules and timers for your mini wifi outlet to turn on and off any home electronic appliances automatically, such as lamps, fan, humidifier, Christmas lights etc. Customize smart home according to your daily needs.     GROUP CONTROL FUNCTION : You could control all Wi-Fi smart plugs in one command by setting them in one group.     EASY TO SET UP: Plug a device into the mini wifi smart outlet and connect wifi plug to 2.4GHz home networking working via app. Then control home appliances whenever and wherever by phone.",
      "details": {
        "brand": "WOOSTAR",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "VOICE CONTROL: Compatible with Alexa, Echo, Google Home. Enjoy hands-free convenience of controlling any home appliances with the mini smart plug by giving voice commands to Amazon Alexa or Google Assistant."
      }
    },
    {
      "id": "B09HYWVFNF",
      "name": "Programmable Smart WiFi Thermostat Plug Outlet, Wireless Electric Plug-in Temperature Controller with App Remote Control. Compatible with Alexa and Google Assistant",
      "ratings": 1.252,
      "price": "$47.99",
      "image": "https://m.media-amazon.com/images/I/514NBVwt5RL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "7-Day Programmable Thermostat: MTS700-WB is a smart plug-in thermostat that provides 4 program periods per day for your schedule, meets your various needs to save energy and stay comfortable. Precise temperature control of ± 1?/°F to ± 15?/°F optional, which depends on you.     APP Remote Control: You can control the thermostat outlet anytime, anywhere with the free Smart Life app and change the temperature from anywhere using your phone, tablet, or laptop. All you need to do is connect the smart thermostat plug to a WiFi network.     Voice Control: MTS700-WB thermostat outlet works with Google Assistant and Alexa, so you can enjoy the hands-free convenience of controlling any home heating or cooling appliances with your voice via Amazon Alexa or Google Assistant.     Count Down Timer: The wireless thermostat plug comes with a simple countdown mode, 1-60 minutes optional to automatically turn on/off your connected appliance when time runs out.     Easy Setup and Use: Simply download the Smart Life app and set it up with the step-by-step guide on the app or our easy-to-read user manual, then you are ready to go. Most people can set it up in 5 minutes or less. Plus, we offer a 1-year quality-related warranty and lifetime technical support.",
      "details": {
        "brand": "HYCENCY",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "Hycency",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "Smart Wifi",
        "ram": "N/A",
        "detail_item": "7-Day Programmable Thermostat: MTS700-WB is a smart plug-in thermostat that provides 4 program periods per day for your schedule, meets your various needs to save energy and stay comfortable. Precise temperature control of ± 1?/°F to ± 15?/°F optional, which depends on you."
      }
    },
    {
      "id": "B09K5CCD25",
      "name": "Tuya WiFi Smart Plug Works with Alexa Google Assistant IFTTT for Voice Control Mini Smart Outlet Plug with Timer Function,No Hub Required,Only 2.4GHz Wi-Fi,FCC/Rohs Listed Socket(2 Pack)",
      "ratings": 49,
      "price": "$19.98",
      "image": "https://m.media-amazon.com/images/I/21d5fbqS0iL._SY445_SX342_QL70_FMwebp_.jpg",
      "description": "Smart home outlet only support wi-fi 2.4 GHz,does not support 5 GHz or BT;Please ensure the stability and security of the wi-fi 2.4 GHz network     Smart life plug compatible with Alexa Google Home and IFTTT which help to manage your home devices through voice control,does not support SmartThings or HomeKit     This round tuya smart plug is recommended to be installed on a three-pin socket, it is not recommended to install two plugs side by side on a two-pin socket     The maximum load current of the smart home plug is 10A,overload protection and a fire-retardant casing ensure complete protection for you and your devices;please take care of your plug, do not drop it to avoid noise during use     No hub or subscription required,simply plug your electrical appliances into smart outlet and connect to Smart Life APP/Tuya APP under a secured 2.4GHz Wi-Fi network",
      "details": {
        "brand": "Sparkleiot",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "White",
        "ram": "N/A",
        "detail_item": "Smart home outlet only support wi-fi 2.4 GHz,does not support 5 GHz or BT;Please ensure the stability and security of the wi-fi 2.4 GHz network"
      }
    },
    {
      "id": "B00ZYLQZEK",
      "name": "WiOn 50049 Outdoor Wi-Fi Wireless Plug-In Switch; Smartphone And Tablet Automation For Up To 12 Devices; 2 Grounded Outlets; Weather Resistant; Energy Saving; Wifi Controlled Switch",
      "ratings": 1.051,
      "price": "$25.93",
      "image": "https://m.media-amazon.com/images/I/51UKcetTO4L.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Control outdoor electrical devices from anywhere - using your smartphone with no hub required     Great for patio dcor; fountains; and outdoor lighting to give home lived-in look or save time and energy when you want to control plugged-in devices from home or away     Waterproof housing with 6in cord     Up to 12 ON/OFF settings per day; including countdown; random/vacation; and sunrise/sunset schedules     Schedule daily; weekday; or weekend schedules",
      "details": {
        "brand": "Woods",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "Black",
        "ram": "N/A",
        "detail_item": "Control outdoor electrical devices from anywhere - using your smartphone with no hub required"
      }
    },
    {
      "id": "B09GK5F68P",
      "name": "Smart Plug, WiFi Light Switch, Outlet Timer, Amazon Alexa Google Home Voice, APP and Remote Control, Smart Devices, Gadgets, Home Improvement Outlet Extender, 2.4ghz Network, Pack of (1)",
      "ratings": 96,
      "price": "$7.15",
      "image": "https://m.media-amazon.com/images/I/311aoMzgbIL._SY445_SX342_QL70_FMwebp_.jpg",
      "description": "VOICE COMMAND TO CONTROL: Smarthentic smart plugs that work with Alexa and Google Home Assistant. Just give a simple voice command to control your home device with a smart outlet via Alexa or Google Home Assistant. No hub is required to install the wifi plug. Smarthentic Alexa outlet plug works with a stable 2.4GHz network.     SCHEDULE & TIMER: By setting schedules and timers for your home smart wifi electrical plugs, you can prepare a crockpot meal and get home with dinner ready. Get ready to have a smart home and create a customized schedule to automatically turn on/off any home electronic appliances such as lamps, Christmas lights, coffee makers, etc. Please note that the apartment essentials plug is not suitable for appliances whose power is more than 10A,1200W     REMOTE CONTROL FROM ANYWHERE: Smarthentic google smart plug can help you control your home appliances from anywhere. Even you are not at home, you also can control your Alexa wifi outlet via Smarthentic App directly, as long as your phone access a secure 2.4 GHz Wi-Fi network. Ideal for someone who cannot move around very well and needs easy access to turn on/off a device     CREATE GROUP AND SHARE TO FAMILIES: Set a group for all google home outlets and control them in one command. Share your wifi plugs that work with Alexa with all family members in a minute. No more worries, everyone can control them easily and it is home essentials     EASY TO INSTALL AND SAFE: Just plug a device into the mini wifi smart outlet and connect to your secured 2.4GHz network with the \"Innova Life\" App. ETL certification ensures complete protection. Smarthentic smart plug is backed by lifetime unconditional service.",
      "details": {
        "brand": "Smarthentic",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "White",
        "ram": "N/A",
        "detail_item": "VOICE COMMAND TO CONTROL: Smarthentic smart plugs that work with Alexa and Google Home Assistant. Just give a simple voice command to control your home device with a smart outlet via Alexa or Google Home Assistant. No hub is required to install the wifi plug. Smarthentic Alexa outlet plug works with a stable 2.4GHz network."
      }
    },
    {
      "id": "B09KZDZJ1M",
      "name": "Smart Plug Mini HomeKit, Smart WiFi Outlet Socket Support Apple HomeKit, Amazon Alexa and Google Assistant Voice Control Plug with Timer Function and Group Control Apple MFi Certified No Hub Required",
      "ratings": 137,
      "price": "$20.99",
      "image": "https://m.media-amazon.com/images/I/417YRaqNSzL._SY445_SX342_QL70_FMwebp_.jpg",
      "description": "Voice Control: Works with Apple HomeKit, Amazon Alexa and Google Assistant. Free your hands, voice commands of smart device to turn on/off the light, and change the colors, lightness and the mode of lighting. (Hey Siri/Alexa, turn on the living room light)     HomeKit Control: Apple MIFI certificated. With Apple Home and free Cozylife APP on your phone, you can take control of your smart plug anywhere and anytime at your will. Brings great convenience to your life.(only 2.4G WiFi supported and no hubs required)     Group Control and Timer: Add your home device to a group and turn on/off the group devices with one command. Enjoy your customized schedule to automatically power on or off any electronic device. Such as turn on the light in the morning and turn it off at night, disconnected the pone within 30 minutes and so on.     Easy to Install and Quick Connection: Simply plug the smart outlet into the wall, scan the product code from Apple HomeKit to get quick connection.Or connect it with CozyLife app with Wi-Fi network(only 2.4Ghz supported), quick connection(5-10 seconds)no hub and subscription required. Then wirelessly control home appliances anywhere and anytime. FCC, RoHS, CE certificated.     Safe and Energy Saving: CozyLife smart plug outlet uses premium materials and techniques ensures the quality of every plug to protect your home devices from overcharging and overheating, saves energy and money. Worry free to buy and use.",
      "details": {
        "brand": "DoHome",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "2 Pack",
        "ram": "N/A",
        "detail_item": "Voice Control: Works with Apple HomeKit, Amazon Alexa and Google Assistant. Free your hands, voice commands of smart device to turn on/off the light, and change the colors, lightness and the mode of lighting. (Hey Siri/Alexa, turn on the living room light)"
      }
    },
    {
      "id": "B07PX57RH4",
      "name": "Eve Energy Strip - Smart Triple Outlet & Power Meter for Apple Home, Built-in Schedules & Switches, Surge Protection, overcurrent Protection, overvoltage Protection, Energy metering",
      "ratings": 382,
      "price": "$94.99",
      "image": "https://m.media-amazon.com/images/I/41u18y4sgrL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Eve Energy Strip requires iPhone or iPad with the latest version of iOS/iPadOS.     Independently control 3 generously spaced power outlets - via Siri, the app on iPhone, iPad or Apple Watch or onboard buttons.     Easily set up schedules to sync connected lights, fans and other devices with your daily rhythm. Or simulate, in combination with a home hub, presence while out or on vacation.     Track total power consumption and learn the projected cost, save energy by turning off appliances that waste power on standby mode.     Surge protection, overcurrent protection, and overvoltage protection: consider your most beloved devices immune e.g. to energy spikes, short circuits and excessive currents, the Apple HomeKit device for unparalleled ease of use, advanced data privacy and security.     Direct Wi-Fi connection - effortless setup, no bridge or gateway required.     US: Power: AC 120 V, 60 Hz, max. 15 A / 1,800 W, Type B sockets, Type A & B appliances, 6.3 ft cable",
      "details": {
        "brand": "Eve",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "Black",
        "ram": "N/A",
        "detail_item": "Eve Energy Strip requires iPhone or iPad with the latest version of iOS/iPadOS."
      }
    },
    {
      "id": "B087CR6S12",
      "name": "meross Smart Plug Mini, 15A & Reliable Wi-Fi, Support Apple HomeKit, Siri, Alexa, Echo, Google Assistant and Nest Hub, App Control, Timer, No Hub Needed, 2.4G WiFi Only, 1 Pack",
      "ratings": 688,
      "price": "$13.99",
      "image": "https://m.media-amazon.com/images/I/31lHffM0-RL._SX342_SY445_QL70_FMwebp_.jpg",
      "description": "Remote Control: To enable HomeKit remote control, you need a HomePod, an Apple TV 4K, Apple TV HD, or an iPad. Set any of these Apple devices in your house as a HomeKit bridge and connect it to your home 2.4GHz Wi-Fi network. Keep in mind that once your HomeKit bridge is set up, it has to be kept online. If it is powered off or disconnected from the Wi-Fi, it will fail to respond when you intend to control the device remotely.     Voice Control: You can control your devices hands free, just give voice commands to turn on/off the connected devices. Compatible with Apple HomeKit, Apple Watch, Siri, Carplay, Amazon Alexa, Google Assistant.     Compact Size: Smart plug occupies only one socket, the device allows you to stack two mini smart plugs in the same outlet, which is convenient and practical.     Schedule: You can schedule connected devices to turn on and off automatically by smart plugs. Save energy when lights are not needed or left on by accident. Sunrise and sunset setting are supported.     Quality and Service : The mini plug is made of PC flame retardant material, and has been approved for safety and quality assurance. Certified by ETL and FCC, it supports home appliance up to 15A.",
      "details": {
        "brand": "meross",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "white",
        "ram": "N/A",
        "detail_item": "Remote Control: To enable HomeKit remote control, you need a HomePod, an Apple TV 4K, Apple TV HD, or an iPad. Set any of these Apple devices in your house as a HomeKit bridge and connect it to your home 2.4GHz Wi-Fi network. Keep in mind that once your HomeKit bridge is set up, it has to be kept online. If it is powered off or disconnected from the Wi-Fi, it will fail to respond when you intend to control the device remotely."
      }
    },
    {
      "id": "B07V2KPNTY",
      "name": "YoLink Smart Plug with Energy Monitoring, 1/4 Mile World's Longest Range Smart Home Mini Outlet Works with Alexa Google Assistant IFTTT Remote Control Home Appliances Anywhere, YoLink Hub Required",
      "ratings": 98,
      "price": "$35.99",
      "image": "https://m.media-amazon.com/images/I/31NtyTtqoTL._SY445_SX342_QL70_FMwebp_.jpg",
      "description": "World's Longest Wireless Range: Powered by LoRa technology, the long-range yet low-power system offers the industry’s longest receiving range in the market (1/4 mile). Our long-range coverage enables its use in areas challenging for most residential Wi-Fi systems, such as basements, outdoor porch/patio areas, sheds, free-standing garages, even remote outbuildings on your property.     Works With Alexa & Google Voice Assistants: Supercharge your YoLink system by adding the YoLink skill to Alexa or Google Assistant. Control your YoLink devices by voice command (“Alexa, turn off the fan” – “OK!”) and control your YoLink devices as part of routines/automations that may include other, third-party, smart devices integrated with Alexa/Google.     Energy Monitoring: you can track energy consumption and real-time power of attached devices by daily/weekly/monthly within YoLink app; Durable Design & Fire Resistant, ETL Listed & FCC Compliant; Loads up to 12.5A, can be used to control most of the electrical appliances or can be added to a group of devices for advanced scene control     From Simple to Super-Smart: After setting up your notification preferences, keep it simple and let the YoLink system do the rest and monitor your home and property for you. Or, utilize available advanced automation features, including 3rd-party integration with Alexa and IFTTT, to interact with other YoLink and 3rd-party smart devices. Limited only by your imagination!     YoLink Hub Required but not included: YoLink Hub is the only central controller for YoLink devices, and it connects YoLink devices into the internet and the cloud. Without YoLink Hub, this sensor does not work with YoLink APP and does not support 3rd-party integration with Alexa and IFTTT. Please search B07TQLKQLJ for the hub or try our Smart Home Starter kit B07V246GCX",
      "details": {
        "brand": "YoLink",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "World's Longest Wireless Range: Powered by LoRa technology, the long-range yet low-power system offers the industry’s longest receiving range in the market (1/4 mile). Our long-range coverage enables its use in areas challenging for most residential Wi-Fi systems, such as basements, outdoor porch/patio areas, sheds, free-standing garages, even remote outbuildings on your property."
      }
    },
    {
      "id": "B07YDK1VSV",
      "name": "Smart Power Strip, YoLink 1/4 Mile World's Longest Range Power Strip Compatible with Alexa Google IFTTT, Surge Protector Plugs 4 USB Charging Ports + 4 AC Plugs for Multi Outlets - YoLink Hub Required",
      "ratings": 96,
      "price": "$47.58",
      "image": "https://m.media-amazon.com/images/I/31Q4GIXnnpL._SY445_SX342_QL70_FMwebp_.jpg",
      "description": "World's Longest Wireless Range: Powered by LoRa technology, the long-range yet low-power system offers the industry’s longest receiving range in the market (1/4 mile). Our long-range coverage enables its use in areas challenging for most residential Wi-Fi systems, such as basements, outdoor porch/patio areas, sheds, free-standing garages, even remote outbuildings on your property.     Works With Alexa & Google Voice Assistants: Supercharge your YoLink system by adding the YoLink skill to Alexa or Google Assistant. Control your YoLink devices by voice command (“Alexa, turn off the fan” – “OK!”) and control your YoLink devices as part of routines/automations that may include other, third-party, smart devices integrated with Alexa/Google. (YoLink Hub required, not included).     Control from anywhere - turn on or off the power of your electrical items remotely via YoLink App on your smartphone or tablet (iOS 9 or higher, Android 4.4 or higher); you can set a countdown timer, create schedules, set up automation among YoLink Yoink devices; also share the device with family members     Safe & Reliable - ETL Listed & FCC Compliant and it is made of high-quality materials. Up to 8 outlets to meet all your need of a charge, AC plugs support 100~120V AC, 10A maximum load and USB Ports support 5V DC, 2.1A Current     YoLink Hub Required but not included - YoLink Hub is the only central controller for YoLink devices, and it connects YoLink devices into the internet and the cloud. Without YoLink Hub, YoLink Smart Power Strip does not work with YoLink app and does not support 3rd-party integration with Alexa, Google Home and IFTTT. Please search B07TQLKQLJ for the hub or try our Smart Home Starter kit B07V246GCX",
      "details": {
        "brand": "YoLink",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "Power Strip",
        "ram": "N/A",
        "detail_item": "World's Longest Wireless Range: Powered by LoRa technology, the long-range yet low-power system offers the industry’s longest receiving range in the market (1/4 mile). Our long-range coverage enables its use in areas challenging for most residential Wi-Fi systems, such as basements, outdoor porch/patio areas, sheds, free-standing garages, even remote outbuildings on your property."
      }
    },
    {
      "id": "B01K1JVZOE",
      "name": "Kasa Smart Plug Classic 15A, Smart Home Wi-Fi Outlet Works with Alexa & Google Home, No Hub Required, UL Certified, 2.4G WiFi Only, 1-Pack(HS105) , White",
      "ratings": 13.597,
      "price": "$13.99",
      "image": "https://m.media-amazon.com/images/I/81B+4phWROL._AC_SY300_SX300_.jpg",
      "description": "Control From Anywhere: Turn electronics on or off from anywhere with your smartphone using the Kasa app (Compatible w/ Android & iOS)     Voice Control: Works with Amazon Alexa, Google Assistant and MicroSoft Cortana supported devices for a hands free experience     Compact Design: Won't block the other wall outlet allowing two Smart Plugs to be installed side by side     Kasa scenes & schedules: Schedule the Smart plug to automatically switch on and off when away or set a scene for controlling many devices with a single button     Note: Requires a secured 2.4 GigaHertz Wi Fi network connection",
      "details": {
        "brand": "N/A",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "Control From Anywhere: Turn electronics on or off from anywhere with your smartphone using the Kasa app (Compatible w/ Android & iOS)"
      }
    },
    {
      "id": "B0828BH1ZK",
      "name": "Smart Plugs That Compatible with Alexa Google Home Siri, Wireless 2.4G WiFi Outlet Controlled by Smart Life Tuya Avatar Controls APP, 10A Mini Socket Enchufe Inteligente with Timer, Dual, 2 Pack",
      "ratings": 613,
      "price": "$18.40",
      "image": "https://m.media-amazon.com/images/I/61TT1Lm6DfL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "【ENERGY MONITORING & TIMER FUNCTION】Track current and historical power usage for connected devices and effectively schedule your usage to save on your next electric bill. With the convenient timer function, the smart home plug can on/off automatically up to your mind     【Easy Installation & Control Anywhere】Internet was needed(the first time to connect needs to 2.4GHz), Smart Life APP, you can control your device anywhere anytime, no hub required.     【Hand Free by Voice Control】Smart plug works with Alexa Google Home, only say to them if you need turn on/off electricals     【Timer Schedule & Device Sharing】30 group timing, never come home to a dark house, also share the device to your family, it is no worried when you go out or if the phone not stand by.",
      "details": {
        "brand": "Avatar Controls",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "【ENERGY MONITORING & TIMER FUNCTION】Track current and historical power usage for connected devices and effectively schedule your usage to save on your next electric bill. With the convenient timer function, the smart home plug can on/off automatically up to your mind"
      }
    },
    {
      "id": "B00ZYLRQNE",
      "name": "WiOn 50050 Indoor WiFi Plug With 1 Grounded Outlet; White",
      "ratings": 693,
      "price": "$4.27",
      "image": "https://m.media-amazon.com/images/I/519Dnk8FXtL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "WIFI SMART PLUG: these WIFI plugs let you control electrical devices from anywhere using our App on your smartphone; even if you‚Äôre out of the house; you can still conveniently switch on the microwave oven or indoor festive lights     PROGRAMMABLE WIFI PLUG IN SWITCH: you can easily program your WIFI plug up to 12 times on/off daily; including countdown; random/vacation; and sunrise/sunset schedules; giving you full control on how you want to use your devices and energy savings     NO HUB OR SETUP REQUIRED: the WIFI outlet plug lets you use your existing wireless router and doesn‚Äôt required any setup or incur monthly charges     GET READY FOR A SMART HOME: great for remote controlling lamps; fans; radios; or holiday lights; you can effortlessly program the smart WIFI plug to switch on/off on a daily; weekday or weekend schedules",
      "details": {
        "brand": "Woods",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "White",
        "ram": "N/A",
        "detail_item": "WIFI SMART PLUG: these WIFI plugs let you control electrical devices from anywhere using our App on your smartphone; even if you‚Äôre out of the house; you can still conveniently switch on the microwave oven or indoor festive lights"
      }
    },
    {
      "id": "B0836HL66P",
      "name": "TP-Link Tapo Smart Plug Mini, Smart Home Wifi Outlet Works with Alexa Echo & Google Home, No Hub Required, New Tapo APP Needed (P100 4-pack)",
      "ratings": 962,
      "price": "$33.99",
      "image": "https://m.media-amazon.com/images/I/41XwX4pFtwL.__AC_SY300_SX300_QL70_FMwebp_.jpg",
      "description": "TAPO SMART DEVICES WILL ONLY WORK WITH THE TAPO APP. THE KASA SMART APP IS NOT COMPATIBLE WITH TAPO DEVICES     Voice Control: Pair your plug with Alexa or Google Assistant to easily control your smart plug with just your voice.     Scheduling: Set schedules for each of your appliances to automate your day. Let Tapo turn on the coffee pot to wake you up or turn off the lights let you sleep.     Multi-User Access: Allows family members to control the smart plug using their own device.     Easy Setup: Setup is quick and simple using Bluetooth and the friendly Tapo app.",
      "details": {
        "brand": "Tapo",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "white",
        "ram": "N/A",
        "detail_item": "TAPO SMART DEVICES WILL ONLY WORK WITH THE TAPO APP. THE KASA SMART APP IS NOT COMPATIBLE WITH TAPO DEVICES"
      }
    },
    {
      "id": "B09LVN3PF8",
      "name": "Govee Dual Smart Plug 2 Pack, 15A WiFi Bluetooth Outlet, Work with Alexa and Google Assistant, 2-in-1 Compact Design Bundle with Govee Smart Plug, WiFi Plugs Work with Alexa & Google Assistant",
      "ratings": 29,
      "price": "$28.99",
      "image": "https://m.media-amazon.com/images/I/51Q7DOvFM7L.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Wireless App Control - Use the Govee Home App to access the Smart Plug via WiFi and Bluetooth to enjoy powerful control and convenient features no matter where you are. Note: Don't support 5G WiFi.     Smart Voice Control - Compatible with Alexa and Google Assistant for hands-free on/off control of your plugged-in devices and appliances. Note: Users must create a new Govee Home App account or be logged in to use this Wi-Fi Plug.     Compact 2-in-1 Design - With 2 horizontally-positioned plugs, Dual Smart Plug only covers a single outlet in a normal vertical outlet fixture. This means you can expand your 2-socket fixtures into 4 smart outlets.     2023 Stability Upgrade: Supports Bluetooth or WiFi connection, which is more stable and faster than plugs that can only be connected through WiFi. No disconnection worries, control all your home appliances and devices anytime & anywhere.     Scheduling & Group Controller: Create customized schedules to power your electronic appliances on/off automatically for helping save energy and money. And with a single tough of one button, you can manage multiple smart plugs simultaneously.",
      "details": {
        "brand": "Govee",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "Wireless App Control - Use the Govee Home App to access the Smart Plug via WiFi and Bluetooth to enjoy powerful control and convenient features no matter where you are. Note: Don't support 5G WiFi."
      }
    },
    {
      "id": "B07ZVQXB4R",
      "name": "Z-Wave Dual Smart Outlet, Outdoor Zwave Smart Plug, Waterproof Dual On/Off Socket, Z Wave Hub Required, Built-in Repeater, Compatible with SmartThings, Wink, Alexa, Google Assistant",
      "ratings": 732,
      "price": "$45.99",
      "image": "https://m.media-amazon.com/images/I/31vBspzYVQL._SY445_SX342_QL70_FMwebp_.jpg",
      "description": "【Z-Wave Plug & Long Range】: The Eva Logik ZW97 dual smart socket Z-Wave plug offers better signal coverage than ever before, faster communication, enhanced security, and effortless pairing. Once plugged in, this wall plug acts as a signal repeater, boosting connectivity between the hub and other devices. It can extend wireless coverage up to 1300 feet if your hub supports Long Range. Please note: It can enhance the transmission range of the signal, but not the signal strength.     【Remote & Voice Control】: Our dual on/off smart outlets support wireless control, allowing you to set schedules or scenes for your outdoor lighting and appliances, including seasonal and landscape lighting, fountains, and pumps, from anywhere. Enjoy hands-free voice control with Alexa & Google Home. Z-Wave Hub Required(and need hub compatibility with Alexa).     【Schedule, Timer & Save Energy】: Set automatic daily timers or create on/off routines so your outdoor smart plug can operate automatically. This helps save energy when plugged-in appliances are not needed or accidentally left on.     【Weather Resistant & Ideal for Outdoor Use】: This Z-Wave plug features IP65 weather-resistant housing, making it ideal for use in gardens, backyards, kitchens, bathrooms, porches, balconies, garages, basements, patios, or with electric grills, sprinklers, washing machines, Christmas trees, landscape lighting, fountains, lamps, pumps, and other outdoor or indoor electric appliances.     【Compact but Powerful】: Despite its compact size, the Z-Wave outlet supports a maximum load of up to 15A, with power specifications of 120V, 60Hz. Z-Wave Frequency: 908.42MHz. FCC & ETL listed. It is compatible with LED, halogen, incandescent, xenon, fluorescent, and compact fluorescent bulbs.     【Z-Wave Compatibility】: The Eva Logik Z-Wave outdoor plug is compatible with SmartThings, Vera, Wink, Fibaro, 2GIG, Hubitat, and more. CANNOT connect directly with Echo Plus (only ZigBee products can connect directly to Echo Plus). It is also compatible with Alexa & Google Assistant (requires a Z-Wave certified hub).",
      "details": {
        "brand": "EVA LOGIK",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "【Z-Wave Plug & Long Range】: The Eva Logik ZW97 dual smart socket Z-Wave plug offers better signal coverage than ever before, faster communication, enhanced security, and effortless pairing. Once plugged in, this wall plug acts as a signal repeater, boosting connectivity between the hub and other devices. It can extend wireless coverage up to 1300 feet if your hub supports Long Range. Please note: It can enhance the transmission range of the signal, but not the signal strength."
      }
    },
    {
      "id": "B09LGZNQD8",
      "name": "SONOFF S40 15A WiFi Smart Plug with Energy Monitoring ETL Certified, Smart Outlet Timer Switch, Work with Alexa & Google Home Assistant, IFTTT Supporting, 2.4 Ghz Wi-Fi Only 1-Pack",
      "ratings": 70,
      "price": "$12.51",
      "image": "https://m.media-amazon.com/images/I/51gLaKRTpWL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "[Monitor Energy Consumption]:Keep track of real-time power, current and voltage of your appliances on App.and Measure your appliances’ power consumption for 100-day daily/monthly energy usage data and total electricity cost.     [Works with Alexa & Google Home,IFTTT Supporting]: Link \"eWeLink Smart Home\" skill. You can directly ask Amazon Echo/Echo Dot/Amazon Tap to turn on/off your SONOFF devices.Link \"eWeLink Smart Home\" on Google Home app, start to voice control your SONOFF devices on Google Home.     [Smart Remote Control Plug]: You can remotely/timely control ON/OFF any connected home appliance via APP eWeLink on your smart phone or tablet. No distance/time limitation.     [Set time schedules for the lights and home appliances]: You can set countdown/single/repeat timers to auto-turn on/off the WiFi controlled outlet on App. One tap ON/OFF Energy Saving.     [Share control of devices to others]: You can simply share control of your home appliances to others so that they can also turn on/off the devices remotely.",
      "details": {
        "brand": "SONOFF",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "[Monitor Energy Consumption]:Keep track of real-time power, current and voltage of your appliances on App.and Measure your appliances’ power consumption for 100-day daily/monthly energy usage data and total electricity cost."
      }
    },
    {
      "id": "B00ZYLTDX0",
      "name": "WiOn 50053 Outdoor Wi-Fi Plug-In Yard Stake With Smartphone Or Tablet Automation for up to 12 devices; 3 Grounded Outlets And 6 Foot Cord",
      "ratings": 469,
      "price": "$12.99",
      "image": "https://m.media-amazon.com/images/I/71hyP-Wtu6L.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Control outdoor electrical devices from anywhere - using your smartphone with no hub required     Great for landscape security lights; holiday lights; and yard decorations for added convenience and energy savings     3 WiFi-controlled grounded outlets; waterproof housing with 6ft cord125Vac; 60Hz; 10A 1250W     Up to 12 ON/OFF settings per day; including countdown; random/vacation; and sunrise/sunset schedules Schedule daily; weekday; or weekend schedules     Height(inches):215Affordable home automation - works with your existing Wi-Fi router No hub required; no monthly feesExpand your WiOn system by simply adding up to 12 WiOn smart switchesFree app works with Apple (iOS 7 and higher) or Android (40 and higher) smart devicesProgramming options include - multiple on/off settings; countdown; random vacation; and sunrise/sunset schedulesRatings: 125-Volt / 60-Hertz; 1250-Watt; 10-Amp",
      "details": {
        "brand": "N/A",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "Control outdoor electrical devices from anywhere - using your smartphone with no hub required"
      }
    },
    {
      "id": "B07M86H949",
      "name": "TOPGREENER 4.2A 21W 3-Port Type C USB Outlet, 15 Amp Receptacle Plug, Charging Power Outlet with Dual Type C&A Ports, Screwless Wall Plate Included, UL Listed, TU21542AC2-WSID, White",
      "ratings": 10.308,
      "price": "$19.99",
      "image": "https://m.media-amazon.com/images/I/21fFzibTNML._SY445_SX342_QL70_FMwebp_.jpg",
      "description": "15A decoractor charging outlet with 1x USB-A port, 2x USB-C ports, and duplex tamper-resistant receptacles     High-speed and convenient charging for smartphones, tablets, laptops, and other USB devices     Child-safe tamper-resistant duplex receptacle increases safety by preventing unwanted objects from being inserted; complies with 2017 NEC Article 406.12     Slim body fits in standard junction boxes for easy installation or easy replacement; dimensions: 1.7”W × 2.7”H × 1.8”D     1-pack; white color with matching screwless wall plate; receptacle rating: 15 Amp, 125VAC; Type-A USB port: 5V/2.4A; Type-C USB port: 5V/1.5A; -4 to 140F operating temperature; clamp-type wiring (#12-14 AWG copper wire only); UL-listed; 1-year warranty",
      "details": {
        "brand": "N/A",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "15A decoractor charging outlet with 1x USB-A port, 2x USB-C ports, and duplex tamper-resistant receptacles"
      }
    },
    {
      "id": "B07XVR51PX",
      "name": "Brilliance LED BRI-WIFI-Smart-Socket-2 Smart Lighting Controller",
      "ratings": 92,
      "price": "$69.99",
      "image": "https://m.media-amazon.com/images/I/51TnR0-rwkL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "",
      "details": {
        "brand": "N/A",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "N/A"
      }
    },
    {
      "id": "B07KB8X234",
      "name": "TOPGREENER DimmerLight Switch LED Dimmer Switch, Full Range Dimming, Single Pole/3-Way,300W LED/CFL, Neutral Wire Not Required, Wall Plate Included,Nickel",
      "ratings": 4,
      "price": "$19.99",
      "image": "https://m.media-amazon.com/images/I/31cIUEOYZVL._SY445_SX342_QL70_FMwebp_.jpg",
      "description": "Dim LED lights to create the perfect ambiance with the Kalide dimmer wall switch; supported by major-brand light bulbs from GE, Cree, Philips, Sylvania, Lithonia, Hyperikon, Amazon Basics, EcoSmart, and more; not compatible with smart lighting fixtures     Features an easy-to-use sliders for full-range dimming and a simple ON/OFF light paddle switch     The preset toggle that allows you to fine-select the type of light; perfect for both residential and commercial locations such as offices, showrooms, family rooms, home theaters, and more     Made of Polycarbonate Thermoplastic material to provide the durability and resilience needed to withstand hard impacts and heavy force; heat & fade resistance to temperatures over 100° to prevent discoloration; flammability UL94; V2 rating     Nickel color; 300W LED/CFL; compatible with dimmable light bulbs only; single pole or three-way application; #14-#12 AWG (copper only); neutral wire not required; 1-year warranty; UL listed     Locator Light: Add an optional red locator light to easily find your dimmer switch in the dark; By factory setting, the locator light is on when the light is switched off and off when the light is switched on; The locator light could be switched off.",
      "details": {
        "brand": "TOPGREENER",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "Dim LED lights to create the perfect ambiance with the Kalide dimmer wall switch; supported by major-brand light bulbs from GE, Cree, Philips, Sylvania, Lithonia, Hyperikon, Amazon Basics, EcoSmart, and more; not compatible with smart lighting fixtures"
      }
    },
    {
      "id": "B094YHC2KJ",
      "name": "MoesGo Smart Power Wall Outlet with USB, WiFi Socket with 2 Plug outlets 15 Amp Divided Control, Smart Life/Tuya APP Remote Controller, ETL Certified, Work with Alexa and Google Home, No Hub Required",
      "ratings": 133,
      "price": "$22.99",
      "image": "https://m.media-amazon.com/images/I/31vZFcnSOkS._SY445_SX342_QL70_FMwebp_.jpg",
      "description": "1.【Indicator Light】: Power and Wi-Fi indicator lights on the face plate help you to know more clearly about the socket operation and make less confusion.     2.【Voice Control】: MoesGo smart sockets are compatible with Amazon Alexa and Google Home. Just control it via your voice to turn power on/off. No hub required and easy to install.     3.【USB Charger】: One USB changer can control the power on/off via smart phone, no additional button on the plate. If the phone is charging while you are sleeping, do a easy step to turn the power off at the time you set via smart phone.     4.【Schedules/ Counterdown】: You can turn power on/off on your own timetable, or set a countdown to turn power on/off from 1 min to 60 mins via 'smart life' app. Remotely check if the power is off or not, more safe and power-saving.     5.【Divided Outlet Control】: Control both the top/bottom outlets and USB separately, it means you can control multiple separate electronic devices right from your smart phone.Note:Only support 2.4G WiFi.",
      "details": {
        "brand": "MoesGo",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "White",
        "ram": "N/A",
        "detail_item": "1.【Indicator Light】: Power and Wi-Fi indicator lights on the face plate help you to know more clearly about the socket operation and make less confusion."
      }
    },
    {
      "id": "B09B3QCXTN",
      "name": "Govee Smart Plug, WiFi Bluetooth Outlets 2 Pack Work with Alexa and Google Assistant Bundle with Govee Smart Plug, WiFi Plugs Work with Alexa & Google Assistant, Smart Outlet with Timer & Group",
      "ratings": 56,
      "price": "$19.99",
      "image": "https://m.media-amazon.com/images/I/51NjiGi9CIL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "More Stable Connectivity: Use Govee Home App to access the Smart Plug via WiFi and Bluetooth, enjoy powerful control and convenient features with wifi plug control all your home appliances and devices anywhere & anytime. Note: Don't support 5G WiFi.     Smart Voice Control: Simply say a few words to Alexa or Google Home for true hands-free control of wifi smart outlets, meaning more time resting on the sofa, gaming and watching movies. Note: Please download Govee Home App to control wifi plugs.     Scheduling & Group Controller: Create customized schedules to power your electronic appliances on/off automatically for helping save energy and money. And with a single tough of one button, you can manage multiple smart plug for alexa simultaneously.     Designed for Practicality: Specially sized and shaped to only take up one outlet at a time and leave others free. Made to be compact and invisibility fit in with your home devices and save more spaces. Smart plug suits for every corner of your room.     Safety as Priority: Wifi outlet not only fully FCC and ETL certified, but also uses fire-resistant material and construction to be a safe smart partner. Note: Users must create a new Govee Home App account or be logged in to use this Wi-Fi Plug.",
      "details": {
        "brand": "Govee",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "More Stable Connectivity: Use Govee Home App to access the Smart Plug via WiFi and Bluetooth, enjoy powerful control and convenient features with wifi plug control all your home appliances and devices anywhere & anytime. Note: Don't support 5G WiFi."
      }
    },
    {
      "id": "B08BLS9FR3",
      "name": "Z-Wave Outlet Plug-in Socket, Z-Wave Plus Smart Plug, 1 On/Off Outlet & 1 Alway On Outlet, Z Wave Hub Required, Built-in Repeater, Works with SmartThings, Wink, Alexa, Google Assistant",
      "ratings": 451,
      "price": "$35.99",
      "image": "https://m.media-amazon.com/images/I/31-LtK-ocBL._SY445_SX342_QL70_FMwebp_.jpg",
      "description": "【Z-Wave Dual Sockets Outlet】: Eva Logik ZW36 dual sockets Z-Wave smart outlet is equipped with a 10 Amp Max Smart On/Off Outlet and a 15 Amp Max Always On Outlet, which can meet your various needs. The total load capacity for both outlets is 1800W (15A) resistive.     【Compact but Powerful】: This Z-Wave smart outlet allows you to still use the top outlet by plugging this into the bottom outlet, ensuring the top remains usable. Compared to other plugs, our smart plug sets the socket on the side, preventing tilting. It is designed for most residential lighting and motor applications, compatible with LED, halogen, incandescent, xenon, fluorescent and compact fluorescent bulbs.     【Remote Control and Voice Control】: Enjoy the convenience of remotely controlling connected devices through a Z-Wave controller, providing flexibility and accessibility. Enjoy hands-free voice control with Alexa & Google Home, Z-WAVE HUB REQUIRED(and need hub compatibility with Alexa).     【Timer,Schedule & Save Money】: This Z-Wave smart outlet allows you to personalize device names, schedules, and automation settings according to your preferences. Reduce your electricity bill by controlling the devices connected to the zwave plug to turn on or off at specific times via a schedule. This zwave plug can also be combined with other devices to set customized scenes to provide automated living!     【Z-Wave Compatibility】: Eva Logik z-wave smart outlet is compatible with SmartThings, Vera, Wink, Fibaro, Homeseer, 2GIG, and Hubitat and more. CANNOT connect directly to ECHO PLUS (only ZigBee products can connect directly to Echo Plus)! It is also compatible with Alexa & Google Assistant (a Z-Wave certified hub is required).     【Long Range】: The smart plug has better signal coverage than ever, and faster communication, with authenticated security and effortless pairing. Once plugged in, the wall plug acts as a signal repeater that boosts connectivity between hub and devices. Please NOTE: It can enhance the transmission range of the signal, but not the signal strength.",
      "details": {
        "brand": "EVA LOGIK",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "white",
        "ram": "N/A",
        "detail_item": "【Z-Wave Dual Sockets Outlet】: Eva Logik ZW36 dual sockets Z-Wave smart outlet is equipped with a 10 Amp Max Smart On/Off Outlet and a 15 Amp Max Always On Outlet, which can meet your various needs. The total load capacity for both outlets is 1800W (15A) resistive."
      }
    },
    {
      "id": "B07ZQYVXH8",
      "name": "TP-Link Tapo Smart Plug Mini, Smart Home Wifi Outlet Works with Alexa Echo & Google Home, No Hub Required, Remote Control Your Home Appliances from Anywhere, New Tapo APP Needed (P100)",
      "ratings": 561,
      "price": "$12.98",
      "image": "https://m.media-amazon.com/images/I/41l5Sds77SL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Control from Anywhere: Control your small appliances from anywhere at anytime, whether you're in another room or away from home.     TAPO SMART DEVICES WILL ONLY WORK WITH THE TAPO APP. THE KASA SMART APP IS NOT COMPATIBLE WITH TAPO DEVICES     Multi-User Access: Allows family members to control the smart plug using their own device.     Scheduling: Set schedules for each of your appliances to automate your day. Let Tapo turn on the coffee pot to wake you up or turn off the lights let you sleep.     Easy Setup: Setup is quick and simple using Bluetooth and the friendly Tapo app.     Compact Design: Its compact design leaves adjacent outlets open for use.     For light use. Maximum Load, 10Amp, 1200watt.",
      "details": {
        "brand": "TP-Link",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "Control from Anywhere: Control your small appliances from anywhere at anytime, whether you're in another room or away from home."
      }
    },
    {
      "id": "B08429W9B5",
      "name": "Enbrighten Zigbee Dimmer, Dual Outlet Control Plug-In, Pairs Directly with Echo 4th Gen/Echo Show 10 (All)/Echo Studio/Echo Plus (All)/Eero Pro 6, White, 43096",
      "ratings": 101,
      "price": "$29.16",
      "image": "https://m.media-amazon.com/images/I/41REaBcNA4L._SY445_SX342_QL70_FMwebp_.jpg",
      "description": "VOICE CONTROL – Pair directly with 1st and 2nd generation Echo Plus, Echo Show 10, or Echo Studio immediately out of the package for easy voice command of connected devices. No additional equipment is required for use with these Echo models. Other Alexa and Google Assistant products can also be used for voice control when connected through a compatible Zigbee hub.     DUAL-OUTLET DESIGN – Two grounded, Zigbee-enabled outlets are operated and scheduled at the same time (not individually controlled). A side-access design easily fits behind furniture, and the smart switch only occupies the top outlet of a duplex receptacle.     FULL-RANGE DIMMABILITY – Adjust brightness levels of dimmable LEDs and CFLs as well as incandescent and halogen lights from 0-100 percent, which reduces energy costs and improves bulb life. It is also ideal for creating the perfect ambiance or providing ample task lighting.     TRUSTED NETWORK – Zigbee 3. 0 is forward and backward compatible and does not use well-known network keys, which allows reliable, safe home automation. Certified device-to-device interoperability and a proven mesh network eliminate single points of failure while supporting large networks.     RANGE EXTENDER – The plug-in Zigbee dimmer repeats the signal from your hub or other Zigbee device to extend wireless range by up to 150ft.",
      "details": {
        "brand": "Enbrighten",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "White",
        "ram": "N/A",
        "detail_item": "VOICE CONTROL – Pair directly with 1st and 2nd generation Echo Plus, Echo Show 10, or Echo Studio immediately out of the package for easy voice command of connected devices. No additional equipment is required for use with these Echo models. Other Alexa and Google Assistant products can also be used for voice control when connected through a compatible Zigbee hub."
      }
    },
    {
      "id": "B08R5B3VWV",
      "name": "Satco S11270 Starfish 3-Inch On/Off and Dimmer WiFi Smart Plug Outlet, Works with Siri, Alexa, Google Assistant, SmartThings, White",
      "ratings": 145,
      "price": "$16.30",
      "image": "https://m.media-amazon.com/images/I/71DaKUiUgRL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "WIFI SMART PLUG: 2.4 GHz WiFi enabled (no hub required) plug offers secure, smart appliance control of your home by voice or Starfish mobile app compatible with Siri, Alexa, Google Assistant, and SmartThings     ON/OFF SWITCH: An on-off switch is located on the outlets for manual override     COMPACT SIZE: Compact rectangular size dimmer outlet with white finish measures 2.87 x 1.69 x 1.97 inches     CONTROL SMALL APPLIANCES: Grounded smart plug is rated to 15A / 300 Watts maximum for use with small appliances such as table lamps, coffee makers, and other electronics     SAFETY LISTING: Dry Location Listed; cETLus Listed; RoHS Compliant; FCC Listed",
      "details": {
        "brand": "Satco",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "WIFI SMART PLUG: 2.4 GHz WiFi enabled (no hub required) plug offers secure, smart appliance control of your home by voice or Starfish mobile app compatible with Siri, Alexa, Google Assistant, and SmartThings"
      }
    },
    {
      "id": "B098ZHQKV1",
      "name": "Unknown Product",
      "ratings": null,
      "price": "N/A",
      "image": "N/A",
      "description": "",
      "details": {
        "brand": "N/A",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "N/A"
      }
    },
    {
      "id": "B00ZYLUBJU",
      "name": "Unknown Product",
      "ratings": null,
      "price": "N/A",
      "image": "N/A",
      "description": "",
      "details": {
        "brand": "N/A",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "N/A"
      }
    },
    {
      "id": "B01NBI0A6R",
      "name": "Unknown Product",
      "ratings": null,
      "price": "N/A",
      "image": "N/A",
      "description": "",
      "details": {
        "brand": "N/A",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "N/A"
      }
    },
    {
      "id": "B097RD83QY",
      "name": "MOES Smart WiFi Cooling Heating Thermostat Outlet, Tuya Digital Temperature Controller Sensor Plug for Reptile Fermenter Brewing Breeding Heat Mat, Smart Life Remote Control, -22-221℉,10A 1250W",
      "ratings": 114,
      "price": "$39.99",
      "image": "https://m.media-amazon.com/images/I/6159FF6VIBL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "【Simple Setup】 Moes WiFi temperature controller comes with smart heating and cooling outlet plugs ; Simply plug in the smart reptile thermostat, you can mount or hang the plug to your own need; it allows to place it to the wall stably or glass with the suction cup on the probe. Can turn on/off the buzzer by long press the down key. Moes thermostat switch controller could work with Alexa and Google Home.     【Advanced APP Remote Control】 Adjust the settings and monitor the smart reptile thermostat controller on your smart phones via Smart Life App anytime from anywhere; Temps record is featured in App for added convenience to adjust the room temperature more intelligently; Help you locate the detailed data to better monitor the scenes; An alert notification will automatically send to you once the temp exceed the setting range.     【Easy Install and Use】 WiFi smart digital temperature controller support -22~221℉ / -30~105℃, fits well for extreme temperature in summer or winter; Each thermostat controlled outlet support 10A, 1250W, suitable for main heater and cooler; Ideal for reptile, homebrew, fermentation, breeding, incubation, greenhouse and more with its wide compatibility featured.     【Durable Salt-proof Probe】The thermostat probe is salt & spray resistance and replaceable with fast response and high accuracy; It can be widely used in a variety of scenarios that need automatic temperature control; Data measurements are updated every 1s to offer you latest changes of the temperature for more accurate and desired temperature settings.     【Upgrade Mode】 Designed with upgraded program to avoid the constantly trigger of the device after the thermostat reaches its set value; When exceed, the smart cooling or heating outlet will automatically turn on; It will operate for a period of time to keep the temperature at a more stable level.",
      "details": {
        "brand": "MOES",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "Black",
        "ram": "N/A",
        "detail_item": "【Simple Setup】 Moes WiFi temperature controller comes with smart heating and cooling outlet plugs ; Simply plug in the smart reptile thermostat, you can mount or hang the plug to your own need; it allows to place it to the wall stably or glass with the suction cup on the probe. Can turn on/off the buzzer by long press the down key. Moes thermostat switch controller could work with Alexa and Google Home."
      }
    },
    {
      "id": "B074K3NFZQ",
      "name": "meross Wi-Fi Smart Plug Mini, 15 Amp & Reliable Wi-Fi Connection, Alexa and Google Voice Control, App Remote Control, Timer, Occupies Only One Socket, No Hub Needed",
      "ratings": 1.083,
      "price": "$7.64",
      "image": "https://m.media-amazon.com/images/I/31DvdMp+OyL._SX342_SY445_.jpg",
      "description": "APP Remote Control: Turn electronics on/off from anywhere on your smart phone with the Meross app. You can check to see the status of connected devices from anywhere any time. All data is securely transmitted and stored using AWS servers in US.     Voice Control: You can control your devices hands free, just make a voice commands to turn on/off the connected devices. Compatible with the Amazon Alexa, Google Assistant and SmartThings.     Compact Size: Occupies only one socket, allows you to stack two Mini Smart Plugs in the same outlet, more convenient and practical.     Schedule and Timmer Setting: You can schedule connected device to turn on and off automatically. Added benefit of saving energy when lights are not needed or are left on by accident. Support sunrise and sunset setting.     Quality and Service : The mini plug is made of PC flame retardant material, has been approved for safety and quality assurance. Certified by ETL(5009830) and FCC(2AMUU-MSS110) in USA, PSE(18031354) and Telec(Mark Number JN0810 i01) in Japan. And it supports any home device up to 15A. Any problem, please feel free to contact us without any hesitation and we’ll find a solution until you are satisfied.",
      "details": {
        "brand": "meross",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "white",
        "ram": "N/A",
        "detail_item": "APP Remote Control: Turn electronics on/off from anywhere on your smart phone with the Meross app. You can check to see the status of connected devices from anywhere any time. All data is securely transmitted and stored using AWS servers in US."
      }
    },
    {
      "id": "B08HFXDXZB",
      "name": "UltraPro Smart Plug WiFi Outlet, Smart Home, Smart Switch, Dual Smart Outlet, Works with Alexa, Echo & Google Home, No Hub Required, App Controlled, ETL Certified, Alexa Plug, 2 Pack, 51403",
      "ratings": 316,
      "price": "$18.55",
      "image": "https://m.media-amazon.com/images/I/41VPtuq7RfL._SY445_SX342_QL70_FMwebp_.jpg",
      "description": "2.4GHz Wi-Fi Compatible – Connects to 2.4GHz networks of single-, dual- and tri-band routers through effortless pairing options for use with the latest home Wi-Fi equipment. DOES NOT WORK WITH 5GHz NETWORKS.     Voice Control – No hub required for voice commands through Amazon Alexa and Google Assistant.     Easy-to-Use App – Versatile UltraPro app available in the Apple App Store and Google Play simplifies network connection for hassle-free mobile operation of lights, fans and more. Alerts and do-not-disturb function allow personalized monitoring without inconvenient interruptions.     Simple Setup – Schedules and automations support full customization based on times, presets, weather, location and other factors. Organize devices by rooms and homes to control several locations from one app.     Space-Saving Design – 2 Indoor plug-in switches feature 2 grounded, simultaneously controlled outlets with a manual ON/OFF button and only occupies one outlet of a duplex receptacle.",
      "details": {
        "brand": "UltraPro",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "Oval Dual Outlet",
        "ram": "N/A",
        "detail_item": "2.4GHz Wi-Fi Compatible – Connects to 2.4GHz networks of single-, dual- and tri-band routers through effortless pairing options for use with the latest home Wi-Fi equipment. DOES NOT WORK WITH 5GHz NETWORKS."
      }
    },
    {
      "id": "B084X6FHYB",
      "name": "Unknown Product",
      "ratings": null,
      "price": "N/A",
      "image": "N/A",
      "description": "",
      "details": {
        "brand": "N/A",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "N/A"
      }
    },
    {
      "id": "B07TT2BGRJ",
      "name": "Smart Wall Plug, YoLink 1/4 Mile World's Longest Range Smart in-Wall Outlet 15A Compatible with Alexa Google Assistant IFTTT, App Remote Timer Schedules Scene Automation Control, YoLink Hub Required",
      "ratings": 50,
      "price": "$37.99",
      "image": "https://m.media-amazon.com/images/I/31JZCLTZ99L._SY445_SX342_QL70_FMwebp_.jpg",
      "description": "World's Longest Wireless Range: Powered by LoRa technology, the long-range yet low-power system offers the industry’s longest receiving range in the market (1/4 mile). Our long-range coverage enables its use in areas challenging for most residential Wi-Fi systems, such as basements, outdoor porch/patio areas, sheds, free-standing garages, even remote outbuildings on your property.     Works With Alexa & Google Voice Assistants: Supercharge your YoLink system by adding the YoLink skill to Alexa or Google Assistant. Control your YoLink devices by voice command (“Alexa, turn off the fan” – “OK!”) and control your YoLink devices as part of routines/automations that may include other, third-party, smart devices integrated with Alexa/Google.     Simple & Easy! YoLink’s Scan & Play smartphone app feature will have your smart plug up & ready in just a couple minutes! And the Wall Plug could not be easier to install: just add it to the app, and plug it into an available 120V receptacle. Done! Enjoy the convenience and energy bill savings of your new smart plug.     Set it & Forget it: Tired of forgetting to turn something off, or worried about leaving an iron or space heater on, or are there appliances/devices that you regularly turn off/on but wish it was automatic? Now, use the YoLink app to schedule automations, to automatically turn the power on or off at the time of your choice, on the days of the week of your choice.     YoLink Hub Required but not included - YoLink Hub is the only central controller for YoLink devices, and it connects YoLink devices into the internet and the cloud. Without YoLink Hub, this smart outlet does not work with YoLink app and does not support 3rd-party integration with Alexa, Google Home and IFTTT. Please search B07TQLKQLJ for the hub or try our Smart Home Starter kit B07V246GCX",
      "details": {
        "brand": "YoLink",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "World's Longest Wireless Range: Powered by LoRa technology, the long-range yet low-power system offers the industry’s longest receiving range in the market (1/4 mile). Our long-range coverage enables its use in areas challenging for most residential Wi-Fi systems, such as basements, outdoor porch/patio areas, sheds, free-standing garages, even remote outbuildings on your property."
      }
    },
    {
      "id": "B081VR9HK4",
      "name": "Unknown Product",
      "ratings": null,
      "price": "N/A",
      "image": "N/A",
      "description": "",
      "details": {
        "brand": "N/A",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "N/A"
      }
    },
    {
      "id": "B08HFYWDPT",
      "name": "UltraPro Outdoor Smart Plug Wi-Fi Outlet, Smart Home, Smart Switch, Dual Smart Outlet, Works with Alexa, Echo & Google Home, No Hub Required, App Controlled, ETL Certified, Outdoor Timer, Black, 51405",
      "ratings": 137,
      "price": "$19.53",
      "image": "https://m.media-amazon.com/images/I/812LpU1JqjL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "2.4GHz Wi-Fi Compatible – Connects to 2.4GHz networks of single-, dual- and tri-band routers through effortless pairing options for use with the latest home Wi-Fi equipment. DOES NOT WORK WITH 5GHz NETWORKS.     Voice Control – No hub required for voice commands through Amazon Alexa and Google Assistant.     Easy-to-Use App – Versatile UltraPro app available in the Apple App Store and Google Play simplifies network connection for hassle-free mobile operation of lights, fans and more. Alerts and do-not-disturb function allow personalized monitoring without inconvenient interruptions.     Simple Setup – Schedules and automations support full customization based on times, presets, weather, location and other factors. Organize devices by rooms and homes to control several locations from one app.     Heavy-Duty Design – 2 simultaneously controlled outlets and weather-resistant construction withstand the elements.",
      "details": {
        "brand": "UltraPro",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "Outdoor Dual Outlet",
        "ram": "N/A",
        "detail_item": "2.4GHz Wi-Fi Compatible – Connects to 2.4GHz networks of single-, dual- and tri-band routers through effortless pairing options for use with the latest home Wi-Fi equipment. DOES NOT WORK WITH 5GHz NETWORKS."
      }
    },
    {
      "id": "B078HVGKMC",
      "name": "Unknown Product",
      "ratings": null,
      "price": "N/A",
      "image": "N/A",
      "description": "",
      "details": {
        "brand": "N/A",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "N/A"
      }
    },
    {
      "id": "B08H1V6N6D",
      "name": "Alexa Smart Plugs 2 Pack - Wireless 2.4G WiFi Outlet Controlled by Smart Life Tuya Avatar Controls APP Compatible with Google Assistant SmartThing Siri, 10A Mini Socket Enchufe Inteligente with Timer",
      "ratings": 415,
      "price": "$19.42",
      "image": "https://m.media-amazon.com/images/I/51aDBQMX2xL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "【Voice Control by Alexa and Google Home】These smart plugs compatible with Alexa and Google Assistant by voice control. Good compatibility lets you control your smart devices so easily by saying simple commands to your Amazon Alexa Echo or Google Assistant device     【Programmable Countdown Timer & Schedule】This wifi smart plug is programmable by APP of Avatar Controls/Tuyasmart/Smart Life. You will never come home to a dark house. Lights will turn on at dusk and turn off at dawn automatically when you set the schedule     【Group Control and Family Sharing】 These smart plugs with 30 group timing, you can easily set up your smart home devices group in app, and one tap sharing, sharing the devices group to your family members     【Faster Connection via Bluetooth】Boring to connect a smart plug that takes you a whole hour? We offer the latest generation smart Wi-Fi & Bluetooth plugs. Connect automatically via Bluetooth and pair AvatarControls Wifi mini smart plugs to your Wi-Fi network. It is much easier and faster than the wifi smart outlets sold now     【Wide Applications WiFi Plugs】These smart outlets that work with Alexa or Google Home can be installed in many places indoor, as a switch for bed lamps, reading lamps, table lights, TV, floor fans, etc. Just Note: Maximum 1100 Watts, Do Not overload. We offer 1-year warranty and lifetime support. Any questions, feel free to contact us.",
      "details": {
        "brand": "Avatar Controls",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "【Voice Control by Alexa and Google Home】These smart plugs compatible with Alexa and Google Assistant by voice control. Good compatibility lets you control your smart devices so easily by saying simple commands to your Amazon Alexa Echo or Google Assistant device"
      }
    },
    {
      "id": "B07NDRCTJK",
      "name": "FIBARO Smart Implant Z-Wave Plus Plugin Universal DIY Tool, FGBS-222, doesn't Work with HomeKit",
      "ratings": 71,
      "price": "$44.99",
      "image": "https://m.media-amazon.com/images/I/51kzGOavFiL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Compatible with any certified Z-Wave or Z-Wave Plus controller     Supports Z-Wave network Security Modes: S0 with AES-128 encryption and S2 Authenticated with PRNG-based encryption     Works as a Z-Wave signal repeater     Allows for connecting: 6 DS18B20 sensors, 1 DHT sensor, 2 2-wire analog sensors, 2 3-wire analog sensor, 2 binary sensors     Built-in temperature sensor",
      "details": {
        "brand": "FIBARO",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "doesn't work with HomeKit",
        "ram": "N/A",
        "detail_item": "Compatible with any certified Z-Wave or Z-Wave Plus controller"
      }
    }
  ]
}