{
  "totalProducts": 121,
  "products": [
    {
      "id": "B0CSDN2136",
      "name": "SM900 Green Wired Gaming Mouse with Honeycomb Shell,12800 DPI,7 Programmable Buttons,Lightweight Gaming Mice Ergonomic Computer Mouse Gaming for Windows/PC/Mac/Laptop Gamer",
      "ratings": 440,
      "price": "$14.99",
      "image": "https://m.media-amazon.com/images/I/61e-WA4G18L.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "6 Levels Adjustable DPI:SM900 is a powerful gaming mouse with excellent performance,It supports 6 levels adjustment DPI up to 12800.Rolling Rate max to 1000Hz,According user's preference setup different DPI and Rolling Rate suitable for games, office and many occasions     4 Mode Switch:SM900 gaming wired mouse supports 4 modes switch, default 1 office mode and 3 gaming modes.Gaming modes need setup by macro software, according to the user's gaming preferences setup different button functions     Support Custom and Macro Program:SM900 lightweight gaming mouse supports macro settings, user can reset the mouse buttons, DPI,modes, lighting effects.Customize personalized gaming mouse according to user preferences.This mouse is widely supported Windows 7,8,10,XP,,VISTA,MAC OS, etc, The USB interface is plug and play     3 Sided Honeycomb Shell design:More breathable, more sweat-absorbent and more comfortable!!!The gaming mouse is made of high quality ABS material and designed with ergonomic hollow perforated housing, Ergonomic Design reduce the weight and make the mouse more flexible and easier to be used for a long time without fatigue, and also enhance the heat dissipation features, very comfortable to use     14 RGB Rainbow Backlight:SM900 pc gaming mice has adjustable RGB lights that can be set to different effects according to user preferences. The brilliant lighting effects provide illumination in dark environments also increases the fun of using",
      "details": {
        "brand": "SOLAKAKA",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "USB",
        "color": "Green",
        "ram": "N/A",
        "detail_item": "6 Levels Adjustable DPI:SM900 is a powerful gaming mouse with excellent performance,It supports 6 levels adjustment DPI up to 12800.Rolling Rate max to 1000Hz,According user's preference setup different DPI and Rolling Rate suitable for games, office and many occasions"
      }
    },
    {
      "id": "B0CQ2XNV5Z",
      "name": "Wireless Mouse Rechargeable,[Battery Level Visible] 2.4G Silent Ultra Slim Portable Mouse,4 Adjustable DPI 800/1000/1200/1600 Quiet Click Cordless Mouse for Laptop PC Computer-Black",
      "ratings": 6.435,
      "price": "$9.99",
      "image": "https://m.media-amazon.com/images/I/51cOehjnrYL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "【Rechargeable and Cordless】 - Our Wireless Mouse Rechargeable features a built-in 700mAh rechargeable battery, eliminating the need for additional batteries. Comes with a charging cable for easy charging. Just charge for 2 hours and enjoy up to 30 days of wireless use.     【Battery Level Indicator】 - Designed with LED indicators, our mouse allows you to easily monitor the battery level. When the battery is above 60%, 3 LED lights will be displayed; when it is between 30%-60%, 2 LED lights will be displayed; and when it is between 10%-30%, 1 LED light will be displayed. It will also give a reminder sound when the battery is running low, preventing any unexpected battery drain.     【Silent Operation】 - With silent buttons producing noise below 30dB, our mouse is perfect for use in coffee shops, libraries, offices, or bedrooms where you want to avoid disturbing others.     【Stable Wireless Connection】 - Utilizing USB 2.4G transmission technology, our mouse provides a stable wireless signal up to 10 meters. It is widely compatible with laptops and desktop computers that have a USB port (not compatible with devices without USB ports).     【Slim and Portable 】- With its sleek and slim design, our mouse is easy to carry, making it a must-have for travel. It also offers 4 adjustable DPI levels (800/1000/1200/1600) to meet your various needs in daily life.     Experience the convenience of a rechargeable and cordless mouse with our Wireless Mouse Rechargeable. Say goodbye to constantly buying batteries and enjoy silent operation with a stable wireless connection. Get yours now and enhance your computing experience!     【Please note:】Devices without a USB Type-A port cannot directly use it, such as Mac, which requires an external Type-C HUB with a USB Type-A port in order to use this mouse.",
      "details": {
        "brand": "Anmck",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "USB",
        "color": "LED-Black",
        "ram": "N/A",
        "detail_item": "【Rechargeable and Cordless】 - Our Wireless Mouse Rechargeable features a built-in 700mAh rechargeable battery, eliminating the need for additional batteries. Comes with a charging cable for easy charging. Just charge for 2 hours and enjoy up to 30 days of wireless use."
      }
    },
    {
      "id": "B004YAVF8I",
      "name": "Logitech M185 Wireless Mouse, 2.4GHz with USB Mini Receiver, 12-Month Battery Life, 1000 DPI Optical Tracking, Ambidextrous PC/Mac/Laptop - Swift Gray",
      "ratings": 33.735,
      "price": "$13.98",
      "image": "https://m.media-amazon.com/images/I/5181UFuvoBL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Plug-and-play wireless: Get a reliable connection from a convenient nano receiver that stays in your computer     1-year battery life: Go for a full year without a battery change (Battery life may vary based on user and computing conditions)     Logitech reliability: Made by the global leader for mice and backed by a 3-year limited hardware warranty     Contoured shape: Gives you more comfort and control     For Windows and Mac computers: No software or setup hassles-start using your mouse right away",
      "details": {
        "brand": "Logitech",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "USB",
        "color": "Swift Gray",
        "ram": "N/A",
        "detail_item": "Plug-and-play wireless: Get a reliable connection from a convenient nano receiver that stays in your computer"
      }
    },
    {
      "id": "B07GBZ4Q68",
      "name": "Logitech G502 HERO High Performance Wired Gaming Mouse, HERO 25K Sensor, 25,600 DPI, RGB, Adjustable Weights, 11 Programmable Buttons, On-Board Memory, PC / Mac",
      "ratings": 53.177,
      "price": "$37.49",
      "image": "https://m.media-amazon.com/images/I/61mpMH5TzkL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Hero 25K sensor through a software update from G HUB, this upgrade is free to all players: Our most advanced, with 1:1 tracking, 400-plus ips, and 100 - 25,600 max dpi sensitivity plus zero smoothing, filtering, or acceleration     11 customizable buttons and onboard memory: Assign custom commands to the buttons and save up to five ready to play profiles directly to the mouse     Adjustable weight system: Arrange up to five removable 3.6 grams weights inside the mouse for personalized weight and balance tuning     Programmable RGB Lighting and Lightsync technology: Customize lighting from nearly 16.8 million colors to match your team's colors, sport your own or sync colors with other Logitech G gear     Mechanical switch button tensioning: Metal spring tensioning system and pivot hinges are built into left and right gaming mouse buttons for a crisp, clean click feel with rapid click feedback     1 year hardware limited warranty. USB report rate: 1000Hz (1ms)     Microprocessor: 32-bit ARM. Use Logitech G HUB to save your settings to the on board memory on the mouse and take them with you. Your saved settings will work on any PC without additional software or any login required.",
      "details": {
        "brand": "Logitech G",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "USB",
        "color": "Black",
        "ram": "N/A",
        "detail_item": "Hero 25K sensor through a software update from G HUB, this upgrade is free to all players: Our most advanced, with 1:1 tracking, 400-plus ips, and 100 - 25,600 max dpi sensitivity plus zero smoothing, filtering, or acceleration"
      }
    },
    {
      "id": "B005EJH6Z4",
      "name": "Amazon Basics 2.4 Ghz Wireless Optical Computer Mouse with USB Nano Receiver, Black",
      "ratings": 57.555,
      "price": "$9.72",
      "image": "https://m.media-amazon.com/images/I/61YQeAUIboL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Smooth, precise and affordable wireless optical 3-button mouse with USB nano receiver for laptop, desktop and netbook PCs     2.4 GHz wireless (not Bluetooth) provides a powerful, reliable connection     Nano-receiver stays in the PC USB port or stows conveniently inside the wireless mouse when not in use (note: Receiver is stored within the mouse from production and needs to be removed upon setup)     Compatible with Windows 2000, XP, Vista, 7, 8, and 10     Easy installation - refer to user manual for instructions",
      "details": {
        "brand": "Amazon Basics",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "USB",
        "color": "Black",
        "ram": "N/A",
        "detail_item": "Smooth, precise and affordable wireless optical 3-button mouse with USB nano receiver for laptop, desktop and netbook PCs"
      }
    },
    {
      "id": "B08LW31NQ6",
      "name": "Lenovo 600 Bluetooth Silent Mouse, Blue Optical Sensor, Adjustable DPI, 4 Button, Microsoft Swift Pair, Windows, Chrome, GY50X88832, Gray",
      "ratings": 6.587,
      "price": "$22.99",
      "image": "https://m.media-amazon.com/images/I/51rbID42liL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Microsoft Swift Pair: Bluetooth 5.0 and Microsoft Swift Pair technology let you connect this mouse conveniently and pair effortlessly with up to two devices at once. With Dual-Host you can quickly switch between them with the push of a button     High-Precision: The blue optical sensor on the Lenovo 600 ensures accurate tracking on almost any surface, providing smooth and responsive performance for an enhanced computing experience. Experience uninterrupted usage for up to a year on a single AA battery     Silent Operation: Get more done with revolutionary, distraction-free silent buttons. Enjoy a noise-free environment and get more done with revolutionary and distraction-free silent click and scroll buttons, making your mouse usage discreet and perfect for shared spaces or late-night work     Ergonomic Design: The Lenovo 600 Bluetooth Silent Mouse is sculpted to be comfortable to rest your palm on. This compact, portable wireless mouse has a low-profile, minimalist design that makes it easy to carry and fit into pockets without bulging     Reliable Wireless Mouse: Customize your cursor speed with 3 adjustable DPI settings (2400, 1600, 800) for precise control in any situation. The left and right click buttons are designed for longevity, offering a lifespan of up to 3-million clicks each. The scroll button will provide smooth scrolling for up to 100,000 clicks",
      "details": {
        "brand": "Lenovo",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "Wi-Fi",
        "color": "Bluetooth Silent Mouse",
        "ram": "N/A",
        "detail_item": "Microsoft Swift Pair: Bluetooth 5.0 and Microsoft Swift Pair technology let you connect this mouse conveniently and pair effortlessly with up to two devices at once. With Dual-Host you can quickly switch between them with the push of a button"
      }
    },
    {
      "id": "B0BRTK8YPN",
      "name": "ASUS ROG Chakram X Origin Gaming Mouse, Tri-Mode connectivity (2.4GHz RF, Bluetooth, Wired), 36000 DPI Sensor, 11 programmable Buttons, Detachable Joystick, Paracord Cable, Black",
      "ratings": 1.21,
      "price": "$118.50",
      "image": "https://m.media-amazon.com/images/I/610zfFdTrwL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "ROG AimPoint optical sensor: Next-gen 36,000 dpi sensor with 8000 Hz polling rate for ultimate precision     Tri-mode connectivity: Flexibility with wired USB, low-latency 2.4 GHz RF, plus a Bluetooth mode to pair up to three devices     Programmable joystick: New detachable joystick available in different sizes for refined analog or digital linear controls     More control at your fingertips: Seven buttons and four-way directional joystick offer a total of 11 programmable buttons for versatile hotkey functions     Instantaneous DPI adjustments: DPI On-the-Scroll enables effortless on-the-fly in-game adjustments     Push-Fit Switch Socket II: Hot-swap compatibility with 3-pin mechanical switches and 5-pin optical micro switches enable variable click force and extend lifespan     Smooth and fast movement: Soft ROG Paracord and 100% PTFE mouse feet ensure fluid glide",
      "details": {
        "brand": "ASUS",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "Bluetooth",
        "color": "BLACK",
        "ram": "N/A",
        "detail_item": "ROG AimPoint optical sensor: Next-gen 36,000 dpi sensor with 8000 Hz polling rate for ultimate precision"
      }
    },
    {
      "id": "B0CSPJP35M",
      "name": "Lenovo Bluetooth Silent Mouse (WL300) - 5 Button Computer Mouse with Silent Left & Right Click – Sculpted Grip, Microsoft Swift Pair, Up to 1600 DPI (Grey)",
      "ratings": 279,
      "price": "$19.99",
      "image": "https://m.media-amazon.com/images/I/517+8YaZ+gL._AC_SY300_SX300_.jpg",
      "description": "Sleek and Compact: Compact and lightweight, this mouse is ideal for on-the-go professionals and is powered by a single AA battery. Its design eliminates the hassle of tangled cables, providing the freedom to work in various environments     Uncompromised Quality: Built to withstand extensive use, the left and right buttons are engineered to last up to 3 million clicks. The scroll wheel is designed to endure up to 300,000 cycles, ensuring long-lasting durability and consistent performance     Sculpted Grip Bluetooth Mouse: Experience all-day comfort with a sculpted grip that conforms to your hand's natural contours, providing ergonomic support for extended periods of use. Effortlessly pair your device with Bluetooth 5.0 and Microsoft Swift Pair technology     Smooth Navigation: Maximize your workflow with a 5-button mouse featuring left click, right click, scroll click, forward, and backward buttons, coupled with an anti-slip scroll wheel. The precise optical sensor and 3-level DPI adjustment caters to various tasks, offering 800, 1200, and 1600 DPI     Silent Efficiency: Designed to work seamlessly on different surfaces such as wood, leather, fabric, paper, and resin, the WL300 offers silent left, right, and scroll wheel buttons, allowing for efficient and quiet operation",
      "details": {
        "brand": "Lenovo",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "Bluetooth",
        "color": "WL300 Grey",
        "ram": "N/A",
        "detail_item": "Sleek and Compact: Compact and lightweight, this mouse is ideal for on-the-go professionals and is powered by a single AA battery. Its design eliminates the hassle of tangled cables, providing the freedom to work in various environments"
      }
    },
    {
      "id": "B087LXCTFJ",
      "name": "Logitech G PRO X SUPERLIGHT Wireless Gaming Mouse, Ultra-Lightweight, HERO 25K Sensor, 25,600 DPI, 5 Programmable Buttons, Long Battery Life, Compatible with PC / Mac - Black",
      "ratings": 7.547,
      "price": "$74.99",
      "image": "https://m.media-amazon.com/images/I/51uy8gOG-iL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Meticulously designed in collaboration with many of the world’s leading esports pros. Engineered to win, being the pinnacle of our continued pursuit for the highest levels of performance.     Ultra-lightweight at under 63 grams, with hyper-minimal redesign achieving nearly 25% weight reduction compared to standard PRO Wireless mouse.     Powered by Lightspeed, PRO X Superlight is our fastest and most reliable PRO mouse yet.     Incredibly precise, fast and consistent control with Hero Sensor, designed from the ground up by Logitech G engineers for the best possible gaming performance.     Large, zero-additive PTFE feet deliver a smooth glide for a pure, fluid connection with the game. System Requirements-Windows 8 or later, macOS 10.11 or later     Available in black and white.",
      "details": {
        "brand": "Logitech G",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "Black",
        "ram": "N/A",
        "detail_item": "Meticulously designed in collaboration with many of the world’s leading esports pros. Engineered to win, being the pinnacle of our continued pursuit for the highest levels of performance."
      }
    },
    {
      "id": "B0BSKX9V7C",
      "name": "ASUS ROG Harpe Gaming Wireless Mouse, Ace Aim Lab Edition, 54g Ultra-Lightweight, 36,000 DPI Sensor, 5 Programmable Buttons, Tri-Mode Connectivity (2.4GHz RF, Bluetooth, Wired), SpeedNova, Black",
      "ratings": 441,
      "price": "$96.74",
      "image": "https://m.media-amazon.com/images/I/71ufA6nd5cL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Pro-Tested Form Factor ---- This gaming mouse was co-developed with esports professionals to ensure maximum stability and control when flicking and tracking, designed for gaming professionals.     Aim Lab Settings Optimizer ---- Synergistic software analyzes player strengths and styles to tailor mouse settings uniquely to unleash your professional potential.     54g Ultra-Lightweight ---- Through meticulous engineering and innovative bio-based nylon material construction, the Bluetooth mouse weighs only 54 grams with a durable structure, offers faster and more accurate movements.     36,000 ROG AimPoint optical sensor ---- The 36,000-dpi ROG AimPoint optical sensor features an industry-leading < 1% cpi deviation, reducing the latency to ultimate in wireless gaming speed, accuracy, and responsiveness.     SpeedNova wireless technology: Low-latency, reliable wireless performance and optimized energy efficiency in the 2.4 GHz RF mode. This technology extremes low-latency and interference reduction for true wireless freedom.     ROG Omni Receiver ---- Allows wireless connection to one compatible keyboard and one compatible mouse at the same time with a single USB receiver and free up other USB ports on your PC.",
      "details": {
        "brand": "ASUS",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "Bluetooth, USB, Radio Frequency",
        "color": "Black",
        "ram": "N/A",
        "detail_item": "Pro-Tested Form Factor ---- This gaming mouse was co-developed with esports professionals to ensure maximum stability and control when flicking and tracking, designed for gaming professionals."
      }
    },
    {
      "id": "B015NBTAOW",
      "name": "TECKNET Wireless Mouse, 2.4G Ergonomic Optical Mouse, Computer Mouse for Laptop, PC, Computer, Chromebook, Notebook, 6 Buttons, 24 Months Battery Life, 2600 DPI, 5 Adjustment Levels",
      "ratings": 65.293,
      "price": "$8.49",
      "image": "https://m.media-amazon.com/images/I/71tqvuHgIlL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Compact Design, Travel Friendly - With the dimension of 4.09*2.68*1.49 in, this compact mouse provides more portability and a better travel experience. Only compatible with USB-A Port Devices.     Ergonomic Design, Comfort Grip - The contoured shape of this mouse is ergonomically designed to fit the natural curve of your hand, ensuring lasting comfort and productivity. Featuring rubber side-grips, it offers added thumb support for a superior working experience.     Advanced Optical Tracking - Featuring 5-level adjustable DPI (800/1200/1600/2000/2600), this mouse provides high-performance precision and smart cursor control on most surfaces. ( Glass surface is Not included )     24 Months Battery Life - Combined with a power-saving mode and on/off switch, this efficiently engineered mouse grants you up to 24 months of battery life.     Plug and Play - Simply plug the USB-A mini-receiver into your Windows, Mac, Chrome OS, or Linux computer and enjoy seamless connectivity up to 49 feet.     Notice - Please be aware that the AAA batteries are not included. The USB receiver is stored at the back of the mouse.",
      "details": {
        "brand": "TECKNET",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "Wireless, USB",
        "color": "Purple",
        "ram": "N/A",
        "detail_item": "Compact Design, Travel Friendly - With the dimension of 4.09*2.68*1.49 in, this compact mouse provides more portability and a better travel experience. Only compatible with USB-A Port Devices."
      }
    },
    {
      "id": "B09R9QCPPK",
      "name": "Amazon Essentials Disney | Marvel | Star Wars Men's Sherpa-Lined Pullover Hoodie Sweatshirt",
      "ratings": 230,
      "price": "$25.68",
      "image": "https://m.media-amazon.com/images/I/71jdXMr4W+L._AC_SX342_SY445_.jpg",
      "description": "",
      "details": {
        "brand": "N/A",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "N/A"
      }
    },
    {
      "id": "B07FNJB8TT",
      "name": "Logitech MX Vertical Wireless Mouse – Ergonomic Design Reduces Muscle Strain, Move Content Between 3 Windows and Apple Computers, Rechargeable, Graphite",
      "ratings": 13.601,
      "price": "$76.00",
      "image": "https://m.media-amazon.com/images/I/61iiZ-gDYEL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Logitech MX Vertical Wireless Ergonomic Mouse is a great fit for medium to large size right hands     NATURAL HANDSHAKE POSITION: MX Vertical’s natural handshake position reduces muscular activity by 10 percent compared to a standard mouse – without any loss in overall performance.     57° VERTICAL ANGLE FOR IMPROVED WRIST POSTURE: MX Vertical’s unique 57° vertical angle reduces the pressure on your wrist, while your thumb is positioned comfortably on the thumb rest.     USER TESTED. ERGONOMIST-APPROVED: MX Vertical has been designed and tested with criteria set out by leading ergonomists – improve posture, lower muscle strain, and reduce wrist pressure.     ADVANCED OPTICAL TRACKING WITH CURSOR SPEED SWITCH: The 4000 DPI high-precision sensor results in 4x less hand movement and reduces fatigue. The cursor speed switch instantly adjusts DPI speed and accuracy with the touch of a button.     COMFORT FORM WITH TEXTURED SURFACE: MX Vertical is shaped for the human hand and smooth to the touch. Its unique form fits a variety of hand shapes and sizes, and the textured rubber surface assures a natural grip.     Uses FSC-certified paper for responsible packaging; Certified carbon neutral: the carbon impact of the product and packaging has been reduced to zero",
      "details": {
        "brand": "Logitech",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "USB",
        "color": "GRAPHITE",
        "ram": "N/A",
        "detail_item": "Logitech MX Vertical Wireless Ergonomic Mouse is a great fit for medium to large size right hands"
      }
    },
    {
      "id": "B098S48QWM",
      "name": "VssoPlor Wireless Mouse, 2.4G Slim Portable Computer Mice with Nano Receiver for Notebook, PC, Laptop, Computer (Black and Gold)",
      "ratings": 22.377,
      "price": "$7.98",
      "image": "https://m.media-amazon.com/images/I/51dsuumz6HL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "LOW POWER CONSUMPTION: Intelligent sleep mode can better extend battery life. It will enter auto sleep mode if you don't use it for 5 minutes to save battery and need to click it, the mouse will enter working mode again     STABLE CONNECTION: 2.4 GHz wireless provides stronger anti-interference ability, a faster transmission speed and a more reliable connection, working distances can up to 10 m, and high DPI can make it track more smoothly over most surfaces     WIDE COMPATIBILITY:Well compatible with Windows7/8/10/XP, Vista, Mac OS X 10.4 etc. Fits for desktop, laptop, PC, Macbook and other devices     ERGONOMIC & COMPACT DESIGN: USB-receiver stays in your PC USB port or stows conveniently inside the wireless mouse when not in use. The lightweight and simple features make the mouse perfect for the journey, office, home     WHISPER & SENSITIVE CLICKING: Smooth frosted surface and quiet clicks can bring a better user experience and free your worry about bothering others and keep you stay focused while working",
      "details": {
        "brand": "VssoPlor",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "2.4G Wireless",
        "color": "Black and Gold",
        "ram": "N/A",
        "detail_item": "LOW POWER CONSUMPTION: Intelligent sleep mode can better extend battery life. It will enter auto sleep mode if you don't use it for 5 minutes to save battery and need to click it, the mouse will enter working mode again"
      }
    },
    {
      "id": "B0787D6SGQ",
      "name": "Amazon Basics Ergonomic 2.4 GHz Wireless Optical Mouse, DPI adjustable, Compatible with PC, Mac, Laptop - Black",
      "ratings": 24.76,
      "price": "$8.09",
      "image": "https://m.media-amazon.com/images/I/51TlYuAqbsL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "COMFORTABLE NAVIGATION: The wireless mouse is designed for smooth and easy computer interface navigation, and provides ease of use for prolonged periods without strain     EXCELLENT COMPATIBILITY: This ergonomic mouse for PC is compatible with Windows 7, 8, and 10     ROBUST WIRELESS CONNECTION: This laptop mouse has a stable 2.4 GHz connection that offers a 33-foot range to enable mobility and flexibility in your workspace setup     SECURE DATA TRANSMISSION: Featuring AES-128 encryption, this wireless computer mouse provides enhanced security for your data, delivering safe usage in any network environment     COMPACT DESIGN: This wireless mouse for laptops measures 4.1 x 2.9 x 1.5 inches, making it compact and easily portable",
      "details": {
        "brand": "Amazon Basics",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "2.4GHz Wireless",
        "color": "Black",
        "ram": "N/A",
        "detail_item": "COMFORTABLE NAVIGATION: The wireless mouse is designed for smooth and easy computer interface navigation, and provides ease of use for prolonged periods without strain"
      }
    },
    {
      "id": "B005EJH6RW",
      "name": "Amazon Basics Responsive and Precise 3-Button Wired USB Computer Mouse with Scrolling and Tracking, Single, Black",
      "ratings": 84.461,
      "price": "$7.19",
      "image": "https://m.media-amazon.com/images/I/61Mzk2NljxL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Computer mouse for easily navigating a computer interface; click, scroll, and more     USB-A wired connection; if existing device only supports USB-C, an additional adapter will be required     High-definition (1000 dpi) optical tracking ensures responsive cursor control for precise tracking and easy text selection     3 buttons offer effortless fingertip control     Plug-and-go ready for instant use     Compatible with Windows and Mac OS     Product Dimensions: 4.3 x 2.4 x 1.4 inches (LxWxH) with 4.9-foot cable",
      "details": {
        "brand": "Amazon Basics",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "Wired",
        "color": "Black",
        "ram": "N/A",
        "detail_item": "Computer mouse for easily navigating a computer interface; click, scroll, and more"
      }
    },
    {
      "id": "B0CPLNPV6F",
      "name": "SM66 White Silent Dual Mode 2.4GHz Wireless Mouse, Adjustable 4800 DPI,Rechargeable Computer Mouse Wireless Office Mouse for PC Mac Laptop, Desktop",
      "ratings": 272,
      "price": "$16.89",
      "image": "https://m.media-amazon.com/images/I/51Udo0fWghL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "2.4G Wireless Dual-Mode:The SOLAKAKA SM66 wireless mouse is perfect for multi-functional use,support 2 mode BT and 2.4GHz wireless connection,3 devices save. supports connection for your Laptop,PC,Computer,Xbox,iPad,Mobile Phone.compatible with multiple systems including Windows,OS,Android,IOS,etc     Ergonomic Design, 5 DPI Adjustable:This Slim Ergonomic shape wireless mouse is designed with an asymmetrical and streamlined shell, offering a comfortable claw-grip using experience for right,left and medium,small hand, long-term use without fatigue. 5 DPI levels 4800,2400,1600,1200,800,user can press the DPI button at the bottom of the mouse. Easier and smoother. The ultra-thin design is mini and lightweight, perfect for traveling carry, and can be easily put into laptop bag, ultra-space saving     Silent Buttons:SM66 wireless mouse adopts a silent button design, which reduces 99% of button noise. It is very suitable for public places such as libraries and offices. It is the best choice for people who like quiet     PORTABLE and 10M LONG WORKING DISTANCE:2.4G Nano USB receiver is embedded in the computer mouse bottom for convenient portability. It is great as a travel mouse for a laptop. The remote mouse for laptop works great with the SOLAKAKA mouse combo and computer keyboard and mice accessories. The 10m,32ft long working distance ensures you can enjoy high-precision optical sensor performance on various surfaces     Rechargeable and Long Battery Life:With the built-in 500mAh rechargeable Lithiumion battery, you can charge the magic cute mouse by using the Type-C charger cable included. Using while charging is available. In addition, the rechargeable mouse uses smart power-saving technology, the great battery will enter sleep mode after 3 minutes of no-operation to save power and provide long time usage. You can wake it up by clicking any button     Friendly Tip: SM66 has a smart sleep mode, when it is not used for a few minutes, it will enter the power saving state, please move the mouse to wake it up!",
      "details": {
        "brand": "SOLAKAKA",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "Bluetooth",
        "color": "white",
        "ram": "N/A",
        "detail_item": "2.4G Wireless Dual-Mode:The SOLAKAKA SM66 wireless mouse is perfect for multi-functional use,support 2 mode BT and 2.4GHz wireless connection,3 devices save. supports connection for your Laptop,PC,Computer,Xbox,iPad,Mobile Phone.compatible with multiple systems including Windows,OS,Android,IOS,etc"
      }
    },
    {
      "id": "B094PS5RZQ",
      "name": "Razer DeathAdder Essential Gaming Mouse: 6400 DPI Optical Sensor - 5 Programmable Buttons - Mechanical Switches - Rubber Side Grips - Classic Black",
      "ratings": 11.987,
      "price": "$20.99",
      "image": "https://m.media-amazon.com/images/I/8189uwDnMkL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "HIGH-PRECISION 6,400 DPI OPTICAL SENSOR — Offers on-the-fly sensitivity adjustment through dedicated DPI buttons (reprogrammable) for gaming and creative work     DURABLE MECHANICAL SWITCHES — Supports up to 10 million clicks, backed by a 2 year warranty     RIDGED, RUBBERIZED SCROLL WHEEL FOR MAXIMUM ACCURACY — Small, tactile bumps increases grip and allows for more controlled scrolling in high-stakes gaming situations     5 PROGRAMMABLE BUTTONS — Allows for button remapping and assignment of complex macro functions through Razer Synapse     #1 SELLING PC GAMING PERIPHERALS BRAND IN THE U.S. — Source — Circana, Retail Tracking Service, U.S., Dollar Sales, Gaming Designed Mice, Keyboards, and PC Headsets, Jan. 2019- Dec. 2023 combined",
      "details": {
        "brand": "Razer",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "Wired",
        "color": "Classic Black",
        "ram": "N/A",
        "detail_item": "HIGH-PRECISION 6,400 DPI OPTICAL SENSOR — Offers on-the-fly sensitivity adjustment through dedicated DPI buttons (reprogrammable) for gaming and creative work"
      }
    },
    {
      "id": "B0C4XXH2FV",
      "name": "Logitech MX Master 2S Bluetooth Edition Wireless Mouse – Use on Any Surface, Hyper-Fast Scrolling, Ergonomic, Rechargeable, Control Up to 3 Apple Mac and Windows Computers - Graphite",
      "ratings": 532,
      "price": "$69.79",
      "image": "https://m.media-amazon.com/images/I/519XaWc6D6L.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "With Logitech Flow, seamlessly control up to three computers with one mouse and copy-paste text, images and files between them.(1)     Darkfield High Precision tracking gives you flawless control virtually anywhere – even on glass(2) with up to 4,000 DPI     Just plug MX Master 2S into your computer using the micro-USB charging cable and get enough power for a full day of usage in three minutes only. A full charge can last up to 70 days.(3)     Scroll through long documents or web pages faster and easier with the speed-adaptive scroll wheel that auto-shifts from click-to-click to hyper-fast scroll and side-to-side scrolling with a stroke of your thumb.(4)     The perfectly crafted, hand-sculpted shape (5) supports your hand and wrist in a comfortable, natural position. Enjoy fine-motion control and a fluid experience thanks to well-positioned buttons and wheels.",
      "details": {
        "brand": "Logitech",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "2023 Model",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "Bluetooth",
        "color": "graphite",
        "ram": "N/A",
        "detail_item": "With Logitech Flow, seamlessly control up to three computers with one mouse and copy-paste text, images and files between them.(1)"
      }
    },
    {
      "id": "B09NBWL8J5",
      "name": "Logitech G PRO X SUPERLIGHT 2 LIGHTSPEED Wireless Gaming Mouse, 8K Polling, Lightweight, LIGHTFORCE Hybrid Switches, HERO 2 Sensor, 888 IPS, 44,000 DPI, 5 Programmable Buttons,USB-C Charging, PC & Mac",
      "ratings": 960,
      "price": "$137.49",
      "image": "https://m.media-amazon.com/images/I/51VRu0zm1IL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Fast and Precise Wireless Gaming Mouse: A pro gaming icon—now faster and more precise; it is designed in collaboration with the world’s leading esports pros and engineered to win     Pro Precision: LIGHTFORCE hybrid optical-mechanical switches enable pro-level precision, reliability and ultralow latency optical actuation with a crisp, tactile click     Most Advanced Optical Sensor in Gaming: HERO 2 features tracking over 888+ IPS, up to 44,000 DPI and precise sensor calibration with zero smoothing, acceleration or filtering     Better Performance: Our championship-winning, wireless mouse—made even better; now with 4K polling, USB-C charging, 95-hour battery life (3) and POWERPLAY compatibility all at 60g     Zero-Additive PTFE Mouse Feet: Command a smooth glide and seamless connection to your game with Zero-additive PTFE mouse feet     Command a smooth glide and seamless connection to your game with Zero-additive PTFE mouse feet",
      "details": {
        "brand": "Logitech G",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "USB, Radio Frequency",
        "color": "Black",
        "ram": "N/A",
        "detail_item": "Fast and Precise Wireless Gaming Mouse: A pro gaming icon—now faster and more precise; it is designed in collaboration with the world’s leading esports pros and engineered to win"
      }
    },
    {
      "id": "B07Y1KKFBH",
      "name": "WisFox 2.4G Wireless Mouse for Laptop, Ergonomic Computer Mouse with USB Receiver and 3 Adjustable Levels, 6 Button Cordless Mouse Wireless Mice for Windows Mac PC Notebook (Grey)",
      "ratings": 5.66,
      "price": "$7.99",
      "image": "https://m.media-amazon.com/images/I/714+t9HR4GL._AC_SY300_SX300_.jpg",
      "description": "▶[COMFORTABLE ERGONOMIC DESIGN] WisFox Wireless Mouse is really well-built and still feels very light, with a clean design and sleek aesthetic. Contoured Shape for the ultimate comfort of use. Sweat-Resistant Coating to further elevate your experience. All in all, this is a comfortable, functional and satisfying laptop mouse for chromebook, home, work, or travel.     ▶[3 DPI LEVELS & 6 BUTTONS] 3 Adjustable DPI Settings, 800, 1200 and 1600. This computer mouse gives precision tracking on just about any surface, with a DPI button helping to change the sensitivity on the fly. Extra 2 Side Buttons ideal for both work and gaming. Plug and play directly with A RECEIVER STORED IN THE BATTERY COMPARTMENT, no any driver needed!     ▶[HIGH DURABILITY & STABLE SINGAL] 5 Million Times Keystroke Test to guarantee superb durability of this cordless mouse, together with advanced 2.4GHz wireless technology to ensure strong accurate connection to your computer, as well as a longer working distance of 33 feet. Easy and convenient. Go ahead, and enjoy being more productive with the USB mouse!     ▶[AUTO SLEEP MODE & SYMMETRIC DESIGN] Being impressively easy to use, this wireless mouse for chromebook also keeps energy efficiency in mind. It will enter auto power-saving mode after 1 minute of idling, or sleep mode after 8 minutes of idling. Double click to wake the ergonomic mouse up. Symmetric design makes it suitable for both right- and left-hander.     ▶[WIDE COMPATIBILITY & SERVICE] This wireless mice is highly compatible with Windows 7/8/10/XP, Vista 7/8, Linux, etc. Works well with laptop, desktop, PC, MacBook and other devices. WisFox is proud to offer 12-month warranty for every our product as well as 24/h service to all our customers. If you have any question, free feel to contact us for help!",
      "details": {
        "brand": "WisFox",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "Wireless, Radio Frequency",
        "color": "Grey",
        "ram": "N/A",
        "detail_item": "▶[COMFORTABLE ERGONOMIC DESIGN] WisFox Wireless Mouse is really well-built and still feels very light, with a clean design and sleek aesthetic. Contoured Shape for the ultimate comfort of use. Sweat-Resistant Coating to further elevate your experience. All in all, this is a comfortable, functional and satisfying laptop mouse for chromebook, home, work, or travel."
      }
    },
    {
      "id": "B0C97CF6K2",
      "name": "Cute Bluetooth Mouse, 2.4 GHz Wireless Mice with USB Receiver for Laptop, iPad, Mac, Silent Cartoon Mouse Suitable for Children and Students (Kerry Bear)",
      "ratings": 376,
      "price": "$14.99",
      "image": "https://m.media-amazon.com/images/I/61kL1e5zG-L.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "❤ [Cute Wireless Mouse] - Our wireless mouse has a variety of cute cartoon pattern designs, suitable for young people and children.     ❤ [Dual Mode Mouse] - Bluetooth & 2.4G dual mode wireless mouse connection switch easily. Bluetooth wireless brings quick response, precise movement, stable connection & smoother tracking. 2.4G wireless transmission provide stable and reliable connection.     ❤ [Silent Wireless Mouse] - Special design, noiseless click sound when pressing buttons, which let you not worry about the mouse sound can disturbing others, especially at library or office.     ❤ [Durable Mouse] - Intelligent power saving, the mouse will automatically be in sleeping mode after 10 minutes inactivity, you can click any button to wake it up. Only 1 piece AA battery is required for power supply (not included in the package).     ❤ [Universal Compatibility Mouse] - FMOUSE M101 Mouse, with wireless receiver and Bluetooth inside, connect the mouse easily to your MacBook, iPad, Laptop or any Desktop devices, Mouse wireless well compatible with Windows, MacOS, iPadOS & Android.",
      "details": {
        "brand": "FMOUSE",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "Wireless, Bluetooth, USB",
        "color": "Kerry Bear",
        "ram": "N/A",
        "detail_item": "❤ [Cute Wireless Mouse] - Our wireless mouse has a variety of cute cartoon pattern designs, suitable for young people and children."
      }
    },
    {
      "id": "B07GCKQD77",
      "name": "Logitech G Pro Wireless Gaming Mouse with Esports Grade Performance, Black",
      "ratings": 12.537,
      "price": "$54.29",
      "image": "https://m.media-amazon.com/images/I/51ySu55JzAL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Made with and for Pro Gamers: G Pro Wireless Gaming Mouse is the result of two years of work with professional esports gamers, combing advanced technologies in an ultra-lightweight design     Light-speed Wireless: Pro grade performance overcomes the traditional limitations of wireless latency, connectivity and power to deliver a rock solid, super-fast 1 millisecond report rate connection     Hero 25K sensor through a software update from G HUB, this upgrade is free to all players: Logitech's most accurate sensor yet with up to 25,600 DPI and 10X the power efficiency of previous generation for the ultimate in wireless gaming speed, accuracy and responsiveness. Microprocessor: 32-bit ARM     Ultra-lightweight: Innovative endoskeleton design creates a super-thin yet incredibly strong outer shell, enabling the body to weigh in at a remarkably light and maneuverable 80 grams.     Ergonomic ambidextrous design: Tournament ready mouse developed with Esports pros for maximum comfort, control and 50 million click durability. Four removable side buttons for supreme customization. Cable length: 1.80 meters     Note: Kindly refer user guide before use. Requirements-Windows 7 or later, macOS 10.11 or later, Chrome OS     1 year hardware limited warranty     Max. acceleration: >1.41 oz (40 g) . Tested on Logitech G240 Gaming Mouse Pad",
      "details": {
        "brand": "Logitech G",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "Wireless",
        "color": "Black",
        "ram": "N/A",
        "detail_item": "Made with and for Pro Gamers: G Pro Wireless Gaming Mouse is the result of two years of work with professional esports gamers, combing advanced technologies in an ultra-lightweight design"
      }
    },
    {
      "id": "B08TLYK78K",
      "name": "Logitech M575 Ergonomic Wireless Trackball USB Mouse, Black (910-005869)",
      "ratings": 5.589,
      "price": "$39.19",
      "image": "https://m.media-amazon.com/images/I/416AZVtCjwL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Ergonomic comfort design, relaxed hand and arm: The comfortable, sculpted ergonomic shape naturally fits your hand.     Smooth thumb control, precise tracking: Great cursor control on any surface. Adjust the cursor speed with Logitech Options software.     Perfect for tight workspaces: Because the trackball doesn’t move, it’s perfect for tight workspaces and busy desks.     2 ways to connect and multi-OS: Connect simply with Bluetooth or the USB receiver and never worry about drop-offs or lag up to a 33 ft (10m) range. Nominal value: 400 dpi     Plastic parts in ERGO M575 include post consumer recycled plastic (Graphite/Black: 50%, Off-White: 21%). Uses FSC-certified paper for responsible packaging.",
      "details": {
        "brand": "Logitech",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "Bluetooth",
        "color": "Graphite",
        "ram": "N/A",
        "detail_item": "Ergonomic comfort design, relaxed hand and arm: The comfortable, sculpted ergonomic shape naturally fits your hand."
      }
    },
    {
      "id": "B01BC4TXXC",
      "name": "TECKNET USB Wired Mouse, 6-Button Corded Mouse with 4 Adjustable DPI, Optical Computer Mouse with Ergonomic Design and 5FT Cord for Laptop, Chromebook, PC, Desktop, Mac, Notebook-Gray",
      "ratings": 11.492,
      "price": "$9.99",
      "image": "https://m.media-amazon.com/images/I/617YQvId+gL._AC_SY300_SX300_.jpg",
      "description": "【High Precision and Durability】: TECKNET Tru-Wave technology wired computer mouse provides precise, intelligent cursor control and tracking on many surface types, even on smooth surfaces with glass. Tested for over 6 million keystrokes, the wired mouse ensures responsive clicks and a longer lifespan for daily use.     【4 Adjustable DPI and 6 Buttons】: 4-level DPI settings (1000/1600/3200/6400) to meet your needs both in home and office. 6 buttons enable superior productivity and efficiency to meet all your computer needs. Moving quickly between documents or browsing your favorite Web sites is a breeze with large, easy-to-reach Back/Forward buttons.     【Ergonomic Design】: The shaped design and soft rubber grips conform to the hand and are designed to be comfortable to hold. The compact size enables it to be able to be taken wherever desired for use on the computer whether at home, at work or anywhere else.     【Plug and Play】: Simply plug in the USB cable to power your mouse, eliminates the trouble of replacing batteries. No software or downloads required. The 5FT of USB cable is the perfect length for a USB wired mouse and adapts to almost any computer setup with no lag.     【Wide Compatibility】：Compatible with Windows 2000,2003, XP, VISTA, 7, 8, 10, 11 and Chromebook, Mac (side buttons not work on Mac).",
      "details": {
        "brand": "TECKNET",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "Wired, USB",
        "color": "GRAY",
        "ram": "N/A",
        "detail_item": "【High Precision and Durability】: TECKNET Tru-Wave technology wired computer mouse provides precise, intelligent cursor control and tracking on many surface types, even on smooth surfaces with glass. Tested for over 6 million keystrokes, the wired mouse ensures responsive clicks and a longer lifespan for daily use."
      }
    },
    {
      "id": "B09JG4KJN5",
      "name": "Wireless Mouse, D-09 Computer Mouse USB Cordless Mice for Laptop, Ergo Grips, Lightspeed 5-Level 2400 DPI, 16 Months Battery, Portable for PC Mac Chromebook (Black)",
      "ratings": 10.115,
      "price": "$11.99",
      "image": "https://m.media-amazon.com/images/I/616YhNKtqML.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "【Less Muscle Strain Ergonomics】Advanced ergonomic computer mouse provides total comfort with 30° ergonomic handshake angel, contoured grips and premium matte finish.6 ʙᴜᴛᴛᴏɴs ᴅᴇsɪɢɴ - new added forward and backward buttons on the side which browses the web, and processs files more efficiently and conveniently.     【Faster Wireless Transmission Speed】 33FT/10M 2.4G wireless connection reduces all the interference and delays. Just plug the USB receiver into pc or laptop and your D-09 works instantly.No delay ,no interference. Mini usb receiver is stored back of the mouse,beside the battery.     【3X Less Hand Movement】800/1200/1600/2000/2400 DPI high precision sensor reduces muscle fatigue and boost your workflow. Cursor moves 3X faster than basic computer wireless mouse.     【1 AA Battery, 2X Longer】Only 1 AA battery lasts up to 18 months. It enters sleep mode after you leave for 8 minutes ,only click any button to recall. D-09 wireless computer mouse saves time and money by practically reducing the need to change batteries.     【Highly-Intergraded Body】Durable 50 Million clicks. Portable for travel use. Work with Windows laptop/MacBook/Chromebook/PC -Any Device with USB Ports. Side buttons are unavailable for Mac OS. Any problems, PLZ do not hesitate to let HOTWEEMS know.",
      "details": {
        "brand": "HOTWEEMS",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "USB",
        "color": "Black",
        "ram": "N/A",
        "detail_item": "【Less Muscle Strain Ergonomics】Advanced ergonomic computer mouse provides total comfort with 30° ergonomic handshake angel, contoured grips and premium matte finish.6 ʙᴜᴛᴛᴏɴs ᴅᴇsɪɢɴ - new added forward and backward buttons on the side which browses the web, and processs files more efficiently and conveniently."
      }
    },
    {
      "id": "B093HD7NJR",
      "name": "Amazon Essentials Disney | Marvel | Star Wars | Princess Women's Fleece Pullover Hoodie Sweatshirts (Available in Plus Size)",
      "ratings": 1.874,
      "price": "$22.60",
      "image": "https://m.media-amazon.com/images/I/91W97ZGWEkL.__AC_SY445_SX342_QL70_FMwebp_.jpg",
      "description": "",
      "details": {
        "brand": "N/A",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "N/A"
      }
    },
    {
      "id": "B0CZY28HRQ",
      "name": "Ergonomic Slope Mouse Pad Wrist Support, Wrist Rest Mousepad for Carpal Tunnel Pain Relief with Massage Bulge and Slow Rebound Memory Foam (12x8 inch, Dark Pink)",
      "ratings": 120,
      "price": "$24.99",
      "image": "https://m.media-amazon.com/images/I/61010RDxVcL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "【Ergonomic Slope】The perfect combination of ergonomic slopes and cross massage beads can change wrist posture, alleviate wrist pain and fatigue, improve carpal tunnel syndrome (CTS), and keep your wrist in the most comfortable state.     【Right or Left Handed】12x8x1.2 inches (300x200x30mm) large space, suitable for left-handed or right-handed people, allowing everyone who owns it to work comfortably.     【High Quality】Integrated slope adopts high elastic slow rebound memory foam, which is not easy to deform after long-term use. The surface is made of silky lycra fabric, which is skin friendly, specialized, and non pilling.     【Feature】Smooth surface, fast movement, accurate cursor positioning, compatible with wireless mouse, optical mouse, laser mouse and other types of mice.     【Anti-Drop】The base is made of PU, which can be firmly adhered to the desktop like gel to prevent the mouse pad from accidentally sliding on the desktop.",
      "details": {
        "brand": "Armanza",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "AM024-Dark Pink",
        "ram": "N/A",
        "detail_item": "【Ergonomic Slope】The perfect combination of ergonomic slopes and cross massage beads can change wrist posture, alleviate wrist pain and fatigue, improve carpal tunnel syndrome (CTS), and keep your wrist in the most comfortable state."
      }
    },
    {
      "id": "B0BPD5T8RQ",
      "name": "Hokafenle Ergonomic Mouse Pad Wrist Support with Massage Design, Wrist Rest Pain Relief Mousepad with Memory Foam&Non-Slip PU Base, Mouse Pads for Wireless Mouse & Desk (12x8 inch,Pink)",
      "ratings": 969,
      "price": "$24.99",
      "image": "https://m.media-amazon.com/images/I/71TFFbBWqeL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "【Ergonomic Massage Design】The innovative ergonomic 8-degree slope and massage bump design perfectly support the wrist and palm. Massage bump design can effectively relieve wrist pain and fatigue, improve carpal tunnel syndrome (CTS), strengthen the air circulation between wrist and mouse pad, prevent sweating, and keep your wrist in the most comfortable state.     【Selected Materials】High quality slow rebound memory foam gel ensures that the wrist rest mouse pad is not easy to deform during long-term use. The surface is made of silky lycra fabric, odorless, abrasion free, pilling free, and comfortable to touch.     【Non-slip Base】The base is made of PU material, which can firmly fix the table top like a gel and prevent the table cushion from sliding on the table top.     【Perfect size】12x8x1.2 inch(300x200x30mm) Comfortable size, perfect for right or left handed, allowing everyone to work comfortably.     【Smooth】Smooth surface, accurate positioning when moving fast, suitable for wireless mouse, optical mouse, laser mouse and other types of mouse.",
      "details": {
        "brand": "Hokafenle",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "HK004-Pink",
        "ram": "N/A",
        "detail_item": "【Ergonomic Massage Design】The innovative ergonomic 8-degree slope and massage bump design perfectly support the wrist and palm. Massage bump design can effectively relieve wrist pain and fatigue, improve carpal tunnel syndrome (CTS), strengthen the air circulation between wrist and mouse pad, prevent sweating, and keep your wrist in the most comfortable state."
      }
    },
    {
      "id": "B0CZM4K4WG",
      "name": "FOPETT Wireless Keyboard and Mouse Combo - 2.4G Full-Sized Cute Colorful Retro Keyboard with Round Keycaps 104 Keys Typewriter Keyboard for Laptop/Windows/PC-Yellow Colorful",
      "ratings": 3.114,
      "price": "$39.99",
      "image": "https://m.media-amazon.com/images/I/71NUBdIaVaL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Keyboard and Mouse Warranty : We offer a three-year worry-free warranty and a 60-day money-back guarantee or replacement option. If you have any inquiries or concerns regarding our wireless keyboard and mouse set, please don't hesitate to contact us. Your satisfaction is our top priority.     Stable 2.4G Wireless Connection Cute Wireless Keyboard : Enjoy a powerful wireless connection with a range of up to 10 meters (393.7 inches) for the keyboard and mouse combo. they utilize a shared Nano receiver, conveniently stored at the bottom of the mouse, plug and play.eliminating the need for additional software installation.keeping your desk clean. keyboard size 17.5 x 5.3 x 1 inch with 104 keys. mouse size is 3.9 x 1.5 x 1 inch. keyboard net weight: 1.6LB, mouse net weight: 0.15LB.     Full Size Wireless Keyboard and Mouse : Thanks to the silent micro-motion technology, the mouse clicks are nearly silent, eliminating bothersome knocking sounds that could disturb you and your family. the cordless mouse DPI levels (800/1000/1200) for fast and precise cursor control, all while maintaining a quiet operation. whether you're working or playing, you'll never have to worry about disturbing others' rest.     Wireless Keyboards Ergonomic Design : The keyboard is designed with a tilt angle,comfortable typing position，the wireless mouse features a sweat-resistant and skin-friendly finish, with a contoured shape that allows for hours of comfortable work. If you encounter any issues with our product, whether it's exceeding Amazon's return time or receiving a defective item, please reach out to us via Amazon email as your first point of contact. we are committed to providing you with satisfactory solutions.     Wireless Mouse Wide Compatibility : Our wireless computer keyboard is 12 function keys for quick access to music, volume, mail, and more (please note that the hotkeys may not be fully compatible with Mac systems). This keyboard mouse combo is compatible with various operating systems, including Windows XP/ME/Vista/7/8/10/11. It works seamlessly with devices that have a USB slot, such as PCs, laptops, MacBooks, desktops, Chromebooks, and even Smart TVs.     Colorful Keyboard Shared Receiver : A USB receiver simultaneously drives the keyboard and mouse, enabling wireless transmission with a stable and delay-free signal,2.4G wireless transmission technology, supporting multiple computer types.the design incorporates splash resistance, with a waterproof conductive film that allows liquid to flow out from within the keyboard membrane. The mouse requires one 1.5V AA battery (included), while the keyboard requires one 1.5V AA battery (included).",
      "details": {
        "brand": "FOPETT",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "Usb",
        "color": "Lovely Coffee",
        "ram": "N/A",
        "detail_item": "Keyboard and Mouse Warranty : We offer a three-year worry-free warranty and a 60-day money-back guarantee or replacement option. If you have any inquiries or concerns regarding our wireless keyboard and mouse set, please don't hesitate to contact us. Your satisfaction is our top priority."
      }
    },
    {
      "id": "B0C37GXG9F",
      "name": "Wireless Keyboard and Mouse Combo, Cute Full Size 104-Key Typewriter Retro Round Keycaps Keyboard for PC Laptop,Windows,Desktop,Perfer for Home and Office Keyboards (Black)",
      "ratings": 717,
      "price": "$37.99",
      "image": "https://m.media-amazon.com/images/I/61UvQyZIH7L.__AC_SY300_SX300_QL70_FMwebp_.jpg",
      "description": "Wireless Keyboard Mouse Combo Includes Cute Quite Wireless Keyboard with 110 Quiet and Comfortable Keys and Wireless Mice. Keyboard Dimensions: 445 x 136 x 30 mm; Mouse Dimensions: 99 x 71 x 38 mm. The design help you save more place in your office or home     Cute Mini Keyboard with Convenient Cute Round Hotkeys 22 shortcut keys to easily manage your media, shortcuts for emails, screen control, internet, and search function. The combo supports Windows 7, Windows 8 , Windows 10, Window XP, PC and Mac     Mini Optical 3 DPI Adjustable Wireless Mouse The mini Optical mouse is with modern ergonomic design, DPI adjustable(800-1200-1600), 3 level power saving mode for the mouse     2.4GHz Dropout-Free Connection Connection&Plug and play 2.4GHz signal delivers up to a range of 28 feet connection that allows you to work with your PC from a distance. One small Nano receiver (USB 2.0) connects both the mouse and keyboard without installing any additional software, high speed rate of return allows the combo to ensure their stable and smooth transmission without delay and frame skip, hence to enhance your typing experience     Durability Battery Life Both keyboard and mouse turn into Power-save mode automatically,click any key or button to wake-up within seconds. Each of them runs on one AAA battery and AA battery (Included). Low battery indication shows in the top right corner, when the battery is dying,the keyboard's low battery indication light will remind you to replace the battery",
      "details": {
        "brand": "LETTON",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "Usb, Radio Frequency",
        "color": "Multi-Black",
        "ram": "N/A",
        "detail_item": "Wireless Keyboard Mouse Combo Includes Cute Quite Wireless Keyboard with 110 Quiet and Comfortable Keys and Wireless Mice. Keyboard Dimensions: 445 x 136 x 30 mm; Mouse Dimensions: 99 x 71 x 38 mm. The design help you save more place in your office or home"
      }
    },
    {
      "id": "B0CKBF6RM3",
      "name": "Wireless Keyboard,KOOTOP Cute Colorful 104 Keys Typewriter Retro Round Keycaps Keyboard for PC Laptop,Desktop,Windows, Home and Office Keyboards",
      "ratings": 1.82,
      "price": "$37.99",
      "image": "https://m.media-amazon.com/images/I/71bLwJr8SxL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Ergonomic Design Wireless keyboard is ergonomically designed with folding holder and anti-slide pads that can keep it at an optimum slope, prevent your wrists from hurting while long sessions of typing.The wireless mouse in contoured shape would provide hours of work comfortably     Silent Wireless Mouse & Long Battery Life This cute mouse provides whisper-quiet clicking, don't worry about disturbing others, or causing unnecessary distracting noises. The keyboard and mouse wireless pink, to further conserve battery life, energy-saving sleep mode kicks in automatically after 8 minutes of no use, click any key or button of to wake-up within seconds     2.4GHz Wireless Technology Wireless keyboard and mouse, with 2 IN 1 Nano receiver (USB 2.0), plug and play, 33 feet working range without delay and disconnect, easing to set up. (Note: The receiver is placed in the back of the mouse, The colorful wirelesss keyboard and mouse share one receiver     Compatible Wireless Keyboard and Mouse Combo The keyboard and mouse combo includes a full-size keyboard and a high sensitivity mouse. Works with your PC, desktop computer, laptop or notebook. Compatible with Windows XP / Vista / 7 / 8 /10 operating systems     12 Multimedia Hot Keys This cute wireless keyboard and mouse layout with numeric keypad. 12 multimedia hot keys combined with FN provide a shortcut to your music, emails, movies, web, ect. (Note: the 12 Multimedia shortcuts are not compatible with Mac systems",
      "details": {
        "brand": "Kootop",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "Usb",
        "color": "row and white",
        "ram": "N/A",
        "detail_item": "Ergonomic Design Wireless keyboard is ergonomically designed with folding holder and anti-slide pads that can keep it at an optimum slope, prevent your wrists from hurting while long sessions of typing.The wireless mouse in contoured shape would provide hours of work comfortably"
      }
    },
    {
      "id": "B08D6VD9TR",
      "name": "Lenovo 530 Full Size Wireless Computer Mouse for PC, Laptop, Computer with Windows - 2.4 GHz Nano USB Receiver - Ambidextrous Design - 12 Months Battery Life - Graphite Grey",
      "ratings": 1.945,
      "price": "$11.99",
      "image": "https://m.media-amazon.com/images/I/51Tg7aco-BL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Reliable Wireless Connectivity: The Lenovo 530 Wireless Mouse offers a dependable connection no matter where you are. Its advanced nano USB receiver utilizes robust 2.4 GHz wireless technology, ensuring seamless performance without the hassle of cords. Stay productive and focused without the constraints of wired setups.     Precision Tracking at Your Fingertips: Elevate your user experience with the 1200 DPI resolution optical sensor featured in this wireless mouse. Experience responsive and clear tracking that enhances your navigation, whether you're browsing the web, creating presentations, or engaging in detailed design work. Precision is now at your fingertips.     Durability That Lasts: With the Lenovo 530 Wireless Mouse, longevity is a guarantee. Boasting a remarkable lifespan of up to 8 million clicks for both left and right buttons, this mouse is built to withstand the rigors of daily use. Enjoy reliable performance for years to come, making it an ideal companion for your computing tasks.     Ergonomic Comfort for Extended Use: Experience unparalleled comfort during long work sessions with the unique and contoured design of the Lenovo 530 Wireless Mouse. Crafted for maximum ergonomics, this mouse fits perfectly in your hand, ensuring all-day comfort. The durable soft touch finish adds a premium feel to your interactions, making productivity a breeze.     Versatility and Portability: Whether you're left-handed or right-handed, the Lenovo 530 Wireless Mouse accommodates your preference. Its ambidextrous design ensures functionality and comfort for all users. Weighing just 65g (2.29 oz), it's the ultimate travel companion. Slip it into your laptop bag or pocket and enjoy its lightweight portability wherever you go. Plus, with an impressive battery life of up to 12 months (actual duration may vary based on usage), you can confidently use it without worrying about frequent recharges. Choose the Lenovo 530 Wireless Mouse for unparalleled performance, comfort, and convenience.",
      "details": {
        "brand": "Lenovo",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "Bluetooth",
        "color": "Graphite Grey",
        "ram": "N/A",
        "detail_item": "Reliable Wireless Connectivity: The Lenovo 530 Wireless Mouse offers a dependable connection no matter where you are. Its advanced nano USB receiver utilizes robust 2.4 GHz wireless technology, ensuring seamless performance without the hassle of cords. Stay productive and focused without the constraints of wired setups."
      }
    },
    {
      "id": "B0CPLNPV6F",
      "name": "SM66 White Silent Dual Mode 2.4GHz Wireless Mouse, Adjustable 4800 DPI,Rechargeable Computer Mouse Wireless Office Mouse for PC Mac Laptop, Desktop",
      "ratings": 272,
      "price": "$16.89",
      "image": "https://m.media-amazon.com/images/I/51Udo0fWghL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "2.4G Wireless Dual-Mode:The SOLAKAKA SM66 wireless mouse is perfect for multi-functional use,support 2 mode BT and 2.4GHz wireless connection,3 devices save. supports connection for your Laptop,PC,Computer,Xbox,iPad,Mobile Phone.compatible with multiple systems including Windows,OS,Android,IOS,etc     Ergonomic Design, 5 DPI Adjustable:This Slim Ergonomic shape wireless mouse is designed with an asymmetrical and streamlined shell, offering a comfortable claw-grip using experience for right,left and medium,small hand, long-term use without fatigue. 5 DPI levels 4800,2400,1600,1200,800,user can press the DPI button at the bottom of the mouse. Easier and smoother. The ultra-thin design is mini and lightweight, perfect for traveling carry, and can be easily put into laptop bag, ultra-space saving     Silent Buttons:SM66 wireless mouse adopts a silent button design, which reduces 99% of button noise. It is very suitable for public places such as libraries and offices. It is the best choice for people who like quiet     PORTABLE and 10M LONG WORKING DISTANCE:2.4G Nano USB receiver is embedded in the computer mouse bottom for convenient portability. It is great as a travel mouse for a laptop. The remote mouse for laptop works great with the SOLAKAKA mouse combo and computer keyboard and mice accessories. The 10m,32ft long working distance ensures you can enjoy high-precision optical sensor performance on various surfaces     Rechargeable and Long Battery Life:With the built-in 500mAh rechargeable Lithiumion battery, you can charge the magic cute mouse by using the Type-C charger cable included. Using while charging is available. In addition, the rechargeable mouse uses smart power-saving technology, the great battery will enter sleep mode after 3 minutes of no-operation to save power and provide long time usage. You can wake it up by clicking any button     Friendly Tip: SM66 has a smart sleep mode, when it is not used for a few minutes, it will enter the power saving state, please move the mouse to wake it up!",
      "details": {
        "brand": "SOLAKAKA",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "Bluetooth",
        "color": "white",
        "ram": "N/A",
        "detail_item": "2.4G Wireless Dual-Mode:The SOLAKAKA SM66 wireless mouse is perfect for multi-functional use,support 2 mode BT and 2.4GHz wireless connection,3 devices save. supports connection for your Laptop,PC,Computer,Xbox,iPad,Mobile Phone.compatible with multiple systems including Windows,OS,Android,IOS,etc"
      }
    },
    {
      "id": "B001DHECXA",
      "name": "TECKNET Wireless Mouse, 2.4G USB Computer Mouse with 6-Level Adjustable 4800 DPI, 30 Months Battery, Ergonomic Grips, 6 Buttons Portable for PC, Chromebook, Mac - Grey",
      "ratings": 51.958,
      "price": "$8.99",
      "image": "https://m.media-amazon.com/images/I/61agI90cKJL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "【6 Levels Adjustable DPI & 6 Buttons】TECKNET wireless mouse has a 6-Level adjustable DPI (800/1200/1600/2400/3200/4800), which provides more sensitivity than standard optical mice for smooth and precise tracking on a wide range of surfaces.     【30 Months Battery Life】Designed with the upgraded independent power switches and sleep modes to minimize battery consumption, the wireless mouse can enjoy up to 30 months of use time with only 2 AA batteries (not included). 2X longer battery life than others.     【Plug & Play 】The wireless mouse has a 50ft/15m wireless use range, which reduces interference and delay for you. No need to install any drivers, plug the TECKNET wireless mouse into the device and you are ready to go!     【Ergonomic Design & Comfort Grip】Featuring a streamlined curved design, this full-size wireless mouse has non-slip rubber sides, a palm rest and a sculpted design for unprecedented comfort. Product Dimension: 4.23*2.61*1.63 in.     【Wide Compatibility & Easy to Use】TECKNET mouse is long-lasting and versatile. This laptop mouse is easily compatible with Windows XP, Windows Vista, Windows 11/10/8/7, Vista 8/7, Chromebook, Mac OS Linux and other systems.",
      "details": {
        "brand": "TECKNET",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "Wireless, USB",
        "color": "Grey",
        "ram": "N/A",
        "detail_item": "【6 Levels Adjustable DPI & 6 Buttons】TECKNET wireless mouse has a 6-Level adjustable DPI (800/1200/1600/2400/3200/4800), which provides more sensitivity than standard optical mice for smooth and precise tracking on a wide range of surfaces."
      }
    },
    {
      "id": "B0BPCW5CS6",
      "name": "Wireless Bluetooth Mouse Rechargeable LED Silent Slim Laptop Mouse Portable(Bluetooth5.2 and 2.4GHz USB Receiver) Dual Mode Computer Mouse for Laptop/iPad Tablet/Apple Computer/MacBook (Black)",
      "ratings": 5.329,
      "price": "$6.98",
      "image": "https://m.media-amazon.com/images/I/615H13dcOUL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "【Dual Mode Wireless Bluetooth Mouse】:(BT5.2/3.0 and 2.4G)Dual Mode Realize the Free Switching of One Computer Mouse Between Two Devices.Bluetooth Mouse Mode Can Connect One Device Through BT5.2/3.0 and Wireless Mouse Mode Another Device Through a 2.4G USB Receiver,No Need to Install any Driver,Plug and Play;Wireless/Bluetooth Technology Provides Powerful and Reliable Connection,Which Can Enables Fast Data Transmission Without Delays or Dropouts,Effective Up to 10 Meters（33 feet）of Range;Note:The USB Receiver is Stored Inside The Back of The Mouse.You Can't Use Bluetooth Mode and 2.4G Mode At the Same Time     【Rechargeable Wireless Mice Save Energy】:Cordless Mouse Built-in Durable 500mAh Lithium Ion Battery, High Cycle Life;LED Wireless Mouse No Need Change Battery,It Can Be Easily Charged Using the Included USB Cable,Just 2 Hours Charging,You Can Use Than 7 Days of Working Time and 30 Days of Standby Time,Standby Time is Very Long;The Laptop Mouse Wireless will enter a sleep state after 5 minutes of inactivity,which saves power and can be used for a long time;You Can Wake USB Mouse Up By Clicking any Button     【Colorful LED Breathing Light】:This Tablet Mouse With 7 Different LED Colorful Breathing Lights,Wireless Laptop Mouse for Laptop 7 Different Color Changes Randomly While in Use,Offering Soothing Lighting;Creating Cool and Fancy Atmosphere for Work and Play;LED Mouses Can Give You More Fun During     【3 Adjustable DPI Levels】:Wireless Computer Mouse with 800 / 1200 / 1600 DPI Resolution Optical Tracking Technology provides more sensitivity than standard optical mice for smooth and precise tracking on a wide range of surfaces;you can freely choose your cursor speed,reduces muscle fatigue and boost your workflow.whether working on spreadsheets,browsing the web,or gaming,this wireless mouse will ensure smooth and responsive performance     【Wide Compatibility Wireless Mouse】:This Wireless Bluetooth Mouse for Laptop,PC/Tablet/Mac/ipad/iphone;It is Compatible With Android/Chromebook/Windows/Vista/Linux/Notebook/Mac OS and Other Devices;Suitable for Homes、Offices、Travel and More     【Anti-Fingerprint,Skin-Friendly for Comfort】:apple magic mouse with classic design with anti-fingerprint Surface Coating Technology Gives You a Skin-Like comfort Touch,The sturdy anti-slip rubber scroll wheel ensures that your hand will not slip when scrolling     【Silent Click,More Focus】:The silent mouse features a unique silent click technology,ensuring the clicks are virtually noiseless,allowing you to enjoy 90 percent less click noise,so that you can stay focused on your work,allowing peaceful work without disturbing others,ideal for both office and home use     【Portable Mouse】:Size About 4.4 x 2.3 x 1.1 inch,It Can Be Easily Put Into Your Laptop Bag and Ultra-Space Saving;Slim and Lightweight,Portable Durable Ergonomic Mouse is Perfect for Travel;Any Problem About The Wireless Usb Mouse,You Can Contact Us Anytime",
      "details": {
        "brand": "WREANU",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "Wireless, BT 3.0/5.2, Bluetooth, USB, Radio Frequency",
        "color": "Black Wireless Bluetooth Mouse",
        "ram": "N/A",
        "detail_item": "【Dual Mode Wireless Bluetooth Mouse】:(BT5.2/3.0 and 2.4G)Dual Mode Realize the Free Switching of One Computer Mouse Between Two Devices.Bluetooth Mouse Mode Can Connect One Device Through BT5.2/3.0 and Wireless Mouse Mode Another Device Through a 2.4G USB Receiver,No Need to Install any Driver,Plug and Play;Wireless/Bluetooth Technology Provides Powerful and Reliable Connection,Which Can Enables Fast Data Transmission Without Delays or Dropouts,Effective Up to 10 Meters（33 feet）of Range;Note:The USB Receiver is Stored Inside The Back of The Mouse.You Can't Use Bluetooth Mode and 2.4G Mode At the Same Time"
      }
    },
    {
      "id": "B07YN82X3B",
      "name": "Logitech G203 Wired Gaming Mouse, 8,000 DPI, Rainbow Optical Effect LIGHTSYNC RGB, 6 Programmable Buttons, On-Board Memory, Screen Mapping, PC/Mac Computer and Laptop Compatible - Black",
      "ratings": 17.236,
      "price": "$19.00",
      "image": "https://m.media-amazon.com/images/I/61UxfXTUyvL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "8,000 DPI gaming-grade sensor responds precisely to movements. Customize your sensitivity settings to suit the sensitivity you like with Logitech G HUB gaming software and cycle easily through up to 5 DPI settings.     Play in color with our most vibrant Lightsync RGB featuring color wave effects customizable across -16.8 million colors. Install Logitech G HUB software to choose from preset colors and animations or make your own. Game-driven, audio visualization and screen mapping options are also available.     Play comfortably and with total control. The classic and simple 6-button layout and classic gaming shape is a comfortable time-tested and loved design. Each button can be customized using Logitech G HUB software to simplify tasks.     Primary buttons are mechanical and tensioned with durable metal springs for reliability, performance and excellent feel. The crisp clicks and precise feedback delivers a great precision feel to maximize your fun in game.     USB data format: 16 bits/axis; USB report rate: 1000Hz (1ms); Microprocessor: 32-bit ARM; Cable length: 6.89 ft (2.1 m)     Compatibility: Windows 7 or later; macOS 10.13 or later; ChromeOS: USB port",
      "details": {
        "brand": "Logitech G",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "USB",
        "color": "Black",
        "ram": "N/A",
        "detail_item": "8,000 DPI gaming-grade sensor responds precisely to movements. Customize your sensitivity settings to suit the sensitivity you like with Logitech G HUB gaming software and cycle easily through up to 5 DPI settings."
      }
    },
    {
      "id": "B0BXBC26X8",
      "name": "Razer Basilisk V3 X HyperSpeed Wireless Gaming Mouse: Up to 285 Hr Battery - 18K Optical Sensor - Mechanical Switches - Chroma RGB - 9 Programmable Controls - Black",
      "ratings": 567,
      "price": "$49.00",
      "image": "https://m.media-amazon.com/images/I/61okFRY8uPL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "ICONIC ERGONOMIC FORM WITH 9 CUSTOMIZABLE CONTROLS — Favored by millions worldwide, the mouse’s signature shape perfectly supports different grips, while its numerous easy-access buttons allow for an endless combination of commands and macros     RAZER HYPERSPEED WIRELESS AND BLUETOOTH — Unleash seamless, low-latency performance that's faster than other wireless tech or switch to Bluetooth for longer hours of gaming. Outfitted with multi-device support for a streamlined setup     UP TO 285 HOURS OF BATTERY LIFE — With up to 535* hours on Bluetooth and 285* hours on Razer HyperSpeed Wireless, last longer in the heat of battle with a mouse designed to play the long game. *May vary depending on usage conditions     RAZER 5G ADVANCED 18K OPTICAL SENSOR — Tailor the mouse to the playstyle with a new, robust set of sensitivity settings. Enjoy responsive, pixel-precise aim with an ultra-reliable sensor that tracks movement with zero spinouts     RAZER MECHANICAL MOUSE SWITCHES GEN-2 — With new gold-plated contact points, the switches are less prone to degrading and have a longer lifespan of up to 60-million clicks, so gamers can enjoy crisp execution that’s just as consistent     POWERED BY RAZER CHROMA RGBL: Customize from 16.8 million colors and countless lighting effects, and experience greater immersion as the mouse reacts dynamically with hundreds of Chroma-integrated games     #1 SELLING PC GAMING PERIPHERALS BRAND IN THE U.S. — Source — Circana, Retail Tracking Service, U.S., Dollar Sales, Gaming Designed Mice, Keyboards, and PC Headsets, Jan. 2019- Dec. 2023 combined",
      "details": {
        "brand": "Razer",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "Bluetooth, USB",
        "color": "Classic Black",
        "ram": "N/A",
        "detail_item": "ICONIC ERGONOMIC FORM WITH 9 CUSTOMIZABLE CONTROLS — Favored by millions worldwide, the mouse’s signature shape perfectly supports different grips, while its numerous easy-access buttons allow for an endless combination of commands and macros"
      }
    },
    {
      "id": "B09J1TB35S",
      "name": "Logitech Lift Vertical Ergonomic Mouse, Wireless, Bluetooth or Logi Bolt USB receiver, Quiet clicks, 4 buttons, compatible with Windows/macOS/iPadOS, Laptop, PC - Graphite",
      "ratings": 9.657,
      "price": "$69.99",
      "image": "https://m.media-amazon.com/images/I/61OkuiCWbDL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Lift yourself up: When the desk life gets you down, lift yourself up with Logitech Lift Vertical Ergonomic Mouse - a great fit for small to medium right hands     Raise your hand into comfort: Rest on Lift upright mouse throughout the day, with a softly textured grip and snug thumb rest for level-above cosiness, 10-m wireless range     57 degrees of sooooothe: Lift’s vertical shape helps wrists feel like “ahhh” at work, and promotes a more natural posture in the forearm, for day-long comfort and productivity     Relax into focus: Settle into work with a cordless mouse featuring easy-to-reach customisable buttons, whisper-quiet clicks and a SmartWheel for smooth, seamless scrolling     Ergo-certified: Lift wireless vertical mouse has been designed, developed, tested and approved according to criteria set out by leading ergonomists     Connect your way: Connect via Bluetooth Low Energy or Logi Bolt USB to Windows, macOS, iPadOS, Chrome OS, or Linux, and enjoy up to 2 years battery life     Plastic parts in Lift include certified post consumer recycled plastic (Graphite: 70%, Off-White and Rose: 54%(6)). Certified carbon neutral.",
      "details": {
        "brand": "Logitech",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "Bluetooth",
        "color": "GRAPHITE",
        "ram": "N/A",
        "detail_item": "Lift yourself up: When the desk life gets you down, lift yourself up with Logitech Lift Vertical Ergonomic Mouse - a great fit for small to medium right hands"
      }
    },
    {
      "id": "B082V7PWD1",
      "name": "TECKNET Bluetooth Mouse, 4000DPI Wireless Mouse Bluetooth for Laptop 2-in-1(BT 5.0/3.0+2.4Ghz) Computer Mouse, Portable PC Mouse Wireless with USB Receiver for Mac, Compatible with MacBook Chromebook",
      "ratings": 8.308,
      "price": "$15.99",
      "image": "https://m.media-amazon.com/images/I/51dNOwNGEEL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Enable High-Efficiency Multiple Working Modes: 3 modes bluetooth wireless mouse for laptop(BT5.0 & BT3.0 + 2.4GHz), realizes free switches between 2 devices(with Bluetooth mode and 2.4G mode) in a switch button on the computer mouse wireless. Simple & convenient to work from the desktop to the laptop, or tablet to Macbook chromebook, etc     2 in 1(Bluetooth+2.4Ghz USB) Computer Mouse Wireless: Bluetooth mode works with Windows/ Android/ MAC OS system, choose the Bluetooth version of your device, bluetooth mouse for laptop with BT5.0 and BT3.0 to choose from; 2.4Ghz USB mode works with laptop, desktop, or any device with USB-A port, simply plug in the receiver, use as a usb wireless mouse. Or put away the adapter, use it as a Bluetooth mouse. Also support both connection methods at the same time.(Can not connect through WiFi)     Connect Step: 2.4G, insert battery, toggle the switch to select the 2.4G wireless mode(green LED lights up on), then plug the receiver into the USB-a port of device, press any button to confirm the connection successfully; Bluetooth, insert battery, toggle the switch to select the Bluetooth mode(blue LED lights up on). Long press the Bluetooth pairing button for 3s to enable pairing. Turn on the computer's Bluetooth and search for Bluetooth devices BM20X-3.0 or BM20X-5.0 and then connect is ok     Connect 2 Devices Simultaneously: Supports 2 devices simultaneously with just one TECKNET wireless mouse for laptop, desktop, tablet, and so on, you can seamlessly switch between multiple devices with just a click, without the trouble of plugging and pairing. Bluetooth mouse for laptop according to the adaptation method of your device with two connectivity options to choose from: one USB-A and another Bluetooth connect, note: Macbook without a USB port can be connected with Bluetooth     6 Adjustable DPI Levels: To meet the needs of different groups, computer mouse wireless for laptop with 6 levels of DPI, 800/1200/1600/2400/3200/4000, and comes with a Nano receiver (stored in the back of the wireless mouse for laptop). No need for any driver, and you can plug and play the computer mouse wireless directly, advanced TeckNet Tru-Wave optical tracking technology ensures precise tracking on most surfaces.     Comfortable & Durable Design: Ergonomic design with an elegant profile, this wireless mouse for laptop is perfect to fit your hands, providing a comfortable user experience. Mouse for laptop tested over 10 million times click lifespan ensures long-term stable use. The computer mouse wireless is medium-sized and is very convenient to carry on trips or outings, note, If your palms are larger and like an oversized wireless bluetooth mouse, please consider carefully     Hassle-free Design: Computer mouse wireless with smart auto-sleep mode, battery life up to 18 months(NOTE: batteries not included, battery life may vary); Compatible with Windows 11/10/8/7/XP/Vista and Mac OS X/Linux/Android/iOS(13+). Moving quickly forward or back between documents or browsing websites is a breeze with Back/Forward buttons(NOTE: not suitable for Mac System) on the left side of the computer wireless mouse for laptop, which may affect left-handed use, please understand",
      "details": {
        "brand": "TECKNET",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "Bluetooth, 2.4G Hz USB Wireless",
        "color": "Black",
        "ram": "N/A",
        "detail_item": "Enable High-Efficiency Multiple Working Modes: 3 modes bluetooth wireless mouse for laptop(BT5.0 & BT3.0 + 2.4GHz), realizes free switches between 2 devices(with Bluetooth mode and 2.4G mode) in a switch button on the computer mouse wireless. Simple & convenient to work from the desktop to the laptop, or tablet to Macbook chromebook, etc"
      }
    },
    {
      "id": "B09C13PZX7",
      "name": "Razer Basilisk V3 Customizable Ergonomic Gaming Mouse: Fastest Gaming Mouse Switch - Chroma RGB Lighting - 26K DPI Optical Sensor - 11 Programmable Buttons - HyperScroll Tilt Wheel - Classic Black",
      "ratings": 7.14,
      "price": "$49.49",
      "image": "https://m.media-amazon.com/images/I/61AcT0ZuO3L.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "ICONIC ERGONOMIC DESIGN WITH THUMB REST — PC gaming mouse favored by millions worldwide with a form factor that perfectly supports the hand while its buttons are optimally positioned for quick and easy access     11 PROGRAMMABLE BUTTONS — Assign macros and secondary functions across 11 programmable buttons to execute essential actions like push-to-talk, ping, and more     HYPERSCROLL TILT WHEEL — Speed through content with a scroll wheel that free-spins until its stopped or switch to tactile mode for more precision and satisfying feedback that’s ideal for cycling through weapons or skills     11 RAZER CHROMA RGB LIGHTING ZONES — Customize each zone from over 16.8 million colors and countless lighting effects, all while it reacts dynamically with over 150 Chroma integrated games     OPTICAL MOUSE SWITCHES GEN 2 — With zero unintended misclicks these switches provide crisp, responsive execution at a blistering 0.2ms actuation speed for up to 70 million clicks     FOCUS+ 26K DPI OPTICAL SENSOR — Best-in-class mouse sensor with intelligent functions flawlessly tracks movement with zero smoothing, allowing for crisp response and pixel-precise accuracy     #1 SELLING PC GAMING PERIPHERALS BRAND IN THE U.S. — Source — Circana, Retail Tracking Service, U.S., Dollar Sales, Gaming Designed Mice, Keyboards, and PC Headsets, Jan. 2019- Dec. 2023 combined",
      "details": {
        "brand": "Razer",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "USB",
        "color": "Black",
        "ram": "N/A",
        "detail_item": "ICONIC ERGONOMIC DESIGN WITH THUMB REST — PC gaming mouse favored by millions worldwide with a form factor that perfectly supports the hand while its buttons are optimally positioned for quick and easy access"
      }
    },
    {
      "id": "B0CP3HTHLZ",
      "name": "TECKNET Wireless Mouse (BT5.0/3.0 & 2.4G) Rechargeable 4800 DPI Silent Mouse 6 Buttons Bluetooth Mouse, USB A Mouse Wide Compatibility - Grey",
      "ratings": 11.45,
      "price": "$16.99",
      "image": "https://m.media-amazon.com/images/I/61MoSPeCRuL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Dual Device Connection: Connect two devices simultaneously using either Bluetooth(3.0/5.0) or USB A connection for a wireless mouse experience. Seamlessly switch between the connected devices with a simple slide of the switch button. This makes it an ideal choice for those seeking both a usb mouse and a bluetooth mouse. (PLEASE NOTE: The mouse is better suited for SMALL to MEDIUM-sized hands. However, if you have larger hands yet enjoy a smaller mouse, you might also like this one.)     Rechargeable Mouse: Say goodbye to constantly changing batteries. Our bluetooth mouse for laptop is rechargeable, taking only 1.5 to 2 hours to fully charge. Once fully charged, it provides around 3 months of usage (based on 2 hours of daily use). It's the perfect solution for those looking for a rechargeable wireless mouse. (A charging cable is included.)     6 Adjustable Level: This computer mouse offers 6 adjustable DPI levels (4800/3200/2400/1600/1200/800), allowing you to easily customize DPI to suit your preferences. Whether you need precise control for detailed work or swift movement for browsing, this wireless mouse for laptop has you covered.     Silent Operation: Enjoy a noiseless experience with this silent mouse. The wireless bluetooth mouse is designed to provide quiet operation, making it suitable for environments where silence is appreciated, such as libraries or offices.     Wide Compatibility: The wireless silent mouse is compatible with various systems including Windows/macOS/Chrome/Linux. It works seamlessly with laptop, computers and other devices, making it a versatile option for anyone in need of a wireless computer mouse. (Side buttons are not compatible with macOS)     36 MONTHS SUPPORT: If you encounter any problems in using the product, please feel free to contact our professional customer service team, enjoying TECKNET 36 Months Warranty (Registered Only)",
      "details": {
        "brand": "TECKNET",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "Wireless, USB A, Bluetooth",
        "color": "Grey",
        "ram": "N/A",
        "detail_item": "Dual Device Connection: Connect two devices simultaneously using either Bluetooth(3.0/5.0) or USB A connection for a wireless mouse experience. Seamlessly switch between the connected devices with a simple slide of the switch button. This makes it an ideal choice for those seeking both a usb mouse and a bluetooth mouse. (PLEASE NOTE: The mouse is better suited for SMALL to MEDIUM-sized hands. However, if you have larger hands yet enjoy a smaller mouse, you might also like this one.)"
      }
    },
    {
      "id": "B0C97CF6K2",
      "name": "Cute Bluetooth Mouse, 2.4 GHz Wireless Mice with USB Receiver for Laptop, iPad, Mac, Silent Cartoon Mouse Suitable for Children and Students (Kerry Bear)",
      "ratings": 376,
      "price": "$14.99",
      "image": "https://m.media-amazon.com/images/I/61kL1e5zG-L.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "❤ [Cute Wireless Mouse] - Our wireless mouse has a variety of cute cartoon pattern designs, suitable for young people and children.     ❤ [Dual Mode Mouse] - Bluetooth & 2.4G dual mode wireless mouse connection switch easily. Bluetooth wireless brings quick response, precise movement, stable connection & smoother tracking. 2.4G wireless transmission provide stable and reliable connection.     ❤ [Silent Wireless Mouse] - Special design, noiseless click sound when pressing buttons, which let you not worry about the mouse sound can disturbing others, especially at library or office.     ❤ [Durable Mouse] - Intelligent power saving, the mouse will automatically be in sleeping mode after 10 minutes inactivity, you can click any button to wake it up. Only 1 piece AA battery is required for power supply (not included in the package).     ❤ [Universal Compatibility Mouse] - FMOUSE M101 Mouse, with wireless receiver and Bluetooth inside, connect the mouse easily to your MacBook, iPad, Laptop or any Desktop devices, Mouse wireless well compatible with Windows, MacOS, iPadOS & Android.",
      "details": {
        "brand": "FMOUSE",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "Wireless, Bluetooth, USB",
        "color": "Kerry Bear",
        "ram": "N/A",
        "detail_item": "❤ [Cute Wireless Mouse] - Our wireless mouse has a variety of cute cartoon pattern designs, suitable for young people and children."
      }
    },
    {
      "id": "B0BYJ7N7LX",
      "name": "SM600 White Wireless Gaming Mouse,8000 DPI Tri-Modes BT5.1/Type-C Wired/2.4G Wireless Mouse with 2 Side Buttons, Programmable Macro Gamer Mouse with RGB Light for Laptop/PC/Mac",
      "ratings": 1.256,
      "price": "$26.89",
      "image": "https://m.media-amazon.com/images/I/61nDTw3ZemL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "3 Mode Connection.SM600 wireless gaming mouse adopts tri-mode connection,2.4G wireless /2 BT5.1/Type-C Wired connection.Users can save 4 devices same time,support PC, laptop, tablet, mobile phone, etc. Switch convenientand connection quick!     Customized &Macro Proqram.SM600 gaming mouse with 7 programmable buttons. Users through the software to set the mouse buttons, DPl, mode, lighting effects, etc.SM600 Custom mouse greatly meets the DIY needs of game enthusiasts!     Adjustable DPI & Rechargeable Battery.SM600 wireless mouse can be adjusted within 6 levels dpi(8000-4000-2400-1600-1200-800).Rate of return up to 1000Hz,even in intense games, achieve zero latency and no frame skipping! Built-in 600 mA lithium battery,with USB-C charqing cable,Low battery indicator will remind user to charge it with flashing redlight.it also supported recharged while charging!     Lightweight & Honeycomb Shell.SM600 honeycomb mouse made of high quality.ABS material and designed with ergonomic hollow shell,Ergonomic Design reduce the weight and make the mouse more flexible and easier to be used for a long time without fatigue,and also enhance the heat dissipation features very comfortable to use.     14 RGB Rainbow Backlight.SM600 has beautiful RGB rainbow backlight. This wireless mouse is equipped with RGB lighting effects. Press the top button to switch light modes (rainbow light/Monochrome light/light off)!! Very cool lights especially when useing in the dark!",
      "details": {
        "brand": "SOLAKAKA",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "Bluetooth",
        "color": "white",
        "ram": "N/A",
        "detail_item": "3 Mode Connection.SM600 wireless gaming mouse adopts tri-mode connection,2.4G wireless /2 BT5.1/Type-C Wired connection.Users can save 4 devices same time,support PC, laptop, tablet, mobile phone, etc. Switch convenientand connection quick!"
      }
    },
    {
      "id": "B071YZJ1G1",
      "name": "Logitech MX Master 2S Wireless Mouse - Hyper-Fast Scrolling, Ergonomic, Rechargeable, Control 3 Computers, Graphite",
      "ratings": 15.564,
      "price": "$65.98",
      "image": "https://m.media-amazon.com/images/I/61v1eEAWXYL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Cross computer control: Game changing capacity to navigate seamlessly on 3 computers, and copy paste text, images, and files from 1 to the other using Logitech flow",
      "details": {
        "brand": "Logitech",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "Wireless, Bluetooth, USB",
        "color": "Graphite",
        "ram": "N/A",
        "detail_item": "Cross computer control: Game changing capacity to navigate seamlessly on 3 computers, and copy paste text, images, and files from 1 to the other using Logitech flow"
      }
    },
    {
      "id": "B09JSH81HZ",
      "name": "Trueque Wireless Mouse for Laptop, 2.4GHz Ergonomic Computer Mouse with Back & Forward Buttons, 3 Levels Tracking Speed, 6 Buttons, Optical USB Cordless Mice for Windows Chromebook MacBook PC (Gray)",
      "ratings": 3.812,
      "price": "$7.99",
      "image": "https://m.media-amazon.com/images/I/51SH2XIbB1L.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Ergonomic Design, All-day Comfort. This wireless mouse features a streamlined, curved design that follows the natural curves of your hand. Skin-friendly silicone and plastic on the sides provide a comfortable grip. Significantly reduces stress on thumbs and wrists when in use.     Multi-function & Efficiency. 6 efficient buttons for excellent productivity, convenient forward/back buttons for increased work efficiency. 3 levels of tracking speed (800, 1200/1600) and 50 million keystrokes tested, making every click precise and accurate.     Plug and Play. 2.4GHz wireless technology can provide a stable signal. The use range is up to 33 feet, ensuring no delay or dropout. No driver installation is required—just plug the USB receiver (stored on the back of the mouse) into your device, and it's ready to use.     Energy Saving & Eco-friendly. Only 1 AA battery lasts up to 16 months. It enters sleep mode after you leave for 1 minute, double-clicking any button to wake it up. Reduces the need to replace batteries.     Wide Compatibility. Compatible with all Windows system versions, Linux, Chrome OS, and Mac OS. Fits desktops, laptops, PC, Macbooks, Chromebook, and computers. USB A to Type C adapter is ready to adapt to your system.",
      "details": {
        "brand": "Trueque",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "USB",
        "color": "Gray",
        "ram": "N/A",
        "detail_item": "Ergonomic Design, All-day Comfort. This wireless mouse features a streamlined, curved design that follows the natural curves of your hand. Skin-friendly silicone and plastic on the sides provide a comfortable grip. Significantly reduces stress on thumbs and wrists when in use."
      }
    },
    {
      "id": "B015NBTMMC",
      "name": "TECKNET Wireless Mouse Rechargeable, 2.4G USB-A Silent Mouse, Quiet Click, 6 Adjustable 4800 DPI, Cordless Computer Mouse, Ergonomic Mouse for Laptop, 6 Buttons Mouse for Chromebook, Ergo Grip - Black",
      "ratings": 12.037,
      "price": "$13.99",
      "image": "https://m.media-amazon.com/images/I/61mhtlXbxJL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Rechargeable Mouse, Energy-Efficient - Equipped with a built-in 700 mAh battery, this wireless mouse could charge rapidly and get enough power for a full day of use in only 5 minutes, without any downtime during recharging. A full charge can last up to 90 days.     Less Noise, More Focus - Eliminate noise and distractions with 90% reduced click sound for enhancing your working Immersion.     Compact Design, Travel Friendly - With the dimension of 4.09*2.68*1.49 in, this compact wireless mouse provides more portability and a better travel experience.     Ergonomic Design, Comfort Grip - The contoured shape of this mouse is ergonomically designed to fit the natural curve of your hand, ensuring lasting comfort and productivity. Featuring rubber side-grips, it offers added thumb support for a superior working experience.     Advanced Optical Tracking - Featuring 6-level adjustable DPI (800/1200/1600/2400/3200/4800), this wireless mouse provides high-performance precision and smart cursor control on most surfaces.     Plug and Play - Simply plug the USB mini-receiver into your Windows, Mac, Chrome OS, or Linux computer and enjoy seamless connectivity up to 49 feet.     Notice - Please be aware that a Type-C charging cable is included. The USB receiver is stored at the back of the wireless mouse. Only compatible with USB-A port.",
      "details": {
        "brand": "TECKNET",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "USB, Rechargeable",
        "color": "Black",
        "ram": "N/A",
        "detail_item": "Rechargeable Mouse, Energy-Efficient - Equipped with a built-in 700 mAh battery, this wireless mouse could charge rapidly and get enough power for a full day of use in only 5 minutes, without any downtime during recharging. A full charge can last up to 90 days."
      }
    },
    {
      "id": "B09KXFTCLP",
      "name": "Logitech Signature M650 L Left Wireless Mouse - For Large Sized Left Hands, 2-Year Battery, Silent Clicks, Customizable Side Buttons, Bluetooth, for PC/Mac/Multi-Device/Chromebook - Graphite",
      "ratings": 9.183,
      "price": "$34.28",
      "image": "https://m.media-amazon.com/images/I/71VW+lp5zTL._AC_SY300_SX300_.jpg",
      "description": "Scroll smarter: With Logitech Signature M650 Wireless Mouse you get line-by-line precision for documents and super-fast scrolling for long web pages; simply switch modes with a flick of the SmartWheel     Left handed design: This comfortable full size mouse is designed for larger hands, for the optimal fit for left handed users     Upgrade your comfort: This work mouse provides long hours of comfort thanks to a contoured shape, soft thumb area, and rubber side grips that keep your hand snug and in place     Connect the way you like: Connect this cordless computer mouse in an instant via Bluetooth Low Energy or Logi Bolt USB receiver     Less noise, more focus: Whether working at the office or at home, Logitech Signature M650 is a quiet mouse, allowing you to enjoy 90 percent less click noise with SilentTouch technology*     Customizable side buttons: Customize the side buttons on the computer mouse with Logitech Options+, available on Windows and macOS, to your favorite shortcuts â?? like back/forward or copy/paste     24 month battery life: Work for up to 2 years on the single AA battery that comes with your multi-device mouse**",
      "details": {
        "brand": "Logitech",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "USB",
        "color": "Graphite",
        "ram": "N/A",
        "detail_item": "Scroll smarter: With Logitech Signature M650 Wireless Mouse you get line-by-line precision for documents and super-fast scrolling for long web pages; simply switch modes with a flick of the SmartWheel"
      }
    },
    {
      "id": "B087LXCTFJ",
      "name": "Logitech G PRO X SUPERLIGHT Wireless Gaming Mouse, Ultra-Lightweight, HERO 25K Sensor, 25,600 DPI, 5 Programmable Buttons, Long Battery Life, Compatible with PC / Mac - Black",
      "ratings": 7.547,
      "price": "$122.85",
      "image": "https://m.media-amazon.com/images/I/51uy8gOG-iL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Meticulously designed in collaboration with many of the world’s leading esports pros. Engineered to win, being the pinnacle of our continued pursuit for the highest levels of performance.     Ultra-lightweight at under 63 grams, with hyper-minimal redesign achieving nearly 25% weight reduction compared to standard PRO Wireless mouse.     Powered by Lightspeed, PRO X Superlight is our fastest and most reliable PRO mouse yet.     Incredibly precise, fast and consistent control with Hero Sensor, designed from the ground up by Logitech G engineers for the best possible gaming performance.     Large, zero-additive PTFE feet deliver a smooth glide for a pure, fluid connection with the game. System Requirements-Windows 8 or later, macOS 10.11 or later     Available in black and white.",
      "details": {
        "brand": "Logitech G",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "Black",
        "ram": "N/A",
        "detail_item": "Meticulously designed in collaboration with many of the world’s leading esports pros. Engineered to win, being the pinnacle of our continued pursuit for the highest levels of performance."
      }
    },
    {
      "id": "B07CMS5Q6P",
      "name": "Logitech G305 LIGHTSPEED Wireless Gaming Mouse, Hero 12K Sensor, 12,000 DPI, Lightweight, 6 Programmable Buttons, 250h Battery Life, On-Board Memory, PC/Mac - Black",
      "ratings": 31.358,
      "price": "$25.49",
      "image": "https://m.media-amazon.com/images/I/51VpABY-b6L.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "HERO Gaming Sensor: Next-gen HERO mouse sensor delivers up to 10x the power efficiency over other gaming mice with exceptional accuracy and responsiveness thanks to 400 IPS precision and up to 12000 DPI sensitivity     LIGHTSPEED Wireless: Ultra-fast LIGHTSPEED Wireless technology gives you a lag-free gaming experience. The G305 wireless gaming mouse delivers incredible responsiveness and reliability with a super-fast 1ms report rate for competition-level performance. Mechanical Button Tensioning System     Ultra-Long Battery Life: The G305 wireless Logitech mouse boasts an incredible 250 hours of continuous gameplay on a single AA battery so you can play at peak performance without worrying about running out of power     Lightweight design: Thanks to an efficient mechanical design, the G305 gaming mouse weighs in at only 99 grams for high manoeuvrability     Compact, portable design with convenient built-in storage for included USB wireless receiver. Max. speed: > 400 IPS     Portable Convenience: The durable, compact design with built-in USB receiver storage makes the G305 means you can take it with you.     2-year limited hardware warranty",
      "details": {
        "brand": "Logitech G",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "Wireless",
        "color": "Black",
        "ram": "N/A",
        "detail_item": "HERO Gaming Sensor: Next-gen HERO mouse sensor delivers up to 10x the power efficiency over other gaming mice with exceptional accuracy and responsiveness thanks to 400 IPS precision and up to 12000 DPI sensitivity"
      }
    },
    {
      "id": "B07L4BM851",
      "name": "Logitech G502 Lightspeed Wireless Gaming Mouse with Hero 25K Sensor, PowerPlay Compatible, Tunable Weights and Lightsync RGB - Black",
      "ratings": 12.532,
      "price": "$124.99",
      "image": "https://m.media-amazon.com/images/I/718b9wK3eaL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Selling Wireless Gaming Gear Brand - Based on independent sales data (FEB ‘19 - FEB’20) of Wireless Gaming Keyboard, Mice, and PC Headset in units from: US, CA, CN, JP, KR, TW, TH, IN, DE, FR, RU, UK, SE, TR     PowerPlay wireless charging: Never worry about your battery life again. Add the power play wireless charging system to keep your G502 Lightspeed Wireless Mouse and other compatible G mice charged while at rest and at play. Powerplay wireless charging system sold separately     Light speed wireless gaming mouse: Exclusive Logitech G ultra-fast wireless technology used by Pro gamers in competitions worldwide     Hero 25K sensor through a software update from G HUB, this upgrade is free to all players: Our most advanced, with 1:1 tracking, 400plus ips, and 100 - 25,600 max dpi sensitivity plus zero smoothing, filtering, or acceleration     11 customizable buttons and hyper fast scroll wheel: Assign custom macro and shortcut commands to the buttons for each game with Logitech G hub software. Use hyper fast scrolling to rapidly review menus, long web pages and more",
      "details": {
        "brand": "Logitech G",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": ": LIGHTSPEED Wireless",
        "color": "Black",
        "ram": "N/A",
        "detail_item": "Selling Wireless Gaming Gear Brand - Based on independent sales data (FEB ‘19 - FEB’20) of Wireless Gaming Keyboard, Mice, and PC Headset in units from: US, CA, CN, JP, KR, TW, TH, IN, DE, FR, RU, UK, SE, TR"
      }
    },
    {
      "id": "B0943HXDVM",
      "name": "Logitech G502 X Wired Gaming Mouse - LIGHTFORCE hybrid optical-mechanical primary switches, HERO 25K gaming sensor, compatible with PC - macOS/Windows - Black",
      "ratings": 1.336,
      "price": "$124.99",
      "image": "https://m.media-amazon.com/images/I/61fjq9eujBL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Icon reinvented: From the legacy of Logitech's most popular G502 design, the G502 X wired gaming mouse is reimagined and redesigned with the latest innovations in gaming technology     LIGHTFORCE switches: All-new hybrid optical-mechanical switch technology for incredible speed and reliability, as well as precise actuation with crisp response, for hours of performance gaming     HERO 25K gaming sensor: Incredibly precise down to the sub-micron for high-precision accuracy with zero smoothing/filtering/acceleration for high gaming performance every time on the computer     Redesigned DPI-shift button: This wired optical gaming mouse features a reversible and removable DPI-shift button for precise customization depending on your grip and preference     Redesigned hyperfast scroll wheel: Switch between hyper-fast free spin and precise ratcheting mode, and tilt left and right for two additional personalizable controls     Weight reduced: Thin-wall exoskeleton for minimum material and maximum rigidity, lightened scroll wheel, and more to achieve 89 grams     Make your choice: Available in black and white colorways",
      "details": {
        "brand": "Logitech G",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "USB",
        "color": "Black",
        "ram": "N/A",
        "detail_item": "Icon reinvented: From the legacy of Logitech's most popular G502 design, the G502 X wired gaming mouse is reimagined and redesigned with the latest innovations in gaming technology"
      }
    },
    {
      "id": "B0CSDN2136",
      "name": "SM900 Green Wired Gaming Mouse with Honeycomb Shell,12800 DPI,7 Programmable Buttons,Lightweight Gaming Mice Ergonomic Computer Mouse Gaming for Windows/PC/Mac/Laptop Gamer",
      "ratings": 440,
      "price": "$14.99",
      "image": "https://m.media-amazon.com/images/I/61e-WA4G18L.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "6 Levels Adjustable DPI:SM900 is a powerful gaming mouse with excellent performance,It supports 6 levels adjustment DPI up to 12800.Rolling Rate max to 1000Hz,According user's preference setup different DPI and Rolling Rate suitable for games, office and many occasions     4 Mode Switch:SM900 gaming wired mouse supports 4 modes switch, default 1 office mode and 3 gaming modes.Gaming modes need setup by macro software, according to the user's gaming preferences setup different button functions     Support Custom and Macro Program:SM900 lightweight gaming mouse supports macro settings, user can reset the mouse buttons, DPI,modes, lighting effects.Customize personalized gaming mouse according to user preferences.This mouse is widely supported Windows 7,8,10,XP,,VISTA,MAC OS, etc, The USB interface is plug and play     3 Sided Honeycomb Shell design:More breathable, more sweat-absorbent and more comfortable!!!The gaming mouse is made of high quality ABS material and designed with ergonomic hollow perforated housing, Ergonomic Design reduce the weight and make the mouse more flexible and easier to be used for a long time without fatigue, and also enhance the heat dissipation features, very comfortable to use     14 RGB Rainbow Backlight:SM900 pc gaming mice has adjustable RGB lights that can be set to different effects according to user preferences. The brilliant lighting effects provide illumination in dark environments also increases the fun of using",
      "details": {
        "brand": "SOLAKAKA",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "USB",
        "color": "Green",
        "ram": "N/A",
        "detail_item": "6 Levels Adjustable DPI:SM900 is a powerful gaming mouse with excellent performance,It supports 6 levels adjustment DPI up to 12800.Rolling Rate max to 1000Hz,According user's preference setup different DPI and Rolling Rate suitable for games, office and many occasions"
      }
    },
    {
      "id": "B09Q5HZL1S",
      "name": "Glorious Model O- (Minus) Wireless Gaming Mouse - 65g Superlight Honeycomb Design, RGB, Ambidextrous, Lag Free 2.4GHz Wireless, Up to 71 Hours Battery - Matte Black",
      "ratings": 4.465,
      "price": "$79.99",
      "image": "https://m.media-amazon.com/images/I/712sMCm+H7L._AC_SY300_SX300_.jpg",
      "description": "Lightning fast: Built with 2.4GHz wireless connectivity, the Model O- (Minus) Wireless has the lowest wireless latency of any mouse in its class. Get blazing-fast 1ms latency with a strong and stable connection, for super consistent performance.     Customizable RGB: Choose from 16.8M possible colours, quickly adjustable without software using mouse buttons. Deeply customize it in Glorious CORE, to make it match the rest of your desktop.     Battery life: Model O- (Minus) Wireless has the highest battery life of any mouse in its class. You get up to 71 hours* of playtime in wireless mode, and you can play while charging, using the ultra-flexible USB-C Ascended paracord charging cable (*with RGB off).     Optimized for competitive gaming: Pinpoint precision with 400 IPS tracking speed, 19,000 Max DPI and up to 1,000Hz polling rate. The proprietary BAMF Senor gives you unrivalled performance, with lower power draw, for long wireless gaming sessions.     Built to last: Model O- (Minus) Wireless honeycomb design helps create the ultimate wireless lightweight mouse, without sacrificing durability. State of the art Omron switches that are good for 20M clicks, and top-tier build quality makes the Model O- (Minus) Wireless built to last.",
      "details": {
        "brand": "Glorious",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "2.4GHz Wireless",
        "color": "Black",
        "ram": "N/A",
        "detail_item": "Lightning fast: Built with 2.4GHz wireless connectivity, the Model O- (Minus) Wireless has the lowest wireless latency of any mouse in its class. Get blazing-fast 1ms latency with a strong and stable connection, for super consistent performance."
      }
    },
    {
      "id": "B08D6VD9TR",
      "name": "Lenovo 530 Full Size Wireless Computer Mouse for PC, Laptop, Computer with Windows - 2.4 GHz Nano USB Receiver - Ambidextrous Design - 12 Months Battery Life - Graphite Grey",
      "ratings": 1.945,
      "price": "$11.99",
      "image": "https://m.media-amazon.com/images/I/51Tg7aco-BL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Reliable Wireless Connectivity: The Lenovo 530 Wireless Mouse offers a dependable connection no matter where you are. Its advanced nano USB receiver utilizes robust 2.4 GHz wireless technology, ensuring seamless performance without the hassle of cords. Stay productive and focused without the constraints of wired setups.     Precision Tracking at Your Fingertips: Elevate your user experience with the 1200 DPI resolution optical sensor featured in this wireless mouse. Experience responsive and clear tracking that enhances your navigation, whether you're browsing the web, creating presentations, or engaging in detailed design work. Precision is now at your fingertips.     Durability That Lasts: With the Lenovo 530 Wireless Mouse, longevity is a guarantee. Boasting a remarkable lifespan of up to 8 million clicks for both left and right buttons, this mouse is built to withstand the rigors of daily use. Enjoy reliable performance for years to come, making it an ideal companion for your computing tasks.     Ergonomic Comfort for Extended Use: Experience unparalleled comfort during long work sessions with the unique and contoured design of the Lenovo 530 Wireless Mouse. Crafted for maximum ergonomics, this mouse fits perfectly in your hand, ensuring all-day comfort. The durable soft touch finish adds a premium feel to your interactions, making productivity a breeze.     Versatility and Portability: Whether you're left-handed or right-handed, the Lenovo 530 Wireless Mouse accommodates your preference. Its ambidextrous design ensures functionality and comfort for all users. Weighing just 65g (2.29 oz), it's the ultimate travel companion. Slip it into your laptop bag or pocket and enjoy its lightweight portability wherever you go. Plus, with an impressive battery life of up to 12 months (actual duration may vary based on usage), you can confidently use it without worrying about frequent recharges. Choose the Lenovo 530 Wireless Mouse for unparalleled performance, comfort, and convenience.",
      "details": {
        "brand": "Lenovo",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "Bluetooth",
        "color": "Graphite Grey",
        "ram": "N/A",
        "detail_item": "Reliable Wireless Connectivity: The Lenovo 530 Wireless Mouse offers a dependable connection no matter where you are. Its advanced nano USB receiver utilizes robust 2.4 GHz wireless technology, ensuring seamless performance without the hassle of cords. Stay productive and focused without the constraints of wired setups."
      }
    },
    {
      "id": "B0CPLNPV6F",
      "name": "SM66 White Silent Dual Mode 2.4GHz Wireless Mouse, Adjustable 4800 DPI,Rechargeable Computer Mouse Wireless Office Mouse for PC Mac Laptop, Desktop",
      "ratings": 272,
      "price": "$16.89",
      "image": "https://m.media-amazon.com/images/I/51Udo0fWghL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "2.4G Wireless Dual-Mode:The SOLAKAKA SM66 wireless mouse is perfect for multi-functional use,support 2 mode BT and 2.4GHz wireless connection,3 devices save. supports connection for your Laptop,PC,Computer,Xbox,iPad,Mobile Phone.compatible with multiple systems including Windows,OS,Android,IOS,etc     Ergonomic Design, 5 DPI Adjustable:This Slim Ergonomic shape wireless mouse is designed with an asymmetrical and streamlined shell, offering a comfortable claw-grip using experience for right,left and medium,small hand, long-term use without fatigue. 5 DPI levels 4800,2400,1600,1200,800,user can press the DPI button at the bottom of the mouse. Easier and smoother. The ultra-thin design is mini and lightweight, perfect for traveling carry, and can be easily put into laptop bag, ultra-space saving     Silent Buttons:SM66 wireless mouse adopts a silent button design, which reduces 99% of button noise. It is very suitable for public places such as libraries and offices. It is the best choice for people who like quiet     PORTABLE and 10M LONG WORKING DISTANCE:2.4G Nano USB receiver is embedded in the computer mouse bottom for convenient portability. It is great as a travel mouse for a laptop. The remote mouse for laptop works great with the SOLAKAKA mouse combo and computer keyboard and mice accessories. The 10m,32ft long working distance ensures you can enjoy high-precision optical sensor performance on various surfaces     Rechargeable and Long Battery Life:With the built-in 500mAh rechargeable Lithiumion battery, you can charge the magic cute mouse by using the Type-C charger cable included. Using while charging is available. In addition, the rechargeable mouse uses smart power-saving technology, the great battery will enter sleep mode after 3 minutes of no-operation to save power and provide long time usage. You can wake it up by clicking any button     Friendly Tip: SM66 has a smart sleep mode, when it is not used for a few minutes, it will enter the power saving state, please move the mouse to wake it up!",
      "details": {
        "brand": "SOLAKAKA",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "Bluetooth",
        "color": "white",
        "ram": "N/A",
        "detail_item": "2.4G Wireless Dual-Mode:The SOLAKAKA SM66 wireless mouse is perfect for multi-functional use,support 2 mode BT and 2.4GHz wireless connection,3 devices save. supports connection for your Laptop,PC,Computer,Xbox,iPad,Mobile Phone.compatible with multiple systems including Windows,OS,Android,IOS,etc"
      }
    },
    {
      "id": "B07C2NL5HK",
      "name": "TECKNET Bluetooth Mouse, 4800 DPI Computer Mouse, 2-Year Battery Wireless Mouse 6 Adjustable DPI, 6 Buttons Compatible with Laptop/Windows/Computer",
      "ratings": 18.48,
      "price": "$13.99",
      "image": "https://m.media-amazon.com/images/I/41FwDnfOf9L.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "6 DPI and 6 Buttons: TECKNET bluetooth mouse (Without a Receiver ) has 4800/3200/2400/1600/1200/800DPI. Six efficient buttons and six adjustable DPI levels that allow you to freely control the mouse speed. Connects directly to Bluetooth-enabled device laptop computer or PC without the need for a receiver.     TruWave Technology: The accuracy of TruWave means this mouse works on most surfaces you encounter in daily life. For example: woodines, paper and cloth. And the wireless mouse offers exceptional sensitivity and responsiveness, providing real-time tracking without delay.     Wide Compatibility: TECKNET bluetooth mouse compatible with Windows (Win 11, Win 10, Win 8.1, Win 8, 2003, 2000, XP, VISTA, etc)Suitable for desktop, laptop, PC, MacBook, Chromebook and other devices. (Please Note: Side buttons are not compatible with macOS)     Bluetooth Pairing: 1. Slide mouse switch to Bluetooth 2. Hold pairing button (2-3 sec) until LED flashes. Click \"Pairing\" on device; wait for \"Connected.\" (Note: If the mouse is idle for an extended period, it will automatically enter sleep mode. Please click any button to wake it up.)     Ergonomic Design: The ergonomic design and soft rubber grip perfect to fit your hand for a comfortable grip while reducing wrist fatigue caused by long working hours. The compact size makes it easy to take with you whether you use your computer at home, at work or anywhere else. (Size: 4.4*2.8*1.6IN/112*71*41MM)     Long Battery Life: TECKNET bluetooth mouse for laptop can up to 24-month battery Life. It takes only 2 AA battery but NOT INCLUDED.     36 MONTHS SUPPORT: If you encounter any problems in using the product, please feel free to contact our professional customer service team, enjoying TECKNET 36 Months Warranty (Registered Only)",
      "details": {
        "brand": "TECKNET",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "Bluetooth",
        "color": "Black",
        "ram": "N/A",
        "detail_item": "6 DPI and 6 Buttons: TECKNET bluetooth mouse (Without a Receiver ) has 4800/3200/2400/1600/1200/800DPI. Six efficient buttons and six adjustable DPI levels that allow you to freely control the mouse speed. Connects directly to Bluetooth-enabled device laptop computer or PC without the need for a receiver."
      }
    },
    {
      "id": "B0BXZ48KSQ",
      "name": "Lenovo 530 Wireless Mouse – Full Size Computer Mouse for PC, Laptop, Windows Computer - 2.4 GHz Nano USB Receiver - Ambidextrous Design - 12 Months Battery Life – Cordless",
      "ratings": 93,
      "price": "$7.99",
      "image": "https://m.media-amazon.com/images/I/51mdRonO0YL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Reliable Wireless Connectivity: The Lenovo 530 Wireless Mouse offers a dependable connection no matter where you are. Its advanced nano USB receiver utilizes robust 2.4 GHz wireless technology, ensuring seamless performance without the hassle of cords. Stay productive and focused without the constraints of wired setups.     Precision Tracking at Your Fingertips: Elevate your user experience with the 1200 DPI resolution optical sensor featured in this wireless mouse. Experience responsive and clear tracking that enhances your navigation, whether you're browsing the web, creating presentations, or engaging in detailed design work. Precision is now at your fingertips.     Durability That Lasts: With the Lenovo 530 Wireless Mouse, longevity is a guarantee. Boasting a remarkable lifespan of up to 8 million clicks for both left and right buttons, this mouse is built to withstand the rigors of daily use. Enjoy reliable performance for years to come, making it an ideal companion for your computing tasks.     Ergonomic Comfort for Extended Use: Experience unparalleled comfort during long work sessions with the unique and contoured design of the Lenovo 530 Wireless Mouse. Crafted for maximum ergonomics, this mouse fits perfectly in your hand, ensuring all-day comfort. The durable soft touch finish adds a premium feel to your interactions, making productivity a breeze.     Versatility and Portability: Whether you're left-handed or right-handed, the Lenovo 530 Wireless Mouse accommodates your preference. Its ambidextrous design ensures functionality and comfort for all users. Weighing just 65g (2.29 oz), it's the ultimate travel companion. Slip it into your laptop bag or pocket and enjoy its lightweight portability wherever you go. Plus, with an impressive battery life of up to 12 months (actual duration may vary based on usage), you can confidently use it without worrying about frequent recharges. Choose the Lenovo 530 Wireless Mouse for unparalleled performance, comfort, and convenience.",
      "details": {
        "brand": "Lenovo",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "USB",
        "color": "Raven Black",
        "ram": "N/A",
        "detail_item": "Reliable Wireless Connectivity: The Lenovo 530 Wireless Mouse offers a dependable connection no matter where you are. Its advanced nano USB receiver utilizes robust 2.4 GHz wireless technology, ensuring seamless performance without the hassle of cords. Stay productive and focused without the constraints of wired setups."
      }
    },
    {
      "id": "B09KXFTCLP",
      "name": "Logitech Signature M650 L Left Wireless Mouse - For Large Sized Left Hands, 2-Year Battery, Silent Clicks, Customizable Side Buttons, Bluetooth, for PC/Mac/Multi-Device/Chromebook - Graphite",
      "ratings": 9.183,
      "price": "$34.28",
      "image": "https://m.media-amazon.com/images/I/71VW+lp5zTL._AC_SY300_SX300_.jpg",
      "description": "Scroll smarter: With Logitech Signature M650 Wireless Mouse you get line-by-line precision for documents and super-fast scrolling for long web pages; simply switch modes with a flick of the SmartWheel     Left handed design: This comfortable full size mouse is designed for larger hands, for the optimal fit for left handed users     Upgrade your comfort: This work mouse provides long hours of comfort thanks to a contoured shape, soft thumb area, and rubber side grips that keep your hand snug and in place     Connect the way you like: Connect this cordless computer mouse in an instant via Bluetooth Low Energy or Logi Bolt USB receiver     Less noise, more focus: Whether working at the office or at home, Logitech Signature M650 is a quiet mouse, allowing you to enjoy 90 percent less click noise with SilentTouch technology*     Customizable side buttons: Customize the side buttons on the computer mouse with Logitech Options+, available on Windows and macOS, to your favorite shortcuts â?? like back/forward or copy/paste     24 month battery life: Work for up to 2 years on the single AA battery that comes with your multi-device mouse**",
      "details": {
        "brand": "Logitech",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "USB",
        "color": "Graphite",
        "ram": "N/A",
        "detail_item": "Scroll smarter: With Logitech Signature M650 Wireless Mouse you get line-by-line precision for documents and super-fast scrolling for long web pages; simply switch modes with a flick of the SmartWheel"
      }
    },
    {
      "id": "B0CMVV4Z6T",
      "name": "Nulea M510 Vertical Mouse Wireless, Ergonomic Mouse for Comfy Tracking, 3 Adjustable DPI (800-1200-1600), 2.4G Wireless Vertical Mouse with 6 Buttons, Compatible with Windows, Mac OS, Laptop, PC, Grey",
      "ratings": 624,
      "price": "$19.99",
      "image": "https://m.media-amazon.com/images/I/71143EycLPL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Ergonomic Natural Grip: Experience all-day comfort with the Nulea ergonomic vertical mouse, meticulously crafted with a precise 57-degree angle to mirror the natural handshake position. This innovative design significantly minimizes forearm strain, enhancing your productivity and comfort throughout the day.     Adjustable DPI: Tailor your tracking precision with the ergonomic mouse, featuring adjustable DPI settings of 800, 1200, and 1600. This flexibility caters to various navigation requirements, ensuring a seamless and accurate experience for all your computing needs.     Wireless Freedom: Enjoy the liberty of wireless operation with the wireless computer mouse, equipped with advanced 2.4G USB technology for instant, smooth plug-and-play functionality. Enhance your productivity and unleash your creativity with unrestricted control and freedom.This mouse requires the use of an AA battery (not included in the packaging)     Efficiency-Enhancing Buttons: This carpal tunnerl mouse features six buttons including Forward or Backward and a 'Back to Desktop' key, accelerating web navigation. The durable, non-slip metal scroll wheel enhances control, perfect for intensive work sessions.     Effortless & Precise Tracking: Designed for comfort and precision, the laptop mouse reduce hand movement, reducing fatigue during long work hours. With up to 1600 DPI, the mouse provides exceptional tracking accuracy, ideal for demanding tasks and extended use.",
      "details": {
        "brand": "Nulea",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "USB",
        "color": "Grey",
        "ram": "N/A",
        "detail_item": "Ergonomic Natural Grip: Experience all-day comfort with the Nulea ergonomic vertical mouse, meticulously crafted with a precise 57-degree angle to mirror the natural handshake position. This innovative design significantly minimizes forearm strain, enhancing your productivity and comfort throughout the day."
      }
    },
    {
      "id": "B09726KT4R",
      "name": "ASUS ROG Spatha X Wireless Gaming Mouse (Magnetic Charging Stand, 12 Programmable Buttons, 19,000 DPI, Push-fit Hot Swap Switch Sockets, ROG Micro Switches&Paracord and Aura RGB lighting),Black",
      "ratings": 1.21,
      "price": "$124.99",
      "image": "https://m.media-amazon.com/images/I/8167lxUe8SL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Dual-mode Connectivity - ROG Spatha X Wireless Gaming Mouse allows you play wirelessly with 2.4 GHzRF, or with a wired USB-C cable connection     Ultimate Accuracy - 19,000 DPI optical sensor provides unmatched accuracy. The DPI On-The-Scroll feature lets you easily adjust the sensitivity of the wireless mouse without accessing software     Programmable Gaming Mouse - The 12 programmable buttons are positioned within easy reach, all designed to provide intuitive, responsive control     Durable Switches & Put-fit Switch Sockets - Gold-plated electro-junction, provides a 70-million clicks; Exclusive put-in switch sockets allow you to easily replace switches based on your preference     Ultra-long Battery Life - Charge it via USB-C cable or with the included magnetic charging stand. 15 minutes can provide up to 12 hours of wireless gaming; Enjoy 67 hours of play time on a full charge",
      "details": {
        "brand": "ASUS",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "USB, Radio Frequency",
        "color": "Black",
        "ram": "N/A",
        "detail_item": "Dual-mode Connectivity - ROG Spatha X Wireless Gaming Mouse allows you play wirelessly with 2.4 GHzRF, or with a wired USB-C cable connection"
      }
    },
    {
      "id": "B082LRMY53",
      "name": "Corsair SCIMITAR RGB ELITE Gaming Mouse For MOBA, MMO - 18,000 DPI - 17 Progammable Buttons - iCUE Compatible - Black",
      "ratings": 3.558,
      "price": "$58.99",
      "image": "https://m.media-amazon.com/images/I/614J0VriTRL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "17 Fully Programmable Buttons: Built with Ideal for performing frequent actions and executing complex macros in MMOs and MOBAs.     Patented Key Slider Control System: Reposition the 12 side buttons to comfortably fit your grip.     Native 18,000 DPI Optical Sensor: Equipped with a custom PixArt PMW3391 sensor, adjustable in 1 DPI resolution steps, for highly accurate and customizable tracking.     Ultra-Durable Construction: The SCIMITAR RGB ELITE’s 50 million click-rated Omron switches, sturdy scroll wheel, and braided cable ensure that it stands up to the wear-and-tear of extended gaming.     Comfortable Contoured Shape: Sculpted to fit the contours of your palm, regardless of hand size or grip style, with a right-side finger rest for added support.     Dynamic Four-Zone RGB Backlighting: Near limitless customization of colors and effects.",
      "details": {
        "brand": "Corsair",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "Bluetooth",
        "color": "Black",
        "ram": "N/A",
        "detail_item": "17 Fully Programmable Buttons: Built with Ideal for performing frequent actions and executing complex macros in MMOs and MOBAs."
      }
    },
    {
      "id": "B07KNQRQ3P",
      "name": "ZERU Bluetooth Mouse,Rechargeable Wireless Mouse for Macbook Pro/Macbook Air,Bluetooth Wireless Mouse for Laptop/PC/Mac/iPad pro/Computer",
      "ratings": 27.651,
      "price": "$11.85",
      "image": "https://m.media-amazon.com/images/I/612hkjogX3S.__AC_SY300_SX300_QL70_FMwebp_.jpg",
      "description": "[BEST COMPATIBLE BLUETOOTH 4.0 CHIP] - Compatible with more than 99% Bluetooth devices. Connect Pad 10.2 2019, Pad 9.7 Inch 2018, Pad 9.7 2017, Pad Pro 12.9\" / 11.0\" / 10.5\"/ 9.7\", Pad Air 10.5 / Air 2, Pad mini 5/ 4, Phone 11 Pro Max, Phone 11 Pro, Phone 11, Phone Xs Max etc.( Note: Updated System to PadOS 13 and iOS 13 or above, and Turn on the ¡°Assistive Touch¡± ) PC, Macbook pro air 2012/¡­2017/2018/2019 laptop, notebook, Mac OS; Support Win7 Win8 Win10 Linux OS X or Android tablet.     【Skin-Friendly for Comfort】Silent click Mouse with classic design with anti-fingerprint finish offers your hand maximum support and comfort. The sturdy anti-slip rubber scroll wheel ensures that your hand will not slip when scrolling.     【Rechargeable Optical Wireless Mouse】Built-in durable 450mAh lithium rechargeable battery can last up to 500 hours after fully charged, and standby time is super long with auto sleep and wake mode. Easily recharged through the included USB cable, no need to change the battery.     【NOISE FREE】Quiet click sound when pressing buttons, which makes you away from worrying about bothering others, especially at home while other family members having rest, so that you can stay focused on your work.     QUALITY GUARANTEE: One year quality warranty for this bluetooth mouse from ZERU",
      "details": {
        "brand": "ZERU",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "Bluetooth",
        "color": "black",
        "ram": "N/A",
        "detail_item": "[BEST COMPATIBLE BLUETOOTH 4.0 CHIP] - Compatible with more than 99% Bluetooth devices. Connect Pad 10.2 2019, Pad 9.7 Inch 2018, Pad 9.7 2017, Pad Pro 12.9\" / 11.0\" / 10.5\"/ 9.7\", Pad Air 10.5 / Air 2, Pad mini 5/ 4, Phone 11 Pro Max, Phone 11 Pro, Phone 11, Phone Xs Max etc.( Note: Updated System to PadOS 13 and iOS 13 or above, and Turn on the ¡°Assistive Touch¡± ) PC, Macbook pro air 2012/¡­2017/2018/2019 laptop, notebook, Mac OS; Support Win7 Win8 Win10 Linux OS X or Android tablet."
      }
    },
    {
      "id": "B07WCW1PB3",
      "name": "memzuoix 2.4G Wireless Mouse, 1200 DPI Mobile Optical Cordless Mouse with USB Receiver, Portable Computer Mice for Laptop, PC, Desktop, MacBook, 5 Buttons, Red",
      "ratings": 19.171,
      "price": "$15.99",
      "image": "https://m.media-amazon.com/images/I/615EiRgcwnL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "【MAXIMUM HAND-FEELING】 Modern contoured shape, sweat-resistant and skin-friendly finish are for maximum comfort and support. The thoughtful ring and little finger rest provide extra comfort. The sturdy scroll wheel with rubber makes sure that your hand will not slip when scrolling.     【PLUG & PLAY SUPER EASY TO USE】Really plug & play design, no drivers need to be installed. 2.4GHz wireless transmission technology provides a powerful and reliable connection up to 43.0ft. Portable design make it easy to store in bag. It's the best mouse for a gifts.     【STRONG DURABILITY & LONG WORKING DISTANCE】Passed 6,000,000 times keystroke test to guarantee extra durability. 2.4GHz wireless technology and professional chip ensure longer working distance.     【EXTREMELY LOW POWER CONSUMPTION】 It takes 2 AAA Batteries(NOT Included) to operate this wireless mouse, and it will turn to sleep mode in 7mins of inactivity for energy saving, can be easily activated by clicking any buttons.     【WIDE COMPATIBILITY】Well compatible with Windows 7/8/10/XP, Vista 7/8, Mac and Linux etc. The cordless computer mouse for Laptop, Desktop, PC, Macbook, and other devices. This wireless mouse enjoys 45 days money-back and a 365-day worry-free warranty. Notice, the side buttons are not available for Mac OS, but the other function can be used normally.",
      "details": {
        "brand": "memzuoix",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "Wireless, USB",
        "color": "Red",
        "ram": "N/A",
        "detail_item": "【MAXIMUM HAND-FEELING】 Modern contoured shape, sweat-resistant and skin-friendly finish are for maximum comfort and support. The thoughtful ring and little finger rest provide extra comfort. The sturdy scroll wheel with rubber makes sure that your hand will not slip when scrolling."
      }
    },
    {
      "id": "B0836GXKKB",
      "name": "Uiosmuph LED Wireless Mouse, G12 Slim Rechargeable Silent Mouse, 2.4G Portable USB Optical Computer Mice with USB Receiver and Type C Adapter (Matte Black)",
      "ratings": 70.87,
      "price": "$25.25",
      "image": "https://m.media-amazon.com/images/I/51KCV2cdDsS.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Rechargeable: Built-in rechargeable battery, no need change battery. Special soundless design for the right and left buttons, won’t disturb others.     Colorful Light: 7 different color changes randomly while in use, offering soothing lighting, creating cool and fancy atmosphere for work and play.     Energy Saving: The mouse will be in sleep mode in 8 mins of inactivity. And the LED light can be turned off by the bottom light switch.     Slim & Portable: About 4.4 x 2.2 x 0.79 inches, Suitable for travelling carry and it can be easily put into your laptop bag and ultra-space saving.     Widely Compatibility: Works with Windows 2000/XP/7/8/10/Vista, Mac with USB port or Type C port. Suitable for homes, offices, travel and more.",
      "details": {
        "brand": "Uiosmuph",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "USB",
        "color": "Matte Black",
        "ram": "N/A",
        "detail_item": "Rechargeable: Built-in rechargeable battery, no need change battery. Special soundless design for the right and left buttons, won’t disturb others."
      }
    },
    {
      "id": "B0C97CF6K2",
      "name": "Cute Bluetooth Mouse, 2.4 GHz Wireless Mice with USB Receiver for Laptop, iPad, Mac, Silent Cartoon Mouse Suitable for Children and Students (Kerry Bear)",
      "ratings": 376,
      "price": "$14.99",
      "image": "https://m.media-amazon.com/images/I/61kL1e5zG-L.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "❤ [Cute Wireless Mouse] - Our wireless mouse has a variety of cute cartoon pattern designs, suitable for young people and children.     ❤ [Dual Mode Mouse] - Bluetooth & 2.4G dual mode wireless mouse connection switch easily. Bluetooth wireless brings quick response, precise movement, stable connection & smoother tracking. 2.4G wireless transmission provide stable and reliable connection.     ❤ [Silent Wireless Mouse] - Special design, noiseless click sound when pressing buttons, which let you not worry about the mouse sound can disturbing others, especially at library or office.     ❤ [Durable Mouse] - Intelligent power saving, the mouse will automatically be in sleeping mode after 10 minutes inactivity, you can click any button to wake it up. Only 1 piece AA battery is required for power supply (not included in the package).     ❤ [Universal Compatibility Mouse] - FMOUSE M101 Mouse, with wireless receiver and Bluetooth inside, connect the mouse easily to your MacBook, iPad, Laptop or any Desktop devices, Mouse wireless well compatible with Windows, MacOS, iPadOS & Android.",
      "details": {
        "brand": "FMOUSE",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "Wireless, Bluetooth, USB",
        "color": "Kerry Bear",
        "ram": "N/A",
        "detail_item": "❤ [Cute Wireless Mouse] - Our wireless mouse has a variety of cute cartoon pattern designs, suitable for young people and children."
      }
    },
    {
      "id": "B0CFF1P999",
      "name": "KM-1 Wireless Gaming Mouse, Computer Mice USB Wireless Mouse with Honeycomb Shell, 6 Programmed Buttons, 3 Adjustable DPI, Ergonomic RGB Optical Gamer Mouse for Laptop PC Mac",
      "ratings": 197,
      "price": "$16.99",
      "image": "https://m.media-amazon.com/images/I/61N5-8AzoPL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Enhanced with a Lightweight Honeycomb Shell - With its innovative design featuring a lightweight honeycomb shell, this mouse provides an enhanced touch experience. The use of high-quality materials ensures its durability and eliminates any concerns about fragility. Its advanced ventilation system keeps your palm cool and refreshed, ensuring a comfortable feel and consistently excellent gaming performance even during prolonged use.     2.4G Wireless Technology - Experience seamless connectivity and accurate tracking with our innovative 2.4G wireless technology. Simply connect the USB receiver to any available USB port, enabling you to use our product effortlessly and without any delays or interference, regardless of your location. However, please be aware that the maximum distance for the 2.4G connection should not exceed 10 meters.     Chroma RGB Lights - Activate the KM-1 mouse by simply clicking the on/off button, and effortlessly switch between various lighting effects including rainbow mode, stream mode, breathing mode, pure mode or turn off the lights altogether. This feature adds a touch of excitement to your gaming experience, ensuring you have more fun.     3 DPI Levels and Flexible Buttons - Three levels of DPI adjustment available: 800, 1600, and 3200, providing convenient control over cursor speed. No need to install additional drivers or software; simply plug the USB receiver into the USB port. Featuring six buttons: Left, Right, Forward, Back, DPI, and Scroll wheel.     Universal Comaptibility & Considerate Charge Cable - Compatible with 98/2000/ME/NT/XP/VISTA/7/8/10/11/MAC OS. Adaptable for Notebook, PC, laptop, Computer, Macbook and so on. With charge cable inside, you could charge your mouse at anytime even using. NOTE: the mouse cursor may move slowly, be unstable, or stop moving entirely. To ensure smooth operation, make sure to charge it promptly. Once fully charged, it will resume normal functionality.",
      "details": {
        "brand": "WolfLawS",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "USB",
        "color": "Black",
        "ram": "N/A",
        "detail_item": "Enhanced with a Lightweight Honeycomb Shell - With its innovative design featuring a lightweight honeycomb shell, this mouse provides an enhanced touch experience. The use of high-quality materials ensures its durability and eliminates any concerns about fragility. Its advanced ventilation system keeps your palm cool and refreshed, ensuring a comfortable feel and consistently excellent gaming performance even during prolonged use."
      }
    },
    {
      "id": "B0BXYV1SZQ",
      "name": "Lenovo 100 Wired USB Computer Mouse for PC, Laptop, Computer with Windows - Full-Size - Ambidextrous Design - 3 Buttons - Red Optical Sensor – Black",
      "ratings": 29.651,
      "price": "$7.99",
      "image": "https://m.media-amazon.com/images/I/51Kbg7o6awL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Slim and Comfortable Design: The Lenovo 100 Wired USB Mouse boasts a slim grip full-size mouse with an ambidextrous design, ensuring a comfortable fit in your hand, whether you're left or right-handed.     Built to Last: Rest assured about durability with the Lenovo 100 Wired USB Mouse. It's engineered for a 3 million clicks button life, delivering long-lasting performance that stands the test of time.     Reliable Wired Connection: Enjoy an easy and reliable connection to your PC via a 1.7-meter USB-A cable. No need to worry about signal drop-offs or battery replacements; this mouse is always ready for action.     Precision and Smooth Movement: The Lenovo 100 Wired USB Mouse offers precise movement with its 1000 DPI resolution and red optical sensor. Glide smoothly from window to window, ensuring accurate and efficient navigation.     Plug-and-Play Convenience: This hassle-free mouse is designed for productivity. It features a straightforward plug-and-play connection to PCs with a USB-A cable, making it a practical choice for users seeking a reliable and efficient pointing device.",
      "details": {
        "brand": "Lenovo",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "USB",
        "color": "Black 100",
        "ram": "N/A",
        "detail_item": "Slim and Comfortable Design: The Lenovo 100 Wired USB Mouse boasts a slim grip full-size mouse with an ambidextrous design, ensuring a comfortable fit in your hand, whether you're left or right-handed."
      }
    },
    {
      "id": "B07NSVMT22",
      "name": "Logitech G903 LIGHTSPEED Wireless Gaming Mouse W/ Hero 25K Sensor, PowerPlay Compatible, 140+ Hour with Rechargeable Battery and Lightsync RGB, Ambidextrous, 107G+10G optional, 25,600 DPI, Black",
      "ratings": 3.675,
      "price": "$61.91",
      "image": "https://m.media-amazon.com/images/I/61GTK3XJokL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Power play wireless charging: never worry about your battery life again. Add the power play wireless charging system to keep G903 and other compatible g mice charged while at rest and at play. Powerplay wireless charging system sold separately     Hero 25K sensor through a software update from G HUB, this upgrade is free to all players: Our most advanced, with 1:1 tracking, 400 plus ips, and 100 - 25,600 max dpi sensitivity plus zero smoothing, filtering, or acceleration     Light speed wireless: pro-grade 1 ms report rate, no cable drag, no compromises on weight or battery life; eSports professionals depend on lightspeed’s responsiveness and reliable Connectivity     140 Hour lipo battery: super-efficient system design results in almost 6x the battery life of previous Gen; lasts for up to 140 hours with light Sync RGB lighting, and up to 180 hours without",
      "details": {
        "brand": "Logitech G",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": ": LIGHTSPEED Wireless",
        "color": "Black",
        "ram": "N/A",
        "detail_item": "Power play wireless charging: never worry about your battery life again. Add the power play wireless charging system to keep G903 and other compatible g mice charged while at rest and at play. Powerplay wireless charging system sold separately"
      }
    },
    {
      "id": "B09HHHDZZG",
      "name": "Nulea M501 Wireless Trackball Mouse, Rechargeable Ergonomic, Easy Thumb Control, Precise & Smooth Tracking, 3 Device Connection (Bluetooth or USB Receiver), Compatible for PC, Laptop, Mac, Windows.",
      "ratings": 10.012,
      "price": "$29.99",
      "image": "https://m.media-amazon.com/images/I/71gIyvpxRSL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Ergonomic Design with Smooth Thumb Control: Move your cursor by the smooth trackball instead of moving your wrist and arm. Let the easy and smooth thumb control help you reduce your muscle stress. The optimal angle of the trackball mouse allows you to keep your palm in a natural position for all-day comfort.     Precise Tracking with Adjustable DPI: Nulea trackball mouse provides precise cursor movement for exceptional accuracy and control. With the smooth trackball, you can be more productive on the move on almost any surface, any workplace. Especially on the narrow space, such as the messy desktop, couch, bed, small writing board on a chair, etc.     True Wireless Freedom: Connect up to 3 devices by either bluetooth or USB dongle. Switch easily between them by the button on the bottom to improve your efficiency.[KINDLY REMINDER: The 2.4G USB receiver is stored at the bottom of the wireless trackball mouse.]     Rechargeable Battery: (For your best experience, please fully charge the bluetooth trackball mouse before your first use) The built-in rechargeable battery has a long battery life enables you to say goodbye to dry cell batteries. Please Note: 1. Please use our included charging cable to charge the wireless trackball mouse 2. Do not use a fast charger to charge the trackball mouse. (Directly use the computer USB port or a 5V charger to charge the bluetooth trackball mouse).     6 Button High Performance: Nulea trackball mouse bluetooth is designed with thoughtful ergonomic details and an elegant curved shape. Plus the back and forward button, you can operate easily with higher productivity as well as added comfort. Note: All buttons on this wireless trackball mouse are not programmable!",
      "details": {
        "brand": "Nulea",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "Bluetooth, USB",
        "color": "A-Red",
        "ram": "N/A",
        "detail_item": "Ergonomic Design with Smooth Thumb Control: Move your cursor by the smooth trackball instead of moving your wrist and arm. Let the easy and smooth thumb control help you reduce your muscle stress. The optimal angle of the trackball mouse allows you to keep your palm in a natural position for all-day comfort."
      }
    },
    {
      "id": "B07QX9C9WH",
      "name": "CORSAIR NIGHTSWORD RGB Gaming Mouse For FPS, MOBA - 18,000 DPI - 10 Programmable Buttons - Weight System - iCUE Compatible - Black",
      "ratings": 5.86,
      "price": "$78.12",
      "image": "https://m.media-amazon.com/images/I/61a0KNfNNNL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Smart Tunable Weight System: CORSAIR-exclusive software automatically detects the mouse’s center of gravity in real time, allowing you to adjust weight between 119g and 141g and fine-tune balance to perfectly fit your grip.     CORSAIR’S Most Advanced Optical Sensor Yet: A custom Pixart PMW3391 native 18,000 DPI optical sensor, adjustable in 1 DPI resolution steps, gives you total sensitivity customization and ultra-accurate tracking.     Professional Comfort: Built with a contoured shape that naturally fits your hand, with high-performance rubber grips inspired by pro sports equipment.     Ten Fully Programmable Buttons: Customize your gaming with the in-game advantage of powerful macros and key remaps.     Precise Weight Calibration: Two sets of weights and six mounting locations offer 120 different weight and balance configurations.     Ultra-Durable Omron Switches: Rated for more than 50 million clicks.",
      "details": {
        "brand": "Corsair",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "Wired",
        "color": "Blue, Black",
        "ram": "N/A",
        "detail_item": "Smart Tunable Weight System: CORSAIR-exclusive software automatically detects the mouse’s center of gravity in real time, allowing you to adjust weight between 119g and 141g and fine-tune balance to perfectly fit your grip."
      }
    },
    {
      "id": "B09TG6KG2T",
      "name": "Razer Viper Ultimate Lightweight Wireless Gaming Mouse & RGB Charging Dock: Hyperspeed Wireless Technology - 20K DPI Optical Sensor - 74g Lightweight - 70 Hr Battery - Mercury White",
      "ratings": 16.517,
      "price": "$99.99",
      "image": "https://m.media-amazon.com/images/I/618J0JFnhWL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "RAZER HYPERSPEED WIRELESS TECHNOLOGY — Brings together extreme low-latency and interference reduction for true wireless freedom     THE LIGHTEST, ZERO-COMPROMISE WIRELESS ESPORTS GAMING MOUSE AT 74G — The Razer Viper Ultimate includes a 20K DPI optical sensor befitting the most serious gamers without the need for drilled holes     OPTICAL MOUSE SWITCH — Razer optical mouse switches uses light beam-based actuation, registering button presses at the speed of light     AMBIDEXTROUS DESIGN — Created for left and right-handed users with accessible, programmable buttons on both sides     UP TO 70 HOURS OF BATTERY LIFE — Allowing non-stop gaming     #1 SELLING PC GAMING PERIPHERALS BRAND IN THE U.S. — Source — Circana, Retail Tracking Service, U.S., Dollar Sales, Gaming Designed Mice, Keyboards, and PC Headsets, Jan. 2019- Dec. 2023 combined",
      "details": {
        "brand": "Razer",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "Wireless",
        "color": "Mercury White",
        "ram": "N/A",
        "detail_item": "RAZER HYPERSPEED WIRELESS TECHNOLOGY — Brings together extreme low-latency and interference reduction for true wireless freedom"
      }
    },
    {
      "id": "B088NDL2G1",
      "name": "【Upgrade】 LED Wireless Mouse, Slim Silent Mouse 2.4G Portable Mobile Optical Office Mouse with USB & Type-c Receiver, 3 Adjustable DPI Levels for Notebook, PC, Laptop, Computer, MacBook (Black)",
      "ratings": 52.042,
      "price": "$9.99",
      "image": "https://m.media-amazon.com/images/I/61L5QT+J39L._AC_SY300_SX300_.jpg",
      "description": "【LED Design】The upgraded version mouse with the LED lights adds more fun to the boring office life. The bottom of the mouse has a switch, you can switch lights freely. Low-key or sparkle, switch in one second, suitable for any occasion.     【Rechargeable Optical Mouse】Built-in durable rechargeable battery, it can be easily charged using the included USB cable without replacing the battery. Just 2 hours charging, you can use it about 7-15 days. Standby time is very long, energy-saving features, automatic sleep mode and wake-up mode are installed to save energy. Turn off the mouse LED light when not in use to save power.     【Plug and Play】No need to install any driver, just plug the USB receiver into your laptop will the mouse start to serve. 2.4GHz wireless technology provides powerful and reliable connection, effective up to 10 meters of range. Advanced optical tracking technology with fast click and responsiveness. 3-Level adjustable DPI (800/1200/1600 DPI), freely to satisfy daily work. Equipped with USB-C to USB adapter, let you worry-free use of any device.     【Mute Click & Comfortable Hand-feeling】Silent click Mouse with classic design with anti-fingerprint finish offers your hand maximum support and comfort. Silent button reduces 90% noises, which makes it an ideal wireless mouse for office, conference room, cafe, library, bedroom, help you concentrate on your work, study without disturbing others besides you. Ultra-thin, ergonomic design, lightweight and convenient for carrying or traveling.     【Wide Compatibility】Well compatible with Windows XP, Vista, 7, 8, and 10 / Windows Vista / Windows Vista/ Windows ME etc, Fits for desktop, laptop, PC, Macbook and other devices. Please Note: If your laptop just with type-c port, You need connect the supplied USB-C to USB adapter to your laptop and plug the USB receiver in to it.",
      "details": {
        "brand": "OKIMO",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "USB",
        "color": "Black",
        "ram": "N/A",
        "detail_item": "【LED Design】The upgraded version mouse with the LED lights adds more fun to the boring office life. The bottom of the mouse has a switch, you can switch lights freely. Low-key or sparkle, switch in one second, suitable for any occasion."
      }
    },
    {
      "id": "B0B6XTDJS1",
      "name": "Razer DeathAdder V3 Wired Gaming Mouse: 59g Ultra Lightweight - Focus Pro 30K Optical Sensor - Fast Optical Switches Gen-3-8K Hz HyperPolling-6 Programmable Buttons -Ergonomic -Speedflex Cable- Black",
      "ratings": 976,
      "price": "$59.99",
      "image": "https://m.media-amazon.com/images/I/61Syl8a3uwL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "59G ULTRA-LIGHTWEIGHT DESIGN — Enjoy a level of speed and control favored by the world’s top players with one of the lightest ergonomic esports mice ever created     FOCUS PRO 30K OPTICAL SENSOR — Flawless tracking performance on a wider variety of surfaces including glass—supported by intelligent functions for enhanced aim and control     OPTICAL MOUSE SWITCHES GEN-3 — From an improved 90-million click lifecycle with zero double-clicking issues, to a blistering 0.2ms actuation with no debounce delay, the mouse has the reliability and speed built for esports     8K HZ HYPERPOLLING TECHNOLOGY — The mouse can communicate its position and clicks to your PC at up to 8000 times a second for near-zero input latency     ERGONOMIC FORM — Developed in partnership with top esports pros, the iconic shape of the Razer DeathAdder has been further improved to continue its legacy of award-winning handling and comfort     RAZER SPEEDFLEX CABLE — Woven for greater flexibility and designed to produce minimal drag allows quicker, smoother swipes for tighter mouse control     1 SELLING PC GAMING PERIPHERALS BRAND IN THE U.S. — Source: Circana, Retail Tracking Service, U.S., Dollar Sales, Gaming Designed Mice, Keyboards, and PC Headsets, Jan. 2019- Dec. 2023 combined",
      "details": {
        "brand": "Razer",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "USB",
        "color": "Black",
        "ram": "N/A",
        "detail_item": "59G ULTRA-LIGHTWEIGHT DESIGN — Enjoy a level of speed and control favored by the world’s top players with one of the lightest ergonomic esports mice ever created"
      }
    },
    {
      "id": "B097F8H1MC",
      "name": "Razer Basilisk V3 - Ergonomic Wired Gaming Mouse",
      "ratings": 9.215,
      "price": "$43.99",
      "image": "https://m.media-amazon.com/images/I/61WeAIZSmrL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "10+1 Programmable Buttons For Limitless Configurations: Assign all your macros and secondary functions across 11 programmable buttons—including its acclaimed multi-function trigger—to execute essential actions like push-to-talk, ping, and more.     Razer HyperScroll Tilt Wheel For Smooth, Free-Spin Scrolling or Tactile Cycling: Speed through content with a scroll wheel that free-spins until it’s stopped, or switch to tactile mode for more precision and satisfying feedback that’s ideal for cycling through weapons or skills.     11 Razer Chroma RGB Lighting Zones For Customizable Lighting Effects and Full Underglow: Bask in the Razer Basilisk V3’s glory as you customize each zone from over 16.8 million colors and countless lighting effects, all while it reacts dynamically with over 150 Chroma-integrated games.     Iconic Ergonomic Design with Thumb Rest For Effortless Use and Long-lasting Comfort: Favored by millions worldwide, the mouse’s signature form factor perfectly supports your hand while its buttons are optimally positioned for quick and easy access.     Razer Optical Mouse Switches Gen-2 For Unrivalled Speed and Reliability: With zero unintended misclicks you can count on these switches to provide crisp, responsive execution at a blistering 0.2ms actuation speed for up to 70 million clicks.",
      "details": {
        "brand": "Razer",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "USB",
        "color": "Black",
        "ram": "N/A",
        "detail_item": "10+1 Programmable Buttons For Limitless Configurations: Assign all your macros and secondary functions across 11 programmable buttons—including its acclaimed multi-function trigger—to execute essential actions like push-to-talk, ping, and more."
      }
    },
    {
      "id": "B0CSPJP35M",
      "name": "Lenovo Bluetooth Silent Mouse (WL300) - 5 Button Computer Mouse with Silent Left & Right Click – Sculpted Grip, Microsoft Swift Pair, Up to 1600 DPI (Grey)",
      "ratings": 279,
      "price": "$19.99",
      "image": "https://m.media-amazon.com/images/I/517+8YaZ+gL._AC_SY300_SX300_.jpg",
      "description": "Sleek and Compact: Compact and lightweight, this mouse is ideal for on-the-go professionals and is powered by a single AA battery. Its design eliminates the hassle of tangled cables, providing the freedom to work in various environments     Uncompromised Quality: Built to withstand extensive use, the left and right buttons are engineered to last up to 3 million clicks. The scroll wheel is designed to endure up to 300,000 cycles, ensuring long-lasting durability and consistent performance     Sculpted Grip Bluetooth Mouse: Experience all-day comfort with a sculpted grip that conforms to your hand's natural contours, providing ergonomic support for extended periods of use. Effortlessly pair your device with Bluetooth 5.0 and Microsoft Swift Pair technology     Smooth Navigation: Maximize your workflow with a 5-button mouse featuring left click, right click, scroll click, forward, and backward buttons, coupled with an anti-slip scroll wheel. The precise optical sensor and 3-level DPI adjustment caters to various tasks, offering 800, 1200, and 1600 DPI     Silent Efficiency: Designed to work seamlessly on different surfaces such as wood, leather, fabric, paper, and resin, the WL300 offers silent left, right, and scroll wheel buttons, allowing for efficient and quiet operation",
      "details": {
        "brand": "Lenovo",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "Bluetooth",
        "color": "WL300 Grey",
        "ram": "N/A",
        "detail_item": "Sleek and Compact: Compact and lightweight, this mouse is ideal for on-the-go professionals and is powered by a single AA battery. Its design eliminates the hassle of tangled cables, providing the freedom to work in various environments"
      }
    },
    {
      "id": "B0CSDN2136",
      "name": "SM900 Green Wired Gaming Mouse with Honeycomb Shell,12800 DPI,7 Programmable Buttons,Lightweight Gaming Mice Ergonomic Computer Mouse Gaming for Windows/PC/Mac/Laptop Gamer",
      "ratings": 440,
      "price": "$14.99",
      "image": "https://m.media-amazon.com/images/I/61e-WA4G18L.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "6 Levels Adjustable DPI:SM900 is a powerful gaming mouse with excellent performance,It supports 6 levels adjustment DPI up to 12800.Rolling Rate max to 1000Hz,According user's preference setup different DPI and Rolling Rate suitable for games, office and many occasions     4 Mode Switch:SM900 gaming wired mouse supports 4 modes switch, default 1 office mode and 3 gaming modes.Gaming modes need setup by macro software, according to the user's gaming preferences setup different button functions     Support Custom and Macro Program:SM900 lightweight gaming mouse supports macro settings, user can reset the mouse buttons, DPI,modes, lighting effects.Customize personalized gaming mouse according to user preferences.This mouse is widely supported Windows 7,8,10,XP,,VISTA,MAC OS, etc, The USB interface is plug and play     3 Sided Honeycomb Shell design:More breathable, more sweat-absorbent and more comfortable!!!The gaming mouse is made of high quality ABS material and designed with ergonomic hollow perforated housing, Ergonomic Design reduce the weight and make the mouse more flexible and easier to be used for a long time without fatigue, and also enhance the heat dissipation features, very comfortable to use     14 RGB Rainbow Backlight:SM900 pc gaming mice has adjustable RGB lights that can be set to different effects according to user preferences. The brilliant lighting effects provide illumination in dark environments also increases the fun of using",
      "details": {
        "brand": "SOLAKAKA",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "USB",
        "color": "Green",
        "ram": "N/A",
        "detail_item": "6 Levels Adjustable DPI:SM900 is a powerful gaming mouse with excellent performance,It supports 6 levels adjustment DPI up to 12800.Rolling Rate max to 1000Hz,According user's preference setup different DPI and Rolling Rate suitable for games, office and many occasions"
      }
    },
    {
      "id": "B0CPLNPV6F",
      "name": "SM66 White Silent Dual Mode 2.4GHz Wireless Mouse, Adjustable 4800 DPI,Rechargeable Computer Mouse Wireless Office Mouse for PC Mac Laptop, Desktop",
      "ratings": 272,
      "price": "$16.89",
      "image": "https://m.media-amazon.com/images/I/51Udo0fWghL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "2.4G Wireless Dual-Mode:The SOLAKAKA SM66 wireless mouse is perfect for multi-functional use,support 2 mode BT and 2.4GHz wireless connection,3 devices save. supports connection for your Laptop,PC,Computer,Xbox,iPad,Mobile Phone.compatible with multiple systems including Windows,OS,Android,IOS,etc     Ergonomic Design, 5 DPI Adjustable:This Slim Ergonomic shape wireless mouse is designed with an asymmetrical and streamlined shell, offering a comfortable claw-grip using experience for right,left and medium,small hand, long-term use without fatigue. 5 DPI levels 4800,2400,1600,1200,800,user can press the DPI button at the bottom of the mouse. Easier and smoother. The ultra-thin design is mini and lightweight, perfect for traveling carry, and can be easily put into laptop bag, ultra-space saving     Silent Buttons:SM66 wireless mouse adopts a silent button design, which reduces 99% of button noise. It is very suitable for public places such as libraries and offices. It is the best choice for people who like quiet     PORTABLE and 10M LONG WORKING DISTANCE:2.4G Nano USB receiver is embedded in the computer mouse bottom for convenient portability. It is great as a travel mouse for a laptop. The remote mouse for laptop works great with the SOLAKAKA mouse combo and computer keyboard and mice accessories. The 10m,32ft long working distance ensures you can enjoy high-precision optical sensor performance on various surfaces     Rechargeable and Long Battery Life:With the built-in 500mAh rechargeable Lithiumion battery, you can charge the magic cute mouse by using the Type-C charger cable included. Using while charging is available. In addition, the rechargeable mouse uses smart power-saving technology, the great battery will enter sleep mode after 3 minutes of no-operation to save power and provide long time usage. You can wake it up by clicking any button     Friendly Tip: SM66 has a smart sleep mode, when it is not used for a few minutes, it will enter the power saving state, please move the mouse to wake it up!",
      "details": {
        "brand": "SOLAKAKA",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "Bluetooth",
        "color": "white",
        "ram": "N/A",
        "detail_item": "2.4G Wireless Dual-Mode:The SOLAKAKA SM66 wireless mouse is perfect for multi-functional use,support 2 mode BT and 2.4GHz wireless connection,3 devices save. supports connection for your Laptop,PC,Computer,Xbox,iPad,Mobile Phone.compatible with multiple systems including Windows,OS,Android,IOS,etc"
      }
    },
    {
      "id": "B0C97CF6K2",
      "name": "Cute Bluetooth Mouse, 2.4 GHz Wireless Mice with USB Receiver for Laptop, iPad, Mac, Silent Cartoon Mouse Suitable for Children and Students (Kerry Bear)",
      "ratings": 376,
      "price": "$14.99",
      "image": "https://m.media-amazon.com/images/I/61kL1e5zG-L.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "❤ [Cute Wireless Mouse] - Our wireless mouse has a variety of cute cartoon pattern designs, suitable for young people and children.     ❤ [Dual Mode Mouse] - Bluetooth & 2.4G dual mode wireless mouse connection switch easily. Bluetooth wireless brings quick response, precise movement, stable connection & smoother tracking. 2.4G wireless transmission provide stable and reliable connection.     ❤ [Silent Wireless Mouse] - Special design, noiseless click sound when pressing buttons, which let you not worry about the mouse sound can disturbing others, especially at library or office.     ❤ [Durable Mouse] - Intelligent power saving, the mouse will automatically be in sleeping mode after 10 minutes inactivity, you can click any button to wake it up. Only 1 piece AA battery is required for power supply (not included in the package).     ❤ [Universal Compatibility Mouse] - FMOUSE M101 Mouse, with wireless receiver and Bluetooth inside, connect the mouse easily to your MacBook, iPad, Laptop or any Desktop devices, Mouse wireless well compatible with Windows, MacOS, iPadOS & Android.",
      "details": {
        "brand": "FMOUSE",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "Wireless, Bluetooth, USB",
        "color": "Kerry Bear",
        "ram": "N/A",
        "detail_item": "❤ [Cute Wireless Mouse] - Our wireless mouse has a variety of cute cartoon pattern designs, suitable for young people and children."
      }
    },
    {
      "id": "B07BFCVJZC",
      "name": "Lekvey Ergonomic Mouse, Vertical Wireless Mouse - Rechargeable 2.4GHz Optical Vertical Mice : 3 Adjustable DPI 800/1200/1600 Levels 6 Buttons, for Laptop, PC, Computer, Desktop, Notebook etc, Black",
      "ratings": 14.211,
      "price": "$19.99",
      "image": "https://m.media-amazon.com/images/I/61BST1dClmL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Ergonomic, Sleek and Rechargeable Design: Scientific ergonomic design encourages healthy neutral \" handshake \" wrist and arm positions for smoother movement and less overall strain     Multifunction and Convenient: Advanced \" Page Back \" and \" Page Forward \" functionality buttons provide convenience when web page browsing. 800 /1200/1600 DPI Levels -- Easily adjusts the sensitivity of the mouse     High-Capacity Rechargeable Battery: Built-in rechargeable battery. You no longer need to buy batteries, very convenient !! Easy To Use -- One nano USB receiver at the bottom of the mouse, Just Plug and Play     Widely Compatible: Widely compatible with Windows 2000 / XP / Vista / 7 / 8 / 10 / Linux. ** Note: Not compatible with Mac OS, Apple Products. ** Once you get used to the ergonomic mouse, you will love it so much     Lekvey Wireless Ergonomic Mouse: Revolutionize your work experience! Are you tired of using traditional mice that strain your wrist? Say goodbye to discomfort and hello to the Lekvey wireless carpal tunnel mouse! Designed with your ergonomic needs in mind, this innovative vertical ergonomic mouse offers a whole different level of comfort and efficiency",
      "details": {
        "brand": "Lekvey",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "Wireless, 2.4 GHz USB",
        "color": "Black",
        "ram": "N/A",
        "detail_item": "Ergonomic, Sleek and Rechargeable Design: Scientific ergonomic design encourages healthy neutral \" handshake \" wrist and arm positions for smoother movement and less overall strain"
      }
    },
    {
      "id": "B0CKN2NSYL",
      "name": "Redragon Wireless Gaming Mouse, MMO Gaming Mouse UP 16,000 DPI, 16 Macro Programmable Buttons, RGB Rechargeable Gaming Mouse with 12 Side Buttons, 70Hrs for PC Laptop MOBA FPS, M901P-KS",
      "ratings": 9.265,
      "price": "$35.99",
      "image": "https://m.media-amazon.com/images/I/61744B20AbL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "【High-performance Gaming Mouse】UP 16000 DPI provides high sensitivity and smoothing movements. Adjustable DPI(100-16000) and Polling Rate(125Hz-1000Hz) ensure this professional gaming mouse is suitable for gaming or daily work. Attached the 40G Acceleration gives you a greater edge over your competition     【Real Customizable】You can remap the 16 buttons through macro editing to meet your usage habits under different conditions. Equipped with 5 Memory Profiles to save your settings, and 2 working modes that can be switched with one click. Redragon MMO Mouse is customizable for Any Scenario, always be one step ahead of others     【Wireless & Rechargeable】Wireless Gaming Mouse gets rid of cable limits, making every move freer and smoother. The 1000mAh build-in battery ensures over 70Hrs(RGB OFF) standby time and can be used during wired charging, keeping the mouse always online     【Real RGB Gaming Mouse】16.8million color combinations bring an immersive gaming experience. 4 Lighting Modes can be easily switched to feed different gaming, and you also can adjust mouse lighting according to your preference using the software(download on redragonzone)     【Unique & Comfort Design】Ergonomic Design with Skin-friendly material, long gaming without fatigue or pain. The 12 side buttons can be remapped through macro editing, making keyboard combination functions realized through button clicks, allowing you to win efficiently in any game scenario",
      "details": {
        "brand": "Redragon",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "🅽🅴🆆 🅡🅔🅛🅔🅐🅢🅔",
        "color": "black",
        "ram": "N/A",
        "detail_item": "【High-performance Gaming Mouse】UP 16000 DPI provides high sensitivity and smoothing movements. Adjustable DPI(100-16000) and Polling Rate(125Hz-1000Hz) ensure this professional gaming mouse is suitable for gaming or daily work. Attached the 40G Acceleration gives you a greater edge over your competition"
      }
    },
    {
      "id": "B011HMDZ0Q",
      "name": "Redragon M602 RGB Wired Gaming Mouse RGB Spectrum Backlit Ergonomic Mouse Griffin Programmable with 8 Backlight Modes, Up to 7200 DPI for Windows PC Gamers (Black)",
      "ratings": 31.116,
      "price": "$19.99",
      "image": "https://m.media-amazon.com/images/I/6177U5fDSwL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "* WIRED GAMING MOUSE; built for Gaming Computers - Ergonomic Redragon M602-RGB “Griffin” RGB Backlit Gaming PC Mouse up to 7200 DPI (user adjustable 800/1200/1600/2400/7200 DPI), 10G acceleration. The High-Precision Sensor delivers Pinpoint Accuracy while the Gaming Grade Micro Switches ensure longevity, greater durability and extreme responsiveness, giving you an even greater edge over your competition     * RGB BACKLIT PROGRAMMABLE PC GAMING MOUSE; 8 programmable buttons, 5 Memory Profiles each with distinct LED color option for quick identification. 8 different backlight modes. (Backlight can be disabled) The Redragon M602-RGB Gaming Mouse offers you total personalization for your Gaming Computer and Gaming Laptop     * ERGONOMIC GAMER MOUSE; Delivering an extremely comfortable and precise experience for Computer Games such as Fortnite Games, SIMS 4, Fallout 4, World of Warcraft, PUGB, Overwatch, Call of Duty or other First-Person Shooter. The ergonomic shape of the Redragon M602-RGB PC Gaming Mouse is built for comfort, fits naturally in your hand, the buttons are tuned to reduce click fatigue     * HIGH-END PC GAMING MOUSE FEATURES; The Redragon M602-RGB Mouse features; Weight Tuning, Anti-Skid Scroll Wheel, Durable smooth TEFLON feet pads for ultimate gaming control. 7 programmable buttons. Total 8 buttons. The Mouse works great with Redragon Gaming Mousepads & Keyboards. Comes with 6 foot, 3mm strong high-speed braided fiber cable and a gold-plated corrosion free USB connector for a reliable connection     * PC GAMING MOUSE COMPATIBILITY: Windows 10, Windows 8, Windows 7, Windows Vista, or Windows XP, Limited Mac OS support Works well with all major Gaming Computers Brands and Gaming Laptops MSI, Dell, Corsair, Alienware, Razer, Xbox One, Asus and others",
      "details": {
        "brand": "Redragon",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "USB",
        "color": "Black",
        "ram": "N/A",
        "detail_item": "* WIRED GAMING MOUSE; built for Gaming Computers - Ergonomic Redragon M602-RGB “Griffin” RGB Backlit Gaming PC Mouse up to 7200 DPI (user adjustable 800/1200/1600/2400/7200 DPI), 10G acceleration. The High-Precision Sensor delivers Pinpoint Accuracy while the Gaming Grade Micro Switches ensure longevity, greater durability and extreme responsiveness, giving you an even greater edge over your competition"
      }
    },
    {
      "id": "B0CPSPN896",
      "name": "Logitech Signature M550 Wireless Mouse - For Small to Medium Sized Hands, 2-Year Battery, Silent Clicks, Bluetooth, Multi-Device Compatibility - Rose",
      "ratings": 1.156,
      "price": "$24.30",
      "image": "https://m.media-amazon.com/images/I/61C6G7urgOL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Scroll smarter: With Logitech Signature M550 Wireless Mouse you get line-by-line precision for documents and super-fast scrolling for long web pages; simply switch modes with a flick of the SmartWheel     The optimal fit for your hand: This comfortable full size mouse is designed for larger hands, for the optimal fit     Upgrade your comfort: This work mouse provides long hours of comfort thanks to a contoured shape, soft thumb area, and rubber side grips that keep your hand snug and in place     Connect the way you like: Connect this cordless computer mouse in an instant via Bluetooth Low Energy or Logi Bolt USB receiver     Less noise, more focus: Whether working at the office or at home, Logitech Signature M550 is a quiet mouse, allowing you to enjoy 90 percent less click noise with SilentTouch technology*     24 month battery life: Work for up to 2 years on the single AA battery that comes with your multi-device mouse**     Works on multiple platforms: Experience seamless compatibility with Windows, macOS, Linux, ChromeOS, ipadOS, and Android operating systems with Logitech Signature 550 wireless Bluetooth mouse     Plastic parts in Signature M550 include certified post-consumer recycled plastic (Black: 65%****)",
      "details": {
        "brand": "Logitech",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "Bluetooth, USB",
        "color": "Rose",
        "ram": "N/A",
        "detail_item": "Scroll smarter: With Logitech Signature M550 Wireless Mouse you get line-by-line precision for documents and super-fast scrolling for long web pages; simply switch modes with a flick of the SmartWheel"
      }
    },
    {
      "id": "B088NDL2G1",
      "name": "【Upgrade】 LED Wireless Mouse, Slim Silent Mouse 2.4G Portable Mobile Optical Office Mouse with USB & Type-c Receiver, 3 Adjustable DPI Levels for Notebook, PC, Laptop, Computer, MacBook (Black)",
      "ratings": 52.042,
      "price": "$9.99",
      "image": "https://m.media-amazon.com/images/I/61L5QT+J39L._AC_SY300_SX300_.jpg",
      "description": "【LED Design】The upgraded version mouse with the LED lights adds more fun to the boring office life. The bottom of the mouse has a switch, you can switch lights freely. Low-key or sparkle, switch in one second, suitable for any occasion.     【Rechargeable Optical Mouse】Built-in durable rechargeable battery, it can be easily charged using the included USB cable without replacing the battery. Just 2 hours charging, you can use it about 7-15 days. Standby time is very long, energy-saving features, automatic sleep mode and wake-up mode are installed to save energy. Turn off the mouse LED light when not in use to save power.     【Plug and Play】No need to install any driver, just plug the USB receiver into your laptop will the mouse start to serve. 2.4GHz wireless technology provides powerful and reliable connection, effective up to 10 meters of range. Advanced optical tracking technology with fast click and responsiveness. 3-Level adjustable DPI (800/1200/1600 DPI), freely to satisfy daily work. Equipped with USB-C to USB adapter, let you worry-free use of any device.     【Mute Click & Comfortable Hand-feeling】Silent click Mouse with classic design with anti-fingerprint finish offers your hand maximum support and comfort. Silent button reduces 90% noises, which makes it an ideal wireless mouse for office, conference room, cafe, library, bedroom, help you concentrate on your work, study without disturbing others besides you. Ultra-thin, ergonomic design, lightweight and convenient for carrying or traveling.     【Wide Compatibility】Well compatible with Windows XP, Vista, 7, 8, and 10 / Windows Vista / Windows Vista/ Windows ME etc, Fits for desktop, laptop, PC, Macbook and other devices. Please Note: If your laptop just with type-c port, You need connect the supplied USB-C to USB adapter to your laptop and plug the USB receiver in to it.",
      "details": {
        "brand": "OKIMO",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "USB",
        "color": "Black",
        "ram": "N/A",
        "detail_item": "【LED Design】The upgraded version mouse with the LED lights adds more fun to the boring office life. The bottom of the mouse has a switch, you can switch lights freely. Low-key or sparkle, switch in one second, suitable for any occasion."
      }
    },
    {
      "id": "B07QX9C9WH",
      "name": "CORSAIR NIGHTSWORD RGB Gaming Mouse For FPS, MOBA - 18,000 DPI - 10 Programmable Buttons - Weight System - iCUE Compatible - Black",
      "ratings": 5.86,
      "price": "$78.12",
      "image": "https://m.media-amazon.com/images/I/61a0KNfNNNL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Smart Tunable Weight System: CORSAIR-exclusive software automatically detects the mouse’s center of gravity in real time, allowing you to adjust weight between 119g and 141g and fine-tune balance to perfectly fit your grip.     CORSAIR’S Most Advanced Optical Sensor Yet: A custom Pixart PMW3391 native 18,000 DPI optical sensor, adjustable in 1 DPI resolution steps, gives you total sensitivity customization and ultra-accurate tracking.     Professional Comfort: Built with a contoured shape that naturally fits your hand, with high-performance rubber grips inspired by pro sports equipment.     Ten Fully Programmable Buttons: Customize your gaming with the in-game advantage of powerful macros and key remaps.     Precise Weight Calibration: Two sets of weights and six mounting locations offer 120 different weight and balance configurations.     Ultra-Durable Omron Switches: Rated for more than 50 million clicks.",
      "details": {
        "brand": "Corsair",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "Wired",
        "color": "Blue, Black",
        "ram": "N/A",
        "detail_item": "Smart Tunable Weight System: CORSAIR-exclusive software automatically detects the mouse’s center of gravity in real time, allowing you to adjust weight between 119g and 141g and fine-tune balance to perfectly fit your grip."
      }
    },
    {
      "id": "B07F816PH9",
      "name": "Razer Mamba Elite Wired Gaming Mouse: 16,000 DPI Optical Sensor - Chroma RGB Lighting - 9 Programmable Buttons - Mechanical Switches",
      "ratings": 20.723,
      "price": "$57.00",
      "image": "https://m.media-amazon.com/images/I/61YTpIudkeL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Connectivity Technology: Usb",
      "details": {
        "brand": "Razer",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "USB",
        "color": "Classic Black",
        "ram": "N/A",
        "detail_item": "Connectivity Technology: Usb"
      }
    },
    {
      "id": "B09GK3LTVC",
      "name": "Razer DeathAdder V2 X HyperSpeed: Award-Winning Ergonomic Design - Ultra-Fast Wireless - 235hr Battery Life - 7 Programmable Buttons - Gen 2 Mechanical Switches - 5G 14K DPI Optical Sensor",
      "ratings": 18.334,
      "price": "$59.99",
      "image": "https://m.media-amazon.com/images/I/31Y0XT5G62L.__AC_SY300_SX300_QL70_FMwebp_.jpg",
      "description": "Award-Winning Ergonomic Design: Trusted by over 13 million fans worldwide, the DeathAdder’s iconic shape has provided wins for countless pros more than any other mouse—including the three-time League of Legends world champ, Faker     Ultra-Fast Razer HyperSpeed Wireless: Featuring the same high-speed Razer HyperSpeed Wireless technology used in our top-tier gaming mice with an ultra-low latency wireless connection     Long Battery Life: With up to 235 hours of seamless low-latency gaming with Razer HyperSpeed Wireless (2.4GHz), and up to 615 hours with Bluetooth, the mouse can go for ages before its battery needs replacing     Razer Mechanical Mouse Switches Gen-2: Experience crisp and consistent execution with switches that have new gold-plated contact points, are less prone to degrading, and have a longer lifespan of up to 60 million clicks     Razer 5G Advanced 14K DPI Optical Sensor: Enjoy responsive, pixel-precise aim with an improved sensor that flawlessly tracks your movement with zero spinouts     7 Programmable Buttons: Have all the control you need with 2 unique quick-access edge buttons and 2 side buttons     Weight Balanced: Batteries are seated at an angle in the mouse to provide optimal weight distribution",
      "details": {
        "brand": "Razer",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "Bluetooth",
        "color": "Classic Black",
        "ram": "N/A",
        "detail_item": "Award-Winning Ergonomic Design: Trusted by over 13 million fans worldwide, the DeathAdder’s iconic shape has provided wins for countless pros more than any other mouse—including the three-time League of Legends world champ, Faker"
      }
    },
    {
      "id": "B0CNBXKWC4",
      "name": "Leather Button RGB Wireless Mouse,Laptop Mouse,Slim Silent Mouse Rechargeable,USB C Mouse with USB/Type-C 2-in-1 Receiver,Computer Mouse for Notebook,MacBook(M1/M2),PC,iPad,etc-White",
      "ratings": 1.036,
      "price": "$10.99",
      "image": "https://m.media-amazon.com/images/I/510T0th6qQL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Leather Button ＆ Silent click: Leather buttons click softly, no fatigue for long time use,leather more skin-friendly than other wireless mice.Noiseless mouse,reduced knocking sound by 90％,fewer distractions allow you to concentrate more on your work or studies.     Slim Portable Mouse ＆ Ergonomic: Silm Portable design makes it easy to slip in your bag for traveling.Ergonomic mouse,the perfect arc,good grip.Overall, it's a comfortable mouse!The mouse with side buttons:Forward, backward.     LED Glowing Mouse ＆ DPI adjust :Unlike other computer mice, this RGB mouse with13 different colorful lights,with a fun atmosphere in use.Click the DPI(1200/1600/2400) button to adjust the mouse cursor speed.【Pls Note:press and hold DPI button for 3 seconds Switching light colours】     Rechargeable mouse ＆ Energy Saving: Built-in 500mAh rechargeable battery with Type-c port for fast charging and have long battery life.Mouse enters sleep mode after 5 mins of inactivity,You need to click or move the mouse to activate.With Battery level indication，Know how much battery power is left at all times.     Easy to use ＆ Wide application: Plug and play,With 2 in 1 receiver, Insert the receiver into the USB or Type-C interface of the computer(device).Then turn on the mouse power switch within a distance of less than 30 cm from the mouse receiver(move the switch to the on).Fits Notebook, Chromebook,Macbook,iPad, iPad Pro, HuaWei Phone, MacBook pro, MacBook Air, PC, Laptop, Computer,Tablet, smart TV and more. Well compatible with Windows ,Android, Harmony,Mac OS X 10.4, PS4, PS5, Xbox, etc.",
      "details": {
        "brand": "DANCESOUL",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "2.4GHz, USB",
        "color": "White",
        "ram": "N/A",
        "detail_item": "Leather Button ＆ Silent click: Leather buttons click softly, no fatigue for long time use,leather more skin-friendly than other wireless mice.Noiseless mouse,reduced knocking sound by 90％,fewer distractions allow you to concentrate more on your work or studies."
      }
    },
    {
      "id": "B0CSDP755C",
      "name": "SM600 Honeycomb Shell Gaming Mouse Wireless,8000 DPI Tri-Modes BT5.1/2.4G Wireless/Type-C Wired Gamer Mouse with 2 Side Buttons, Macro Programmable and RGB Light for PC/Mac/Laptop,Green",
      "ratings": 1.256,
      "price": "$29.89",
      "image": "https://m.media-amazon.com/images/I/61DboHuc4+L._AC_SY300_SX300_.jpg",
      "description": "3 Mode connection:M600 PRO wireless gaming mouse adopts tri-mode connection,2.4G wireless,2 BT5.1,Type-C Wired connection.Users can save 4 devices same time,support PC,laptop,tablet,mobile phone,etc. Switch convenientand connection quick     Customized and Macro Proqram:SM600 gaming mouse with 7 programmable buttons. Users through the software to set the mouse buttons,DPl,mode,lighting effects,etc.SM600 Custom mouse greatly meets the DIY needs of game enthusiasts     Adjustable DPI and Rechargeable Battery:SM600 wireless mouse can be adjusted within 6 levels dpi(8000-4000-2400-1600-1200-800).Rate of return up to 1000Hz,even in intense games,achieve zero latency and no frame skipping. Built-in 600 mA lithium battery,with USB-C charqing cable,Low battery indicator will remind user to charge it with flashing redlight.it also supported recharged while charging     Lightweight and Honeycomb Shell:SM600 honeycomb mouse made of high quality.ABS material and designed with ergonomic hollow shell,Ergonomic Design reduce the weight and make the mouse more flexible and easier to be used for a long time without fatigue,and also enhance the heat dissipation features very comfortable to use.     14 RGB Rainbow Backlight:SM600 has beautiful RGB rainbow backlight.This wireless mouse is equipped with RGB lighting effects. Press the top button to switch light modes(rainbow light,Monochrome light,light off). Very cool lights especially when useing in the dark.",
      "details": {
        "brand": "SOLAKAKA",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "Bluetooth",
        "color": "green",
        "ram": "N/A",
        "detail_item": "3 Mode connection:M600 PRO wireless gaming mouse adopts tri-mode connection,2.4G wireless,2 BT5.1,Type-C Wired connection.Users can save 4 devices same time,support PC,laptop,tablet,mobile phone,etc. Switch convenientand connection quick"
      }
    },
    {
      "id": "B07NSSPV9S",
      "name": "Logitech G703 Lightspeed Wireless Gaming Mouse W/Hero 25K Sensor, PowerPlay Compatible, Lightsync RGB, Lightweight 95G+10G Optional, 100-25, 600 DPI, Rubber Side Grips - Black",
      "ratings": 7.103,
      "price": "$29.99",
      "image": "https://m.media-amazon.com/images/I/61-jAartdjL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Best Selling Wireless Gaming Gear Brand - Based on independent sales data (Oct ‘18 - Oct’19) of Wireless Gaming Keyboard, Mice, and PC Headset in units from: US, CA, CN, JP, KR, TW, TH, IN, DE, FR, RY, UK, SE, TR     Power play wireless charging: never worry about your battery life again. Add the power play wireless charging system to keep G703 and other compatible g mice charged while at rest and at play. . .power play wireless charging system sold separately     Hero 25K sensor through a software update from G HUB, this upgrade is free to all players: our most advanced, with 1: 1 tracking, 400 plus IPS, and 100-25, 600 max DPI sensitivity — Plus zero smoothing, filtering, or acceleration, and 10x power efficiency of previous Gen     Light speed wireless: pro-level responsiveness and connectivity for long lasting, high performance game play — with a weight of 95 g and battery life for up to 35 hours of continuous play with default light Sync RGB lighting.     Supreme comfort and quality: brings together comfort, durability, and performance with comfortable design, rubber side grips, 10 g optional weight, and 6 programmable buttons for a customizable gaming experience.     Advanced button technology: metal-spring button Tensioning keeps primary left and right buttons poised to trigger with less force, for exceptional button feel, response, and consistency every time     Note : In case of Wireless mouse, the USB receiver will be provided inside or along with the mouse     Dual-injected rubber side grips",
      "details": {
        "brand": "Logitech G",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "Bluetooth",
        "color": "Black",
        "ram": "N/A",
        "detail_item": "Best Selling Wireless Gaming Gear Brand - Based on independent sales data (Oct ‘18 - Oct’19) of Wireless Gaming Keyboard, Mice, and PC Headset in units from: US, CA, CN, JP, KR, TW, TH, IN, DE, FR, RY, UK, SE, TR"
      }
    },
    {
      "id": "B0D2JGKRMM",
      "name": "Lenovo Yoga Pro Mouse - Tidal Teal",
      "ratings": 823,
      "price": "$36.99",
      "image": "https://m.media-amazon.com/images/I/51gSq4gwZmL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Ergonomic Design: The Yoga Pro is a full-sized mouse with perfect symmetry, a comfortable grip with soft material on the sides, and thumb rest placement that delivers an experience tuned for comfort and balance     Dynamic Performance: This computer mouse invites fluidity and dynamic performance into your workflow. With programmable side and top buttons, silent left and right buttons, and a configurable scroll wheel, it delivers true adaptability     Multi-Surface Tracking: Our blue optical sensor enables precision on almost any surface, promoting enduring focus. And with on-the-fly DPI (three stages) and adjustable via software up to 4000, you can further tailor your Yoga Pro to meet your changing needs     Rechargeable Bluetooth Mouse: Harness the energy of a long-lasting rechargeable battery and dual-device Bluetooth 5.1 pairing for seamless transitions. With less than a 2-hour charge for full battery, your mouse will last 2-3 months before needing its next power up     Connectivity Type: Bluetooth Low Energy / Bluetooth 5. Bluetooth Dual-Host Quick Pairing & Swift Pair. Multi-device switch and connect with the bottom pairing button. One-year long-term warranty",
      "details": {
        "brand": "Lenovo",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "Bluetooth",
        "color": "Tidal Teal",
        "ram": "N/A",
        "detail_item": "Ergonomic Design: The Yoga Pro is a full-sized mouse with perfect symmetry, a comfortable grip with soft material on the sides, and thumb rest placement that delivers an experience tuned for comfort and balance"
      }
    },
    {
      "id": "B08SHCKVTG",
      "name": "Corsair Katar Pro XT Ultra-Light Gaming Mouse- 18k DPI PixArt Optical Sensor- RGB Scroll Wheel Lighting- 6 Programmable Buttons- Lightweight Paracord Cable,Black",
      "ratings": 959,
      "price": "$34.99",
      "image": "https://m.media-amazon.com/images/I/51xGoYAgAqL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Weighing just 73g, the KATAR PRO XT is extremely light and agile for hours of fast-paced FPS or MOBA gameplay.     The KATAR PRO XT’s compact, symmetric shape makes it great for claw and fingertip grip styles.     An 18,000 DPI optical sensor from PixArt, customizable in 1 DPI steps, offers the precision and high-accuracy tracking you need for victory.     CORSAIR QUICKSTRIKE buttons use a spring-loaded design, delivering zero gap between the left and right click buttons and their switches, so your clicks, shots, and spells are faster than ever.     A lightweight paracord cable reduces drag, enabling faster, tighter, and more precise mouse movements.",
      "details": {
        "brand": "Corsair",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "Wired",
        "color": "Black",
        "ram": "N/A",
        "detail_item": "Weighing just 73g, the KATAR PRO XT is extremely light and agile for hours of fast-paced FPS or MOBA gameplay."
      }
    },
    {
      "id": "B07HCXFQ8P",
      "name": "SteelSeries Rival 650 Quantum Wireless Gaming Mouse - Rapid Charging, 12,000 Cpi Dual Sensor, 256 Weight Configs, 8 Zone RGB Lighting",
      "ratings": 2.168,
      "price": "$63.99",
      "image": "https://m.media-amazon.com/images/I/71ZtSH66n4L.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Quantum Wireless technology allows accurate, reliable lag free performance on par with SteelSeries' top tier wired mice, while allowing you to remain untethered     24 plus hour battery life on a full charge or 10 hours from 15 minute rapid charge     SteelSeries' most advanced optical sensor, TrueMove3 plus, provides true 1 to 1 tracking, while a secondary depth sensor adjusts the lift off distance to control movement with esports precision and accuracy     Personalize with 256 unique center of gravity weight tuning configurations to fit your preferences     Ultra durable gaming switches guaranteed for 60 million clicks. Lift off distance-customizable, 0.5–2 millimeter",
      "details": {
        "brand": "SteelSeries",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "Wireless",
        "color": "Black",
        "ram": "N/A",
        "detail_item": "Quantum Wireless technology allows accurate, reliable lag free performance on par with SteelSeries' top tier wired mice, while allowing you to remain untethered"
      }
    },
    {
      "id": "B0BGJT87N2",
      "name": "Razer Naga V2 HyperSpeed Wireless MMO Gaming Mouse: 19 Programmable Buttons - HyperScroll Technology - Focus Pro 30K Optical Sensor - Mechanical Mouse Switches Gen-2 - Up to 400 Hr Battery Life",
      "ratings": 862,
      "price": "$78.99",
      "image": "https://m.media-amazon.com/images/I/61YULkQowXL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "19 PROGRAMMABLE BUTTONS — Armed with ergonomically positioned buttons that provide an arsenal of commands at the fingertips for mapping out the essentials or going all out with advanced macros     RAZER HYPERSPEED WIRELESS (2.4 GHZ) AND BLUETOOTH — Unleash seamless, low-latency performance that's 25% faster than other wireless tech or switch to Bluetooth for longer hours of gaming     POWERED BY RAZER HYPERSCROLL TECHNOLOGY — Perform repeated commands rapidly or blaze through content in free-spin mode, or activate tactile mode for enhanced precision and satisfying feedback     LONG BATTERY LIFE — With up to 400 hours on Bluetooth and 250 hours of seamless low-latency gaming on Razer HyperSpeed Wireless (2.4GHz), last longer in the heat of battle with this mouse before having to replace its battery     FOCUS PRO 30K OPTICAL SENSOR — Razer’s brand-new sensor provides flawless tracking performance on a wider variety of surfaces including glass —supported by intelligent functions for enhanced aim and control     MECHANICAL MOUSE SWITCHES GEN 2 — With gold-plated contact points, the switches are less prone to degrading and have a longer lifespan of up to 60 million clicks     #1 SELLING PC GAMING PERIPHERALS BRAND IN THE U.S. — Source — Circana, Retail Tracking Service, U.S., Dollar Sales, Gaming Designed Mice, Keyboards, and PC Headsets, Jan. 2019- Dec. 2023 combined",
      "details": {
        "brand": "Razer",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "Bluetooth, USB",
        "color": "Black",
        "ram": "N/A",
        "detail_item": "19 PROGRAMMABLE BUTTONS — Armed with ergonomically positioned buttons that provide an arsenal of commands at the fingertips for mapping out the essentials or going all out with advanced macros"
      }
    },
    {
      "id": "B0CB7W6W7B",
      "name": "Wireless Bluetooth Mouse Rechargeable Laptop Mouse with LED Use Portable(BT5.2 and USB 2.4G) Dual Mode Connection Silent Slim Computer Mouse for Laptop/iPad Tablet/Apple MacBook/PC (Black)",
      "ratings": 1.393,
      "price": "$6.48",
      "image": "https://m.media-amazon.com/images/I/61djDHY5BnL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "【Rechargeable Optical Mouse/Energy Saving】:Computer Mouse Built-in Durable Lithium Ion Rechargeable Battery,High Cycle Life,No Need Change Battery;Laptop Mouse Wireless Can Be Easily Charged Using the Included USB Cable,Just 2 Hours Charging,Mouse Wireless Can Use Than 5 Days of Working Time and 30 Days of Standby Time,Standby Time is Very Long;Tablet Mouse Will Fall Asleep After 5 Minutes No-Operation to Save Power and Provides Long Term Usage;You Can Wake ipad Mouse Up By Clicking any Button     【LED Colorful Breathing Light】:This Wireless Mice With 7 Different Colorful LED Breathing Lights,7 Different Color Changes Randomly While in Use,Offering Soothing Lighting;Creating Cool and Fancy Atmosphere for Office and Gaming,LED Mouse Can Give You More Fun During     【Wireless Bluetooth Mouse Dual Mode】:Mouses(BT5.2/3.0 and 2.4 G)Dual Mode Realize the Free Switching of One Wireless Bluetooth Mice Between Two Devices;Bluetooth Mouse Mode Can Connect One Device Through BT5.2/3.0 and Wireless Mouse Mode Another Device Through a 2.4G USB Receiver,No Need to Install any Driver,Plug and Play;Wireless/Bluetooth Technology Provides Powerful and Reliable Connection,Which Can Enables Fast Data Transmission Without Delays or Dropouts,Effective Up to 10 Meters（33 feet）of Range     【Silent/Fingerprint-proof】:Silent Laptop Mice Button Silent Click Design Reduces 90% Noises,Help You Concentrate on Your Work、Study Without Disturbing Others Besides You;Apple Mouse Fingerprint-proof Surface Coating Technology Design Gives Your a Skin-Like Touch,The sturdy anti-slip rubber scroll wheel ensures that your hand will not slip when scrolling;Slim Mouse Offers Your Hand Maximum Support and Comfort     【Wide Compatibility Wireless Mouse】:Wireless Bluetooth Mouse For Laptop/Computer/Apple/Notebook/Tablet/Macbook/ipad/iPhone;Mice is Compatible With Android/Chromebook/Windows/Vista/Linux/Notebook/Mac OS and Other Bluetooth Devices     【Portable Mouse and Operation Notice】:jelly comb wireless mouse Size About 4.5 x 2.4 x 1.2 inch;USB Mouse Can Be Easily Put Into Your Laptop Bag and Ultra-Space SavingS;lim and Lightweight,Convenient for Carrying or Traveling;Black Wireless Mouse Suitable for Homes、Offices、Travel and More;Note:The USB Receiver is Stored Inside The Back of The Mouse;You Can't Use Bluetooth Mode and 2.4G Mode At the Same Time;Pls Turn off the mac mouse and LED light when not in use to expand the using life;Any Problem About The black mouse,You Can Contact Us Anytime",
      "details": {
        "brand": "AIKOKOK",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "USB",
        "color": "Black",
        "ram": "N/A",
        "detail_item": "【Rechargeable Optical Mouse/Energy Saving】:Computer Mouse Built-in Durable Lithium Ion Rechargeable Battery,High Cycle Life,No Need Change Battery;Laptop Mouse Wireless Can Be Easily Charged Using the Included USB Cable,Just 2 Hours Charging,Mouse Wireless Can Use Than 5 Days of Working Time and 30 Days of Standby Time,Standby Time is Very Long;Tablet Mouse Will Fall Asleep After 5 Minutes No-Operation to Save Power and Provides Long Term Usage;You Can Wake ipad Mouse Up By Clicking any Button"
      }
    },
    {
      "id": "B08LDHYNW3",
      "name": "TECKNET Wireless Mouse, USB Cordless Computer Mouse with 8 Buttons, Ergonomic Design, High-Precision 5 Adjustable DPI for PC/Mac/Laptop",
      "ratings": 1.035,
      "price": "$11.99",
      "image": "https://m.media-amazon.com/images/I/613mEAkWBlL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "【2.4GHz Wireless Gaming Mouse】Our 2.4GHz wireless gaming mouse offers a more secure and precise experience compared to traditional FM radio systems, with an increased working distance of up to 10 meters.     【Plug & Play】No need to install a driver; simply plug the tiny USB Nano receiver into your PC, and the mouse will automatically connect. You can select your preferred cursor speed from 800, 1200, 1600, 2400, or 4800 DPI.     【Secret Weapon for Gaming】With our wireless gaming mouse, achieve a 500Hz return rate for instant transmission between your computer and mouse. Experience no delay and no frame skipping, allowing you to enjoy games more fluently and freely.     【Stable Connection】The wireless gaming mouse features Tru-Wave and Co-Link Technology. Tru-Wave technology provides precise, smart cursor control over many surface types. Co-Link technology ensures that once paired, there is no need to re-establish the connection after a signal loss or shutdown.     【Energy Efficient】The auto power-off function switches off the wireless mouse when the USB Nano receiver is disconnected or when the PC is switched off. This feature provides up to 12 months of battery life from just 2 AA batteries (not included).     【36 Months Support】If you encounter any problems in using the computer mouse wireless, please feel free to contact our professional customer service team, enjoying TECKNET 36 Months Warranty (Registered Only)",
      "details": {
        "brand": "TECKNET",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "USB",
        "color": "Black blue",
        "ram": "N/A",
        "detail_item": "【2.4GHz Wireless Gaming Mouse】Our 2.4GHz wireless gaming mouse offers a more secure and precise experience compared to traditional FM radio systems, with an increased working distance of up to 10 meters."
      }
    },
    {
      "id": "B00Z9V0NKC",
      "name": "BENGOO Gaming Mouse Wired, Ergonomic Gamer Laptop PC Optical Computer Mice with RGB Backlit, 4 Adjustable DPI Up to 3600, 6 Programmable Buttons for Windows 7/8/10/XP Vista Linux -Black",
      "ratings": 12.914,
      "price": "$9.00",
      "image": "https://m.media-amazon.com/images/I/61lCLrCtuhL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "【Speed DPI Switch】 Bengoo customizable RGB gaming mice, with 4 adjustable DPI speed Switch:1200-1600-2400-3600, you can control the speed more freely and easily. No need any driver, plug and play directly.     【Flexible Buttons】 Equipped with six buttons: Left button, Right button, Forward, Back, DPI button and Scroll wheel, meets for your demands excellently for different games, enables to switch fast while gaming.     【Lighting Colors】 Muti-colors lights greatly match your style, provide you fancy gaming environment and highlight your game atmosphere.     【Ergonomic Design】 Perfectly fits under your palm, skin-friendly material we take provides you a perfect hand feel, gives gamers the most comfortable gaming experienece and makes you feel free from fatigue.     【Wide Compatibility】 Support Windows XP, Vista, Windows 7, Windows 8. Adaptable for Notebook, PC, laptop, Computer, Macbook and so on.",
      "details": {
        "brand": "BENGOO",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "USB",
        "color": "black",
        "ram": "N/A",
        "detail_item": "【Speed DPI Switch】 Bengoo customizable RGB gaming mice, with 4 adjustable DPI speed Switch:1200-1600-2400-3600, you can control the speed more freely and easily. No need any driver, plug and play directly."
      }
    },
    {
      "id": "B08D6VD9TR",
      "name": "Lenovo 530 Full Size Wireless Computer Mouse for PC, Laptop, Computer with Windows - 2.4 GHz Nano USB Receiver - Ambidextrous Design - 12 Months Battery Life - Graphite Grey",
      "ratings": 1.945,
      "price": "$11.99",
      "image": "https://m.media-amazon.com/images/I/51Tg7aco-BL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Reliable Wireless Connectivity: The Lenovo 530 Wireless Mouse offers a dependable connection no matter where you are. Its advanced nano USB receiver utilizes robust 2.4 GHz wireless technology, ensuring seamless performance without the hassle of cords. Stay productive and focused without the constraints of wired setups.     Precision Tracking at Your Fingertips: Elevate your user experience with the 1200 DPI resolution optical sensor featured in this wireless mouse. Experience responsive and clear tracking that enhances your navigation, whether you're browsing the web, creating presentations, or engaging in detailed design work. Precision is now at your fingertips.     Durability That Lasts: With the Lenovo 530 Wireless Mouse, longevity is a guarantee. Boasting a remarkable lifespan of up to 8 million clicks for both left and right buttons, this mouse is built to withstand the rigors of daily use. Enjoy reliable performance for years to come, making it an ideal companion for your computing tasks.     Ergonomic Comfort for Extended Use: Experience unparalleled comfort during long work sessions with the unique and contoured design of the Lenovo 530 Wireless Mouse. Crafted for maximum ergonomics, this mouse fits perfectly in your hand, ensuring all-day comfort. The durable soft touch finish adds a premium feel to your interactions, making productivity a breeze.     Versatility and Portability: Whether you're left-handed or right-handed, the Lenovo 530 Wireless Mouse accommodates your preference. Its ambidextrous design ensures functionality and comfort for all users. Weighing just 65g (2.29 oz), it's the ultimate travel companion. Slip it into your laptop bag or pocket and enjoy its lightweight portability wherever you go. Plus, with an impressive battery life of up to 12 months (actual duration may vary based on usage), you can confidently use it without worrying about frequent recharges. Choose the Lenovo 530 Wireless Mouse for unparalleled performance, comfort, and convenience.",
      "details": {
        "brand": "Lenovo",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "Bluetooth",
        "color": "Graphite Grey",
        "ram": "N/A",
        "detail_item": "Reliable Wireless Connectivity: The Lenovo 530 Wireless Mouse offers a dependable connection no matter where you are. Its advanced nano USB receiver utilizes robust 2.4 GHz wireless technology, ensuring seamless performance without the hassle of cords. Stay productive and focused without the constraints of wired setups."
      }
    },
    {
      "id": "B0CSDN2136",
      "name": "SM900 Green Wired Gaming Mouse with Honeycomb Shell,12800 DPI,7 Programmable Buttons,Lightweight Gaming Mice Ergonomic Computer Mouse Gaming for Windows/PC/Mac/Laptop Gamer",
      "ratings": 440,
      "price": "$14.99",
      "image": "https://m.media-amazon.com/images/I/61e-WA4G18L.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "6 Levels Adjustable DPI:SM900 is a powerful gaming mouse with excellent performance,It supports 6 levels adjustment DPI up to 12800.Rolling Rate max to 1000Hz,According user's preference setup different DPI and Rolling Rate suitable for games, office and many occasions     4 Mode Switch:SM900 gaming wired mouse supports 4 modes switch, default 1 office mode and 3 gaming modes.Gaming modes need setup by macro software, according to the user's gaming preferences setup different button functions     Support Custom and Macro Program:SM900 lightweight gaming mouse supports macro settings, user can reset the mouse buttons, DPI,modes, lighting effects.Customize personalized gaming mouse according to user preferences.This mouse is widely supported Windows 7,8,10,XP,,VISTA,MAC OS, etc, The USB interface is plug and play     3 Sided Honeycomb Shell design:More breathable, more sweat-absorbent and more comfortable!!!The gaming mouse is made of high quality ABS material and designed with ergonomic hollow perforated housing, Ergonomic Design reduce the weight and make the mouse more flexible and easier to be used for a long time without fatigue, and also enhance the heat dissipation features, very comfortable to use     14 RGB Rainbow Backlight:SM900 pc gaming mice has adjustable RGB lights that can be set to different effects according to user preferences. The brilliant lighting effects provide illumination in dark environments also increases the fun of using",
      "details": {
        "brand": "SOLAKAKA",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "USB",
        "color": "Green",
        "ram": "N/A",
        "detail_item": "6 Levels Adjustable DPI:SM900 is a powerful gaming mouse with excellent performance,It supports 6 levels adjustment DPI up to 12800.Rolling Rate max to 1000Hz,According user's preference setup different DPI and Rolling Rate suitable for games, office and many occasions"
      }
    },
    {
      "id": "B0CPLNPV6F",
      "name": "SM66 White Silent Dual Mode 2.4GHz Wireless Mouse, Adjustable 4800 DPI,Rechargeable Computer Mouse Wireless Office Mouse for PC Mac Laptop, Desktop",
      "ratings": 272,
      "price": "$16.89",
      "image": "https://m.media-amazon.com/images/I/51Udo0fWghL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "2.4G Wireless Dual-Mode:The SOLAKAKA SM66 wireless mouse is perfect for multi-functional use,support 2 mode BT and 2.4GHz wireless connection,3 devices save. supports connection for your Laptop,PC,Computer,Xbox,iPad,Mobile Phone.compatible with multiple systems including Windows,OS,Android,IOS,etc     Ergonomic Design, 5 DPI Adjustable:This Slim Ergonomic shape wireless mouse is designed with an asymmetrical and streamlined shell, offering a comfortable claw-grip using experience for right,left and medium,small hand, long-term use without fatigue. 5 DPI levels 4800,2400,1600,1200,800,user can press the DPI button at the bottom of the mouse. Easier and smoother. The ultra-thin design is mini and lightweight, perfect for traveling carry, and can be easily put into laptop bag, ultra-space saving     Silent Buttons:SM66 wireless mouse adopts a silent button design, which reduces 99% of button noise. It is very suitable for public places such as libraries and offices. It is the best choice for people who like quiet     PORTABLE and 10M LONG WORKING DISTANCE:2.4G Nano USB receiver is embedded in the computer mouse bottom for convenient portability. It is great as a travel mouse for a laptop. The remote mouse for laptop works great with the SOLAKAKA mouse combo and computer keyboard and mice accessories. The 10m,32ft long working distance ensures you can enjoy high-precision optical sensor performance on various surfaces     Rechargeable and Long Battery Life:With the built-in 500mAh rechargeable Lithiumion battery, you can charge the magic cute mouse by using the Type-C charger cable included. Using while charging is available. In addition, the rechargeable mouse uses smart power-saving technology, the great battery will enter sleep mode after 3 minutes of no-operation to save power and provide long time usage. You can wake it up by clicking any button     Friendly Tip: SM66 has a smart sleep mode, when it is not used for a few minutes, it will enter the power saving state, please move the mouse to wake it up!",
      "details": {
        "brand": "SOLAKAKA",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "Bluetooth",
        "color": "white",
        "ram": "N/A",
        "detail_item": "2.4G Wireless Dual-Mode:The SOLAKAKA SM66 wireless mouse is perfect for multi-functional use,support 2 mode BT and 2.4GHz wireless connection,3 devices save. supports connection for your Laptop,PC,Computer,Xbox,iPad,Mobile Phone.compatible with multiple systems including Windows,OS,Android,IOS,etc"
      }
    },
    {
      "id": "B0C97CF6K2",
      "name": "Cute Bluetooth Mouse, 2.4 GHz Wireless Mice with USB Receiver for Laptop, iPad, Mac, Silent Cartoon Mouse Suitable for Children and Students (Kerry Bear)",
      "ratings": 376,
      "price": "$14.99",
      "image": "https://m.media-amazon.com/images/I/61kL1e5zG-L.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "❤ [Cute Wireless Mouse] - Our wireless mouse has a variety of cute cartoon pattern designs, suitable for young people and children.     ❤ [Dual Mode Mouse] - Bluetooth & 2.4G dual mode wireless mouse connection switch easily. Bluetooth wireless brings quick response, precise movement, stable connection & smoother tracking. 2.4G wireless transmission provide stable and reliable connection.     ❤ [Silent Wireless Mouse] - Special design, noiseless click sound when pressing buttons, which let you not worry about the mouse sound can disturbing others, especially at library or office.     ❤ [Durable Mouse] - Intelligent power saving, the mouse will automatically be in sleeping mode after 10 minutes inactivity, you can click any button to wake it up. Only 1 piece AA battery is required for power supply (not included in the package).     ❤ [Universal Compatibility Mouse] - FMOUSE M101 Mouse, with wireless receiver and Bluetooth inside, connect the mouse easily to your MacBook, iPad, Laptop or any Desktop devices, Mouse wireless well compatible with Windows, MacOS, iPadOS & Android.",
      "details": {
        "brand": "FMOUSE",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "Wireless, Bluetooth, USB",
        "color": "Kerry Bear",
        "ram": "N/A",
        "detail_item": "❤ [Cute Wireless Mouse] - Our wireless mouse has a variety of cute cartoon pattern designs, suitable for young people and children."
      }
    },
    {
      "id": "B0B1DKR8K8",
      "name": "VssoPlor Type C Wireless Mouse USB C Rechargeable Portable Quiet MacBook Mouse iPad Mouse USB and Type C Receiver Dual Mode Laptop Mouse for PC, Laptop, MacBook, Tablet-Black Gold",
      "ratings": 4.853,
      "price": "$19.99",
      "image": "https://m.media-amazon.com/images/I/51f4-q-YWEL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "【WIDE COMPATIBILITY】 Well compatible with Windows7/8/10/XP, Vista, Mac OS X 10.10 or later. Fits for all Type-C devices, tablets, cellphones, Macbook, Macbook Pro, iMac, iMac Pro, Chromebook and more     【RECHARGEABLE & QUIET CLICKING】Easily recharged through the included micro usb cable and built-in durable 300mAh lithium rechargeable battery. Smooth frosted surface and quiet clicks can bring a better user experience and free your worry about bothering others and keep you stay focused while working     【ADJUSTABLE DPI AND ERGONOMIC DESIGN】3 DPI lecvels (1000/1600/2400 DPI) allows you to change the cursor sensitivity easily and track more smoothly over a variety of surfaces. Contoured shape fits your hands perfectly, reducing hand fatigue     【EASY TO USE & CONVENIENT】PLUG and PLAY. The nano type-C and usb receiver is in the battery compartment of the mouse. Take it out and plug it into the port of the device separately. No additional drivers or software needed. You can switch between connected devices with a single button. Store the receiver in the battery compartment when you on the go     【SKIN-FRIENDLY & WARRANTY】Silent click mouse with classic design offers your hand maximum support and comfort. Every Vssoplor product includes 12-month warranty. Please buy with confidence",
      "details": {
        "brand": "VssoPlor",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "Wireless, USB",
        "color": "Black Gold",
        "ram": "N/A",
        "detail_item": "【WIDE COMPATIBILITY】 Well compatible with Windows7/8/10/XP, Vista, Mac OS X 10.10 or later. Fits for all Type-C devices, tablets, cellphones, Macbook, Macbook Pro, iMac, iMac Pro, Chromebook and more"
      }
    },
    {
      "id": "B0CF4DJM7F",
      "name": "Razer Viper V3 HyperSpeed Wireless Esports Gaming Mouse: 82g Lightweight - Up to 280 Hr Battery - 30K DPI Optical Sensor - Gen-2 Mechanical Switches - 8 Programmable Controls - Classic Black",
      "ratings": 271,
      "price": "$62.63",
      "image": "https://m.media-amazon.com/images/I/61LI6E0sJwL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "82G LIGHTWEIGHT DESIGN — Featuring a mass centralized design, the Razer Viper V3 HyperSpeed ensures seamless, consistent swipes crucial to competitive play so never have to settle for unbalanced battery-powered mice     FOCUS PRO 30K OPTICAL SENSOR — With a forward sensor placement and intelligent functions, our flagship sensor ensures a finer degree of accuracy, while maintaining flawless tracking on a wider variety of surfaces including glass     UP TO 280 HOURS OF BATTERY LIFE — Power through most intense scrimming and tournament schedule with up to 280 hours of high-performance gaming on just a single AA battery     HYPERSPEED WIRELESS — Experience a flawless, low-latency connection that remains smooth and stable even in noisy wireless environments for outfitted with multi-device support for a streamlined esports setup     MECHANICAL MOUSE SWITCHES GEN-2 — Rated with a 60-million click lifespan, the switches feature gold-plated contact points for greater resistance against wear and tear to enjoy crisp execution that always comes in clutch     ON-MOUSE DPI CONTROL — Conveniently located on the top of the mouse, press the button to quickly toggle between 5 DPI stages, or customize its function and map it to an essential command     #1 SELLING PC GAMING PERIPHERALS BRAND IN THE U.S. — Source — Circana, Retail Tracking Service, U.S., Dollar Sales, Gaming Designed Mice, Keyboards, and PC Headsets, Jan. 2019- Dec. 2023 combined",
      "details": {
        "brand": "Razer",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "USB",
        "color": "Classic Black",
        "ram": "N/A",
        "detail_item": "82G LIGHTWEIGHT DESIGN — Featuring a mass centralized design, the Razer Viper V3 HyperSpeed ensures seamless, consistent swipes crucial to competitive play so never have to settle for unbalanced battery-powered mice"
      }
    },
    {
      "id": "B078W926JQ",
      "name": "SteelSeries Rival 600 - Gaming Mouse - 12,000 CPI TrueMove3+ Dual Optical Sensor - 0.05 Lift-Off Distance - Weight System,Black",
      "ratings": 4.032,
      "price": "$39.99",
      "image": "https://m.media-amazon.com/images/I/41LUn42Si5L.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Exclusive TrueMove3 12,000 CPI, 350 IPS optical 1 to 1 tracking esports sensor     One of the world's lowest and most accurate lift off distance     256 centre of gravity weight tuning configurations     Split-trigger 60-million click mechanical switches     Silicone side grips for increased grip and durabilityEight-zone RGB illumination with Discord notificationsSave sensor settings, macros, and lighting effects on-board",
      "details": {
        "brand": "SteelSeries",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "USB",
        "color": "Black",
        "ram": "N/A",
        "detail_item": "Exclusive TrueMove3 12,000 CPI, 350 IPS optical 1 to 1 tracking esports sensor"
      }
    },
    {
      "id": "B00Z9V0NKC",
      "name": "BENGOO Gaming Mouse Wired, Ergonomic Gamer Laptop PC Optical Computer Mice with RGB Backlit, 4 Adjustable DPI Up to 3600, 6 Programmable Buttons for Windows 7/8/10/XP Vista Linux -Black",
      "ratings": 12.914,
      "price": "$9.00",
      "image": "https://m.media-amazon.com/images/I/61lCLrCtuhL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "【Speed DPI Switch】 Bengoo customizable RGB gaming mice, with 4 adjustable DPI speed Switch:1200-1600-2400-3600, you can control the speed more freely and easily. No need any driver, plug and play directly.     【Flexible Buttons】 Equipped with six buttons: Left button, Right button, Forward, Back, DPI button and Scroll wheel, meets for your demands excellently for different games, enables to switch fast while gaming.     【Lighting Colors】 Muti-colors lights greatly match your style, provide you fancy gaming environment and highlight your game atmosphere.     【Ergonomic Design】 Perfectly fits under your palm, skin-friendly material we take provides you a perfect hand feel, gives gamers the most comfortable gaming experienece and makes you feel free from fatigue.     【Wide Compatibility】 Support Windows XP, Vista, Windows 7, Windows 8. Adaptable for Notebook, PC, laptop, Computer, Macbook and so on.",
      "details": {
        "brand": "BENGOO",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "USB",
        "color": "black",
        "ram": "N/A",
        "detail_item": "【Speed DPI Switch】 Bengoo customizable RGB gaming mice, with 4 adjustable DPI speed Switch:1200-1600-2400-3600, you can control the speed more freely and easily. No need any driver, plug and play directly."
      }
    },
    {
      "id": "B07V83NMCV",
      "name": "Alienware Wired/Wireless Gaming Mouse AW610M: 16000 DPI Optical Sensor - 350 Hour Rechargeable Battery, 7 Buttons, 3-ZONE 16.8m AlienFX RGB Lighting, Edge-Free Design, Ergonomic, Dark Side of the Moon",
      "ratings": 1.576,
      "price": "$58.99",
      "image": "https://m.media-amazon.com/images/I/71u65w5IiEL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Power your way to victory: Game with confidence thanks to industry-leading power efficiency. With up to 350 hours of gameplay on a single charge of the lithium-ion battery, you can keep the fight going for weeks on end.     Attack with deadly precision: Move swiftly and precisely with the latest generation custom Alienware native 16,000 DPI sensor.     Control the battlefield: Wield greater precision while in the middle of combat with the custom, adjustable scroll wheel that allows you to switch between 12 and 24 steps per scroll wheel revolution.     Light it up: Fly your colors on the battlefield with fully customizable AlienFX RGB, giving you 16.8m color control via Alienware Command Center.     Personalize your arsenal: Switch up your gameplay instantly with seven buttons that are fully programmable thanks to the Alienware Command Center. Plus, stay one-step ahead of your opponents with pre-loaded tension on the main clicker mechanism for a controlled, crisp, tactile click feel.",
      "details": {
        "brand": "Alienware",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "Wireless, wired - USB",
        "color": "Dark Side of the Moon",
        "ram": "N/A",
        "detail_item": "Power your way to victory: Game with confidence thanks to industry-leading power efficiency. With up to 350 hours of gameplay on a single charge of the lithium-ion battery, you can keep the fight going for weeks on end."
      }
    },
    {
      "id": "B08LDHYNW3",
      "name": "TECKNET Wireless Mouse, USB Cordless Computer Mouse with 8 Buttons, Ergonomic Design, High-Precision 5 Adjustable DPI for PC/Mac/Laptop",
      "ratings": 1.035,
      "price": "$11.99",
      "image": "https://m.media-amazon.com/images/I/613mEAkWBlL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "【2.4GHz Wireless Gaming Mouse】Our 2.4GHz wireless gaming mouse offers a more secure and precise experience compared to traditional FM radio systems, with an increased working distance of up to 10 meters.     【Plug & Play】No need to install a driver; simply plug the tiny USB Nano receiver into your PC, and the mouse will automatically connect. You can select your preferred cursor speed from 800, 1200, 1600, 2400, or 4800 DPI.     【Secret Weapon for Gaming】With our wireless gaming mouse, achieve a 500Hz return rate for instant transmission between your computer and mouse. Experience no delay and no frame skipping, allowing you to enjoy games more fluently and freely.     【Stable Connection】The wireless gaming mouse features Tru-Wave and Co-Link Technology. Tru-Wave technology provides precise, smart cursor control over many surface types. Co-Link technology ensures that once paired, there is no need to re-establish the connection after a signal loss or shutdown.     【Energy Efficient】The auto power-off function switches off the wireless mouse when the USB Nano receiver is disconnected or when the PC is switched off. This feature provides up to 12 months of battery life from just 2 AA batteries (not included).     【36 Months Support】If you encounter any problems in using the computer mouse wireless, please feel free to contact our professional customer service team, enjoying TECKNET 36 Months Warranty (Registered Only)",
      "details": {
        "brand": "TECKNET",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "USB",
        "color": "Black blue",
        "ram": "N/A",
        "detail_item": "【2.4GHz Wireless Gaming Mouse】Our 2.4GHz wireless gaming mouse offers a more secure and precise experience compared to traditional FM radio systems, with an increased working distance of up to 10 meters."
      }
    },
    {
      "id": "B08SMQB6TF",
      "name": "HOTLIFE LED Wireless Mouse, Slim Rechargeable Silent Portable USB Optical 2.4G Wireless Bluetooth Two Mode Computer Mice with USB Receiver and Type C Adapter (Black)",
      "ratings": 10.753,
      "price": "$8.79",
      "image": "https://m.media-amazon.com/images/I/61U4Qj2jqmL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "【Led Wireless Mouse】: This wireless mouse Bluetooth with lights can give you more fun during office time. You can choose use the 2.4G wireless mouse when the mouse botton switch is on the 2.4G mode,or connect your laptop's Bluetooth to use the Bluetooth mouse, easy to switch,suitable for any occasion.     【Silent Mouse Rechargeable】: Noiseless click, no worrying about disturbing others beside you, let you concentrate on work. Built-in durable rechargeable battery, it can be easily charged using the included USB cable. 2 hours charging, you can use it for 8-10 days.     【Back to Desktop Button & DPI Adjustable】: Two buttons are after the mouse scrool wheel, the M button makes you back to the laptop desktop to deal other things when you are Browsing the website. 3 adjustable DPI level s( 800, 1200, 1600) to change the speed and sensitivity of your laptop mouse cursor freely.     【Wide Compatibility Mouse Wireless】An accurate USB mouse with an working distance of up to 10 meters（33 feet） which can enables fast data transmission without delays or dropouts,fit for the computer micro usb and type c port, never think about the usb port. Well compatible with Windows XP, Vista, 7, 8, and 10 / Vista / Windows ME for Mac OS,Also support Bluetooth connection, this led wireless + bluetooth mouse perfectly fits for desktop, laptop, PC, for Macbook, for iPad and other Bluetooth devices.     【Portable Mouse and Operation Notice】 Slim and lightweight, Size : 4.52 in * 2.35 in * 0.78 in, durable ergonomic mouse is perfect for travel. The USB receiver is stored inside the back of the mouse. No need for a driver, Plug and Play! Automatic sleep mode and wake-up mode are installed to save energy. ANY PROBLEM about the computer mice, you can contact us anytime.",
      "details": {
        "brand": "HOTLIFE",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "USB",
        "color": "Black",
        "ram": "N/A",
        "detail_item": "【Led Wireless Mouse】: This wireless mouse Bluetooth with lights can give you more fun during office time. You can choose use the 2.4G wireless mouse when the mouse botton switch is on the 2.4G mode,or connect your laptop's Bluetooth to use the Bluetooth mouse, easy to switch,suitable for any occasion."
      }
    },
    {
      "id": "B0BKL8VT9M",
      "name": "Arteck Multi-Device Wireless Bluetooth Mouse with Nano USB-A, USB-C Receiver Ergonomic Right Hand Silent Clicking Rechargeable Mouse for Computer Desktop PC Laptop Mac iPad and Windows 11/10 iPad OS",
      "ratings": 732,
      "price": "$25.99",
      "image": "https://m.media-amazon.com/images/I/61VYoya-47L.__AC_SY300_SX300_QL70_FMwebp_.jpg",
      "description": "Comfortable ergonomic design: Soft easy-to-grip thumb rest, promotes natural hand and wrist position allow you to navigate your mouse in a more comfortable way. This mouse fits for medium-large hands, not suitable for small hands.     3 Devices with A Single Clicking: This mouse is able to connect to 3 devices (2.4G USB-A Wireless + 2.4G USB-C Wireless + Bluetooth) at the same time. You can switch between 3 devices with a single button clicking.     Wide Compatibility: This mouse works with Computer / Desktop / PC / Laptop / Mac / iPad, Windows 11/10/8/7, iPad OS, Android. It can connect to your device via USB port or Bluetooth.     Long Life Rechargeable Battery: Rechargeable lithium battery with an industry-high capacity lasts for 4 months with single charge (based on 2 hours' non-stop use per day). Silent clicking allows you to work in the office, home, cafe, library without disturbing anyone around you.     What You Get: Arteck MD172 Wireless Mouse, one nano USB-A receiver, one nano USB-C receiver (both stored in the back of the mouse), USB-C charging cable, welcome guide, our 24-months warranty and friendly customer service.",
      "details": {
        "brand": "Arteck",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "USB-C Wireless, Bluetooth, USB-A Wireless",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "Comfortable ergonomic design: Soft easy-to-grip thumb rest, promotes natural hand and wrist position allow you to navigate your mouse in a more comfortable way. This mouse fits for medium-large hands, not suitable for small hands."
      }
    },
    {
      "id": "B09CD1G6G6",
      "name": "VEGCOO Wireless Gaming Mouse, C23 Silent Click Wireless Rechargeable Mouse with Colorful LED Lights and 3 Level DPI 400mah Lithium Battery for Laptop and Computer (Black)",
      "ratings": 587,
      "price": "$15.99",
      "image": "https://m.media-amazon.com/images/I/71TmHxBNc6L.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "【Lightweight Honeycomb Shell】The stylish honeycomb shell design makes the wireless gaming mouse lightweight and convenient, and it is shockproof. It also helps with air circulation, bringing all mouse grips a pleasant, cool and comfortable feel that keeps sweaty hands from disturbing you. Take your gaming experience to the next level!     【Chroma RGB Light】The red button under the wireless rechargeable mouse allows you to freely switch between 5 light modes, including no light/colorful light/streamer light/rainbow light/breathing light, choose a series of vibrant colors to personalize you game settings and match your play style. Become the ultimate trendsetter in gaming operations.     【Wireless & Rechargeable】Our cellular mouse adopts 2.4G wireless technology and built-in 500mAh rechargeable battery, which provides stable connection and accurate tracking. No input lag and interference within 10 meters, fast charging, long battery life.     【Adjustable DPI & Silent Click】DPI 800/1600/3200 three levels available, easy to adjust and switch. The left and right buttons of the RGB mouse are designed to click silently, so you don't have to worry about disturbing your family when you're gaming or working at night.     【Ergonomic Mouse】The symmetrical and ergonomically designed PC gaming mouse is suitable for both left and right hands. This sleek PC gaming mouse features pleasing materials that fit perfectly in your grip, ensuring smooth, comfortable operation.",
      "details": {
        "brand": "VEGCOO",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "USB",
        "color": "black",
        "ram": "N/A",
        "detail_item": "【Lightweight Honeycomb Shell】The stylish honeycomb shell design makes the wireless gaming mouse lightweight and convenient, and it is shockproof. It also helps with air circulation, bringing all mouse grips a pleasant, cool and comfortable feel that keeps sweaty hands from disturbing you. Take your gaming experience to the next level!"
      }
    },
    {
      "id": "B0CSDP755C",
      "name": "SM600 Honeycomb Shell Gaming Mouse Wireless,8000 DPI Tri-Modes BT5.1/2.4G Wireless/Type-C Wired Gamer Mouse with 2 Side Buttons, Macro Programmable and RGB Light for PC/Mac/Laptop,Green",
      "ratings": 1.256,
      "price": "$29.89",
      "image": "https://m.media-amazon.com/images/I/61DboHuc4+L._AC_SY300_SX300_.jpg",
      "description": "3 Mode connection:M600 PRO wireless gaming mouse adopts tri-mode connection,2.4G wireless,2 BT5.1,Type-C Wired connection.Users can save 4 devices same time,support PC,laptop,tablet,mobile phone,etc. Switch convenientand connection quick     Customized and Macro Proqram:SM600 gaming mouse with 7 programmable buttons. Users through the software to set the mouse buttons,DPl,mode,lighting effects,etc.SM600 Custom mouse greatly meets the DIY needs of game enthusiasts     Adjustable DPI and Rechargeable Battery:SM600 wireless mouse can be adjusted within 6 levels dpi(8000-4000-2400-1600-1200-800).Rate of return up to 1000Hz,even in intense games,achieve zero latency and no frame skipping. Built-in 600 mA lithium battery,with USB-C charqing cable,Low battery indicator will remind user to charge it with flashing redlight.it also supported recharged while charging     Lightweight and Honeycomb Shell:SM600 honeycomb mouse made of high quality.ABS material and designed with ergonomic hollow shell,Ergonomic Design reduce the weight and make the mouse more flexible and easier to be used for a long time without fatigue,and also enhance the heat dissipation features very comfortable to use.     14 RGB Rainbow Backlight:SM600 has beautiful RGB rainbow backlight.This wireless mouse is equipped with RGB lighting effects. Press the top button to switch light modes(rainbow light,Monochrome light,light off). Very cool lights especially when useing in the dark.",
      "details": {
        "brand": "SOLAKAKA",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "Bluetooth",
        "color": "green",
        "ram": "N/A",
        "detail_item": "3 Mode connection:M600 PRO wireless gaming mouse adopts tri-mode connection,2.4G wireless,2 BT5.1,Type-C Wired connection.Users can save 4 devices same time,support PC,laptop,tablet,mobile phone,etc. Switch convenientand connection quick"
      }
    },
    {
      "id": "B09NBV52FS",
      "name": "Wired Gaming Mouse [Breathing RGB LED] [Plug Play] High-Precision Adjustable 7200 DPI, 7 Programmable Buttons, Ergonomic Computer USB Mice for Windows/PC/Mac/Laptop Gamer",
      "ratings": 2.16,
      "price": "$16.99",
      "image": "https://m.media-amazon.com/images/I/61i6QyWUpQS.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "[Charming Breath RGB Backligh]:16 million color options for the backlight setting make your gaming mouse look cool.The RGB lights is more vibrant than basic light up mice.Turn it off when you unwanted.     [High-Precision DPI & Polling Rateh]:gaming mouse run flawlessly with optical sensor and avoids random clicks.adjust DPI 1200-7200,polling rate125-1000Hz to provide precise cursor movements for gameplay.     [Seven Programmable Buttons]:Mouse have 7 buttons,can set for more functions like rapid fire,macro etc.Software is initial setup.side buttons are default as forward,backward for efficiency surfing.     [Ergonomic Design,Less Fatigue]:The ergonomic contour makes gaming mice fit in any hands.Texture of mouse is a super-fine rubber that feels comfortable and less your fatigue during multiplayer sessions.     [Plug & Play, Build Quality]:As a plug-and-play wired mouse,easy to use and work with Windows,Mac OS,etc.You can feel the solid construction of all buttons.They are responsive,won’t squeak or get stuck.",
      "details": {
        "brand": "WEEMSBOX",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "USB",
        "color": "Black",
        "ram": "N/A",
        "detail_item": "[Charming Breath RGB Backligh]:16 million color options for the backlight setting make your gaming mouse look cool.The RGB lights is more vibrant than basic light up mice.Turn it off when you unwanted."
      }
    },
    {
      "id": "B0DCXGFGH2",
      "name": "SteelSeries Aerox 9 Wireless: World of Warcraft Edition — Free in-Game Item — MMO Gaming Mouse — 18 Programmable Buttons — Lightweight — Bluetooth/2.4GHz — 18K DPI TrueMove Air Sensor",
      "ratings": 23,
      "price": "$159.99",
      "image": "https://m.media-amazon.com/images/I/61bYvs-KdcL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "WORLD OF WARCRAFT EDITION — Gear up for MMO gameplay with this Limited Edition mouse featuring a uniquely molded design and the World of Warcraft logo     FREE IN-GAME ITEM — Receive the Lil' Flameo pet as a digital reward in-game     LIGHTWEIGHT — Effortlessly glide on your mousepad for faster and more decisive clicks, increasing your DPS or HPS; save your raid members from certain death at the hands of a boss and their puddles     18 PROGRAMMABLE BUTTONS — With additional 12 side buttons, easily map all your essential abilities, macros, items, and more to cast them in a flash     180-HOUR BATTERY LIFE — Race for max level in The War Within and battle without breaks as you clear dungeons; get back in the action quickly with USB-C Fast Charge",
      "details": {
        "brand": "SteelSeries",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "Bluetooth",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "WORLD OF WARCRAFT EDITION — Gear up for MMO gameplay with this Limited Edition mouse featuring a uniquely molded design and the World of Warcraft logo"
      }
    },
    {
      "id": "B08W2J9JZ9",
      "name": "CORSAIR SABRE RGB PRO CHAMPION SERIES FPS/MOBA Gaming Mouse - Ergonomic Shape for Esports and Competitive Play - Ultra-Lightweight 74g - Flexible Paracord Cable,Black",
      "ratings": 1.15,
      "price": "$50.18",
      "image": "https://m.media-amazon.com/images/I/71l6hZtDwoL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "CORSAIR CHAMPION SERIES products are designed for and tested by top esports professionals – helping to carry you to victory with a tournament-grade mouse featuring a comfortable ergonomic shape for claw and palm grips, long-term comfort, and fast movement with hyper-responsive inputs.     Weighing in at an ultra-light 74g to support rapid movements and twitch reflexes, the SABRE RGB PRO’s sturdy design keeps up with your longest matches.     CORSAIR QUICKSTRIKE buttons use a spring-loaded design, delivering zero gap between the primary mouse buttons and their switches, so your clicks, shots, and spells are faster than ever.     CORSAIR AXON hyper-processing technology transmits your movements and clicks to your PC up to 8x faster than conventional gaming mice with 8,000Hz hyper-polling.     An extremely light and flexible paracord weave cable dramatically reduces drag to keep your mouse movements fluid and agile.",
      "details": {
        "brand": "Corsair",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "USB",
        "color": "Black",
        "ram": "N/A",
        "detail_item": "CORSAIR CHAMPION SERIES products are designed for and tested by top esports professionals – helping to carry you to victory with a tournament-grade mouse featuring a comfortable ergonomic shape for claw and palm grips, long-term comfort, and fast movement with hyper-responsive inputs."
      }
    },
    {
      "id": "B0BCJC3GCY",
      "name": "RisoPhy Wireless Gaming Mouse,Tri-Mode 2.4G/USB-C/Bluetooth Mouse Up to 10000DPI,Chroma RGB Backlit,Ergonomic Mouse with 8 Programmable Buttons,Rechargeable Computer Mouse for Laptop,PC,Mac",
      "ratings": 1.211,
      "price": "$24.99",
      "image": "https://m.media-amazon.com/images/I/61qN9d08hgL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "⚡️【Latest Three Modes Connectivity】This wireless gaming mouse supports 3 modes of connection to meet a variety of user scenarios. Switch to 2.4G mode and Bluetooth mode when playing games,saving you the hassle of cable,and getting longer battery life.If it is not enough, you can also switch to traditional wired mode with the included rechargeable USB-C cable.Up to 3 devices can be connected simultaneously, such gaming mice are perfect for multi-device productivity.     ⚡️【Immersive RGB Backlight】True RGB effect,16.8 million colors for choice.This RGB gaming mouse has 7 kinds of RGB lighting effects such as streamer, horse racing, neon, solid color, etc to match your game style and desktop layout.All the light effect parameters can be customized with the attached software,giving you the best lighting experience.Light can be also turned off if you don't want it with the convenient switch under this computer mouse.     ⚡️【Pixel-Level Tracking Accuracy】The gaming mouse has a 6-level DPI (1200-2400-3500-5000-7000-10000DPI) and 20G acceleration. This gaming mouse offers pixel-level accuracy for high-intensity gaming and daily office use. There are also 4 polling rates (125-250-500-1000HZ) to reduce lag and ensure smooth motion.     ⚡️【8 Programmable Buttons & Quick Fire Button】RisoPhy wireless mouse support macro editing, and all the buttons can be programmed with the easy-to-use software.The advantage is that the fire button（✈𝐨𝐧𝐞 𝐜𝐥𝐢𝐜𝐤 = 𝐭𝐫𝐢𝐩𝐥𝐞 𝐜𝐥𝐢𝐜𝐤𝐬） is on the left side of your index finger which is very easy to click, giving you the edge you need during those intense FPS battles.It is also great for MOBA/RTS games. NOTE:Programming software is only available on Windows and only supports wired mode.     ⚡️【Extreme Ergonomics & Professional After-Sales Service】This bluetooth gaming mouse is designed for medium-large hands, and if you have larger hands, you'll be amazed at how well-supported this gamer mouse is. Ring finger, pinky and thumb rest provide you with maximum comfort, matte texture is sweat-proof and non-slip, the first choice for computer gamers.",
      "details": {
        "brand": "RisoPhy",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "Bluetooth",
        "color": "Black",
        "ram": "N/A",
        "detail_item": "⚡️【Latest Three Modes Connectivity】This wireless gaming mouse supports 3 modes of connection to meet a variety of user scenarios. Switch to 2.4G mode and Bluetooth mode when playing games,saving you the hassle of cable,and getting longer battery life.If it is not enough, you can also switch to traditional wired mode with the included rechargeable USB-C cable.Up to 3 devices can be connected simultaneously, such gaming mice are perfect for multi-device productivity."
      }
    },
    {
      "id": "B09CXQZMHG",
      "name": "Corsair M65 RGB Ultra Tunable FPS Gaming Mouse Marksman 26,000 DPI Optical Sensor, Optical Switches, AXON Hyper-Processing Technology, Sensor Fusion Control, Tunable Weight System - Black",
      "ratings": 720,
      "price": "$69.99",
      "image": "https://m.media-amazon.com/images/I/61lUrCmjygL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Iconic Aluminum Frame: The M65 RGB ULTRA’s anodized aluminum frame makes for lasting durability with a familiar shape.     CORSAIR MARKSMAN 26,000 DPI Optical Sensor: With an astonishing native 26,000 DPI and 650 inches per seconds (IPS) tracking, the MARKSMAN sensor captures your every mouse movement.     Optical Switches: Left and right-click switches deliver hyper-fast and precise responses, while standing up to years of rigorous use.     CORSAIR AXON Hyper-Processing Technology: Registers and transmits your movements and clicks up to 8x faster than conventional gaming mice thanks to a native 8,000Hz polling rate.     Sensor Fusion Control: Combines a six-axis gyro and accelerometer to enable ultra-low lift-off distance for more accurate tracking when repositioning your mouse.     Tunable Weight System: Adjust the M65 RGB ULTRA’s center of gravity and weight from 97g-115g using up to six included weights.",
      "details": {
        "brand": "Corsair",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "USB",
        "color": "Black",
        "ram": "N/A",
        "detail_item": "Iconic Aluminum Frame: The M65 RGB ULTRA’s anodized aluminum frame makes for lasting durability with a familiar shape."
      }
    },
    {
      "id": "B07QYSSB9R",
      "name": "TECKNET Wireless Mouse for Laptop, 2.4G Wireless Computer Mouse, 5-Level Adjustable 4800 DPI, Silent Mouse with Receiver & 6 Buttons, 18 Months Battery Life, USB Portable Mouse for Mac, Chromebook",
      "ratings": 2.402,
      "price": "$9.99",
      "image": "https://m.media-amazon.com/images/I/61ClHH24oWL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "5 Adjustable DPI & Plug and Play: Wireless mouse for laptop with 5 levels adjustable DPI - 4800/2000/1600/1200/800, easily change the cursor sensitivity depending on your need; Plug and Play - No need for a driver, and you can plug and play the Wireless mouse for laptop directly; NOTE: USB Nano Receiver stored within the back of the wireless computer mouse.     Strong, Durable, Silent & Long Working Range: The wireless mouse for laptop passes the 10,000,000 times keystroke test to guarantee extra durability, The wireless computer mouse's silent button allows you to work in a quiet environment without worrying about disturbing others; Wireless mouse for laptop with 2.4GHz wireless technology ensures a longer working range reaching up to 10 meters (33ft).     Long Battery Life & Extremely Low Power Consumption: The silent mouse has an 18-month long battery life (battery not included), with an auto power-off function to save power, the silent mouse will enter sleep mode in a few minutes of inactivity. Press any button to wake it up. Note: The wireless mouse for laptop is powered by 1x AA batteries (not included).     Unique TruWave & CoLink Technology: TruWave - provides precise, smart cursor control on many surface types to wireless mouse for laptop; CoLink - once the wireless computer mouse is paired there’s no need to re-establish pairing after a signal loss or shutdown.     Wide Compatibility & Low Power Warning: The wireless mouse for laptop can be well-compatible with Windows 11/10/8/7/XP, Vista 7/8 and Linux, etc. Fits desktops, laptops, PC, Macbooks, and other devices; and the LED battery indicator warns you if the battery is running low.     36 Months Support: If you encounter any problems in using the product, please feel free to contact our professional customer service team, enjoying TECKNET 36 Months Warranty (Registered Only)",
      "details": {
        "brand": "TECKNET",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "Wireless, 2.4G USB Receiver",
        "color": "Grey",
        "ram": "N/A",
        "detail_item": "5 Adjustable DPI & Plug and Play: Wireless mouse for laptop with 5 levels adjustable DPI - 4800/2000/1600/1200/800, easily change the cursor sensitivity depending on your need; Plug and Play - No need for a driver, and you can plug and play the Wireless mouse for laptop directly; NOTE: USB Nano Receiver stored within the back of the wireless computer mouse."
      }
    },
    {
      "id": "B00GU4F4OM",
      "name": "Unknown Product",
      "ratings": null,
      "price": "N/A",
      "image": "N/A",
      "description": "",
      "details": {
        "brand": "N/A",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "N/A"
      }
    },
    {
      "id": "B0CVR5DM26",
      "name": "Unknown Product",
      "ratings": null,
      "price": "N/A",
      "image": "N/A",
      "description": "",
      "details": {
        "brand": "N/A",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "N/A"
      }
    },
    {
      "id": "B08D6VD9TR",
      "name": "Unknown Product",
      "ratings": null,
      "price": "N/A",
      "image": "N/A",
      "description": "",
      "details": {
        "brand": "N/A",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "N/A"
      }
    },
    {
      "id": "B0CSDN2136",
      "name": "SM900 Green Wired Gaming Mouse with Honeycomb Shell,12800 DPI,7 Programmable Buttons,Lightweight Gaming Mice Ergonomic Computer Mouse Gaming for Windows/PC/Mac/Laptop Gamer",
      "ratings": 440,
      "price": "$14.99",
      "image": "https://m.media-amazon.com/images/I/61e-WA4G18L.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "6 Levels Adjustable DPI:SM900 is a powerful gaming mouse with excellent performance,It supports 6 levels adjustment DPI up to 12800.Rolling Rate max to 1000Hz,According user's preference setup different DPI and Rolling Rate suitable for games, office and many occasions     4 Mode Switch:SM900 gaming wired mouse supports 4 modes switch, default 1 office mode and 3 gaming modes.Gaming modes need setup by macro software, according to the user's gaming preferences setup different button functions     Support Custom and Macro Program:SM900 lightweight gaming mouse supports macro settings, user can reset the mouse buttons, DPI,modes, lighting effects.Customize personalized gaming mouse according to user preferences.This mouse is widely supported Windows 7,8,10,XP,,VISTA,MAC OS, etc, The USB interface is plug and play     3 Sided Honeycomb Shell design:More breathable, more sweat-absorbent and more comfortable!!!The gaming mouse is made of high quality ABS material and designed with ergonomic hollow perforated housing, Ergonomic Design reduce the weight and make the mouse more flexible and easier to be used for a long time without fatigue, and also enhance the heat dissipation features, very comfortable to use     14 RGB Rainbow Backlight:SM900 pc gaming mice has adjustable RGB lights that can be set to different effects according to user preferences. The brilliant lighting effects provide illumination in dark environments also increases the fun of using",
      "details": {
        "brand": "SOLAKAKA",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "USB",
        "color": "Green",
        "ram": "N/A",
        "detail_item": "6 Levels Adjustable DPI:SM900 is a powerful gaming mouse with excellent performance,It supports 6 levels adjustment DPI up to 12800.Rolling Rate max to 1000Hz,According user's preference setup different DPI and Rolling Rate suitable for games, office and many occasions"
      }
    }
  ]
}