{
  "totalProducts": 22,
  "products": [
    {
      "id": "B0CHNVBBLF",
      "name": "SM900 White Wired Gaming Mouse with Honeycomb Shell,12800 DPI,7 Programmable Buttons,Lightweight Gaming Mice Ergonomic Computer Wired Mouse Gaming for Win/PC/Mac/Laptop Gamer",
      "ratings": 440,
      "price": "$14.99",
      "image": "https://m.media-amazon.com/images/I/61wmkh+azPL._AC_SY300_SX300_.jpg",
      "description": "6 Levels Adjustable DPI:SM900 is a powerful gaming mouse with excellent performance,It supports 6 levels adjustment DPI up to 12800.Rolling Rate max to 1000Hz,According user's preference setup different DPI and Rolling Rate suitable for games, office and many occasions     4 Mode Switch:SM900 wired mouse supports 4 modes switch, default 1 office mode and 3 gaming modes.Gaming modes need setup by macro software, according to the user's gaming preferences setup different button functions     Support Custom and Macro Program:SM900 lightweight wired mouse supports macro settings, user can reset the mouse buttons, DPI,modes, lighting effects.Customize personalized gaming mouse according to user preferences.This mouse is widely supported Windows 7,8,10,XP,,VISTA,MAC OS, etc, The USB interface is plug and play     3 Sided Honeycomb Shell design: SM900 Wired mouse more breathable, more sweat-absorbent and more comfortable!!!The gaming mouse is made of high quality ABS material and designed with ergonomic hollow perforated housing, Ergonomic Design reduce the weight and make the mouse more flexible and easier to be used for a long time without fatigue, and also enhance the heat dissipation features, very comfortable to use     14 RGB Rainbow Backlight:SM900 pc gaming mice has adjustable RGB lights that can be set to different effects according to user preferences. The brilliant lighting effects provide illumination in dark environments also increases the fun of using",
      "details": {
        "brand": "SOLAKAKA",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "wired",
        "color": "white",
        "ram": "N/A",
        "detail_item": "6 Levels Adjustable DPI:SM900 is a powerful gaming mouse with excellent performance,It supports 6 levels adjustment DPI up to 12800.Rolling Rate max to 1000Hz,According user's preference setup different DPI and Rolling Rate suitable for games, office and many occasions"
      }
    },
    {
      "id": "B0D1QNK49S",
      "name": "Natural Rodent Mouse Repellent Ball, 24 Pack Peppermint Oil for Mice Away, Rodent Mice Repellent Indoor Outdoor for Car Engines House Rv Garage - Squirrel Repellent Deterrent Safe for Pets & Human",
      "ratings": 24,
      "price": "$22.79",
      "image": "https://m.media-amazon.com/images/I/81J0IH7nCKL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "[Effective Rodent Rat Repellent] - Mouse Repellent utilize the latest technology, special formulas, and ingredients to effectively drive away rodents, keeping your home free from rodent troubles. Whether it’s large rats or small rodents, the repellent balls can efficiently deter their intrusion     [Long-Lasting Effects] - Mouse Repellent have a long-lasting effect, providing continuous protection against rodent infestations. They not only repel existing rodents but also prevent them from re-entering, ensuring long-term safeguarding for your home     [Easy to Use] - Using Mouse Repellent is incredibly simple. Just place the balls in areas prone to rodent activity, such as the kitchen, storage rooms, or basement. No complicated procedures or installations are required, making it convenient to drive away rodents and protect your family     [Safe and Eco-friendly] - Mouse Rodent are made from non-toxic and harmless formulas, ensuring the safety of humans and pets. You can use them with peace of mind, without worrying about any adverse effects on the health of your family members. Moreover, the repellent balls are environmentally friendly, causing no harm to the environment     [Versatile Applications] - Mouse Repellent are suitable for various settings, including residential homes, commercial spaces, and warehouses. Whether it’s for your home or workplace, the repellent offer a reliable solution for driving away rodents, ensuring cleanliness and safety. Whether you’re in the city or countryside, Mouse Repellent are the preferred choice for effective rodent control",
      "details": {
        "brand": "YJOO",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "[Effective Rodent Rat Repellent] - Mouse Repellent utilize the latest technology, special formulas, and ingredients to effectively drive away rodents, keeping your home free from rodent troubles. Whether it’s large rats or small rodents, the repellent balls can efficiently deter their intrusion"
      }
    },
    {
      "id": "B07L4BM851",
      "name": "Logitech G502 Lightspeed Wireless Gaming Mouse with Hero 25K Sensor, PowerPlay Compatible, Tunable Weights and Lightsync RGB - Black",
      "ratings": 12.532,
      "price": "$124.99",
      "image": "https://m.media-amazon.com/images/I/718b9wK3eaL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Selling Wireless Gaming Gear Brand - Based on independent sales data (FEB ‘19 - FEB’20) of Wireless Gaming Keyboard, Mice, and PC Headset in units from: US, CA, CN, JP, KR, TW, TH, IN, DE, FR, RU, UK, SE, TR     PowerPlay wireless charging: Never worry about your battery life again. Add the power play wireless charging system to keep your G502 Lightspeed Wireless Mouse and other compatible G mice charged while at rest and at play. Powerplay wireless charging system sold separately     Light speed wireless gaming mouse: Exclusive Logitech G ultra-fast wireless technology used by Pro gamers in competitions worldwide     Hero 25K sensor through a software update from G HUB, this upgrade is free to all players: Our most advanced, with 1:1 tracking, 400plus ips, and 100 - 25,600 max dpi sensitivity plus zero smoothing, filtering, or acceleration     11 customizable buttons and hyper fast scroll wheel: Assign custom macro and shortcut commands to the buttons for each game with Logitech G hub software. Use hyper fast scrolling to rapidly review menus, long web pages and more",
      "details": {
        "brand": "Logitech G",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": ": LIGHTSPEED Wireless",
        "color": "Black",
        "ram": "N/A",
        "detail_item": "Selling Wireless Gaming Gear Brand - Based on independent sales data (FEB ‘19 - FEB’20) of Wireless Gaming Keyboard, Mice, and PC Headset in units from: US, CA, CN, JP, KR, TW, TH, IN, DE, FR, RU, UK, SE, TR"
      }
    },
    {
      "id": "B0CTMTKCRY",
      "name": "GravaStar Wireless Gaming Mice Mercury M1 Pro, Lightweight Magnesium Alloy Gaming Mouse, 26,000 DPI, PAW3395DM Sensor, Tri Mode Connection, Support 4K, Up to 200 Hours Battery Life",
      "ratings": 302,
      "price": "$99.95",
      "image": "https://m.media-amazon.com/images/I/61x9hrrHN2L.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Ergonomic Mastery: Precision at Your Fingertips - Meticulously crafted for the discerning gamer, the M1 Pro boasts an ergonomic design that cradles your hand, transforming every move into natural, precise actions. Enhanced tactile button feedback means every click is more satisfying, more accurate - a true extension of your intent.     TUROSPEED Dominance: Stay Connected, Stay Unbeatable - With the TUROSPEED Wireless technology, the M1 Pro offers versatile connection options - from the ultra-fast 2.4G to the agile Bluetooth, down to the steadfast wired connection. Coupled with prolonged battery life, this mouse ensures you're always ready, always dominant.     Hyper Precision Sensor: The Art of Unseen Advantage - Dominate the gaming world with a up to 4K polling rate and a staggering 26,000 DPI sensor. PAW3395 provides ultra-smooth cursor movement and pinpoint accuracy, giving you the unseen advantage in every skirmish, every battle.     GLOWSYNC Spectrum: Illuminate Your Victory Path - The M1 Pro’s customizable GLOWSYNC RGB lighting isn't just about aesthetics; it's about setting the tone for your next conquest. Sync it with your game, feel the ambiance of every battle, and let the colors herald your victories.     Ultimate Customization Control: Your Strategy, Your Terms - Tailor every aspect of your gameplay with the M1 Pro’s fully programmable buttons. The intuitive software enables you to assign macros, reconfigure button layouts, and adapt the mouse to your gaming style, ensuring you’re always playing on your terms.     Ultra-Low Lag Command Center: Instant Response, Instant Victory - Experience the pinnacle of gaming precision with the M1 Pro’s 4K receiver. This advanced technology translates into ultra-low latency and consistent, stable connectivity, giving you a noticeable advantage in fast-paced games.",
      "details": {
        "brand": "N/A",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "Ergonomic Mastery: Precision at Your Fingertips - Meticulously crafted for the discerning gamer, the M1 Pro boasts an ergonomic design that cradles your hand, transforming every move into natural, precise actions. Enhanced tactile button feedback means every click is more satisfying, more accurate - a true extension of your intent."
      }
    },
    {
      "id": "B09NBV52FS",
      "name": "Wired Gaming Mouse [Breathing RGB LED] [Plug Play] High-Precision Adjustable 7200 DPI, 7 Programmable Buttons, Ergonomic Computer USB Mice for Windows/PC/Mac/Laptop Gamer",
      "ratings": 2.16,
      "price": "$16.99",
      "image": "https://m.media-amazon.com/images/I/61i6QyWUpQS.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "[Charming Breath RGB Backligh]:16 million color options for the backlight setting make your gaming mouse look cool.The RGB lights is more vibrant than basic light up mice.Turn it off when you unwanted.     [High-Precision DPI & Polling Rateh]:gaming mouse run flawlessly with optical sensor and avoids random clicks.adjust DPI 1200-7200,polling rate125-1000Hz to provide precise cursor movements for gameplay.     [Seven Programmable Buttons]:Mouse have 7 buttons,can set for more functions like rapid fire,macro etc.Software is initial setup.side buttons are default as forward,backward for efficiency surfing.     [Ergonomic Design,Less Fatigue]:The ergonomic contour makes gaming mice fit in any hands.Texture of mouse is a super-fine rubber that feels comfortable and less your fatigue during multiplayer sessions.     [Plug & Play, Build Quality]:As a plug-and-play wired mouse,easy to use and work with Windows,Mac OS,etc.You can feel the solid construction of all buttons.They are responsive,won’t squeak or get stuck.",
      "details": {
        "brand": "WEEMSBOX",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "USB",
        "color": "Black",
        "ram": "N/A",
        "detail_item": "[Charming Breath RGB Backligh]:16 million color options for the backlight setting make your gaming mouse look cool.The RGB lights is more vibrant than basic light up mice.Turn it off when you unwanted."
      }
    },
    {
      "id": "B08BS4MTQN",
      "name": "HP Wired RGB Gaming Mouse High Performance Mouse with Optical Sensor, 3 Buttons, 7 Color LED for Computer Notebook Laptop Office PC Home",
      "ratings": 1.761,
      "price": "$9.88",
      "image": "https://m.media-amazon.com/images/I/71PFM6i9dkL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "OPTICAL GAMING MOUSE WITH BUILT IN COOL LIGHTING EFFECT- Classic design combining with 7 colors glaring LED light，creates a cool and colorful game atmosphere to enhance the excitement of the game.Best for pc games.     UNIVERSAL COMPATIBILITY — Windows. Chromebooks. MacOS. Linux. Most gaming consoles. If you got it, you can use it, with no additional software or drivers to download. Just plug, play — and get to work!     PRECISE & ACCURATE CURSOR CONTROL: The responsive USB mouse wired is rated at 1200 DPI, which allows for precise, quick, and smooth cursor movement with pinpoint accuracy     THE PERFECT FIT FOR YOUR PALM - Whether you use this as a wired mac mouse or PC mouse, our mouse for computer will be comfortable to use. The ambidextrous design allows anyone to work for long periods of time without any wrist strain or discomfort.     BASIC WORKPLACE ESSENTIAL: The corded mouse is a simple accessory to improve your productivity. With a 3 button layout and a scroll wheel, you will be able to conquer your workload with ease.",
      "details": {
        "brand": "HP",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "Wired, USB",
        "color": "[POSSIBLE_VALUES] Red, Green, Blue, Yellow, Purple, Cyan, White",
        "ram": "N/A",
        "detail_item": "OPTICAL GAMING MOUSE WITH BUILT IN COOL LIGHTING EFFECT- Classic design combining with 7 colors glaring LED light，creates a cool and colorful game atmosphere to enhance the excitement of the game.Best for pc games."
      }
    },
    {
      "id": "B0CPLNPV6F",
      "name": "SM66 White Silent Dual Mode 2.4GHz Wireless Mouse, Adjustable 4800 DPI,Rechargeable Computer Mouse Wireless Office Mouse for PC Mac Laptop, Desktop",
      "ratings": 272,
      "price": "$16.89",
      "image": "https://m.media-amazon.com/images/I/51Udo0fWghL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "2.4G Wireless Dual-Mode:The SOLAKAKA SM66 wireless mouse is perfect for multi-functional use,support 2 mode BT and 2.4GHz wireless connection,3 devices save. supports connection for your Laptop,PC,Computer,Xbox,iPad,Mobile Phone.compatible with multiple systems including Windows,OS,Android,IOS,etc     Ergonomic Design, 5 DPI Adjustable:This Slim Ergonomic shape wireless mouse is designed with an asymmetrical and streamlined shell, offering a comfortable claw-grip using experience for right,left and medium,small hand, long-term use without fatigue. 5 DPI levels 4800,2400,1600,1200,800,user can press the DPI button at the bottom of the mouse. Easier and smoother. The ultra-thin design is mini and lightweight, perfect for traveling carry, and can be easily put into laptop bag, ultra-space saving     Silent Buttons:SM66 wireless mouse adopts a silent button design, which reduces 99% of button noise. It is very suitable for public places such as libraries and offices. It is the best choice for people who like quiet     PORTABLE and 10M LONG WORKING DISTANCE:2.4G Nano USB receiver is embedded in the computer mouse bottom for convenient portability. It is great as a travel mouse for a laptop. The remote mouse for laptop works great with the SOLAKAKA mouse combo and computer keyboard and mice accessories. The 10m,32ft long working distance ensures you can enjoy high-precision optical sensor performance on various surfaces     Rechargeable and Long Battery Life:With the built-in 500mAh rechargeable Lithiumion battery, you can charge the magic cute mouse by using the Type-C charger cable included. Using while charging is available. In addition, the rechargeable mouse uses smart power-saving technology, the great battery will enter sleep mode after 3 minutes of no-operation to save power and provide long time usage. You can wake it up by clicking any button     Friendly Tip: SM66 has a smart sleep mode, when it is not used for a few minutes, it will enter the power saving state, please move the mouse to wake it up!",
      "details": {
        "brand": "SOLAKAKA",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "Bluetooth",
        "color": "white",
        "ram": "N/A",
        "detail_item": "2.4G Wireless Dual-Mode:The SOLAKAKA SM66 wireless mouse is perfect for multi-functional use,support 2 mode BT and 2.4GHz wireless connection,3 devices save. supports connection for your Laptop,PC,Computer,Xbox,iPad,Mobile Phone.compatible with multiple systems including Windows,OS,Android,IOS,etc"
      }
    },
    {
      "id": "B0BRTF2PGP",
      "name": "Asus ROG Keris Wireless AimPoint Gaming Mouse, Tri-mode connectivity, 36000 DPI sensor, 5 programmable buttons, ROG SpeedNova, Replaceable switches, Paracord cable, White",
      "ratings": 217,
      "price": "$71.99",
      "image": "https://m.media-amazon.com/images/I/61T1RDQiXKL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Perfect precision: 36,000 dpi ROG AimPoint optical sensor with 650 ips and 50 g acceleration rate, plus 1000 Hz polling rate     Tri-mode connectivity: Game with RGB on for up to 119 hours with low-latency 2.4 GHz RF, pair up to three devices via Bluetooth mode, or charge and play with wired USB     ROG SpeedNova wireless technology: Delivering low-latency, reliable wireless performance and an optimized power solution in the 2.4 GHz RF mode     Lightweight structure: Updated design with durable inner structure keeps mouse weight down to just 75 grams     Push-Fit Switch Socket II: Swappable switch design for easy customization; Keris AimPoint includes ROG Micro Switches and is compatible with other 3-pin mechanical and 5-pin optical micro switches     PBT L/R buttons: Feature a durable nonslip surface that resists wear or shine to ensure a consistent feel     Anti-slip ROG patterned mouse grip tape: Provides users with a more secure grip and an added bit of flair     Smooth and fast movements: ROG Paracord and 100% PTFE mouse feet",
      "details": {
        "brand": "ASUS",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "Bluetooth",
        "color": "White",
        "ram": "N/A",
        "detail_item": "Perfect precision: 36,000 dpi ROG AimPoint optical sensor with 650 ips and 50 g acceleration rate, plus 1000 Hz polling rate"
      }
    },
    {
      "id": "B0BCJC3GCY",
      "name": "RisoPhy Wireless Gaming Mouse,Tri-Mode 2.4G/USB-C/Bluetooth Mouse Up to 10000DPI,Chroma RGB Backlit,Ergonomic Mouse with 8 Programmable Buttons,Rechargeable Computer Mouse for Laptop,PC,Mac",
      "ratings": 1.211,
      "price": "$24.99",
      "image": "https://m.media-amazon.com/images/I/61qN9d08hgL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "⚡️【Latest Three Modes Connectivity】This wireless gaming mouse supports 3 modes of connection to meet a variety of user scenarios. Switch to 2.4G mode and Bluetooth mode when playing games,saving you the hassle of cable,and getting longer battery life.If it is not enough, you can also switch to traditional wired mode with the included rechargeable USB-C cable.Up to 3 devices can be connected simultaneously, such gaming mice are perfect for multi-device productivity.     ⚡️【Immersive RGB Backlight】True RGB effect,16.8 million colors for choice.This RGB gaming mouse has 7 kinds of RGB lighting effects such as streamer, horse racing, neon, solid color, etc to match your game style and desktop layout.All the light effect parameters can be customized with the attached software,giving you the best lighting experience.Light can be also turned off if you don't want it with the convenient switch under this computer mouse.     ⚡️【Pixel-Level Tracking Accuracy】The gaming mouse has a 6-level DPI (1200-2400-3500-5000-7000-10000DPI) and 20G acceleration. This gaming mouse offers pixel-level accuracy for high-intensity gaming and daily office use. There are also 4 polling rates (125-250-500-1000HZ) to reduce lag and ensure smooth motion.     ⚡️【8 Programmable Buttons & Quick Fire Button】RisoPhy wireless mouse support macro editing, and all the buttons can be programmed with the easy-to-use software.The advantage is that the fire button（✈𝐨𝐧𝐞 𝐜𝐥𝐢𝐜𝐤 = 𝐭𝐫𝐢𝐩𝐥𝐞 𝐜𝐥𝐢𝐜𝐤𝐬） is on the left side of your index finger which is very easy to click, giving you the edge you need during those intense FPS battles.It is also great for MOBA/RTS games. NOTE:Programming software is only available on Windows and only supports wired mode.     ⚡️【Extreme Ergonomics & Professional After-Sales Service】This bluetooth gaming mouse is designed for medium-large hands, and if you have larger hands, you'll be amazed at how well-supported this gamer mouse is. Ring finger, pinky and thumb rest provide you with maximum comfort, matte texture is sweat-proof and non-slip, the first choice for computer gamers.",
      "details": {
        "brand": "RisoPhy",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "Bluetooth",
        "color": "Black",
        "ram": "N/A",
        "detail_item": "⚡️【Latest Three Modes Connectivity】This wireless gaming mouse supports 3 modes of connection to meet a variety of user scenarios. Switch to 2.4G mode and Bluetooth mode when playing games,saving you the hassle of cable,and getting longer battery life.If it is not enough, you can also switch to traditional wired mode with the included rechargeable USB-C cable.Up to 3 devices can be connected simultaneously, such gaming mice are perfect for multi-device productivity."
      }
    },
    {
      "id": "B079V4PXYD",
      "name": "3DConnexion 3DX-700059 Spacemouse Compact 3D Mouse",
      "ratings": 956,
      "price": "$149.00",
      "image": "https://m.media-amazon.com/images/I/71HBAHa7ChS.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "The space mouse compact was developed to deliver an intuitive, effortless and precise 3D navigation in CAD applications that cannot be experienced by using a standard mouse and keyboard.     Six-degrees-of-freedom (6Dof) sensor - intuitively and precisely navigate digital models or views. Operating system - Windows 10, Windows 8.1, Windows 7 SP1,Apple macOS 10.14, Apple macOS 10.13, Apple macOS 10.12, Apple OS X 10.11, Apple OS X 10.10. Linux Red Hat Enterprise Linux Workstation 4, 5, Linux Novell SUSE Linux 9.3, 10, 11     Each of the space mouse compact's two buttons opens its own 3Dconnexion radial menu. They provide direct access to up to 8 of your favorite application commands.     With its iconic, pure design, the space mouse compact is small enough to fit on every desk while the brushed steel base ensures the device stability for precise 3D navigation.     2-Year manufacturer's warranty",
      "details": {
        "brand": "3Dconnexion",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "USB",
        "color": "Black",
        "ram": "N/A",
        "detail_item": "The space mouse compact was developed to deliver an intuitive, effortless and precise 3D navigation in CAD applications that cannot be experienced by using a standard mouse and keyboard."
      }
    },
    {
      "id": "B0C97CF6K2",
      "name": "Cute Bluetooth Mouse, 2.4 GHz Wireless Mice with USB Receiver for Laptop, iPad, Mac, Silent Cartoon Mouse Suitable for Children and Students (Kerry Bear)",
      "ratings": 376,
      "price": "$14.99",
      "image": "https://m.media-amazon.com/images/I/61kL1e5zG-L.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "❤ [Cute Wireless Mouse] - Our wireless mouse has a variety of cute cartoon pattern designs, suitable for young people and children.     ❤ [Dual Mode Mouse] - Bluetooth & 2.4G dual mode wireless mouse connection switch easily. Bluetooth wireless brings quick response, precise movement, stable connection & smoother tracking. 2.4G wireless transmission provide stable and reliable connection.     ❤ [Silent Wireless Mouse] - Special design, noiseless click sound when pressing buttons, which let you not worry about the mouse sound can disturbing others, especially at library or office.     ❤ [Durable Mouse] - Intelligent power saving, the mouse will automatically be in sleeping mode after 10 minutes inactivity, you can click any button to wake it up. Only 1 piece AA battery is required for power supply (not included in the package).     ❤ [Universal Compatibility Mouse] - FMOUSE M101 Mouse, with wireless receiver and Bluetooth inside, connect the mouse easily to your MacBook, iPad, Laptop or any Desktop devices, Mouse wireless well compatible with Windows, MacOS, iPadOS & Android.",
      "details": {
        "brand": "FMOUSE",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "Wireless, Bluetooth, USB",
        "color": "Kerry Bear",
        "ram": "N/A",
        "detail_item": "❤ [Cute Wireless Mouse] - Our wireless mouse has a variety of cute cartoon pattern designs, suitable for young people and children."
      }
    },
    {
      "id": "B09CD1G6G6",
      "name": "VEGCOO Wireless Gaming Mouse, C23 Silent Click Wireless Rechargeable Mouse with Colorful LED Lights and 3 Level DPI 400mah Lithium Battery for Laptop and Computer (Black)",
      "ratings": 587,
      "price": "$15.99",
      "image": "https://m.media-amazon.com/images/I/71TmHxBNc6L.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "【Lightweight Honeycomb Shell】The stylish honeycomb shell design makes the wireless gaming mouse lightweight and convenient, and it is shockproof. It also helps with air circulation, bringing all mouse grips a pleasant, cool and comfortable feel that keeps sweaty hands from disturbing you. Take your gaming experience to the next level!     【Chroma RGB Light】The red button under the wireless rechargeable mouse allows you to freely switch between 5 light modes, including no light/colorful light/streamer light/rainbow light/breathing light, choose a series of vibrant colors to personalize you game settings and match your play style. Become the ultimate trendsetter in gaming operations.     【Wireless & Rechargeable】Our cellular mouse adopts 2.4G wireless technology and built-in 500mAh rechargeable battery, which provides stable connection and accurate tracking. No input lag and interference within 10 meters, fast charging, long battery life.     【Adjustable DPI & Silent Click】DPI 800/1600/3200 three levels available, easy to adjust and switch. The left and right buttons of the RGB mouse are designed to click silently, so you don't have to worry about disturbing your family when you're gaming or working at night.     【Ergonomic Mouse】The symmetrical and ergonomically designed PC gaming mouse is suitable for both left and right hands. This sleek PC gaming mouse features pleasing materials that fit perfectly in your grip, ensuring smooth, comfortable operation.",
      "details": {
        "brand": "VEGCOO",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "USB",
        "color": "black",
        "ram": "N/A",
        "detail_item": "【Lightweight Honeycomb Shell】The stylish honeycomb shell design makes the wireless gaming mouse lightweight and convenient, and it is shockproof. It also helps with air circulation, bringing all mouse grips a pleasant, cool and comfortable feel that keeps sweaty hands from disturbing you. Take your gaming experience to the next level!"
      }
    },
    {
      "id": "0783231172",
      "name": "Mouse Hunt",
      "ratings": 3.234,
      "price": "$11.98",
      "image": "https://m.media-amazon.com/images/I/41T5rgfEbnL._SX300_SY300_QL70_FMwebp_.jpg",
      "description": "",
      "details": {
        "brand": "N/A",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "N/A"
      }
    },
    {
      "id": "B092CGJ1S5",
      "name": "Logitech G502 X Plus Lightspeed Wireless Optical Mouse - LIGHTFORCE hybrid switches, LIGHTSYNC RGB, HERO 25K gaming sensor, compatible with PC - macOS/Windows - White",
      "ratings": 2.798,
      "price": "$124.99",
      "image": "https://m.media-amazon.com/images/I/61LaIVlVOwL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Icon reinvented: From the legacy of Logitech’s most popular G502 design, G502 X PLUS is reimagined and redesigned with the latest innovations in gaming technology; available in black and white     LIGHTFORCE switches: All-new hybrid optical-mechanical switch technology for incredible speed and reliability, as well as precise actuation with crisp response, for hours of performance gaming     LIGHTSYNC RGB: This RGB gaming mouse features glowing 8-LED lighting that’s customisable and adapts as you game with startup/power-down effects and battery optimisation through active play detection     LIGHTSPEED wireless: This wireless mouse features pro-grade connectivity, with an updated protocol achieving 68 per cent faster response rate than the previous generation and improved reliability     HERO 25K gaming sensor: Incredibly precise down to the sub-micron for high-precision accuracy with zero smoothing/filtering/acceleration for high gaming performance every time on the computer     Redesigned DPI-shift button: This cordless optical gaming mouse features a reversible and removable DPI-shift button for precise customisation depending on your grip and preference     Redesigned dual-mode scroll wheel: Switch between hyper-fast free spin and precise ratcheting mode, and tilt left and right for two additional personalisable controls     POWERPLAY compatible: G502 X PLUS wireless PC gaming mouse stays charged, at rest and at play, with our unique wireless charging solution (sold separately)",
      "details": {
        "brand": "Logitech G",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "Wireless, USB",
        "color": "White",
        "ram": "N/A",
        "detail_item": "Icon reinvented: From the legacy of Logitech’s most popular G502 design, G502 X PLUS is reimagined and redesigned with the latest innovations in gaming technology; available in black and white"
      }
    },
    {
      "id": "B0BYJ7N7LX",
      "name": "SM600 White Wireless Gaming Mouse,8000 DPI Tri-Modes BT5.1/Type-C Wired/2.4G Wireless Mouse with 2 Side Buttons, Programmable Macro Gamer Mouse with RGB Light for Laptop/PC/Mac",
      "ratings": 1.256,
      "price": "$26.89",
      "image": "https://m.media-amazon.com/images/I/61nDTw3ZemL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "3 Mode Connection.SM600 wireless gaming mouse adopts tri-mode connection,2.4G wireless /2 BT5.1/Type-C Wired connection.Users can save 4 devices same time,support PC, laptop, tablet, mobile phone, etc. Switch convenientand connection quick!     Customized &Macro Proqram.SM600 gaming mouse with 7 programmable buttons. Users through the software to set the mouse buttons, DPl, mode, lighting effects, etc.SM600 Custom mouse greatly meets the DIY needs of game enthusiasts!     Adjustable DPI & Rechargeable Battery.SM600 wireless mouse can be adjusted within 6 levels dpi(8000-4000-2400-1600-1200-800).Rate of return up to 1000Hz,even in intense games, achieve zero latency and no frame skipping! Built-in 600 mA lithium battery,with USB-C charqing cable,Low battery indicator will remind user to charge it with flashing redlight.it also supported recharged while charging!     Lightweight & Honeycomb Shell.SM600 honeycomb mouse made of high quality.ABS material and designed with ergonomic hollow shell,Ergonomic Design reduce the weight and make the mouse more flexible and easier to be used for a long time without fatigue,and also enhance the heat dissipation features very comfortable to use.     14 RGB Rainbow Backlight.SM600 has beautiful RGB rainbow backlight. This wireless mouse is equipped with RGB lighting effects. Press the top button to switch light modes (rainbow light/Monochrome light/light off)!! Very cool lights especially when useing in the dark!",
      "details": {
        "brand": "SOLAKAKA",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "Bluetooth",
        "color": "white",
        "ram": "N/A",
        "detail_item": "3 Mode Connection.SM600 wireless gaming mouse adopts tri-mode connection,2.4G wireless /2 BT5.1/Type-C Wired connection.Users can save 4 devices same time,support PC, laptop, tablet, mobile phone, etc. Switch convenientand connection quick!"
      }
    },
    {
      "id": "B088NDL2G1",
      "name": "【Upgrade】 LED Wireless Mouse, Slim Silent Mouse 2.4G Portable Mobile Optical Office Mouse with USB & Type-c Receiver, 3 Adjustable DPI Levels for Notebook, PC, Laptop, Computer, MacBook (Black)",
      "ratings": 52.042,
      "price": "$9.99",
      "image": "https://m.media-amazon.com/images/I/61L5QT+J39L._AC_SY300_SX300_.jpg",
      "description": "【LED Design】The upgraded version mouse with the LED lights adds more fun to the boring office life. The bottom of the mouse has a switch, you can switch lights freely. Low-key or sparkle, switch in one second, suitable for any occasion.     【Rechargeable Optical Mouse】Built-in durable rechargeable battery, it can be easily charged using the included USB cable without replacing the battery. Just 2 hours charging, you can use it about 7-15 days. Standby time is very long, energy-saving features, automatic sleep mode and wake-up mode are installed to save energy. Turn off the mouse LED light when not in use to save power.     【Plug and Play】No need to install any driver, just plug the USB receiver into your laptop will the mouse start to serve. 2.4GHz wireless technology provides powerful and reliable connection, effective up to 10 meters of range. Advanced optical tracking technology with fast click and responsiveness. 3-Level adjustable DPI (800/1200/1600 DPI), freely to satisfy daily work. Equipped with USB-C to USB adapter, let you worry-free use of any device.     【Mute Click & Comfortable Hand-feeling】Silent click Mouse with classic design with anti-fingerprint finish offers your hand maximum support and comfort. Silent button reduces 90% noises, which makes it an ideal wireless mouse for office, conference room, cafe, library, bedroom, help you concentrate on your work, study without disturbing others besides you. Ultra-thin, ergonomic design, lightweight and convenient for carrying or traveling.     【Wide Compatibility】Well compatible with Windows XP, Vista, 7, 8, and 10 / Windows Vista / Windows Vista/ Windows ME etc, Fits for desktop, laptop, PC, Macbook and other devices. Please Note: If your laptop just with type-c port, You need connect the supplied USB-C to USB adapter to your laptop and plug the USB receiver in to it.",
      "details": {
        "brand": "OKIMO",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "USB",
        "color": "Black",
        "ram": "N/A",
        "detail_item": "【LED Design】The upgraded version mouse with the LED lights adds more fun to the boring office life. The bottom of the mouse has a switch, you can switch lights freely. Low-key or sparkle, switch in one second, suitable for any occasion."
      }
    },
    {
      "id": "B07QYSSB9R",
      "name": "TECKNET Wireless Mouse for Laptop, 2.4G Wireless Computer Mouse, 5-Level Adjustable 4800 DPI, Silent Mouse with Receiver & 6 Buttons, 18 Months Battery Life, USB Portable Mouse for Mac, Chromebook",
      "ratings": 2.402,
      "price": "$9.99",
      "image": "https://m.media-amazon.com/images/I/61ClHH24oWL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "5 Adjustable DPI & Plug and Play: Wireless mouse for laptop with 5 levels adjustable DPI - 4800/2000/1600/1200/800, easily change the cursor sensitivity depending on your need; Plug and Play - No need for a driver, and you can plug and play the Wireless mouse for laptop directly; NOTE: USB Nano Receiver stored within the back of the wireless computer mouse.     Strong, Durable, Silent & Long Working Range: The wireless mouse for laptop passes the 10,000,000 times keystroke test to guarantee extra durability, The wireless computer mouse's silent button allows you to work in a quiet environment without worrying about disturbing others; Wireless mouse for laptop with 2.4GHz wireless technology ensures a longer working range reaching up to 10 meters (33ft).     Long Battery Life & Extremely Low Power Consumption: The silent mouse has an 18-month long battery life (battery not included), with an auto power-off function to save power, the silent mouse will enter sleep mode in a few minutes of inactivity. Press any button to wake it up. Note: The wireless mouse for laptop is powered by 1x AA batteries (not included).     Unique TruWave & CoLink Technology: TruWave - provides precise, smart cursor control on many surface types to wireless mouse for laptop; CoLink - once the wireless computer mouse is paired there’s no need to re-establish pairing after a signal loss or shutdown.     Wide Compatibility & Low Power Warning: The wireless mouse for laptop can be well-compatible with Windows 11/10/8/7/XP, Vista 7/8 and Linux, etc. Fits desktops, laptops, PC, Macbooks, and other devices; and the LED battery indicator warns you if the battery is running low.     36 Months Support: If you encounter any problems in using the product, please feel free to contact our professional customer service team, enjoying TECKNET 36 Months Warranty (Registered Only)",
      "details": {
        "brand": "TECKNET",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "Wireless, 2.4G USB Receiver",
        "color": "Grey",
        "ram": "N/A",
        "detail_item": "5 Adjustable DPI & Plug and Play: Wireless mouse for laptop with 5 levels adjustable DPI - 4800/2000/1600/1200/800, easily change the cursor sensitivity depending on your need; Plug and Play - No need for a driver, and you can plug and play the Wireless mouse for laptop directly; NOTE: USB Nano Receiver stored within the back of the wireless computer mouse."
      }
    },
    {
      "id": "B09KG6JJ4H",
      "name": "Unipows Wireless Mouse - 2.4G Slim Portable Computer Mouse with Nano Receiver, Less Noise Mobile Optical Mice for Notebook, PC, Laptop, Desktop (Gradient Mint Green)",
      "ratings": 3.027,
      "price": "$9.99",
      "image": "https://m.media-amazon.com/images/I/61QPJBSW1PL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "2.4GHz Stable Wireless Connection - A tiny wireless receiver (stored in back of the mouse) provides stronger anti-interference ability, faster transmission speed and more reliable connection up to 15m (49 feet), without any hassle of additional wire and driver. Just plug and play.     Portable and Noiseless - Stow the USB receiver inside the wireless mouse when not in use. Take it to anywhere like home, office, coffee shop, etc. Responsive buttons provide soft click with less noise.     Enduring Quality & Power Saving - High DPI Movement resolution allows the mouse to track on nearly any surface. Rated to 5 million comfortable clicks. Turn into sleep mode in 8 minutes of inactivity for energy saving, easily activated by clicking any button. 1 AA Battery (NOT Included) is needed for this mouse.     Ergonomic Shape & Impressive Color - Slim ergonomic design and smooth sleek surface for an incredible user experience. Unique gradient pink to purple show your difference and romance.     Wide Compatibility - Work with Windows XP, Windows Vista, Windows 7, Mac OS X 10.4 etc. NOTE: This product is connected by USB receiver, and is NOT compatible with macbook pro or other laptops which don’t come with USB ports.",
      "details": {
        "brand": "Unipows",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "USB",
        "color": "Gradient Mint Green",
        "ram": "N/A",
        "detail_item": "2.4GHz Stable Wireless Connection - A tiny wireless receiver (stored in back of the mouse) provides stronger anti-interference ability, faster transmission speed and more reliable connection up to 15m (49 feet), without any hassle of additional wire and driver. Just plug and play."
      }
    },
    {
      "id": "B0BZY54XX6",
      "name": "Wireless Mouse,Rechargeable Mouse Wireless 2.4G USB(Battery Level Visible) Ergonomic Computer Mouse,3 Levels DPI,Silent Wireless Mice for Laptop PC Computer(Black)",
      "ratings": 3.7,
      "price": "$12.99",
      "image": "https://m.media-amazon.com/images/I/51pn-LrKPjL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Enhanced Rechargeable Mouse: Upgrade with the battery indicator,clearly display the power source.this wireless mouse can be easily recharged for a long-lasting performance,No more worrying about replacing batteries     Ergonomic Design: this laptop mouse offers you a comfortable grip and a tranquil environment, reducing your fatigue and disturbance and improving your productivity and enjoyment.Our silent mouse is designed to fit comfortably in your hand and reduce hand fatigue     2.4GHz Wireless Connection: This cordless mouse provides stable and reliable wireless connetion,ensures efficient and smooth performance with minimal interference.connectivity up to 10 M away, allowing you to work or play without the hassle of cords     Easy to use&Silent click: Plug and play, The mouse features a silent click function that allows you to work discreetly without disturbing those around you.(Note：The USB receiver is stored on the bottom of the mouse.)     Wide Compatibility & Worry free service: This rechargeable mouse is compatible with almost devices with USB ports and most operating systems such as Windows 10/8/7/XP, Vista Linux and Mac OS. enjoys forty-five-day refund and twelve-month replacement policy",
      "details": {
        "brand": "Uineer",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "2.4GHz Wireless",
        "color": "Black",
        "ram": "N/A",
        "detail_item": "Enhanced Rechargeable Mouse: Upgrade with the battery indicator,clearly display the power source.this wireless mouse can be easily recharged for a long-lasting performance,No more worrying about replacing batteries"
      }
    },
    {
      "id": "B09DY2T2NZ",
      "name": "ECHTPower Wireless Bluetooth Mouse, Ergonomic Mouse with LED Light, Tri-Mode BT5.0+BT5.0+2.4GHz, Vertical Mouse Adjustable DPI 2400/1600/1000, Rechargeable Mice for PC, Laptop, Mac, Windows",
      "ratings": 7.507,
      "price": "$25.99",
      "image": "https://m.media-amazon.com/images/I/61Nn8OwzLcL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "【Ergonomic Wireless Mouse】The ergonomic wireless mouse with a vertical design fits the natural curve of your right hand, the reasonable size，which efficiently reduces wrist discomfort from prolonged usage. This makes using the ergonomic wireless mouse more natural and pleasant.     [3 in 1 Bluetooth Mouse] Enjoy versatility with 3 connection modes: BT 5.0/BT 5.0 and 2.4GHz. Seamlessly switch 【3 in 1 Bluetooth Mouse】Enjoy versatility with 3 connection modes: BT 5.0/BT 5.0 and 2.4GHz. Seamlessly switch between devices with the mode switch button, allowing you to connect to 3 devices. The vertical mouse may significantly increase your productivity at work.     【High-Capacity & Rechargeable Battery】Equipped with a 700Ah large-capacity rechargeable battery, our wireless ergonomic mouse provides up to 120 hours of continuous use on a single charge. You may use the wireless mouse by inserting the USB receiver into the device while the vertical mouse is charging. Thus, even when the laptop mouse is charging, you may use it. Spare you the hassle of constantly changing batteries.     【Strong Compatibility】Compatible with Windows XP/Vista/7/8/10/11/Linux and MacOS X (Note: forward/back buttons unavailable in Mac OS X). Suitable for PCs, laptops, computers, Macbooks, and other devices. Our wireless ergonomic mouse undergoes rigorous testing with 3 million button clicks, ensuring durable and reliable quality.     【High Precision & Adjustable DPI】Customizing the wireless ergonomic mouse to your preferences.Easily adjust sensitivity with 1000/1600/2400 DPI levels. When visiting websites, the advanced \"Page Back\" and \"Page Forward\" functionality buttons are convenient. Note: Please remove the blue plastic film on the slip mat before using.",
      "details": {
        "brand": "ECHTPower",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "Bluetooth, USB",
        "color": "Bluetooth+2.4GHz Wireless Mouse",
        "ram": "N/A",
        "detail_item": "【Ergonomic Wireless Mouse】The ergonomic wireless mouse with a vertical design fits the natural curve of your right hand, the reasonable size，which efficiently reduces wrist discomfort from prolonged usage. This makes using the ergonomic wireless mouse more natural and pleasant."
      }
    },
    {
      "id": "B08D6VD9TR",
      "name": "Lenovo 530 Full Size Wireless Computer Mouse for PC, Laptop, Computer with Windows - 2.4 GHz Nano USB Receiver - Ambidextrous Design - 12 Months Battery Life - Graphite Grey",
      "ratings": 1.945,
      "price": "$11.99",
      "image": "https://m.media-amazon.com/images/I/51Tg7aco-BL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Reliable Wireless Connectivity: The Lenovo 530 Wireless Mouse offers a dependable connection no matter where you are. Its advanced nano USB receiver utilizes robust 2.4 GHz wireless technology, ensuring seamless performance without the hassle of cords. Stay productive and focused without the constraints of wired setups.     Precision Tracking at Your Fingertips: Elevate your user experience with the 1200 DPI resolution optical sensor featured in this wireless mouse. Experience responsive and clear tracking that enhances your navigation, whether you're browsing the web, creating presentations, or engaging in detailed design work. Precision is now at your fingertips.     Durability That Lasts: With the Lenovo 530 Wireless Mouse, longevity is a guarantee. Boasting a remarkable lifespan of up to 8 million clicks for both left and right buttons, this mouse is built to withstand the rigors of daily use. Enjoy reliable performance for years to come, making it an ideal companion for your computing tasks.     Ergonomic Comfort for Extended Use: Experience unparalleled comfort during long work sessions with the unique and contoured design of the Lenovo 530 Wireless Mouse. Crafted for maximum ergonomics, this mouse fits perfectly in your hand, ensuring all-day comfort. The durable soft touch finish adds a premium feel to your interactions, making productivity a breeze.     Versatility and Portability: Whether you're left-handed or right-handed, the Lenovo 530 Wireless Mouse accommodates your preference. Its ambidextrous design ensures functionality and comfort for all users. Weighing just 65g (2.29 oz), it's the ultimate travel companion. Slip it into your laptop bag or pocket and enjoy its lightweight portability wherever you go. Plus, with an impressive battery life of up to 12 months (actual duration may vary based on usage), you can confidently use it without worrying about frequent recharges. Choose the Lenovo 530 Wireless Mouse for unparalleled performance, comfort, and convenience.",
      "details": {
        "brand": "Lenovo",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "Bluetooth",
        "color": "Graphite Grey",
        "ram": "N/A",
        "detail_item": "Reliable Wireless Connectivity: The Lenovo 530 Wireless Mouse offers a dependable connection no matter where you are. Its advanced nano USB receiver utilizes robust 2.4 GHz wireless technology, ensuring seamless performance without the hassle of cords. Stay productive and focused without the constraints of wired setups."
      }
    },
    {
      "id": "B077TRZG6C",
      "name": "VEGCOO C10 Wireless Gaming Mouse Rechargeable Silent Optical Mice 7 Colors LED Lights, 7 Buttons 2400/1600/800DPI (Black)",
      "ratings": 5.509,
      "price": "$14.99",
      "image": "https://m.media-amazon.com/images/I/61yvaHfrqDL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Amazing LED Light: Our wireless gaming mouse can randomly change color into 7 different color schemes, creating amazing feelings for gaming or working. The light up mouse has a soft light that is not distracting when using it.Lights can be turned off if not needed.     Stable and Accurate Tracking: Our RGB wireless mouse provides a stable connection between the USB receiver and computer via 2. 4GHz wireless technology. The wireless RGB mouse comes with a sensitive optical sensor that provides precise and free movement.     Silent Clicking: We are not only a computer mouse for office, but also a silent gaming mouse, the left and right buttons are silent to protect you from harsh clicking noises. You can enjoy leisure or work time without disturbing others around you.     Environmentally friendly battery: The gaming mouse wireless usb has a built-in 600mAh lithium rechargeable battery, which is rechargeable. Equipped with a USB port charging cable, you can also use the mouse while charging. With the rechargeble gaming mouse wireless, you don't have to worry about the mouse running out of battery anymore.     Comfortable Feel:wireless mouse for laptop with natural curve design, comfortable material and medium size keeps your hands in good shape. The shortcut thumb side button realizes the function of turning pages forward and backward, allowing you to turn pages freely.",
      "details": {
        "brand": "VEGCOO",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "USB",
        "color": "black",
        "ram": "N/A",
        "detail_item": "Amazing LED Light: Our wireless gaming mouse can randomly change color into 7 different color schemes, creating amazing feelings for gaming or working. The light up mouse has a soft light that is not distracting when using it.Lights can be turned off if not needed."
      }
    }
  ]
}