{
  "totalProducts": 83,
  "products": [
    {
      "id": "B0C5Y4DDBP",
      "name": "Gatorade Gx Stainless Steel Bottle, 32oz",
      "ratings": 193,
      "price": "$50.24",
      "image": "https://m.media-amazon.com/images/I/51SXaXH5IEL.__AC_SY300_SX300_QL70_FMwebp_.jpg",
      "description": "Gatorade Gx Stainless Steel Bottle, White, 32oz     Gatorade’s Stainless Steel Bottle is BPA-free with double-wall, vacuum-insulation that keeps drinks cold for hours     The drink-thru cap design lets you open and close the cap with a quick twist     Compatible with Gatorade powders and tablets     Ideal for Pre, during, and post workouts or games     Reusable",
      "details": {
        "brand": "Gatorade",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "White",
        "ram": "N/A",
        "detail_item": "Gatorade Gx Stainless Steel Bottle, White, 32oz"
      }
    },
    {
      "id": "B0BC2Q97K8",
      "name": "CHIPS AHOY! Original Chocolate Chip Cookies, 20 Snack Packs (2 Cookies Per Pack)",
      "ratings": 32.665,
      "price": "$14.14",
      "image": "https://m.media-amazon.com/images/I/51e+t80epkL._SY300_SX300_.jpg",
      "description": "Includes twenty 20 snack packs of CHIPS AHOY! Original Chocolate Chip Cookies (packaging may vary)     Two full-size original CHIPS AHOY! chocolate chip cookies in each convenient snack pack     Crispy chocolate chip cookies baked to have the perfect amount of crunch and loaded with real chocolate chips     Kosher cookies make delicious lunch snacks, office snacks, ice cream toppers and party favors     Individually wrapped packs make these great for snacking, sharing and on-the-go",
      "details": {
        "brand": "Chips Ahoy!",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "Includes twenty 20 snack packs of CHIPS AHOY! Original Chocolate Chip Cookies (packaging may vary)"
      }
    },
    {
      "id": "B0C35Z66QV",
      "name": "Gain + Aroma Boost Laundry Detergent Liquid, Original Scent, 107 Loads, 154 fl oz, HE Compatible Laundry Soap with Febreze and Oxi",
      "ratings": 104.046,
      "price": "$9.99",
      "image": "https://m.media-amazon.com/images/I/71YC69VHFBL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Gain + Aroma Boost Liquid Laundry Detergent lifts away dirt and locks in an amazing scent to keep your laundry smelling excellent—even after six weeks* *From wash until wear     Gain Laundry Detergent offers a crisp, clean, original scent that is classic for a reason     Gain Laundry Detergent soap smells great because it cleans great: Gain Laundry Detergent Liquid uses the cleaning power of Oxi Boost and the odor-removal properties of Febreze in one laundry soap     Laundry detergent liquid works in regular washers and high-efficiency washers—even in cold water     Includes one 154 fl oz bottle of Gain + Aroma Boost Laundry Detergent Liquid, Original scent—enough for 107 loads",
      "details": {
        "brand": "Gain",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "Gain + Aroma Boost Liquid Laundry Detergent lifts away dirt and locks in an amazing scent to keep your laundry smelling excellent—even after six weeks* *From wash until wear"
      }
    },
    {
      "id": "B07Y972SSM",
      "name": "Mary Kitchen Hash Corned Beef Hash 14 oz (8 Pack)",
      "ratings": 8.97,
      "price": "$137.97",
      "image": "https://m.media-amazon.com/images/I/51G8yESlLZL._SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Includes an 8 pack of HORMEL MARY KITCHEN Corned Beef Hash, America's selling hash (Based on latest 52 week IRI data.)     With 17 grams of protein per serving, this corned beef hash makes the perfect addition to recipes like egg muffins, potatoes, and more     Fry up this corned beef hash to create a crisp and crunchy taste     Made from a mix of tender corned beef chunks, diced potatoes, and savory seasonings, you can bring that classic restaurant taste of corned beef hash to your home     For over 65 years, HORMEL MARY KITCHEN has been delivering quality food and great taste",
      "details": {
        "brand": "Mary Kitchen",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "Includes an 8 pack of HORMEL MARY KITCHEN Corned Beef Hash, America's selling hash (Based on latest 52 week IRI data.)"
      }
    },
    {
      "id": "B00BHIRVZ6",
      "name": "DEL MONTE FRESH CUT Canned Beets Sliced, Canned Vegetables, 12 Pack, 8.25 oz Can",
      "ratings": 1.831,
      "price": "$18.37",
      "image": "https://m.media-amazon.com/images/I/61V2EGibWTL._SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Twelve 8.25 oz cans of DEL MONTE FRESH CUT Sliced Beets     Canned vegetables offer a quick side dish or recipe addition     Beets canned with only water, sugar and sea salt     Non-GMO* beets with no artificial flavors or preservatives     Warm and serve canned beets sliced on their own or add to your favorite meals",
      "details": {
        "brand": "Del Monte",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "Twelve 8.25 oz cans of DEL MONTE FRESH CUT Sliced Beets"
      }
    },
    {
      "id": "1601061935",
      "name": "Knock Knock All Out Of Grocery List Note Pad, 6 x 9-inches (Blue)",
      "ratings": 12.081,
      "price": "$10.50",
      "image": "https://m.media-amazon.com/images/I/81ByaXDTX0L.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Stick This Bestselling Magnetic Shopping List Notepad On Your Fridge And Check Off Depleted Items As You Run Out, Then Replenish With Ease And Certainty When Next You Shop     6 X 9-Inch, 60 Sheet Notepad With Magnet On Back     Country Of Origin :China     Never Forget The Milk Again With The Perfect Grocery List Pad",
      "details": {
        "brand": "Knock Knock",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "All Out of (Blue / Original)",
        "ram": "N/A",
        "detail_item": "Stick This Bestselling Magnetic Shopping List Notepad On Your Fridge And Check Off Depleted Items As You Run Out, Then Replenish With Ease And Certainty When Next You Shop"
      }
    },
    {
      "id": "B00QJ9PBBY",
      "name": "Sturdy Reusable Grocery Bags Foldable and Washable - Made From RipStop Nylon Hold 50lbs - Designed in USA Reusable Shopping Bags Inside a Compact Pod with Carry Clip - 10 Pack in Blue",
      "ratings": 3.906,
      "price": "$38.49",
      "image": "https://m.media-amazon.com/images/I/71C8GB4HxGL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "MADE of RIPSTOP NYLON: Reinforced weaving pattern provides exceptional strength and tear resistance. BagPodz RipStop Nylon shopping bags can hold up to 50 lbs and withstand conditions that would easily tear polyester apart.     SIMPLE to USE & REUSE: All the shopping cart bags for groceries needed for an entire shopping trip in one compact and convenient ‘pod’. The grocery bags easily come out of the pod one-at-a-time, as needed at checkout. Reloading is just as easy.     CLIP IT to the CART & GO: BagPodz is a portable pod of reusable bags for groceries that conveniently clips to your cart. It eliminates the need for plastic shopping bags.     ULTRA COMPACT & CONVENIENT: BagPodz is small enough to fit in your glove compartment or in your cup holder with its compact pouch. It's on hand anytime you go shopping. Bags are also flat bottomed which makes them very convenient for shopping.     MACHINE WASHABLE: Reusable washable grocery bags and water repellent to contain spills. Each grocery bag is made from 100% Ripstop Nylon and uses Bluesign Certified material for safety and sustainability.",
      "details": {
        "brand": "N/A",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "MADE of RIPSTOP NYLON: Reinforced weaving pattern provides exceptional strength and tear resistance. BagPodz RipStop Nylon shopping bags can hold up to 50 lbs and withstand conditions that would easily tear polyester apart."
      }
    },
    {
      "id": "B00IE76Q7M",
      "name": "Reynolds Kitchens Premium Slow Cooker Liners - 13 x 21 Inch, 6 Count",
      "ratings": 60.439,
      "price": "$3.48",
      "image": "https://m.media-amazon.com/images/I/41yTd6+03lS._SY300_SX300_.jpg",
      "description": "SLOW COOKER LINERS—This package contains six Reynolds Kitchens Slow Cooker Liners, each measuring 13 x 21 inches to fit 3- to 8-quart round and oval slow cookers     EASY CLEANUP—These strong, reliable slow cooker bags shorten your slow cooker cleanup to eight seconds or less, guaranteed     NO SOAKING OR SCRUBBING—Line your slow cooker with these slow cooker bags to prevent stubborn, stuck-on messes     BPA-FREE & SAFE FOR HIGH TEMPS—Each slow cooker bag is made with a BPA-free nylon-blend construction that’s safe for low, medium & high settings     MAKE MEALS EASY—Use a Reynolds slow cooker liner next time you make chili, pulled pork, pot roasts, soups & more to spend less time scrubbing & more time with your loved ones",
      "details": {
        "brand": "Reynolds",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "clear",
        "ram": "N/A",
        "detail_item": "SLOW COOKER LINERS—This package contains six Reynolds Kitchens Slow Cooker Liners, each measuring 13 x 21 inches to fit 3- to 8-quart round and oval slow cookers"
      }
    },
    {
      "id": "B0035LCFNQ",
      "name": "Duracell Coppertop AA Batteries with Power Boost Ingredients, 24 Count Pack Double A Battery with Long-lasting Power, Alkaline AA Battery for Household and Office Devices",
      "ratings": 82.774,
      "price": "$18.99",
      "image": "https://m.media-amazon.com/images/I/71F1yxjGeYL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "FORMULATED WITH POWER BOOST INGREDIENTS: Duracell Coppertop AA alkaline batteries contain Duracell’s patented POWER BOOST Ingredients which deliver lasting performance in your devices     GUARANTEED FOR 12 YEARS IN STORAGE: Duracell guarantees each Coppertop AA alkaline battery to last 12 years in storage, so you can be confident these batteries will be ready when you need them     DEPENDABLE POWER: Duracell Coppertop AA batteries are made to power everyday devices throughout the home, like TV and gaming remotes, cameras, flashlights, toys, and more     #1 TRUSTED BATTERY BRAND: From storm prep to holiday needs, Duracell is the #1 trusted battery brand for the moments that matter most     QUALITY ASSURANCE: With Duracell batteries, quality is assured; every Duracell product is guaranteed against defects in material and workmanship     Duracell CopperTop batteries are available in Double A (AA), Triple A (AA), C, D and 9V sizes.",
      "details": {
        "brand": "DURACELL",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "FORMULATED WITH POWER BOOST INGREDIENTS: Duracell Coppertop AA alkaline batteries contain Duracell’s patented POWER BOOST Ingredients which deliver lasting performance in your devices"
      }
    },
    {
      "id": "B000EMQF94",
      "name": "Hamburger Helper Salisbury, 6.2 Ounces, 12 per Case.",
      "ratings": 202,
      "price": "$27.36",
      "image": "https://m.media-amazon.com/images/I/51hjzWAEpGL._SX300_SY300_QL70_FMwebp_.jpg",
      "description": "America’s favorite Hamburger Helper in a delicious Salisbury entree, blending beef and vegetables     Make Hamburger Helper in three easy steps: simply brown beef, stir in ingredients and sauce and simmer     Add your own twist! Visit Hamburger Helper.com for recipes the whole family will love.",
      "details": {
        "brand": "Hamburger Helper",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "America’s favorite Hamburger Helper in a delicious Salisbury entree, blending beef and vegetables"
      }
    },
    {
      "id": "B07WZCS8ZT",
      "name": "Amazon Fresh, Sliced Pears in Pear Juice from Concentrate, 15 Oz (Previously Happy Belly, Packaging May Vary)",
      "ratings": 4.015,
      "price": "$28.99",
      "image": "https://m.media-amazon.com/images/I/41Pjg0L5LXL._SX300_SY300_QL70_FMwebp_.jpg",
      "description": "WHAT'S INSIDE: One 15-ounce can of Sliced Pears in Pear Juice from Concentrate     NEW LOOK: Your favorite Happy Belly products are now part of the Amazon Fresh family! Packaging may vary, but the product and quality you love are exactly the same.     HIGH QUALITY, LOW PRICES: Amazon Fresh brand products are all about high-quality food that fits every budget, every day.     ONLY FROM AMAZON: Look for the Amazon Fresh label to find great deals on a wide selection of grocery essentials.",
      "details": {
        "brand": "Amazon Fresh",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "WHAT'S INSIDE: One 15-ounce can of Sliced Pears in Pear Juice from Concentrate"
      }
    },
    {
      "id": "B00TT3JLQ8",
      "name": "Wolfgang Puck Coffee Jamaican Me Crazy Flavored Coffee Single Serve Cups for Keurig, 24 Count (060731740002)",
      "ratings": 1.417,
      "price": "$149.00",
      "image": "https://m.media-amazon.com/images/I/41ZCTzobxeL._SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Compatible with ALL Keurig K Cups Brewers including the 20 version     A medium roast infused with rich coconut by Wolfgang Puck; Includes 1 box of 24 count.     Single-use mini brewer cups hold the perfect amount of grounds, no need to measure     PLEASE NOTE: DUE TO A RECENT MANUFACTURING CHANGE, \"JAMAICA ME CRAZY\" HAS BEEN CHANGED TO \"JAMAICAN ME CRAZY\". THE COFFEE IS EXACTLY THE SAME, ONLY THE NAME AND GRAPHICAL DESIGN OF THE BRAND ARE DIFFERENT.     Whether you need a morning pick-me-up, or a quick escape to the islands, a delicious cup of Wolfgang Puck Jamaica Me Crazy is the perfect companion K-cups are compatible with all Keurig brewers, and are also compatible with the new Keurig 20",
      "details": {
        "brand": "Wolfgang Puck",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "Compatible with ALL Keurig K Cups Brewers including the 20 version"
      }
    },
    {
      "id": "B00FYR4V5Y",
      "name": "Mott's 100% Original Apple Juice, 8 Fl Oz Bottles, 24 Count (4 Packs Of 6), 2 Servings Of Fruit, 100% Fruit Juice, Gluten-free, Caffeine-free, Kosher, Contains No Artificial Colors Or Sweeteners",
      "ratings": 11.612,
      "price": "$49.99",
      "image": "https://m.media-amazon.com/images/I/41rtmA2VTyS._SX300_SY300_QL70_FMwebp_.jpg",
      "description": "One 6-pack of 8 fluid ounce bottles     100% apple juice     2 servings of fruit in each bottle 8 fl oz bottle     No added sugar and an excellent source of vitamin C",
      "details": {
        "brand": "Mott's",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "One 6-pack of 8 fluid ounce bottles"
      }
    },
    {
      "id": "B00G2XNSWQ",
      "name": "Nutella & GO! Bulk 12 Pack, Hazelnut and Cocoa Spread with Breadsticks, Stocking Stuffers, Snack Cups, 1.8 oz Each​",
      "ratings": 5.946,
      "price": "$25.99",
      "image": "https://m.media-amazon.com/images/I/515NEWgO0DL._SX300_SY300_QL70_FMwebp_.jpg",
      "description": "NUTELLA HAZELNUT SNACK CUP: Discover the Original Hazelnut Spread in a fun and convenient snack cup with breadsticks that's perfect anytime, anywhere. Dip into wow with this 12-pack of Nutella & GO!     DISCOVER DELICIOUSNESS: Each snack cup of Nutella contains the irresistibly creamy taste of the hazelnut spread with cocoa that you know and love, plus a serving of crispy breadsticks     DIP INTO WOW: Nutella & GO! is the playful way to enjoy the sweet and salty snacking combination of hazelnut and cocoa with crispy breadsticks or pretzels, all while on the go or at home     WAYS TO SHARE: Nutella lets you share in special moments together with a variety of packaging sizes, so no matter if you need a little, a lot, or just want it for on the go, there's a Nutella for you     ON-THE-GO SNACKS: Dip into delicious and enjoy your favorite hazelnut spread with breadsticks whether commuting, road-tripping or traveling across town. The perfect snack for kids, Nutella & GO! makes a great lunchbox or after-school snack     HOLIDAY CHEER IN A SNACK CUP: Dip into yum and bring smiles to the season with these holiday Christmas treats that make great stocking stuffers for kids​",
      "details": {
        "brand": "Nutella",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "NUTELLA HAZELNUT SNACK CUP: Discover the Original Hazelnut Spread in a fun and convenient snack cup with breadsticks that's perfect anytime, anywhere. Dip into wow with this 12-pack of Nutella & GO!"
      }
    },
    {
      "id": "B006BHRV1W",
      "name": "Nature’s Bakery Whole Wheat Fig Bars, Original Fig, Real Fruit, Vegan, Non-GMO, Snack bar, 1 box with 12 twin packs (12 twin packs)",
      "ratings": 53.606,
      "price": "$19.99",
      "image": "https://m.media-amazon.com/images/I/41CA1dxMvML._SX300_SY300_QL70_FMwebp_.jpg",
      "description": "WE “HEART FIGS!” Our Whole Wheat Fig Bars are always an excellent choice for families on-the-go in search of a wholesome win-win: convenience and nutrition, all in one     CONVENIENCE Nature’s Bakery Whole Wheat Figs Bars are a perfect snack for kids or adults. Grab one as a quick healthy breakfast bar, use as a wholesome treat for kids’ lunches, or enjoy as a convenient afterschool snack. Great for active and busy families     NUTRITION Made with you and your family in mind, Nature's Bakery Whole Wheat Fig Bars are soft-baked with NO cholesterol, GMOs or high fructose corn syrup. No Artificial Flavors, Certified Vegan, Plant Based, Kosher, Made in a Nut-Free Facility, Low Sodium, Soy Free, Dairy Free, and 0g Trans Fat     THOUGHTFUL INGREDIENTS Real, sun-ripened figs and wholesome whole wheat make our homemade recipe the perfect boost in your everyday     SIZE Contains 1 Box of 12 twin packs (12 Twin Packs; 2 x 1 oz. snack bars per twin pack) of Nature's Bakery Original Fig Whole Wheat Fig Bars",
      "details": {
        "brand": "Nature's Bakery",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "WE “HEART FIGS!” Our Whole Wheat Fig Bars are always an excellent choice for families on-the-go in search of a wholesome win-win: convenience and nutrition, all in one"
      }
    },
    {
      "id": "B01LB1J9BW",
      "name": "Folgers Classic Roast Instant Coffee, 8 Ounces",
      "ratings": 22.328,
      "price": "$30.25",
      "image": "https://m.media-amazon.com/images/I/41fCxMLEaaL._SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Contains one (1) 8-ounce jar of Folgers instant coffee     The classic Folgers taste you love in instant coffee form     Just add water or milk and stir     Enjoy hot or iced     Proudly roasted in New Orleans",
      "details": {
        "brand": "Folgers",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "Contains one (1) 8-ounce jar of Folgers instant coffee"
      }
    },
    {
      "id": "B09H3TKQXS",
      "name": "Kauai Coffee Coconut Caramel Crunch Medium Roast - Ground Coffee, 24 oz Package",
      "ratings": 21.974,
      "price": "$24.95",
      "image": "https://m.media-amazon.com/images/I/418ebZlhSFL._SX300_SY300_QL70_FMwebp_.jpg",
      "description": "COCONUT CARAMEL CRUNCH MEDIUM ROAST - Taste the unique combination of tropical coconut and sweet caramel     10% HAWAIIAN ORIGIN COFFEE - Taste Paradise One Cup at a Time with our Hawaiian coffee     GROUND COFFEE BEANS – Our Roast Masters use premium beans to capture the easygoing character and subtle nuances that distinguish our ground Kauai coffee; 24 oz package     ARABICA COFFEE - The ground coffee in medium roast has a smooth taste with no bitterness     KAUAI COFFEE COMPANY ESTATE - Hawaii’s largest coffee estate is open year-round offering farm tours and coffee tastings",
      "details": {
        "brand": "Kauai Coffee",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "COCONUT CARAMEL CRUNCH MEDIUM ROAST - Taste the unique combination of tropical coconut and sweet caramel"
      }
    },
    {
      "id": "B0CS3DTNKB",
      "name": "VENO 4 Pack Reusable Grocery Bags and Shopping Bags with Handles and Hard Bottom with Compact Convenience Size. Foldable, Durable, Heavy Duty Utility Tote - Perfect for Shopping Cart (Gray, 4 Pack)",
      "ratings": 78,
      "price": "$17.99",
      "image": "https://m.media-amazon.com/images/I/81eaRuqGqhL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "PP Woven     Imported     Stays Upright with Hard Bottom: VENO kitchen reusable grocery bags are engineered with a solid base, ensuring your items stay upright and organized while shopping or transporting, eliminating spills and messes. Place a set of reusable bags in your shopping cart for easy, convenient, and organized shopping and loading!     Convenient Compact Design: The compact size of this reusable grocery bag makes it a perfect fit for transporting and carrying, while its utility tote bag design maximizes convenience for any occasion and is ideal for organized, space-saving, and efficient shopping. 12.6” H x 12.6” W x 7.5” D.     Durable Design for Long-Lasting Use: Crafted for durability, our heavy-duty shopping bags with handles are designed to withstand the rigors of daily use, becoming an indispensable grocery bag carrier in your routine. Featuring reinforced poly webbing handles and crafted from durable, sturdy, and water-resistant PP-woven material, these reusable shopping bags for groceries are built to last.     Sustainable and Stylish: Embrace sustainable shopping without sacrificing style; our chic grocery tote bag doubles as a fashionable accessory that complements your conscious lifestyle. Replace plastic bags with VENO reusable grocery totes that minimize waste and maximize style.     Organizational Must-Have: Streamline your shopping with these foldable and collapsible totes with handles, perfect for sorting groceries in the cart and an essential for savvy shoppers and organized kitchens. VENO reusable bags for groceries are a must-have.",
      "details": {
        "brand": "N/A",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "PP Woven"
      }
    },
    {
      "id": "B0D7HMRCJ2",
      "name": "Vegetable Chopper: Pro Food Chopper with Stainless Steel Blade Chopper - Veggie Chopper with Container for Onion Salad Nut Slicer Dicer Cutter - Kitchen Essentials",
      "ratings": 60,
      "price": "$19.99",
      "image": "https://m.media-amazon.com/images/I/61OnzW9Cv2L.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "【Vegetable Chopper Free Your Hands】BestQueen Food Chopper adopts curved “W” blade to enlarge chopping area and chop more evenly; due to the small capacity of the vegetable catch tray, you need to cut the food into 1/2, 1/3, 1/4 pcs, then press the handle to chop, chopping speed is faster than knife     【Easy to Use & Store】Vegetable Cutter is handy and convenient for you to use at anywhere with a flat cutting board; And the size is 3.54*8.93 inch, Weight：270 g; No need to charge, always available; Whether you chop any foods in kitchen or have a picnic outdoors, the food cutter lets you say goodbye to the embarrassment of no electricity at any time     【Multi-functional Chopper】Veggie chopper with container and lid is ideal for garlic press, hard cheeses, nuts, herbs, onions, cilantro, hard boiled eggs, small salads, tuna, pizza toppings, cookies for ice cream toppings and more; Every time you press the veggie cutter, the blade will rotate 24° to cut the vegetable and fruit, so less raw materials can be chopped more finely     【Safe & Durable Material Made】The chopper vegetable cutter is made of high-quality polypropylene, which is durable and almost impossible to break or damage; The blade is made of premium 304 stainless steel, it’s grisp and rustless. Its integral blade guard can protect your fingertips from blade damage when chopping. No need to cry when cutting onions     【Easy to Install & Clean】The onion chopper is easy to disassemble for easy cleanup; Simply finish cleaning under running water in 3 minutes with cleaning scraper, also top dishwasher safe as all parts are detachable; The hand food chopper is kitchen essential and home must-have",
      "details": {
        "brand": "BESTQUEEN",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "Black",
        "ram": "N/A",
        "detail_item": "【Vegetable Chopper Free Your Hands】BestQueen Food Chopper adopts curved “W” blade to enlarge chopping area and chop more evenly; due to the small capacity of the vegetable catch tray, you need to cut the food into 1/2, 1/3, 1/4 pcs, then press the handle to chop, chopping speed is faster than knife"
      }
    },
    {
      "id": "B0BPRMSB9L",
      "name": "2 PACK Green Stainless Steel Onion Slicer Holder, Onion/Egg/Grape/Apple/Lemon/Fruit/Veggie Slicer/Cutter, Kitchen Accessory/Essential",
      "ratings": 84,
      "price": "$9.99",
      "image": "https://m.media-amazon.com/images/I/61Wr7ucggkL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "【Easy To Use】This onion slice can not only stabilize the food, but also slice evenly, so that we can easily grab the food to eat. Don't worry about the injury caused by cutting your finger. It is convenient and fast.     【Excellent Materials】Made of 304 stainless steel,it's easy to clean, perfect for health. Because of the food grade high-quality stainless steel materials,it's durable and not easy to rust or hide dirt.     【Kitchen Soul】The onion holder saves a lot of time for slicing or chopping onions.Onion cutting can be used to fix onions, tomatoes, cooked food, fish or meat holes, convenient and worry free.     【Ergonomic Design】Anti slip handle design makes the stainless steel handle more comfortable to grip.It fits the size of most people's hands.",
      "details": {
        "brand": "SCGFPOE",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "Green",
        "ram": "N/A",
        "detail_item": "【Easy To Use】This onion slice can not only stabilize the food, but also slice evenly, so that we can easily grab the food to eat. Don't worry about the injury caused by cutting your finger. It is convenient and fast."
      }
    },
    {
      "id": "B0DFPXDCKC",
      "name": "FANTEXY Onion Holder for Slicing, Large Onion Cutter for Slicing Stainless Steel Onion Slice Holder, Vegetable Slicer for Tomato, Lemon, Potato, Eggs, Avocados, Vegetables, Fruit, Meat kitchen Gadgets",
      "ratings": 19,
      "price": "$9.98",
      "image": "https://m.media-amazon.com/images/I/71IdDbyP41L.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Best option: This onion holder for slicing will be your best choice when you want fast and safe slicing, even slicing, slicing without getting your hands dirty, no slipping of the chopper when slicing, meat tenderiser, and saving time     Upgraded and enlarged onion cutter for slicing: The improved stainless steel onion slice holder is stronger, resistant, comfortable to hold and won't slip. This onion slicer holder with 12 steel pins can be easily inserted into both large and small ingredients, no more fear that the onion slice holder is too small, which leads to slippage and effort when using! The best gift for cooking beginners, chefs, mums and more     Quality materials: The onion slicer holder is made of food grade stainless steel and plastic, non-toxic and harmless. The sturdy material makes the pin connection strong and not easy to fall off, ensuring your safety when slicing vegetables     Simple to operate & easy to clean: The food slicer can be inserted into food and held in the hand to quickly and evenly slice/chop/dice vegetables, fruits and meats without touching the food and eliminating the need to wash your hands. onion holder for slicing can be rinsed out with clean water and is also dishwasher safe. tomato The slicer tool's compact size makes it easy to carry and store     Multi-purpose kitchen tools: Onion slice holder can be used to slice a variety of vegetables, fruits and meats, such as onions, lemons, cheeses, potatoes, tomatoes, apples, steak, chicken, carrots, eggs, cucumbers, etc. onion cutter slicer also tenderises the meat, and the sharp steel needles penetrate deeper into the meat to improve the texture of it",
      "details": {
        "brand": "FANTEXY",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "Black",
        "ram": "N/A",
        "detail_item": "Best option: This onion holder for slicing will be your best choice when you want fast and safe slicing, even slicing, slicing without getting your hands dirty, no slipping of the chopper when slicing, meat tenderiser, and saving time"
      }
    },
    {
      "id": "B07V5DR9K3",
      "name": "365 by Whole Foods Market, Organic Blueberry Cereal Bar 6 Count, 7.8 Ounce",
      "ratings": 3.949,
      "price": "$10.99",
      "image": "https://m.media-amazon.com/images/I/41Dzw2xORjL._SX300_SY300_QL70_FMwebp_.jpg",
      "description": "8G Whole Grains Per Servings     Fruit & Grain Bars     Made With Real Fruit Filling     365 by Whole Foods Market products give you that dance-down-the-aisles feeling, virtual aisles too! Our huge range of choices with premium ingredients at prices you can get down with makes grocery shopping so much more than tossing the basics in your cart.     An Amazon brand",
      "details": {
        "brand": "365 by Whole Foods Market",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "8G Whole Grains Per Servings"
      }
    },
    {
      "id": "B09TKSQF1M",
      "name": "Amazon Fresh, Regular Jellied Cranberry Sauce, 14 Oz",
      "ratings": 1.167,
      "price": "$10.99",
      "image": "https://m.media-amazon.com/images/I/417mCYzYDYL._SX300_SY300_QL70_FMwebp_.jpg",
      "description": "WHAT'S INSIDE: One 14-ounce can of jellied cranberry sauce     WHY YOU'LL LOVE IT: This jellied cranberry sauce is made with 100% North American cranberries.     HIGH QUALITY, LOW PRICES: Amazon Fresh brand products are all about high-quality food that fits every budget, every day.     ONLY FROM AMAZON: Look for the Amazon Fresh label to find great deals on a wide selection of grocery essentials.",
      "details": {
        "brand": "Amazon Fresh",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "WHAT'S INSIDE: One 14-ounce can of jellied cranberry sauce"
      }
    },
    {
      "id": "B08X6H8KDB",
      "name": "Apple Cinnamon Cheerios, Heart Healthy Gluten Free Breakfast Cereal, Family Size, 19 oz",
      "ratings": 5.338,
      "price": "$26.99",
      "image": "https://m.media-amazon.com/images/I/51Tt0IWLv2L._SX300_SY300_QL70_FMwebp_.jpg",
      "description": "APPLE CINNAMON CHEERIOS: A gluten free sweetened whole grain oat cereal with the delicious tastes of apple and real cinnamon; First ingredient whole grain oats     CAN HELP LOWER CHOLESTEROL as part of a heart healthy diet;Three grams of soluble fiber daily from whole grain oat foods in a diet low in saturated fat and cholesterol, may reduce the risk of heart disease -this cereal provides 0.75 grams per serving     GLUTEN FREE CEREAL: Pour some in a bowl with ice cold milk for an irresistible, gluten free part of an easy breakfast; Pack some up for gluten free snacks on the go, or add to homemade cereal bars     WHOLESOME INGREDIENTS: Provides 21g of whole grain (at least 48g recommended daily), a good source of calcium and fiber, and 12 vitamins and minerals per serving; No artificial flavors and no colors from artificial sources     CONTAINS: One 19 oz Family Size cereal box of Apple Cinnamon Cheerios Gluten Free Breakfast Cereal",
      "details": {
        "brand": "Cheerios",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "APPLE CINNAMON CHEERIOS: A gluten free sweetened whole grain oat cereal with the delicious tastes of apple and real cinnamon; First ingredient whole grain oats"
      }
    },
    {
      "id": "B0C7SS82MW",
      "name": "Bauducco Mini Panettone - Moist & Fresh Holiday Cake - Traditional Italian Recipe With Candied Fruit & Raisins - 2.8oz",
      "ratings": 1.703,
      "price": "$16.19",
      "image": "https://m.media-amazon.com/images/I/416cBkiI4LL._SX300_SY300_QL70_FMwebp_.jpg",
      "description": "PANETTONE MINI CLASSIC: Moist and fresh cake with candied fruits and raisins, just in a snack size version.     SLOW RISE DOUGH: Each batch undergoes a meticulous 52-hour process for unparalleled flavor.     ON-THE-GO: A snack size version of the Bauducco Classic Panettone, ready to eat. They’re guaranteed moist, fresh and aromatic ready to be enjoyed at home, at the office or as a snack.     SMALL GIFT. BIG HEART: Everyone wishes for a sweet treat, and this Bauducco Classic Mini Panettone is the perfect gift. They’re delicious, cute looking, and a simple way to show friendship and love.     FUN IN THE KITCHEN: Have fun preparing delicious treats like Ice Cream-filled Classic Mini Panettone with your kids.     #1 PANETTONE IN THE US: Made by the Bauducco family, now in its third generation following the same original recipe since 1952.",
      "details": {
        "brand": "Bauducco",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "PANETTONE MINI CLASSIC: Moist and fresh cake with candied fruits and raisins, just in a snack size version."
      }
    },
    {
      "id": "B074J2YQXF",
      "name": "365 by Whole Foods Market, Peppermints, 1.5 Ounce",
      "ratings": 1.472,
      "price": "$19.99",
      "image": "https://m.media-amazon.com/images/I/41VGnvhHwRL._SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Our Peppermints Freshen Your Breath And Cool Your Palate-And They Just Might Save The Day. We Got You Covered, Close Talkers.     365 by Whole Foods Market products give you that dance-down-the-aisles feeling, virtual aisles too! Our huge range of choices with premium ingredients at prices you can get down with makes grocery shopping so much more than tossing the basics in your cart.     An Amazon brand     Trust & Quality We Are Proud To Offer This Product To You Because It Meets Our Rigorous Quality Standards, Which Prohibit Over 100 Ingredients For Both Food And Supplements.",
      "details": {
        "brand": "365 by Whole Foods Market",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "Our Peppermints Freshen Your Breath And Cool Your Palate-And They Just Might Save The Day. We Got You Covered, Close Talkers."
      }
    },
    {
      "id": "B0D5NP53PB",
      "name": "Dot's Pretzels Bundle Pack Original, Honey Mustard, and Cinnamon Sugar Seasoned Pretzel Twists, Healthy Kids Snacks, Grocery Sized Bags (3 Pack)",
      "ratings": 1.739,
      "price": "$23.99",
      "image": "https://m.media-amazon.com/images/I/412yeE-KzuL._SX300_SY300_QL70_FMwebp_.jpg",
      "description": "This Dot's Bundle Pack features three iconic flavors from the Dot's kitchen: Original, Honey Mustard, and Cinnamon Sugar. Receive three 16oz bags that are perfect for any snacking occassion     Dot's Pretzels provide a satisfying crunch with a twist! Specially seasoned with a blend of bold spices, our pretzels are great for kids lunches, watching the big game, or just a snack for yourself     All Dot's Pretzels are baked to golden perfection and have big time buttery flavor, making them the ideal snack to add to any party or meal!     Made with care using high-quality ingredients for a delicious crunch every time. Perfect for back to school snacks!     While they make amazing snacks, Dot's are also great to supplement your baking or cooking! Crumble our pretzels to coat your fish or chicken, or to make a crust for a cheesecake!",
      "details": {
        "brand": "Dot's Homestyle Pretzels",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "This Dot's Bundle Pack features three iconic flavors from the Dot's kitchen: Original, Honey Mustard, and Cinnamon Sugar. Receive three 16oz bags that are perfect for any snacking occassion"
      }
    },
    {
      "id": "B09SHKTPR4",
      "name": "Amazon Fresh, Stuffing Mix, Cornbread, 6 Oz",
      "ratings": 226,
      "price": "$29.88",
      "image": "https://m.media-amazon.com/images/I/51tAAuAxMML._SX300_SY300_QL70_FMwebp_.jpg",
      "description": "WHAT'S INSIDE: 6-ounce box of cornbread stuffing mix     WHY YOU'LL LOVE IT: This tasty stuffing mix is ready in just 5 minutes. Includes simple stovetop or microwave instructions.     ALSO CONTAINS: Soy, Wheat     HIGH QUALITY, LOW PRICES: Amazon Fresh brand products are all about high-quality food that fits every budget, every day.     ONLY FROM AMAZON: Look for the Amazon Fresh label to find great deals on a wide selection of grocery essentials.",
      "details": {
        "brand": "Amazon Fresh",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "WHAT'S INSIDE: 6-ounce box of cornbread stuffing mix"
      }
    },
    {
      "id": "B071DWP99K",
      "name": "365 by Whole Foods Market, Bag Kitchen Tall Drawstring Flextra 13Gl 38Count, 38 Count",
      "ratings": 4.469,
      "price": "$19.69",
      "image": "https://m.media-amazon.com/images/I/51j0Z65dTiL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Flextra Strength Bags     Great In The Kitchen And Beyond... Our Flextra Tall Kitchen Bags Are Tough And Durable With The Strength And Superior Performance You Expect. Made With A Proprietary Blend Of Resins, Our Bags Have A Unique Embossed Pattern, Which Results In Additional Puncture And Tear Resistance. Plus, The Drawstring Hugs The Trash Can To Help The Bag Stay In Place.     You Can Also Use These Bags To... Store Covered Decorations And Toys To Help Keep Them Dry And Free From Dust. Protect Your Bedding And Pillows When Storing Or Moving Them To Help Keep Them Clean. Pack On-The-Go Supplies And Clothing To Help Keep Them Dry When Hiking Or Camping.     365 by Whole Foods Market products give you that dance-down-the-aisles feeling, virtual aisles too! Our huge range of choices with premium ingredients at prices you can get down with makes grocery shopping so much more than tossing the basics in your cart.     An Amazon brand",
      "details": {
        "brand": "365 by Whole Foods Market",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "White",
        "ram": "N/A",
        "detail_item": "Flextra Strength Bags"
      }
    },
    {
      "id": "B0DDQDCQ6D",
      "name": "Dole Fruit Bowls No Sugar Added Lunch Snacks, 12 Cups and belVita Blueberry Breakfast Biscuits, Value Pack, 12 Packs, Variety Pack",
      "ratings": null,
      "price": "$19.99",
      "image": "https://m.media-amazon.com/images/I/41Xkigusc1L._SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Variety Pack: Dole Fruit Bowls are gluten free and come in BPA free, individually wrapped packaging; It’s a surprisingly fun way to eat fruit, liven up your snack routine and add a bit of sunshine to your day     Gluten-Free: Dole Fruit Bowls are made from non-GMO ingredients; They're gluten-free and make a great healthy snack for kids and adults     Delicious Mixed Fruit: With Dole's shelf-stable products, you can have the delicious taste of refreshing mixed fruit anywhere, anytime and in bulk; Try Dole's fruit in a cup, in a jar, cut fruit in gel, or fruit juice     Healthy Snacks and Juices: From packaged shelf stable fruit, to dried fruit, fruit juices, and frozen fruit, Dole is a world leader in growing, sourcing, distributing, and marketing packaged fruit and healthy snacks to brighten your day     One box with 12 packs, 4 biscuits per pack, of belVita Blueberry Breakfast Biscuits (packaging may vary)     Crunchy blueberry biscuits made with wholesome grains and specially baked with slow-release carbs that break down gradually in the body to deliver delicious, steady energy     Kosher, cholesterol free breakfast biscuit with no high-fructose corn syrup and no artificial colors, flavors or sweeteners     These delicious, convenient breakfast biscuits are a great alternative to traditional breakfast snacks",
      "details": {
        "brand": "Belvita",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "Variety Pack: Dole Fruit Bowls are gluten free and come in BPA free, individually wrapped packaging; It’s a surprisingly fun way to eat fruit, liven up your snack routine and add a bit of sunshine to your day"
      }
    },
    {
      "id": "B005J3RB4G",
      "name": "Goya Foods Enriched Medium Grain Rice, 20 Pound (Pack of 1)",
      "ratings": 50,
      "price": "$44.99",
      "image": "https://m.media-amazon.com/images/I/51NGZAqRJrS._SX300_SY300_QL70_FMwebp_.jpg",
      "description": "VERSATILE MAIN OR SIDE DISH | Meat, fish, chicken and vegetable lovers can complement their dishes with versatile GOYA Medium Grain Rice     BELOVED STAPLE | Rice is a staple ingredient of cuisines all around the world     NUTRITIONAL QUALITIES | Fat Free, Sodium Free, Saturated Fat Free, 0g Trans Fat, Cholesterol Free, Vegan and Kosher. Enriched with Iron, Niacin(B3), Thiamin(B1) and Folic Acid     COMMITMENT TO QUALITY | GOYA Medium Grain Rice is Extra Fancy and Blue Rose type. If it's Goya... it has to be good! | ¡Si es Goya... tiene que ser bueno!     PACK OF 1: 20 LB BAGS | Single unit bags and multipacks available on Amazon, Amazon Fresh and Prime Pantry. Enjoy GOYA's full line of Rices on Amazon Fresh, Amazon Retail and Prime Pantry",
      "details": {
        "brand": "Goya",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "VERSATILE MAIN OR SIDE DISH | Meat, fish, chicken and vegetable lovers can complement their dishes with versatile GOYA Medium Grain Rice"
      }
    },
    {
      "id": "B0054LHI5A",
      "name": "Burt's Bees Lip Balm Stocking Stuffers, Moisturizing Lip Care Christmas Gifts, Original Beeswax with Vitamin E & Peppermint Oil, Natural Origin Lip Care (4-Pack)",
      "ratings": 97.378,
      "price": "$10.49",
      "image": "https://m.media-amazon.com/images/I/51jx+82YDsL._SY300_SX300_.jpg",
      "description": "FLAVORFUL LIP BALM: Four 0.15 oz. lip balm tubes of Burt’s Bees Beeswax Lip Balm to moisturize and soften your lips     MOISTURIZED LIPS: Each balm is infused with responsibly sourced beeswax, vitamin E and nourishing oils for a conditioning lip treatment that keeps your lips happy, healthy and juicy     PEPPERMINT FLAVOR: A hint of peppermint oil gives a one-of-a-kind refreshing tingle that will encourage you to apply this flavored lip balm over and over again     NOURISH DRY OR CHAPPED LIPS: The tint-free tube of moisturizing lip balm glides on your lips smoothly to nourish them, keeping lips happy, healthy and hydrated     CONDITIONING LIP THERAPY: This lip moisturizer leaves your lips smooth and refreshed with a matte finish from natural ingredients     NATURAL ORIGIN: Formulated without parabens, phthalates, petrolatum or SLS, this 100% natural lip balm revitalizes and beautifies your lips with clean ingredients to moisturize worry-free",
      "details": {
        "brand": "Burt's Bees",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "FLAVORFUL LIP BALM: Four 0.15 oz. lip balm tubes of Burt’s Bees Beeswax Lip Balm to moisturize and soften your lips"
      }
    },
    {
      "id": "B0CR1FWQNY",
      "name": "50 Pack 2LB White Grocery Bags – Small Paper Lunch Bags for Food Sandwiches Snacks Candy Bread Meal Prep Compostable Disposable Storage Sacks for Parties and Treats Durable Recyclable Packaging",
      "ratings": 28,
      "price": "$7.49",
      "image": "https://m.media-amazon.com/images/I/71WT7olY3ZL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Perfectly Sized Paper Bags: Our 2 lb brown paper bags come in a package of 50, each measuring 4.3\" x 2.5\" x 7.9\". They're designed to hold small side dishes, desserts, or even a small drink with ease.     Eco-Friendly and Sturdy: Crafted from 100% recycled kraft paper, our bags are both compostable and biodegradable. With a basis weight of 50 gsm, they're strong and durable, capable of meeting your daily load-bearing needs.     Versatile and Multipurpose: These paper bags have a wide range of uses, from holding small side dishes, bagels, and hot dogs to desserts, sandwiches, candies, snacks, and small drinks. They're perfect for lighter grocery items and smaller orders at cafes, bakeries, or even as party favor bags.     Classic White Design: Featuring a plain white color, our bags offer a timeless look that's easy to label and customize. Their rectangular base allows them to stand upright, making them ideal for packing, takeout, and delivery.     Convenient and Customizable: The blank surface of these paper bags makes them perfect for DIY projects. You can decorate them with drawings, colors, stickers, or logos to suit different occasions, whether it's a party favor bag, lunch bag, treat bag, or grocery bag.",
      "details": {
        "brand": "HOGOWARE",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "White",
        "ram": "N/A",
        "detail_item": "Perfectly Sized Paper Bags: Our 2 lb brown paper bags come in a package of 50, each measuring 4.3\" x 2.5\" x 7.9\". They're designed to hold small side dishes, desserts, or even a small drink with ease."
      }
    },
    {
      "id": "B0BDSYZVRF",
      "name": "Amazon Fresh, Chunky Salsa, Medium, 15.5 Oz",
      "ratings": 62,
      "price": "$9.89",
      "image": "https://m.media-amazon.com/images/I/41HHg7XhTCL._SY300_SX300_QL70_FMwebp_.jpg",
      "description": "WHAT'S INSIDE: One 15.5 ounce container of Chunky Salsa, Medium.     WHY YOU'LL LOVE IT: This chunky salsa is bursting with tomatoes, peppers, onions, and garlic. It brings a medium-spicy kick to Amazon Brand Happy Belly Restaurant-Style Tortilla Chips, Amazon Brand Aplenty Organic Blue Corn Tortilla Chips, or your favorite meal. Made with no artificial colors, flavors, or preservatives. Available in Mild and Medium.     HIGH QUALITY, LOW PRICES: Amazon Fresh brand products are all about high-quality food that fits every budget, every day.     ONLY FROM AMAZON: Look for the Amazon Fresh label to find great deals on a wide selection of grocery essentials.",
      "details": {
        "brand": "Amazon Fresh",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "WHAT'S INSIDE: One 15.5 ounce container of Chunky Salsa, Medium."
      }
    },
    {
      "id": "B07WPSFJKX",
      "name": "Amazon Fresh, Cherry Mixed Fruit in Juice, 4 Oz Bowls (Pack of 4) (Previously Happy Belly, Packaging May Vary)",
      "ratings": 2.916,
      "price": "$9.99",
      "image": "https://m.media-amazon.com/images/I/410BAYcGyZL._SX300_SY300_QL70_FMwebp_.jpg",
      "description": "WHAT'S INSIDE: Four 4-ounce bowls of Cherry Mixed Fruit in Juice     NEW LOOK: Your favorite Happy Belly products are now part of the Amazon Fresh family! Packaging may vary, but the product and quality you love are exactly the same.     HIGH QUALITY, LOW PRICES: Amazon Fresh brand products are all about high-quality food that fits every budget, every day.     ONLY FROM AMAZON: Look for the Amazon Fresh label to find great deals on a wide selection of grocery essentials.",
      "details": {
        "brand": "Amazon Fresh",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "WHAT'S INSIDE: Four 4-ounce bowls of Cherry Mixed Fruit in Juice"
      }
    },
    {
      "id": "B07TZPYK5R",
      "name": "VP Home Reusable Tote Bags for Grocery and Picnic, Fourth Wing Tote Bag",
      "ratings": 36,
      "price": " ",
      "image": "https://m.media-amazon.com/images/I/A1thsy9Hj1L.__AC_SY445_SX342_QL70_FMwebp_.jpg",
      "description": "",
      "details": {
        "brand": "N/A",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "N/A"
      }
    },
    {
      "id": "B0D14Y3GXN",
      "name": "Snack Pack Sugar Free Cherry Flavored Juicy Gels, 4 Count Snack Cups (Pack of 4)",
      "ratings": 6.051,
      "price": "$14.99",
      "image": "https://m.media-amazon.com/images/I/41lPp9cYGsL._SX300_SY300_QL70_FMwebp_.jpg",
      "description": "The information below is per-pack only     One 4 ct pack of Snack Pack Sugar Free Cherry Flavored Juicy Gels     Sugar free Juicy Gels snack cups that are flavored like classic cherry     Tasty sweet treats that are full of explosive cherry flavor that anybody is sure to enjoy     Each snack cup is sugar free, gluten free and has 5 calories per serving     Gels cups that are perfect for packing in a lunch or enjoying as an after-dinner treat or dessert",
      "details": {
        "brand": "Snack Pack",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "The information below is per-pack only"
      }
    },
    {
      "id": "B0CP9DJVNM",
      "name": "Glutinous Rice Flour 16 Ounce Sourced for SPICEBRO online Grocery",
      "ratings": 75,
      "price": "$9.99",
      "image": "https://m.media-amazon.com/images/I/51muXxXb0zL._SX300_SY300_QL70_FMwebp_.jpg",
      "description": "From Thailand, where the best glytinous rice grows     Ground in traditional water mill, which yields extra fine flour     One of essential ingredients in Asian Cooking: sweet Glutininous flour     Delicious and nutrition. Great for mochi, rice cake, baking and many more     Selected by SPICEBRO Online Market",
      "details": {
        "brand": "SPICEBRO",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "From Thailand, where the best glytinous rice grows"
      }
    },
    {
      "id": "B0C7LMRMDN",
      "name": "Ibera MIK Shopping Bag - Durable, Foldable, and Spacious Reusable Tote for Grocery Shopping - Reinforced Handles and Eco-Friendly Design (COMPATIBLE WITH MIK RACKS ONLY)",
      "ratings": 3.105,
      "price": "$99.99",
      "image": "https://m.media-amazon.com/images/I/716uoGBL5fL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Durable 1680D nylon construction for long-lasting use     Spacious main compartment with internal pockets for organized storage     PakRak and MIK system bags for you to choose     Quick-release bag mouting system, install and release bag within 3 seconds",
      "details": {
        "brand": "N/A",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "Durable 1680D nylon construction for long-lasting use"
      }
    },
    {
      "id": "B0D14Y8R1Z",
      "name": "Manwich Original Sloppy Joe Sauce, Canned Sauce, 15 oz (Pack of 4)",
      "ratings": 13.432,
      "price": "$21.99",
      "image": "https://m.media-amazon.com/images/I/51wHilEOVHL._SY300_SX300_QL70_FMwebp_.jpg",
      "description": "The information below is per-pack only     One 15 oz can of Manwich Original Sloppy Joe Sauce     Enjoy the deliciously messy favorite the entire family loves     Delicious tomato base with classic seasonings for the taste that makes everyone smile     Manwich sauce is perfect for sloppy joe sandwiches and is also great on tacos, meatloaf and more     Just mix this canned sauce with lean ground beef or ground turkey, then heat and serve",
      "details": {
        "brand": "MANWICH",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "The information below is per-pack only"
      }
    },
    {
      "id": "B0C4LMBV7S",
      "name": "Bumble Bee Hot & Spicy Hardwood Smoked Oysters, 3.75 oz Tin - 20g Protein per Serving, Gluten Free, Keto",
      "ratings": 566,
      "price": "$18.99",
      "image": "https://m.media-amazon.com/images/I/51eYCgur53L._SX300_SY300_QL70_FMwebp_.jpg",
      "description": "NUTRITIOUS & DELICIOUS: These oysters are an excellent source of protein and iron and low in saturated fat. See product package for nutrition information.     PERFECT FOR HORS D'OEUVRES: Bumble Bee oysters are hardwood smoked and smothered in a delicious spicy sauce.     READY TO ENJOY: In a convenient easy open can, these Bumble Bee oysters are a treat straight out of the can or in your favorite recipes.     ASC CERTIFIED: This product has met the ASC's global standard for responsibly farmed seafood.",
      "details": {
        "brand": "Bumble Bee",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "NUTRITIOUS & DELICIOUS: These oysters are an excellent source of protein and iron and low in saturated fat. See product package for nutrition information."
      }
    },
    {
      "id": "B00MULG362",
      "name": "Walkers Crisps - Prawn Cocktail (6x25g)",
      "ratings": 870,
      "price": "$39.90",
      "image": "https://m.media-amazon.com/images/I/51Mnu6e02gL._SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Please be aware that unless expressly indicated otherwise, product packaging may vary from what is shown on this listing. We recommend that you do not rely solely on the information presented on our listing. Please always read the labels, warning and directions provided before using or consuming the product.",
      "details": {
        "brand": "Walkers",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "Please be aware that unless expressly indicated otherwise, product packaging may vary from what is shown on this listing. We recommend that you do not rely solely on the information presented on our listing. Please always read the labels, warning and directions provided before using or consuming the product."
      }
    },
    {
      "id": "B0D14XKZ4S",
      "name": "La Moderna Shells Pasta, Noodles, Durum Wheat, Protein, Fiber, Vitamins, 7 Oz (Pack of 5)",
      "ratings": 2.685,
      "price": "$4.75",
      "image": "https://m.media-amazon.com/images/I/51vGx-se8AL._SX300_SY300_QL70_FMwebp_.jpg",
      "description": "The information below is per-pack only     SHELLS PASTA: Made from 100% durum wheat, good for your health and full of protein, fiber, and vitamins.     CULTURALLY INCLUSIVE: Certified kosher, enriched with vitamins, iron and folic acid. Free of GMOs.     QUICK & EASY: Ready in 7 to 9 minutes, easily offer your family a fast and rich dish with the recipe of your choice.     A TRADITION: This pasta brings the La Moderna tradition of excellent Mexican quality and flavor to any dish.     LA MODERNA, NUMBER ONE PASTA: Your favorite pasta from Mexico.",
      "details": {
        "brand": "La Moderna",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "The information below is per-pack only"
      }
    },
    {
      "id": "B0CW97M75J",
      "name": "Bodaon 10Pk Collapsible Reusable Grocery Bags with Plastic Bottom, the Utility Tote Bag Bulk, Large Folding/Foldable Reusable Shopping Cart for Groceries, Shopping Basket Heavy Duty (Mixed Color)",
      "ratings": 41,
      "price": "$23.99",
      "image": "https://m.media-amazon.com/images/I/71DvVpCh0iL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "【LARGE CAPACITY】:Dimension: 13W x 10H x 15D inch, with its generous capacity of 32L/8.4 Gallons. With its generous size, the shopping bag makes shopping a breeze. You won't need to carry multiple plastic bags or small shopping bags anymore. This makes your shopping experience smoother and more efficient.     【MULTI-FUNCTIONAL】:Our shopping bags are true multitaskers! Not only perfect for your everyday shopping needs, but also an ideal choice for business events, travels, picnics, outdoor activities, or gift giveaways. With its spacious capacity, you can easily carry all your essentials, making it suitable for various occasions.. Get one for multiple purposes and enjoy a convenient and enjoyable shopping experience     【6 COLORS FOR CHOICE】:Our shopping bags come in 6 different colors for you to choose from. Our color options aim to meet various needs and personal preferences. You can choose your favorite color based on your preferences and style, making your shopping experience more personalized and unique     【BULK IN QUANTITY】:We offer three choices of bag amounts: 2-pack, 4-pack, and 6-pack, to meet the needs of most families. This helps you categorize your purchases with ease. While shopping at the supermarket or mall, you can place different items     【REUSABLE & ECO FRIENDLY】:The shopping bags are crafted using eco-friendly materials, providing you with a guarantee of top-notch quality for your shopping experience. Carefully selected materials ensure the durability of the shopping bags, allowing for multiple reuses and serving as a sustainable alternative to traditional plastic bags. By purchasing our shopping bags, not only do you contribute to the environment, but you also gain a long-lasting shopping companion     【COLLAPSIBLE】:Despite its large capacity, these shopping bags often come with foldable and easy-to-store features. When not in use, you can simply fold them up and tuck them into your purse or car trunk without taking up too much space     【PLASTIC BOTTOM】:Each of our shopping bags comes with an individual bottom panel. This design provides the shopping bag with a sturdy bottom structure, allowing it to stand on its own and remain stable without the need for additional support. The bottom panel securely fits into the base of the shopping bag, ensuring that the bag maintains its shape and stability when loaded with items",
      "details": {
        "brand": "N/A",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "【LARGE CAPACITY】:Dimension: 13W x 10H x 15D inch, with its generous capacity of 32L/8.4 Gallons. With its generous size, the shopping bag makes shopping a breeze. You won't need to carry multiple plastic bags or small shopping bags anymore. This makes your shopping experience smoother and more efficient."
      }
    },
    {
      "id": "B0BPRMSB9L",
      "name": "2 PACK Green Stainless Steel Onion Slicer Holder, Onion/Egg/Grape/Apple/Lemon/Fruit/Veggie Slicer/Cutter, Kitchen Accessory/Essential",
      "ratings": 84,
      "price": "$9.99",
      "image": "https://m.media-amazon.com/images/I/61Wr7ucggkL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "【Easy To Use】This onion slice can not only stabilize the food, but also slice evenly, so that we can easily grab the food to eat. Don't worry about the injury caused by cutting your finger. It is convenient and fast.     【Excellent Materials】Made of 304 stainless steel,it's easy to clean, perfect for health. Because of the food grade high-quality stainless steel materials,it's durable and not easy to rust or hide dirt.     【Kitchen Soul】The onion holder saves a lot of time for slicing or chopping onions.Onion cutting can be used to fix onions, tomatoes, cooked food, fish or meat holes, convenient and worry free.     【Ergonomic Design】Anti slip handle design makes the stainless steel handle more comfortable to grip.It fits the size of most people's hands.",
      "details": {
        "brand": "SCGFPOE",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "Green",
        "ram": "N/A",
        "detail_item": "【Easy To Use】This onion slice can not only stabilize the food, but also slice evenly, so that we can easily grab the food to eat. Don't worry about the injury caused by cutting your finger. It is convenient and fast."
      }
    },
    {
      "id": "B0D7HMRCJ2",
      "name": "Vegetable Chopper: Pro Food Chopper with Stainless Steel Blade Chopper - Veggie Chopper with Container for Onion Salad Nut Slicer Dicer Cutter - Kitchen Essentials",
      "ratings": 60,
      "price": "$19.99",
      "image": "https://m.media-amazon.com/images/I/61OnzW9Cv2L.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "【Vegetable Chopper Free Your Hands】BestQueen Food Chopper adopts curved “W” blade to enlarge chopping area and chop more evenly; due to the small capacity of the vegetable catch tray, you need to cut the food into 1/2, 1/3, 1/4 pcs, then press the handle to chop, chopping speed is faster than knife     【Easy to Use & Store】Vegetable Cutter is handy and convenient for you to use at anywhere with a flat cutting board; And the size is 3.54*8.93 inch, Weight：270 g; No need to charge, always available; Whether you chop any foods in kitchen or have a picnic outdoors, the food cutter lets you say goodbye to the embarrassment of no electricity at any time     【Multi-functional Chopper】Veggie chopper with container and lid is ideal for garlic press, hard cheeses, nuts, herbs, onions, cilantro, hard boiled eggs, small salads, tuna, pizza toppings, cookies for ice cream toppings and more; Every time you press the veggie cutter, the blade will rotate 24° to cut the vegetable and fruit, so less raw materials can be chopped more finely     【Safe & Durable Material Made】The chopper vegetable cutter is made of high-quality polypropylene, which is durable and almost impossible to break or damage; The blade is made of premium 304 stainless steel, it’s grisp and rustless. Its integral blade guard can protect your fingertips from blade damage when chopping. No need to cry when cutting onions     【Easy to Install & Clean】The onion chopper is easy to disassemble for easy cleanup; Simply finish cleaning under running water in 3 minutes with cleaning scraper, also top dishwasher safe as all parts are detachable; The hand food chopper is kitchen essential and home must-have",
      "details": {
        "brand": "BESTQUEEN",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "Black",
        "ram": "N/A",
        "detail_item": "【Vegetable Chopper Free Your Hands】BestQueen Food Chopper adopts curved “W” blade to enlarge chopping area and chop more evenly; due to the small capacity of the vegetable catch tray, you need to cut the food into 1/2, 1/3, 1/4 pcs, then press the handle to chop, chopping speed is faster than knife"
      }
    },
    {
      "id": "B08NJC9Q57",
      "name": "ATMOS GREEN 100 pack 15 X 16 inch with 27\" handle NATURAL Color 5 Oz Recycled Cotton reusable grocery bag eco friendly super strong great choice for SCHOOL, promotion, branding & gift MADE in INDIA",
      "ratings": 5.416,
      "price": "$159.99",
      "image": "https://m.media-amazon.com/images/I/316H1kG7CDL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Atmos Green eco friendly Recycled cotton tote bags are washable and reusable     Atmos Green totes has 27\" soft self fabric handles so you can comfortably carry by hand or over your shoulder     Atmos Green economical foldable, lightweight Cotton tote bag has one spacious main compartment and wide-open mouth makes easy to load and unload your belongings.     Atmos Green tote bags can be used for grocery shopping, Schools, Universities, Promotions, Branding, work, travel, gym, beach, church, custom DIY, art & crafts, decorations, weddings etc.     SIZE: 15\"W x 16\"H, Imprint Size up to: 13\"W x 14\"H. Great for SCHOOLS, promotional needs, giveaways, advertising your business, trade shows. Perfect for screen print, embroidery or Iron-on transfer.",
      "details": {
        "brand": "N/A",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "Atmos Green eco friendly Recycled cotton tote bags are washable and reusable"
      }
    },
    {
      "id": "B09XDSBV7H",
      "name": "Eccliy 24 Pieces Reusable Grocery Bags Polyester Shopping Bags for Groceries Multi Colors Reusable Bags Foldable Shopping Bag (Solid Style)",
      "ratings": 242,
      "price": "$21.99",
      "image": "https://m.media-amazon.com/images/I/710JhhokqgL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Large Capacity: these reusable grocery bags have an open size of 33 x 52 cm/ 13 x 20.5 inches, lightweight and strong, with reinforced seams, exquisite workmanship, lightweight and sturdy, can hold more than 50 pounds of items, such as canned food, milk, fruit, etc.; The wide and long shoulder straps allow you to carry to reduce the burden, a nice helper for daily shopping     Foldable Design: these reusable shopping bags can be put back into the tote bag when you don't need them, measure 11 x11/ 4.3 x 4.3 inches when folded; If you do not like to fold, this is a choice for you to easily put into backpacks, wallets, pockets, will not take up too much space     Safe Material: these washable shopping bags are made of quality polyester material, clean and safe, machine washable and reusable, quick drying and lightweight,with strong stitching, which can replace plastic bags, convenient to use     Beautiful Set: you will get 24 pieces of foldable tote bags in 10 different colors, bright colors to add color to your daily life, bring you a good mood, suitable for both men and women, the abundant quantity is enough for you and your family daily use and replacement, different colors are easy for distinction, practical and beautiful     Applicable Occasions: the shopping cart bags for groceries can meet your daily needs, also suitable for various event occasions, such as outdoor activities, birthday parties, picnics, travel, seaside and other outdoor activities, also nice for Christmas, Thanksgiving, Mother's Day and other holiday gifts for your friends and family, a practical gift",
      "details": {
        "brand": "N/A",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "Large Capacity: these reusable grocery bags have an open size of 33 x 52 cm/ 13 x 20.5 inches, lightweight and strong, with reinforced seams, exquisite workmanship, lightweight and sturdy, can hold more than 50 pounds of items, such as canned food, milk, fruit, etc.; The wide and long shoulder straps allow you to carry to reduce the burden, a nice helper for daily shopping"
      }
    },
    {
      "id": "B0D7MNB5R9",
      "name": "4 Pack Reusable Grocery Bags, Tote Bags for Shopping Cart with Hard Bottom to Stand Upright or Foldable, 35 L Waterproof Shopping Bags with Sturdy Handles for Picnic",
      "ratings": 9,
      "price": " ",
      "image": "https://m.media-amazon.com/images/I/81bMiU-DngL.__AC_SY445_SX342_QL70_FMwebp_.jpg",
      "description": "",
      "details": {
        "brand": "N/A",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "N/A"
      }
    },
    {
      "id": "B0DD6RQS1C",
      "name": "VENO 2 Pack Reusable Grocery Bags and Shopping Bags with Handles and Hard Bottom, Compact Convenience Size. (Gray, 2 Pack)",
      "ratings": 12,
      "price": " ",
      "image": "https://m.media-amazon.com/images/I/91vnGENMv8L.__AC_SY445_SX342_QL70_FMwebp_.jpg",
      "description": "",
      "details": {
        "brand": "N/A",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "N/A"
      }
    },
    {
      "id": "B0DBKHLZVL",
      "name": "2 Pack Grocery Bag Carrier Handle - Soft Grip, Hands-Free Convenience for Plastic, Shopping Bags & Grocery Bags",
      "ratings": 10,
      "price": "$13.99",
      "image": "https://m.media-amazon.com/images/I/611gZ05EirL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Multi-Purpose Use: Our grocery bag carrier handle is designed to carry a variety of items including groceries, paint cans, sports gear, and more. Its versatility makes it perfect for everyday tasks, from toting dry cleaning to hauling construction tools or walking multiple dogs at once.     Ergonomic Design: Featuring a soft cushion grip, this grocery bag carrier handle reduces hand strain and fatigue, allowing you to comfortably carry heavy loads without pain or discomfort.     Hands-Free Option: This carrier handle can be used in hand or over the shoulder for a hands-free carrying experience, making it convenient for multitasking moms, seniors, and busy professionals.     Lightweight & Portable: Compact and weighing only 2.75 ounces, it easily fits into a purse, backpack, or car for on-the-go convenience. It's small enough to carry everywhere, yet strong enough to handle multiple bags.     Durable & Long-Lasting: Made from sturdy, high-quality materials, this grocery bag handle is built to last, supporting even the heaviest loads. It's an essential tool for anyone looking to simplify their carrying tasks.",
      "details": {
        "brand": "Hadwoer",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "Green",
        "ram": "N/A",
        "detail_item": "Multi-Purpose Use: Our grocery bag carrier handle is designed to carry a variety of items including groceries, paint cans, sports gear, and more. Its versatility makes it perfect for everyday tasks, from toting dry cleaning to hauling construction tools or walking multiple dogs at once."
      }
    },
    {
      "id": "B0CMX192H9",
      "name": "Calindiana Modern Farmhouse Metal Magnetic Grocery Bags Holder for Plastic Bags with LId and Kitchen Organizer and Storage Wall Mount Grocery Bag Dispenser Space Saving, White",
      "ratings": 56,
      "price": "$26.99",
      "image": "https://m.media-amazon.com/images/I/61KF3jC4VRL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "DECLUTTER YOUR KITCHEN: Aren’t you stressed out by looking at disorganized and cluttered plastic grocery bags? If so, we are here to relieve your stress! Store your plastic grocery bags in our grocery bags holder, make it out of your sight, and enjoy the satisfaction of the decluttered and neatly organized kitchen!     DESIGNED IN USA: Our grocery bags holder is designed in USA and it is spacious enough with 7.3(L)X3.5(W)X10.2(H) inch size dimensions     MODERN FARMHOUSE DESIGN: This container is simply labeled as ‘grocery bags’ and its tin material adds both modern and farmhouse vibes to your kitchen. This will blend seamlessly with any kitchen interior scheme and with any style of refrigerators or kitchen cabinets     HIGH QUALITY: If you are in need of a durable container for storing grocery bags, look no further. Our grocery bags holder is made of sturdy tin material and it will hold up under any conditions. This grocery bags holder also features magnetic backing and a lid. With its strong and large magnetic backing, this will be attached to your refrigerator firmly with maximum stability     THREE INSTALLMENT OPTIONS: You can simply attach this on your refrigerator with its magnetic backing. You can also hang it on the kitchen wall with its built in keyhole hangers and inclusive nails and anchors. Lastly, you can attach this either inside or outside of your kitchen cabinets with its inclusive adhesive screw stickers     ADDED CONVENIENCE: You can simply add or take out grocery bags through the large top opening of our grocery bags holder. You can also pull the grocery bags out from the bottom dispensing slot. Feel free to utilize our grocery bags holder in the way that suits you best     MULTI STORAGE USE: There is no need to limit the purpose of this container just to store grocery bags. You can also store any other necessities such as trash bags, freezer bags, zip lock bags, and so much more",
      "details": {
        "brand": "N/A",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "DECLUTTER YOUR KITCHEN: Aren’t you stressed out by looking at disorganized and cluttered plastic grocery bags? If so, we are here to relieve your stress! Store your plastic grocery bags in our grocery bags holder, make it out of your sight, and enjoy the satisfaction of the decluttered and neatly organized kitchen!"
      }
    },
    {
      "id": "B091Q24KSW",
      "name": "Click & Carry Grocery Bag Carrier - Plastic Bag Organizer and Holder for Easy Shopping - As Seen on Shark Tank - Comfortable Gel Padding Bags Handle, Hands-Free Design for Groceries, Paint Can Carrier",
      "ratings": 5.811,
      "price": "$21.99",
      "image": "https://m.media-amazon.com/images/I/71fKpg4VOkL.__AC_SY300_SX300_QL70_FMwebp_.jpg",
      "description": "ULTIMATE GROCERY BAG ORGANIZER: Click & Carry is the padded handle device that makes it easy to haul all of life’s most annoying cargo. Whatever you're hauling, Click & Carry will make it feel like half the weight! The Click & Carry grocery bag carrier ensures easy transportation of multiple bags, making grocery shopping a breeze. Be a One Trip Warrior and carry all your groceries inside at once without those painful grooves in your hands and arms!     COMFORTABLE & DURABLE: The Click & Carry grocery bag carrier is designed with comfortable gel padding to cushion your shoulders and hands, ensuring a pain-free experience even when carrying heavy loads. Its sturdy construction guarantees long-lasting use, making it the perfect companion for all your shopping trips. Use Click & Carry to easily haul up to 100 pounds hands-free! Evenly distribute the weight of your cargo on both sides of the Click & Carry, and it will balance on your shoulder!     VERSATILE USAGE: This plastic bag organizer is not just for groceries. Use it to carry paint cans, sports gear, travel luggage, dry cleaning, heavy buckets, and even walk multiple dogs at once! This multipurpose tool is a must-have for various daily tasks, providing convenience and efficiency in one compact solution.     EASY TO STORE & ACCESS: The Click & Carry grocery bag holder is pocket-sized and can be conveniently stored in your kitchen, car, or garage. Its lightweight design makes it easy to grab and go, ensuring you always have a reliable bag carrier on hand for any task. Click & Carry is ideal for parents, apartment dwellers, seniors with dexterity issues, DIYers, sports enthusiasts and anyone who needs to carry bags, tools, etc.     AS SEEN ON TV: Click & Carry has appeared on Shark Tank (S12 E8), QVC - In the Kitchen with David, GMA (Good Morning America), The Today Show, Today with Hoda & Jenna, The Bethenny Frankel Show, DIY Network and Food Network.",
      "details": {
        "brand": "N/A",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "ULTIMATE GROCERY BAG ORGANIZER: Click & Carry is the padded handle device that makes it easy to haul all of life’s most annoying cargo. Whatever you're hauling, Click & Carry will make it feel like half the weight! The Click & Carry grocery bag carrier ensures easy transportation of multiple bags, making grocery shopping a breeze. Be a One Trip Warrior and carry all your groceries inside at once without those painful grooves in your hands and arms!"
      }
    },
    {
      "id": "B0B4RQKWWR",
      "name": "Shappy 34 Pcs Reusable Floral Grocery Bags Foldable Nylon Washable Extra Large Cute Flower Tote Bags with Attached Pouch for Women Shopping Supplies",
      "ratings": 168,
      "price": " ",
      "image": "https://m.media-amazon.com/images/I/919Cm3YCCoL.__AC_SY445_SX342_QL70_FMwebp_.jpg",
      "description": "",
      "details": {
        "brand": "N/A",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "N/A"
      }
    },
    {
      "id": "B0DHGRD7GC",
      "name": "Plastic Bag Holder, Heavy Duty Wall Mount Plastic Bag Dispenser, Washable Grocery Bag Holder Organizer, Grocery Bag Holder for Home Kitchen Camper",
      "ratings": null,
      "price": "$4.99",
      "image": "https://m.media-amazon.com/images/I/613qyNOOaQL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Polyester Construction: The plastic bag holders for grocery bags are made of soft and durability polyester material, ensuring long-lasting use and resistance to wear and tear.     Easy Installation: The plastic bag organizer features an easy hanging design, allowing you to conveniently mount it on the wall, under a shelf, in a closet, or in a garage, saving valuable space and keeping your bags organized and accessible.     Large Capacity Design: With dimensions of approximately 13.8 x 6.3 inches, our grocery bag holder for plastic bags can accommodate over 40 plastic bags, providing ample storage space for your grocery bags or other items.     Machine Washable for Easy Cleaning: Our grocery bag organizer can be easily washed with either cold or hot water, ensuring effortless maintenance and cleanliness.     Versatile and Multi-functional: Not only can our plastic bag dispenser, but it can also hold vinyl rolls, wrapping papers, freezer bags, zip lock bags, socks, and more, making it a versatile storage solution for various household items.",
      "details": {
        "brand": "N/A",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "Polyester Construction: The plastic bag holders for grocery bags are made of soft and durability polyester material, ensuring long-lasting use and resistance to wear and tear."
      }
    },
    {
      "id": "B0CKX83DNC",
      "name": "Reusable Shopping Bags for Groceries, Set of 4 - Planet-Friendly Totes - Foldable, Washable - Set of 4",
      "ratings": 19,
      "price": " ",
      "image": "https://m.media-amazon.com/images/I/81+eLjCTsjL._AC_SX342_SY445_.jpg",
      "description": "",
      "details": {
        "brand": "N/A",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "N/A"
      }
    },
    {
      "id": "B0D6C1NFNR",
      "name": "2 Pcs Plastic Grocery Bag Holder - Reusable Trash Bag Holder, Wall Mount Plastic Bag Organizer Dispenser for Home Kitchen Travelling 14 * 4.3 in",
      "ratings": null,
      "price": "$4.99",
      "image": "https://m.media-amazon.com/images/I/81zSRlmHRgL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Wall Mount: The plastic bag holder has with hang design. that allows you to hang it on the wall, door, hook, or any you can hang it everywhere you like, freeing up valuable space in your home.     Ample Storage: This grocery bag organizer has enough space to accommodate a large number of grocery bags, shopping bags, trash bags, etc. Measuring approximately 14 x 4.3 in, we are also equipped with 3 Black seamless hooks in the package.     Breathable Material: The grocery bag holder for plastic bags is made of sturdy polyester mesh, which can see things inside at a glance. It is washable and reusable. breathable mesh fabric can store your fruit and vegetables while keeping them fresh.     Convenient to Use: The plastic bag storage adopts a cylindrical design, Just put the plastic bag in the trash from the top and there is an elastic opening at the bottom, which makes it easier for you to take out what you want.     Versatile Usage: You can hang our plastic bag dispenser organizer in your kitchen, bathroom, living room, or closet to store kitchen paper, plastic bags, grocery bags, storage bags, socks, etc. take full advantage of vertical space.",
      "details": {
        "brand": "OKAMMY",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "Black",
        "ram": "N/A",
        "detail_item": "Wall Mount: The plastic bag holder has with hang design. that allows you to hang it on the wall, door, hook, or any you can hang it everywhere you like, freeing up valuable space in your home."
      }
    },
    {
      "id": "B0B3MF4WTG",
      "name": "Upgrade Shopping Bag with Wheels Carry on Luggage Bag Reusable Shopping Bags Travel Bag Duffel Bag",
      "ratings": 42,
      "price": " ",
      "image": "https://m.media-amazon.com/images/I/71LfAgHQIOL.__AC_SY445_SX342_QL70_FMwebp_.jpg",
      "description": "",
      "details": {
        "brand": "N/A",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "N/A"
      }
    },
    {
      "id": "B0D5QXTKGW",
      "name": "Grocery Bag Holder with Belt,Shopping Bag Easy Carrier,Box Carrying Strap with Handle,Lightweight Move and Carry Furniture Tool,Suitable for Luggage,Heavy Objects，Beach Chair，Outdoor Supplies",
      "ratings": 10,
      "price": "$6.90",
      "image": "https://m.media-amazon.com/images/I/61caJJTOClL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "【3 in 1 Bag Holder】Our product has three functions: it can be carried directly, worn on the shoulder, and tied to objects for lifting     【Multiple Use】You can use this grocery carrier at home, supermarket shopping, out in the yard, at the office, outdoors, or on the beach     【Strong Hook】Our bag holder use stainless steel hooks and durable materials that can withstand a weight capacity of up to 80lbs     【Easy to store】Because our hooks can be folded, they are convenient for travel and easy to carry     【Extra-long strap】Our strap is 1.9 meters long and can be adjusted to fit different sizes, making it suitable for both large and small goods",
      "details": {
        "brand": "LYIGEOL",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "orange",
        "ram": "N/A",
        "detail_item": "【3 in 1 Bag Holder】Our product has three functions: it can be carried directly, worn on the shoulder, and tied to objects for lifting"
      }
    },
    {
      "id": "B0D8PZY367",
      "name": "61 Pcs Toy Cash Register for Kids with Scanners, Calculator, Cards, Shopping Bag, Play Food, Weighing Tool-Grocery Game Set Gift for Toddler Ages 3 4 5 6 7 8, 16.5x17.3x32.3in",
      "ratings": 1,
      "price": "$45.99",
      "image": "https://m.media-amazon.com/images/I/71t1AeL3lCL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "【Role Play Set】 Children can shop, check out orders, scan food, weigh food, announce prices, and pay. These imaginative interactive games help children apply math skills in a practical way and help divert their attention from electronic devices.     【Large Size Cash Register with 61 Accessories】 The cash register measures 16.5x17.3x32.3in. Includes a lot of groceries, weighing tools, shopping bags, scanners, vegetables, fruits, snacks, drinks, etc.     【Real Calculator and Simulated Currency】The calculator provides real calculation capabilities and provides children with a variety of settlement payment methods, including cash, coins, card, and mobile phone payment.     【High-quality and safe materials】The cash register is made of durable materials, bright colors, odorless, reusable, and easy to clean. It has smooth, burr-free edges to ensure safety during the game.     【Educational Interactive Toy】Children can play with friends or parents and use their imagination. During the game, children can learn shopping, currency denomination recognition, and basic counting skills. It is a gift for children aged 3, 4, 5, 6, 7, and 8.",
      "details": {
        "brand": "N/A",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "【Role Play Set】 Children can shop, check out orders, scan food, weigh food, announce prices, and pay. These imaginative interactive games help children apply math skills in a practical way and help divert their attention from electronic devices."
      }
    },
    {
      "id": "B0DHMSWNQS",
      "name": "Earthwise Deluxe Collapsible Reusable Shopping Box Grocery Bag Set with Reinforced Bottom Storage Boxes Bins Cubes- Birch Birds (Set of 3)",
      "ratings": null,
      "price": " ",
      "image": "https://m.media-amazon.com/images/I/81YlW1kbjEL.__AC_SY445_SX342_QL70_FMwebp_.jpg",
      "description": "",
      "details": {
        "brand": "N/A",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "N/A"
      }
    },
    {
      "id": "B0D3V4KSX9",
      "name": "DHQH Canvas Tote Bag for Women, Cute Dinosaur Reusable Grocery Bag for Dinosaur Lover, Birthday Gifts for Mom Daughter Friends Sisters Who Loves Dinosaurs",
      "ratings": 18,
      "price": "$7.99",
      "image": "https://m.media-amazon.com/images/I/71E+RT8lizL._AC_SY300_SX300_.jpg",
      "description": "Unique Canvas Tote Bag: Our canvas tote bag features a adorable dinosaur printing, We use advanced printing technology to ensure that the animal prints on our tote bags are vibrant, long-lasting, and fade-resistant. Best dinosaur gift for dinosaur lovers, suitable as a gift for best friends, sisters, mom, daughter, niece, granddaughter and so on     Perfect Size and Multi-Purpose: Our cute canvas tote bag measures 13.38x15.3 inch, roomy for holding commodities and foods as grocery or camping bag, wallet, mobile phones, keys and umbrella as shopping bag, and other supplies as tote bag. And this dinosaur canvas tote bag is suitable as gift for Birthday, Thanksgiving, Wedding, Graduation, Teachers' Day ect     Meet Your Daily Needs: Our tote bags for dinosaur lovers are incredibly versatile and can be used for different occasions. Whether you need a shopping bag, beach bag, travel bag, our cute dinosaur reusable cotton canvas bag can meet your needs. The possibilities are endless, making them a practical and fashionable choice for any lifestyle     Washable and Reusable: Our canvas tote bag can be machine washable and hand washed. You can wash this tote bag, hang to dry and iron it.Please wash it with cold water, which can makes it wrinkle a little but won't shrink significantly     Warm After-Sales Service: Our is committed to providing the best possible support, if you have any issue, please let us know and we will solve any question in 24 hours",
      "details": {
        "brand": "N/A",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "Unique Canvas Tote Bag: Our canvas tote bag features a adorable dinosaur printing, We use advanced printing technology to ensure that the animal prints on our tote bags are vibrant, long-lasting, and fade-resistant. Best dinosaur gift for dinosaur lovers, suitable as a gift for best friends, sisters, mom, daughter, niece, granddaughter and so on"
      }
    },
    {
      "id": "B0CJ4HN5NZ",
      "name": "MIAHART Reusable Grocery Bags Foldable Groceries Shopping Bags Foldable Cute Tote Bags Waterproof Nylon Grocery Bags",
      "ratings": 38,
      "price": " ",
      "image": "https://m.media-amazon.com/images/I/81C3yfxT75L.__AC_SY445_SX342_QL70_FMwebp_.jpg",
      "description": "",
      "details": {
        "brand": "N/A",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "N/A"
      }
    },
    {
      "id": "B01MQFYCY1",
      "name": "Prextex Grocery Store Pretend Play Electronic Toy Kids Cash Register Set - STEM Cash Register for Kids with Microphone, Play Money, and Food Basket - Kids Checkout Register with Scanner- Pink",
      "ratings": 7.006,
      "price": "$22.99",
      "image": "https://m.media-amazon.com/images/I/81DHFWMAtCL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Realistic Play Fun: Engage kids with a cashier register featuring a scanner, beeping sounds, and play money for lifelike store role-play. Perfect for imaginative grocery shopping play     Interactive Features: This kids' cash register includes a working scanner, mic, and credit card swipe, helping children practice counting skills while enjoying hours of engaging fun     Complete Grocery Set: Comes with pretend food, a basket, coins, play bills, and a credit card. This set offers everything kids need for a realistic and creative shopping experience     Educational Learning Tool: Enhances math and STEM skills as kids practice counting, addition, and subtraction. A hands-on way to support early learning and numeracy development     Durable and Safe Design: Made from sturdy materials with smooth edges for safe use by small hands. Ideal for gifting on special occasions or for everyday pretend play activities",
      "details": {
        "brand": "N/A",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "Realistic Play Fun: Engage kids with a cashier register featuring a scanner, beeping sounds, and play money for lifelike store role-play. Perfect for imaginative grocery shopping play"
      }
    },
    {
      "id": "B0BBJS33QJ",
      "name": "LEGO Friends Organic Grocery Store 41729, Supermarket Toy Shop for Girls and Boys 8 Plus Years Old, Playset with Truck & 4 Mini-Dolls",
      "ratings": 61,
      "price": "$89.98",
      "image": "https://m.media-amazon.com/images/I/81WQYa8QxgL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "This LEGO Friends toy supermarket playset with shopping trip adventures includes a delivery van, 2 shopping trolleys, 4 mini-dolls and 1 micro-doll     Includes shopping baskets, tins, bottles and food items; trolleys have a storage area, a toy van has space for a minifigure and veggies     The LEGO food shop comes with 2023 series characters: Leo, Autumn, Jordin and Isaac mini-dolls plus a younger sister Alba, and Churro the cat figure     Kids can role-play working in the toy shop, using the mop; they can go shopping or they can help Jordin deliver vegetables in the LEGO toy truck     Meet the new Heartlake City generation for 2023, full of new LEGO Friends characters; check out other sets, like Heartlake Downtown Diner 41728     This LEGO Friends Heartlake City supermarket building toy makes a cool birthday gift idea or anytime treat for kids Ages 8 and over",
      "details": {
        "brand": "N/A",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "This LEGO Friends toy supermarket playset with shopping trip adventures includes a delivery van, 2 shopping trolleys, 4 mini-dolls and 1 micro-doll"
      }
    },
    {
      "id": "B092SS3YHR",
      "name": "Sweetzer & Orange 6-Pack Magnetic Grocery List for Fridge (Floral Theme) - 3.5” x 9” Memo Notepad for Shopping, Locker, Filing Cabinet, To Do, Appointment Reminders, Meal Plans | 55 Sheets Per Pad",
      "ratings": 1.955,
      "price": "$11.99",
      "image": "https://m.media-amazon.com/images/I/81SjWHqXE3S.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "6 Charming Note Pad Designs: Forget scrambling for the back of a receipt or half-ripped envelope the next time you need to jot a note. Stay on top of daily to-dos with six gorgeous memo pads that help you take on the day in style. Brighten up your kitchen (or office!) with adorable fruit or floral designs and get the whole family in on the organizing fun!     55 Sheets Per Pad: With 55 sheets of paper, each pad has enough room for MONTHS of list-making goodness. Perfect for “Honey Do” lists, important reminders, meal plans, keeping track of upcoming bills, or simply reminding a special someone how much you love them. And with 100% recyclable paper, you’ll feel great knowing you’re helping create a cleaner Earth.     Large, Full-back Magnet: Prevent squirmy grocery list pads from sliding all over your fridge with an extra large magnet that covers the entire back of the pad. Unlike note pads that use tiny, weak magnets, ours firmly grip your refrigerator and STAY there. They’re also great for filing cabinets and lockers, so office workers and students will love them, too!     Thick, Non-bleed Paper: What good is a writing pad if half the paper is unusable, thanks to aggravating ink bleeds that ruin every other sheet? Hin’t: It isn’t! With a full ream of thick, 80gsm paper, each sheet is expertly crafted to prevent ink from bleeding through to the next sheet. Our note pads even stop heavier inks dead in their tracks! (Nice try, ballpoint pens.)     Sturdy And Well-Constructed: We’ll come right out and say it: Most magnetic shopping list pads are just plain DINKY! The magnets fall off, the sheets are hard to tear and they seem to fall apart at record speed. Not ours! They’re superbly constructed with high-quality paper, a premium magnet and strong adhesive for durable pads that stay strong and true.",
      "details": {
        "brand": "Sweetzer & Orange",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "Floral",
        "ram": "N/A",
        "detail_item": "6 Charming Note Pad Designs: Forget scrambling for the back of a receipt or half-ripped envelope the next time you need to jot a note. Stay on top of daily to-dos with six gorgeous memo pads that help you take on the day in style. Brighten up your kitchen (or office!) with adorable fruit or floral designs and get the whole family in on the organizing fun!"
      }
    },
    {
      "id": "B086W6C1VG",
      "name": "Lissi Shopping Cart with 16\" Baby Doll",
      "ratings": 1.307,
      "price": "$29.99",
      "image": "https://m.media-amazon.com/images/I/8110iLg+HxL._AC_SY300_SX300_.jpg",
      "description": "Shopping cart with 16\" baby doll.     Metal frame.     Plastic basket.     Turning front wheels.     Easy to assemble.",
      "details": {
        "brand": "N/A",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "Shopping cart with 16\" baby doll."
      }
    },
    {
      "id": "B0D3KPSK4X",
      "name": "3 Pcs Initial Canvas Tote Bag Reusable Blank Grocery Bag Personalized Present Bag for Bridesmaid Wedding Birthday",
      "ratings": null,
      "price": " ",
      "image": "https://m.media-amazon.com/images/I/710pKwndPjL.__AC_SY445_SX342_QL70_FMwebp_.jpg",
      "description": "",
      "details": {
        "brand": "N/A",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "N/A"
      }
    },
    {
      "id": "B0DH2C24TZ",
      "name": "Sports Canvas Tote Bag, Soccer Gifts, Tennis Gifts, Softball Gifts, Travel Beach Bag, Reusable Grocery Shopping Bag",
      "ratings": null,
      "price": "$9.99",
      "image": "https://m.media-amazon.com/images/I/61I5zTLBv0L.__AC_SY445_SX342_QL70_FMwebp_.jpg",
      "description": "",
      "details": {
        "brand": "N/A",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "N/A"
      }
    },
    {
      "id": "B0D7LVSL4N",
      "name": "2 in 1 Grocery Bag Holder & Trash Bag Dispenser, Metal Trash Bag Holder, Kitchen Grocery Bag Storage Organizer for Cabinet, Under Sink, Wall Mounted or Countertop, Black",
      "ratings": 155,
      "price": "$35.99",
      "image": "https://m.media-amazon.com/images/I/61hl37o1i7L.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "2 in 1 Trash Bag Holder Dispenser: This upgraded plastic bag holder has two spaces - grocery bag holder & garbage bag dispenser. Provides a practical solution for organizing and storing plastics, garbage, groceries, and garbage bags.     Sturdy & Durable: The plastic bag grocery bag holder is made of high-quality metal, sturdy and durable. The surface has been painted, waterproof and rust proof, and will not crack. You can use it with confidence even in humid environments.     Space Saving: Our plastic bag organizer can be used on countertops, installed on walls, cabinet doors, or under sinks. Maximize space savings. You can take measurements before purchasing to ensure the size is correct.     Easy to install: The plastic bag organizer does not require assembly and comes with screws and adhesive hooks. When you want to install a garbage bag organizer on walls or cabinets, not only can you use screws, but you can also choose to use adhesive hooks to protect your walls and cabinets.     Easy to Use: The package includes: a 2-in-1 garbage bag organizer, 4 anti slip rubber feet, 2 screws, and 2 adhesive hooks. The garbage bag dispenser is easy to access, simply open the top sliding cover to put the plastic bag in, and then pull it out through the easy access opening at the front.",
      "details": {
        "brand": "STWWO",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "Black",
        "ram": "N/A",
        "detail_item": "2 in 1 Trash Bag Holder Dispenser: This upgraded plastic bag holder has two spaces - grocery bag holder & garbage bag dispenser. Provides a practical solution for organizing and storing plastics, garbage, groceries, and garbage bags."
      }
    },
    {
      "id": "B0D8M57FZJ",
      "name": "Reusable grocery bag - Canvas bags are oversized, sturdy and collapsible. The only bags with a removable rigid bottom.",
      "ratings": 11,
      "price": " ",
      "image": "https://m.media-amazon.com/images/I/71GMcZfd39L.__AC_SY445_SX342_QL70_FMwebp_.jpg",
      "description": "",
      "details": {
        "brand": "N/A",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "N/A"
      }
    },
    {
      "id": "B0DN19W7G4",
      "name": "136 Pcs Mini Shopping Cart Basket Miniature Food Drink Bottle Supermarket Metal Handcart Toys Doll House Store Cosplay Game Dollhouse Grocery Bread Party Trolley Model Dollar Bills Small Shelves",
      "ratings": null,
      "price": "$20.99",
      "image": "https://m.media-amazon.com/images/I/81ngQe3XajL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Rich in Quantity - Package includes a variety of 136 shopping accessories that your child will love! Included 2pcs toy shopping cart ,2 pcs shopping baskets，2 mini shelves 100 pcs mini food, fruit, bread,and 30 beverage bottles and 1 bundle of paper dollar bill model. Enough quantity and styles that can help to develop creativity and imagination, bringing you kids lots of fun.     High-quality Material - Supermarket handcart crafts with premium metal material, the heavy-gauge steel frame, smooth surface, sturdy and wear-resistant. Through solder joint process, exquisite workmanship. Mini food toys are made of non-toxic resin, safe, sturdy and long-lasting, handmade, hand-painted with exquisite details, realistic appearance can make you more enjoy dressing up your dollhouse.     Wide Applications - Perfect dollhouse accessories to decorate your kitchen, cute and realistic. It is suitable for pretend plays, role plays, scenario simulation, play house,parent-child games, play kitchen or any gift-giving occasion for kids. It can exercise children's thinking ability, hand-eye coordination and color cognition ability, and develop good storage habits.Your kid’s imagination, creativity will be improved and promotes their intellectual development.     Realistic Design - The doll food accessories are handmade, hand-painted with exquisite details, realistic appearance can make you more enjoy dressing up your dollhouse house furniture, dollhouse miniatures the hard material can be applied for your long-term use.     Perfect Gift - Miniatures make a perfect gift for Birthdays and Christmas. Great for miniature garden,miniascape, potted landscaping, Window Display, dollhouse. Great for adding life atmosphere for your dollhouse, remarkable detail and have almost lifelike appearances. Perfect to send them as a gift to a friend that likes to do arts and crafts with miniatures, children, lover, friends and family.",
      "details": {
        "brand": "N/A",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "Rich in Quantity - Package includes a variety of 136 shopping accessories that your child will love! Included 2pcs toy shopping cart ,2 pcs shopping baskets，2 mini shelves 100 pcs mini food, fruit, bread,and 30 beverage bottles and 1 bundle of paper dollar bill model. Enough quantity and styles that can help to develop creativity and imagination, bringing you kids lots of fun."
      }
    },
    {
      "id": "B08WHDNB9R",
      "name": "1/6 Size Grocery Bags, 100 Durable Plastic Bags - T Shirt Handles, Premium Green Plastic Plastic Shopping Bags, Durable, For Retail And Groceries",
      "ratings": null,
      "price": "$40.68",
      "image": "https://m.media-amazon.com/images/I/51JhiBwYdeL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "NATURE-FRIENDLY: Crafted from premium plastic, these plastic bags are constructed to be durable while producing less of a harmful impact on the environment.     PREVENT MESSES AND SPILLS: These high-quality grocery bags are tear-resistant and durable to prevent rips or breaks and keep your items intact during use. Securely take groceries on the go!     COMFORTABLY CARRY YOUR GROCERIES: Great for on the go! These retail bags feature t-shirt style handles that provide you with a secure and comfortable grip that makes it easy to carry your items.     GREEN FINISH ADDS STYLE: These grocery shopping bags have no unwanted dyes and have a printed earth-friendly logo. The green finish offers effortless transparency to easily identify your items.     100 PLASTIC BAGS PER ORDER: Never run out of supplies! These clear plastic bags are âÂ…Â in size and measure 12 inches long by 6.5 inches wide and 22 inches tall. Each order brings 100 bags.",
      "details": {
        "brand": "N/A",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "NATURE-FRIENDLY: Crafted from premium plastic, these plastic bags are constructed to be durable while producing less of a harmful impact on the environment."
      }
    },
    {
      "id": "B0C5Y4DDBP",
      "name": "Gatorade Gx Stainless Steel Bottle, 32oz",
      "ratings": 193,
      "price": "$50.24",
      "image": "https://m.media-amazon.com/images/I/51SXaXH5IEL.__AC_SY300_SX300_QL70_FMwebp_.jpg",
      "description": "Gatorade Gx Stainless Steel Bottle, White, 32oz     Gatorade’s Stainless Steel Bottle is BPA-free with double-wall, vacuum-insulation that keeps drinks cold for hours     The drink-thru cap design lets you open and close the cap with a quick twist     Compatible with Gatorade powders and tablets     Ideal for Pre, during, and post workouts or games     Reusable",
      "details": {
        "brand": "Gatorade",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "White",
        "ram": "N/A",
        "detail_item": "Gatorade Gx Stainless Steel Bottle, White, 32oz"
      }
    },
    {
      "id": "B0DHWSSB71",
      "name": "Insulated Cooler Bag, Reusable Grocery Bags for Hot/Cold Food, Thermal Food Delivery Bag for Beach, Travel, Picnics",
      "ratings": 7,
      "price": "$25.99",
      "image": "https://m.media-amazon.com/images/I/81hDiAF-SIL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Two Sizes To Choose From: Medium: 8\" D x 20\" W x 15\" H, Large: 8\" D x 21\" W x 17\" H. The tote cooler bag is generously sized to provide plenty of room for all your essentials, it can hold a variety of lunch boxes, snacks, groceries and beverages. It is your premium outdoor companion.     Excellent Thermal Insulation: The insulated cooler bag liner is heat-sealed seams of PEVA to prevent water leakage, can be easily wiped clean. The center is made of thick thermal foam to keep beverages cold for 8 hours or longer!     Portable And Collapsible: The soft-sided cooler bag is lightweight construction and comfortable carry handles make it easy to take with you wherever you go, and the collapsible design allows you to fold it up when not in use, saving valuable storage space in your car or home.     Handle Design: The reusable grocery bag handle webbing is made of heavy-duty nylon fabric and is horizontally adjustable for a variety of carrying options     Versatile & Stylish: Grocery insulated cooler bag is a small pocket on the front and back, convenient for you to put your cell phone, keys, wallet and so on. Heavy duty insulated cooler bag not only for picnics, camping, beach. It is also great for grocery shopping, road trips, hiking and dinner parties.",
      "details": {
        "brand": "N/A",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "Two Sizes To Choose From: Medium: 8\" D x 20\" W x 15\" H, Large: 8\" D x 21\" W x 17\" H. The tote cooler bag is generously sized to provide plenty of room for all your essentials, it can hold a variety of lunch boxes, snacks, groceries and beverages. It is your premium outdoor companion."
      }
    },
    {
      "id": "B0CRVSNXSS",
      "name": "Kids Shopping Cart Trolley Play Set and Pretend Play Calculator Cash Register Toy with Pretend Food and Accessories,Perfect for Ages 3+ Pretend Play and Role-Playing Games",
      "ratings": 15,
      "price": "$35.95",
      "image": "https://m.media-amazon.com/images/I/81HpAPkWOpL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "[Deluxe Set for Imaginative Play] Supermarket Play Set 80 PCS,includes Shopping Cart, Cash Register,real calculator, realistic scanner, Balance, Play Food,Fruits and Vegetables, Boxes, Bottles, Stickers and More. The cart requires simple assembly for extra fun.     [Learning Educational Toys for Kids] Yalujumb Educational Toy Shopping Cart Set is a great learning resource for children ages 3+.It encourages vocabulary development as children learn the names of different foods in the supermarket. The cash register calculator automatically accumulates shopping amounts and allows your baby to learn basic math, money skills and hand-eye coordination.     [Unleash Creativity and Imagination]This set of pretend play cash registers and shopping cart ,kids can play with friends or parents with this toy, little ones can use their imagination while improving their social and fine motor skills to keep them away from the electronics alone.     [Designed for Children's Safety and Comfort] This supermarket playset made of high quality and durable materials,The cart's rounded edges and three levels of storage make it perfect for small hands. The round wheels fit a variety of surfaces, and won't scratch floors.     [Ideal Gift for Kids] Toys for kids aged 3-8 years old birthday gifts, Christmas gifts. Safe, odourless and non-toxic. If there are any issues, we are here to promptly assist you. As math learning toy perfect for toddler age 3, 4, 5, 6, 7, 8+ years.",
      "details": {
        "brand": "N/A",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "[Deluxe Set for Imaginative Play] Supermarket Play Set 80 PCS,includes Shopping Cart, Cash Register,real calculator, realistic scanner, Balance, Play Food,Fruits and Vegetables, Boxes, Bottles, Stickers and More. The cart requires simple assembly for extra fun."
      }
    },
    {
      "id": "B0D46SPZ14",
      "name": "Wagon Cart Foldable with Tailgate, Collapsible Wagon with Wheels 150L Large Capacity, 360 lbs Heavy Duty Grocery Cart, Utility Wagon with Brakes for Gardening, Camping, Shopping, Black T",
      "ratings": 86,
      "price": "$59.99",
      "image": "https://m.media-amazon.com/images/I/71RI8rEdFNL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "𝐔𝐥𝐭𝐫𝐚𝐥𝐢𝐠𝐡𝐭 𝐛𝐮𝐭 𝐒𝐩𝐚𝐜𝐢𝐨𝐮𝐬 𝐰𝐢𝐭𝐡 𝐓𝐚𝐢𝐥𝐠𝐚𝐭𝐞: Greatly release your hands from carrying daily stuff by using our portable folding wagon. The Moothing collapsible wagon unfolded size measures as 25\"D x 17\"W x 37\"H. With opened tailgate, it can be extended to 39\"D that provide 𝐞𝐱𝐭𝐫𝐚 𝟰𝟬％ 𝐜𝐚𝐩𝐚𝐜𝐢𝐭𝐲 to 𝟮𝟰𝟬𝐋 for heavy and bigger items.     𝟭𝟮𝐋𝐁𝐒 𝐔𝐭𝐢𝐥𝐢𝐭𝐲 𝐖𝐚𝐠𝐨𝐧 𝐟𝐨𝐫 𝐌𝐮𝐥𝐭𝐢𝐩𝐮𝐫𝐩𝐨𝐬𝐞 𝐔𝐬𝐞: An indispensable foldable wagon in your daily life! It only weigh 𝟭𝟮𝐋𝐁𝐒 as the weight of a small cat which is 𝟱𝟬％ 𝐥𝐢𝐠𝐡𝐭𝐞𝐫 than other lightweight wagon carts! Our grocery wagon provide large capacity for carrying bulky loads for outdoor camping, garden trolley, supermarket shopping, fishing, sports and so on.     𝐔𝐩𝐠𝐫𝐚𝐝𝐞𝐝 𝐇𝐞𝐚𝐯𝐲 𝐃𝐮𝐭𝐲 𝐒𝐭𝐫𝐮𝐜𝐭𝐮𝐫𝐞: Our folding wagon with tailgate is constructed of anti-rust material and enhanced load-bearing frame can load up to 𝟯𝟲𝟬𝐋𝐁𝐒. The 𝟲𝟬𝟬𝐃 Oxford fabric to help this heavy duty utility wagon waterproof and tear resistance to load some sharp and waterish items, and it can be easily removed for cleaning.     𝐀𝐥𝐥-𝐭𝐞𝐫𝐫𝐚𝐢𝐧 𝐖𝐡𝐞𝐞𝐥𝐬 𝐰𝐢𝐭𝐡 𝐁𝐞𝐚𝐫𝐢𝐧𝐠𝐬: Equipped with sturdy wheels that have built-in bearings, this foldable wagon with wheels for groceries ensures smooth and reliable movement across various surfaces. The bearings also contribute to a quieter operation. For added safety and stability, the beach wagon is equipped with a reliable brake system that keeps it stationary when needed, preventing unwanted rolling.     𝐅𝐥𝐞𝐱𝐢𝐛𝐥𝐞 𝐇𝐚𝐧𝐝𝐥𝐞 & 𝐁𝐨𝐭𝐭𝐥𝐞 𝐇𝐨𝐥𝐝𝐬: No need to bend down and pull up the handle! The wagon cart for groceries is designed with flexible handle with rebound function helps a easier operation. Get your drinks near by from two bottle holders. Coming with two wagon strap that will help you load more items into the camping cart and keep them from falling off.",
      "details": {
        "brand": "Moothing",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "Black T Handle",
        "ram": "N/A",
        "detail_item": "𝐔𝐥𝐭𝐫𝐚𝐥𝐢𝐠𝐡𝐭 𝐛𝐮𝐭 𝐒𝐩𝐚𝐜𝐢𝐨𝐮𝐬 𝐰𝐢𝐭𝐡 𝐓𝐚𝐢𝐥𝐠𝐚𝐭𝐞: Greatly release your hands from carrying daily stuff by using our portable folding wagon. The Moothing collapsible wagon unfolded size measures as 25\"D x 17\"W x 37\"H. With opened tailgate, it can be extended to 39\"D that provide 𝐞𝐱𝐭𝐫𝐚 𝟰𝟬％ 𝐜𝐚𝐩𝐚𝐜𝐢𝐭𝐲 to 𝟮𝟰𝟬𝐋 for heavy and bigger items."
      }
    },
    {
      "id": "B09FGNFW4W",
      "name": "Shappy 6 Pieces Extra Large Reusable Shopping Grocery Bags with Handles Colorful Woven Plastic Waterproof Tote Bags",
      "ratings": 125,
      "price": " ",
      "image": "https://m.media-amazon.com/images/I/71LAwoSQKEL.__AC_SY445_SX342_QL70_FMwebp_.jpg",
      "description": "",
      "details": {
        "brand": "N/A",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "N/A"
      }
    },
    {
      "id": "B0DFWLP4M6",
      "name": "Navatiee Foldable Collapsible Wagon Cart, Utility Garden Wagon with 220lbs Weight Capacity, Heavy Duty Lightweight Portable Sport Wagon for Outdoor, Grocery, Camping, ArmyGreen",
      "ratings": 217,
      "price": "$59.99",
      "image": "https://m.media-amazon.com/images/I/71nmZb+9ScL._AC_SY300_SX300_.jpg",
      "description": "CONVENIENT VERSATILITY: Introducing the amazing ultimate collapsible wagon! It's the perfect blend of style and convenience! This amazingly lightweight and compact wagon lets you switch between pull and carry modes with detachable wheels in a flash! Amaze yourself by effortlessly removing the wheels and carrying it like a stylish briefcase!     DEPENDABLE AND DURABLE: Built to last with a robust frame and unique technology, so you can load up to 220 lbs. with confidence. The 600D Oxford fabric interior pockets enhance the wagon's reliability, so you can be sure your gear is safe and sound. You can effortlessly transport all your gear in one go, ready to take on any challenge with style and durability.     EFFORTLESS NAVIGATION: Navatiee wagon is elevated by its intuitive telescopic handle and 360-degree swiveling front wheel, adding a touch of elegance and sophistication to its navigation. Just like charting your life's path, you have the freedom to choose your wagon's course – the possibilities are endless!     COMPACT AND MIGHTY: Embrace the innovative fold-flat design that allows for quick folding without tools, and get ready to be amazed by its incredible lightweight quality at just 12 pounds! When folded, it measures a mere 16.7\" x 6.7\" x 13\", making it a breeze to stow in your car boot, closet, or any storage space.     GROCERY OR SHOPPING LIFESAVER: Designed for versatility and high performance, Navatiee wagon is your essential tool for reducing the toil of grocery transport. It's the perfect companion for your next shopping trip, ensuring your goods are transported with ease and comfort.",
      "details": {
        "brand": "Navatiee",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "Armygreen",
        "ram": "N/A",
        "detail_item": "CONVENIENT VERSATILITY: Introducing the amazing ultimate collapsible wagon! It's the perfect blend of style and convenience! This amazingly lightweight and compact wagon lets you switch between pull and carry modes with detachable wheels in a flash! Amaze yourself by effortlessly removing the wheels and carrying it like a stylish briefcase!"
      }
    },
    {
      "id": "B0CRSFSY8L",
      "name": "iDesign Recycled Plastic Grocery Bag Holder and Dispenser – 4.03” L x 8.3” W x 12.5” H, White",
      "ratings": 44,
      "price": "$11.36",
      "image": "https://m.media-amazon.com/images/I/51aVlwaXOsL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "BAG DISPENSER – Add attractive storage to your kitchen with the iDesign Plastic Bag Holder for Grocery Bags; the perfect combination of style & function, this bag holder has a sleek design for space saving storage     WALL MOUNT BAGGIE ORGANIZER – This plastic bag organizer can be mounted to any wall or cabinet to create instant storage in unused paces     STYLISH DESIGN – The white finish of this stylish storage bag organizer will match any kitchen décor; the grocery bag dispenser is also great for organizing the bathroom or garage     MADE WITH RECYCLED PLASTIC – Made of a durable recycled plastic, this grocery bag holder for plastic bags stands up to everyday use     EFFICIENT SIZE – Measuring 4.03” L x 8.3” W x 12.5” H, the plastic bag holder creates storage in the cabinet, wall, closet, or anywhere you need instant organization",
      "details": {
        "brand": "N/A",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "BAG DISPENSER – Add attractive storage to your kitchen with the iDesign Plastic Bag Holder for Grocery Bags; the perfect combination of style & function, this bag holder has a sleek design for space saving storage"
      }
    },
    {
      "id": "B0CPJFV9QR",
      "name": "Paterr 50 Pack Reusable Grocery Bags Foldable Shopping Bags Bulk Washable Grocery Tote Bags with Carry Pouch for Groceries",
      "ratings": 18,
      "price": " ",
      "image": "https://m.media-amazon.com/images/I/91F3xEZYsUL.__AC_SY445_SX342_QL70_FMwebp_.jpg",
      "description": "",
      "details": {
        "brand": "N/A",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "N/A"
      }
    },
    {
      "id": "B0CW97M75J",
      "name": "Bodaon 10Pk Collapsible Reusable Grocery Bags with Plastic Bottom, the Utility Tote Bag Bulk, Large Folding/Foldable Reusable Shopping Cart for Groceries, Shopping Basket Heavy Duty (Mixed Color)",
      "ratings": 41,
      "price": "$23.99",
      "image": "https://m.media-amazon.com/images/I/71DvVpCh0iL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "【LARGE CAPACITY】:Dimension: 13W x 10H x 15D inch, with its generous capacity of 32L/8.4 Gallons. With its generous size, the shopping bag makes shopping a breeze. You won't need to carry multiple plastic bags or small shopping bags anymore. This makes your shopping experience smoother and more efficient.     【MULTI-FUNCTIONAL】:Our shopping bags are true multitaskers! Not only perfect for your everyday shopping needs, but also an ideal choice for business events, travels, picnics, outdoor activities, or gift giveaways. With its spacious capacity, you can easily carry all your essentials, making it suitable for various occasions.. Get one for multiple purposes and enjoy a convenient and enjoyable shopping experience     【6 COLORS FOR CHOICE】:Our shopping bags come in 6 different colors for you to choose from. Our color options aim to meet various needs and personal preferences. You can choose your favorite color based on your preferences and style, making your shopping experience more personalized and unique     【BULK IN QUANTITY】:We offer three choices of bag amounts: 2-pack, 4-pack, and 6-pack, to meet the needs of most families. This helps you categorize your purchases with ease. While shopping at the supermarket or mall, you can place different items     【REUSABLE & ECO FRIENDLY】:The shopping bags are crafted using eco-friendly materials, providing you with a guarantee of top-notch quality for your shopping experience. Carefully selected materials ensure the durability of the shopping bags, allowing for multiple reuses and serving as a sustainable alternative to traditional plastic bags. By purchasing our shopping bags, not only do you contribute to the environment, but you also gain a long-lasting shopping companion     【COLLAPSIBLE】:Despite its large capacity, these shopping bags often come with foldable and easy-to-store features. When not in use, you can simply fold them up and tuck them into your purse or car trunk without taking up too much space     【PLASTIC BOTTOM】:Each of our shopping bags comes with an individual bottom panel. This design provides the shopping bag with a sturdy bottom structure, allowing it to stand on its own and remain stable without the need for additional support. The bottom panel securely fits into the base of the shopping bag, ensuring that the bag maintains its shape and stability when loaded with items",
      "details": {
        "brand": "N/A",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "【LARGE CAPACITY】:Dimension: 13W x 10H x 15D inch, with its generous capacity of 32L/8.4 Gallons. With its generous size, the shopping bag makes shopping a breeze. You won't need to carry multiple plastic bags or small shopping bags anymore. This makes your shopping experience smoother and more efficient."
      }
    },
    {
      "id": "B0DB5KXFTC",
      "name": "French Fry Cutter, Heavy Duty Potato Slicer, Stainless Steel Potato Chopper Set with 1/2 Inch Blades for Sweet Potato, Carrot, Yam, Cucumbers (1/2 Inch Blade)",
      "ratings": 8,
      "price": "$83.99",
      "image": "https://m.media-amazon.com/images/I/61y7-TnUAkL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Materials: The body is made of stainless steel and aluminum, with a stronger cast iron handle, durable and not easy to scratch, easy to clean, and not easy to rust .If you receive a package with missing or damaged parts, please contact us for a replacement     Sharp Blade: Equipped with stainless steel blade, extremely sharp, not easy to loosen, to meet your cutting needs.stainless steel blade made by exquisite craftsmanship, extremely sharp, effortless to cut potato, beet, sweet potato and onion etc     Labor-Saving and Efficient: Cut potatoes in a short time for french fries. Will help you save time and space. Whether it's for business or using it at home with family and friends, it's your competent assistant.The chip cutter is easy to install and has an I-shaped handle, so you can easily handle large amounts of food. Ideal for home and commercial use     Stable Suction Cups: The base comes with four non-slip suction cups to ensure that the machine is stable on the workbench when cutting, and will not slip, protecting your safety.Note: Please use it on smooth countertops and keep the suction cups tidy. If the suction is not strong please check if there is dust at the suction cup     Widely Used: This cutter is not only suitable for cutting potatoes to make French fries but also perfect for cucumbers, carrots, zucchini, Onions, apples, and other fruits and vegetables. Whether it's for business or using it at home with family and friends, it's your competent assistant",
      "details": {
        "brand": "Awgpd",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "Black",
        "ram": "N/A",
        "detail_item": "Materials: The body is made of stainless steel and aluminum, with a stronger cast iron handle, durable and not easy to scratch, easy to clean, and not easy to rust .If you receive a package with missing or damaged parts, please contact us for a replacement"
      }
    }
  ]
}