{
  "totalProducts": 28,
  "products": [
    {
      "id": "B0CCZWCPRQ",
      "name": "Rii RK100+ Multiple Color Rainbow LED Backlit Large Size USB Wired Mechanical Feeling Multimedia PC Gaming Keyboard,Office Keyboard for Working or Primer Gaming,Office Device",
      "ratings": 6.849,
      "price": "$21",
      "image": "https://m.media-amazon.com/images/I/61jhVTLFAEL.__AC_SY300_SX300_QL70_FMwebp_.jpg",
      "description": "Rii Wired Multimedia Gaming KeyboardProfessional Mechanical feeling backlit gaming keyboard,Ideal for desktop and PC; Can be used for gaming and office,not the real mechanical keyboard,,but it worth more.     Support Win10, Win8, Win7, Linux, Vista, IBM PC Laptop Pad Google Android TV Box HTPC IPTV Smart TV Mac OS Raspberry Pi ,Chrome OS and Linux OS     Features rainbow backlight with breathing light function; Press fn + light key to enter into breathing light mode; Press light button thrice to turn off backlight     Standard 105 Keys full size keyboard; Comes with 11 special designed multi media keys combinations,Measures 17.1 x 5.3 x 0.9 inches     Automatically enters sleeping mode if not used for 10 minutes; Any key press will awaken and backlights turn back on",
      "details": {
        "brand": "Rii",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "USB",
        "color": "Rainbow LED Backlit/Black keys",
        "ram": "N/A",
        "detail_item": "Rii Wired Multimedia Gaming KeyboardProfessional Mechanical feeling backlit gaming keyboard,Ideal for desktop and PC; Can be used for gaming and office,not the real mechanical keyboard,,but it worth more."
      }
    },
    {
      "id": "B00B7GV802",
      "name": "Amazon Basics USB Wired Computer Keyboard (QWERTY) and Mouse Bundle Pack, Black",
      "ratings": 10.889,
      "price": "$13.99",
      "image": "https://m.media-amazon.com/images/I/71y-jMVFfTL.__AC_SY300_SX300_QL70_FMwebp_.jpg",
      "description": "Low-profile keys provide a quiet, comfortable typing experience     Hotkeys enable easy access for Media, My Computer, mute, volume down, volume Up, and calculator; 4 function keys control previous track, Stop, Play/Pause, Next track on your media player     Simple wired USB connection; works with Windows 2000, XP, Vista, 7, 8, 10 and later     Smooth, precise and affordable USB-connected 3-button optical mouse for the desktop PC     High-definition (1000 dpi) optical tracking enables responsive cursor control for precise tracking and easy text selection",
      "details": {
        "brand": "Amazon Basics",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "Wired",
        "color": "black",
        "ram": "N/A",
        "detail_item": "Low-profile keys provide a quiet, comfortable typing experience"
      }
    },
    {
      "id": "B0C4YF92Y3",
      "name": "FOPETT Wireless Keyboard and Mouse Combo, 105 Keys Full-Sized 2.4 GHz Round Keycap Colorful Keyboards, USB Receiver Plug and Play, for Windows, Mac, PC, Laptop, Desktop (Milkteacolorful)",
      "ratings": 3.508,
      "price": "$38.99",
      "image": "https://m.media-amazon.com/images/I/61Je93umeNL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "A fusion of retro style and modern design: The inspiration of these cute rounded keys come from vintage typewriters offering you visual enjoyment and retro feeling to type. The mini Optical mouse is with modern ergonomic design,DPI adjustable(800-1200-1600).The combo will bring you a nostalgic feeling with the eye-catching retro aesthetic.     Powerful&Reliable 2.4GHz wireless connection:2.4GHz signal delivers up to a range of 28 feet connection that allows you to work with your PC from a distance. One small Nano receiver (USB 2.0) connects both the mouse and keyboard,high speed rate of return allows the combo to ensure their stable and smooth transmission without delay and frame skip,hence to enhance your typing experience.     Convenient Hotkeys: 13 Easy-to-reach function keys provides a shortcut to your music,emails,multimedia control,web,etc.For instance,you can play the music you want by simply press the Fn+Esc.     Longer battery life design: both keyboard and mouse turn into Power-save mode automatically,click any key or button to wake-up within seconds.Each of them runs on one AA battery (NOT included).Low battery indication shows in the top right corner,when the battery is dying,the keyboard's low battery indication light will remind you to replace the battery.     Compatible with operating systems(USB 2.0 port,require no special software or drivers)---Windows or Mac OS, Work perfectly with PC,Laptop,Smart TVand more---(Note: Hotkeys function may not fully compatible with Mac, OS System).",
      "details": {
        "brand": "FOPETT",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "Usb",
        "color": "Milkteacolorful",
        "ram": "N/A",
        "detail_item": "A fusion of retro style and modern design: The inspiration of these cute rounded keys come from vintage typewriters offering you visual enjoyment and retro feeling to type. The mini Optical mouse is with modern ergonomic design,DPI adjustable(800-1200-1600).The combo will bring you a nostalgic feeling with the eye-catching retro aesthetic."
      }
    },
    {
      "id": "B0BF64DN6H",
      "name": "SteelSeries Apex Pro TKL HyperMagnetic Gaming Keyboard - Adjustable Actuation - Esports Tenkeyless - OLED Screen - RGB - PBT Keycaps - USB-C - 2023 Edition,Black",
      "ratings": 6.09,
      "price": "$149.64",
      "image": "https://m.media-amazon.com/images/I/71aDZGDOwlL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "FULLY CUSTOMIZABLE & STUPIDLY FAST with OmniPoint 2.0 Adjustable HyperMagnetic switches     RAPID TRIGGER — Eradicate latency arising from the physical movement of the switch through dynamic activation and deactivation of keys based on travel distance rather than a fixed point in the key travel.     ULTIMATE CONTROL — 40 levels of per-key actuation (0.1 – 4.0mm) – set WASD for light, ultra-fast movements and set ability keys to deep presses to avoid accidentally triggering specials     2-IN-1 ACTION KEYS — Program two different actions to the same key, such as walking with a light touch or sprinting with a deep press     20x faster actuation, 11x faster response than traditional mechanical keyboards     Esports-ready TKL form factor. Full-size functionality. Premium aluminum top plate. Detachable USB-C.",
      "details": {
        "brand": "SteelSeries",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "wired",
        "color": "Black",
        "ram": "N/A",
        "detail_item": "FULLY CUSTOMIZABLE & STUPIDLY FAST with OmniPoint 2.0 Adjustable HyperMagnetic switches"
      }
    },
    {
      "id": "B0CMZ15QB6",
      "name": "MageGee Typewriter Mechanical Gaming Keyboard, Retro Gold Punk Round Keycap LED Backlit USB Wired Keyboards for Game and Office, for Windows Laptop PC Mac - Blue Switches",
      "ratings": 2.176,
      "price": "$39.99",
      "image": "https://m.media-amazon.com/images/I/71ZUEJycEmL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "【Retro Typewriter Style Mechanical Keyboard】It's a cute and funning gold typewriter keyboard, plating punk round keycap with beautiful blue switch make clicky-clacky sound make typing enjoyable, just like a typewriter.     【104-Key Anti-ghosting Keyboards】This is a Full-Size keyboard, featuring standard keyboard layout with F1-F12 function keys and number pad, provides high responsive commands for typing and gaming.     【Multiple LED Gold Backlit Modes】The Keyboard is Double-shot injection molded keycap for clear backlight and extreme durability, press Fn+Ins/HM/Pg/Del/End can adjust various kinds lighting effect, arrow keys change backlight brightness and speed.     【Ergonomics Design】High low key layout with suspended round key fits fingers effectively, adjustable double kickstand feet, help reduce hand fatigue, aluminum alloy metal panel, matte texture, sturdy and robust, protect it from scratch.     【Extensive Compatibility】MageGee typewriter keyboards use USB 2.0 connector making it compatible with Windows (2000, XP, ME, Vista, 7, 8), Linux and Mac, plug and play, no drivers or software required.",
      "details": {
        "brand": "MageGee",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "USB",
        "color": "Gold",
        "ram": "N/A",
        "detail_item": "【Retro Typewriter Style Mechanical Keyboard】It's a cute and funning gold typewriter keyboard, plating punk round keycap with beautiful blue switch make clicky-clacky sound make typing enjoyable, just like a typewriter."
      }
    },
    {
      "id": "B0D17C3ZVJ",
      "name": "TECKNET RGB Gaming Keyboard, 105 Keys, All-Metal Panel, 15-Zone RGB Illumination, Silent Keyboard with Wrist Rest, 25 Anti-ghosting Keys, IP32 Water Resistance, USB Wired Keyboard for PC, Mac, Laptop",
      "ratings": 1.845,
      "price": "$26.99",
      "image": "https://m.media-amazon.com/images/I/817vi8DaEKL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "【15-Zone Rainbow Backlit Keyboard】Choose from 5 illumination modes and 4 brightness levels on the gaming keyboard. Even in low light conditions, the keys are easily identifiable, enhancing typing accuracy and efficiency. 15 RGB color modes to create the perfect atmosphere for your typing adventure.     【Wear Resistant ABS Keycaps & Metal Panel】The RGB gaming keyboard is made of highly resistant ABS plastic keycaps and a metal base, improving texture and durability while reducing movement and bending during use. Featuring the classic volcano switch structure, it can endure an impressive 50 million keystrokes.     【Ergonomic Design, Enhance Gaming Experience】The wired gaming keyboard with a wrist rest offers an ergonomic typing angle (7°) along with a scientific stepped key design. The accompanying wrist rest maintains your hands in a natural position, reducing hand fatigue. With soft key feedback and minimal noise, this keyboard is ideal for late-night gaming sessions or office tasks.     【25 Anti-ghost Keys & 12 Multimedia Keys】The silent gaming keyboard is equipped with anti-ghost keys, enabling 25 keys to function simultaneously for quick and precise responses during games. Additionally, the 12 multimedia keys allow you to control play, pause, and skip multimedia operations directly from the keyboard, ensuring a seamless and uninterrupted gaming experience. (NOTE: Multimedia keys are not available on Mac)     【IP32 Spill Resistance】The quiet gaming keyboard boasts IP32 spill resistance, with cleverly designed four drainage holes in the wrist rest to prevent accidents, ensuring your game never stops. The removable key cover makes cleaning easy.     【Auto-Sleep Mode, Energy Saving】After 5 minutes of inactivity, the gaming keyboard automatically goes into sleep mode, turning off the backlight to save power. Press any key to wake up the buttons and backlight.     【Life Time Support】If you do not like our product or service, please feel free to contact us. Each TECKNET product provides a 36 months warranty (registered only).",
      "details": {
        "brand": "TECKNET",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "USB-A",
        "color": "Black",
        "ram": "N/A",
        "detail_item": "【15-Zone Rainbow Backlit Keyboard】Choose from 5 illumination modes and 4 brightness levels on the gaming keyboard. Even in low light conditions, the keys are easily identifiable, enhancing typing accuracy and efficiency. 15 RGB color modes to create the perfect atmosphere for your typing adventure."
      }
    },
    {
      "id": "B0C7KFZ5TL",
      "name": "ASUS ROG Strix Scope II 96 Wireless Gaming Keyboard, Tri-Mode Connection, Dampening Foam & Switch-Dampening Pads, Hot-Swappable Pre-lubed ROG NX Snow Switches, PBT Keycaps, RGB-Black",
      "ratings": 412,
      "price": "$159.99",
      "image": "https://m.media-amazon.com/images/I/91YxKZjwOPL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "96% layout: Retains all function and number keys in a more compact and efficient layout that frees up desk space     Hot-swappable switches: Pre-lubed NX Snow linear switches and ROG NX Storm clicky switches with walled stem design to enhance keystroke stability and are tuned for great acoustics     Tri-mode connection: Connect using Bluetooth (up to three devices), 2.4 GHz with ROG SpeedNova wireless technology or wired USB     Sound-dampening foam with switch-dampening pads: Unique, integrated dampening foam with added switch-dampening pad structure absorbs pinging noises and echoes for improved keystroke acoustics.     Enhanced typing experience: Pre-lubed keyboard stabilizers produce less friction for smoother keystrokes and stability for longer keys; durable ROG PBT doubleshot keycaps or UV-coated ABS keycaps offer a premium feel and shine resistance     Hotkeys: F1–F5 keys are pre-programmed as hotkeys for Xbox Game Bar and recording     Intuitive controls: Multi-function button and multi-wheel for media playback, volume, and keyboard lighting",
      "details": {
        "brand": "ASUS",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "wired, wireless",
        "color": "Black",
        "ram": "N/A",
        "detail_item": "96% layout: Retains all function and number keys in a more compact and efficient layout that frees up desk space"
      }
    },
    {
      "id": "B0CCXKPM64",
      "name": "MageGee 75% Mechanical Gaming Keyboard with Brown Switch, LED White Backlit Keyboard, 87 Keys Compact TKL Wired Computer Keyboard for Windows Laptop PC Gamer - Retro Grey/White",
      "ratings": 3.13,
      "price": "$29.99",
      "image": "https://m.media-amazon.com/images/I/61IR7bwqICL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "[Mechanical brown switch]: the feature button sound is quiet, the resistance is small, a good balance of click switch and linear switch performance in terms of acoustic feedback and triggering.     [Classic charming white LED backlight]: customize multiple illuminated light effects with static and dynamic, supports about 19 kinds backlight modes, press Fn+| to switch, FN+↑/↓ control backlight brightness, FN+←/→ control backlight speed.     [Full anti-ghosting keyboard]: all 87 keys are no conflict, allow multiple keys to work simultaneously with high speed for a reliable connection, have 12 multimedia keyboard, great for gamer, typist, programmer, writer etc.     [Ergonomic mechanical keyboards]: stylish retro grey white mash up 75% layout, come with extra 16 red keycaps, double-shot injection non-slip suspension keycap, splash-proof design, durable metal panel enough to protect it from scratch, also firm kickstand feet adjustable typing angle.     [Extensive Compatibility]: MageGee MK-Star mechanical keyboards use USB 2.0 connector making it compatible with Windows (2000, XP, ME, Vista, 7, 8), Linux and Mac, plug and play, no drivers or software required.",
      "details": {
        "brand": "MageGee",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "USB-A",
        "color": "Grey White/Brown Switch",
        "ram": "N/A",
        "detail_item": "[Mechanical brown switch]: the feature button sound is quiet, the resistance is small, a good balance of click switch and linear switch performance in terms of acoustic feedback and triggering."
      }
    },
    {
      "id": "B0BKW3LB2B",
      "name": "Logitech MX Keys S Wireless Keyboard, Low Profile, Fluid Precise Quiet Typing, Programmable Keys, Backlighting, Bluetooth, USB C Rechargeable, for Windows PC, Linux, Chrome, Mac - Graphite",
      "ratings": 20.203,
      "price": "$108.19",
      "image": "https://m.media-amazon.com/images/I/71skZeAyPuL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Fluid Typing Experience: Laptop-like profile with spherically-dished keys shaped for your fingertips delivers a fast, fluid, precise and quieter typing experience     Automate Repetitive Tasks: Easily create and share time-saving Smart Actions shortcuts to perform multiple actions with a single keystroke with the Logi Options+ app (1)     Smarter Illumination: Backlit keyboard keys light up as your hands approach and adapt to the environment; Now with more lighting customizations on Logi Options+ (1)     More Comfort, Deeper Focus: Work for longer with a solid build, low-profile design and an optimum keyboard angle that is better for your wrist posture     Multi-Device, Multi OS Bluetooth Keyboard: Pair with up to 3 devices on nearly any operating system (Windows, macOS, Linux) via Bluetooth Low Energy or included Logi Bolt USB receiver (2)     USB C Rechargeable Keyboard: Stays powered for up to 10 days on a full charge or up to 5 months (backlighting turned off) (4); quick charge with the included USB-C charging cable     Team with Master 3S: Pair any MX wireless keyboard and mouse with Logi Options+ and seamlessly work, transfer text and files between up to 3 computers (Windows & macOS)     Recycled: Plastic parts in MX Keys S Wireless Keyboard include certified post-consumer recycled plastic â?? 26% for Graphite and 11% for Pale Grey (5)",
      "details": {
        "brand": "Logitech",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "Bluetooth, USB, USB-C",
        "color": "Graphite",
        "ram": "N/A",
        "detail_item": "Fluid Typing Experience: Laptop-like profile with spherically-dished keys shaped for your fingertips delivers a fast, fluid, precise and quieter typing experience"
      }
    },
    {
      "id": "B07NY9ZT92",
      "name": "Logitech G915 LIGHTSPEED RGB Mechanical Gaming Keyboard, Low Profile GL Clicky Key Switch, LIGHTSYNC RGB, Advanced LIGHTSPEED Wireless and Bluetooth Support - Clicky,Black",
      "ratings": 13.879,
      "price": "$143.00",
      "image": "https://m.media-amazon.com/images/I/51jkxo3a7bL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "LIGHTSPEED wireless delivers pro-grade performance with flexibility and freedom from cords. Creates a clean aesthetics for battlestations. Delivers 30 hours on a single full charge.     LIGHTSYNC technology provides next-gen RGB lighting that synchronizes lighting with any content. Personalize each key or create custom animations from ~16.8M colors with Logitech G HUB software.     Low Profile mechanical switches offers the speed, accuracy and performance of a mechanical switch at half the height. The GL Clicky switch features a distinctive sound and tactile feedback. Comes in 3 options: GL Tactile, GL Linear or GL Clicky.     Beautifully crafted, the G915 uses aircraft-grade aluminum alloy to deliver incredibly thin but rigid and durable design.     Enjoy 30 hours of game time on a single charge. Low battery warnings at 15 percent on the keyboard battery LED and via pop-up notification in the Logitech G HUB software. Quickly recharges in 3 hours.     Five dedicated G-keys can be programmed with custom macros and commands per game or app profile. Requires use Logitech G HUB to easily setup and manage profiles, commands and more.     Dedicated media controls with a precision engineered, edgeless volume wheel provide convenient and easy control to quickly play, pause, skip or mute your media.     Connect to multiple devices uses LIGHTSPEED or Bluetooth. Toggle between high-performance LIGHTSPEED wireless via USB receiver and Bluetooth— quickly and easily.",
      "details": {
        "brand": "Logitech G",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "Bluetooth",
        "color": "Black",
        "ram": "N/A",
        "detail_item": "LIGHTSPEED wireless delivers pro-grade performance with flexibility and freedom from cords. Creates a clean aesthetics for battlestations. Delivers 30 hours on a single full charge."
      }
    },
    {
      "id": "B0CMTQ95X3",
      "name": "FD 2.4GHz Wireless Keyboard and Mouse Set with Switch Button - Full-Size Keyboard - Compatible for Windows/Laptop/PC/Notebook/Smart TV and More - Light Pink Colorful",
      "ratings": 4.169,
      "price": "$19.49",
      "image": "https://m.media-amazon.com/images/I/71X4W0cKqYL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Keyboard and Mouse Warranty : We offer a three-year worry-free warranty and a 60-day money-back guarantee or replacement option. If you have any inquiries or concerns regarding our wireless keyboard and mouse set, please don't hesitate to contact us. Your satisfaction is our top priority.     Mouse and Keyboard Four Major Advantages : 1)Super large anti-slip silicone base enhances friction. 2)Laser-engraved high-definition characters with injection molding process, ensuring keycaps never fade. 3)Imported chip with pure-grade DSP environment noise reduction algorithm reduces key sound, solving the issue of multiple sets being used simultaneously in the same office without key skipping or interference. 4)keyboard Power-saving switch that helps conserve battery power.     Cute Wireless Keyboard - Stable 2.4G Wireless Connection : Enjoy a powerful wireless connection with a range of up to 10 meters (393.7 inches) for the keyboard and mouse combo. They utilize a shared Nano receiver, conveniently stored at the bottom of the mouse, Plug and Play.eliminating the need for additional software installation.keeping your desk clean.Keyboard size 17.5 x 5.5 x 1.3 inch with 105 Keys. Mouse size is 4.1 x 2.5 x 1.0 inch. Keyboard net weight: 1.57LB,Mouse net weight: 0.15LB.     Wireless Keyboard and Mouse Full Size : Thanks to the silent micro-motion technology, the mouse clicks are nearly silent, eliminating bothersome knocking sounds that could disturb you and your family. The cordless mouse DPI levels (1600) for fast and precise cursor control, all while maintaining a quiet operation. Whether you're working or playing, you'll never have to worry about disturbing others' rest.     Wireless Keyboards Ergonomic Design :The keyboard is designed with a tilt angle,comfortable typing position，The wireless mouse features a sweat-resistant and skin-friendly finish, with a contoured shape that allows for hours of comfortable work.If you encounter any issues with our product, whether it's exceeding Amazon's return time or receiving a defective item, please reach out to us via Amazon email as your first point of contact. We are committed to providing you with satisfactory solutions.     Keyboards Wide Compatibility : Wireless Keyboard - Our wireless computer keyboard is 12 function keys for quick access to music, volume, mail, and more (please note that the hotkeys may not be fully compatible with Mac systems). This keyboard mouse combo is compatible with various operating systems, including Windows XP/ME/Vista/7/8/10/11. It works seamlessly with devices that have a USB slot, such as PCs, laptops, MacBooks, desktops, Chromebooks, and even Smart TVs.     Colorful Keyboard Shared Receiver : A USB receiver simultaneously drives the keyboard and mouse, enabling wireless transmission with a stable and delay-free signal,2.4G wireless transmission technology, supporting multiple computer types.The design incorporates splash resistance, with a waterproof conductive film that allows liquid to flow out from within the keyboard membrane. The mouse requires one 1.5V AA battery (included), while the keyboard requires two 1.5V AAA battery (included).",
      "details": {
        "brand": "FD",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "Usb",
        "color": "105 Keys Light Pink Colorful",
        "ram": "N/A",
        "detail_item": "Keyboard and Mouse Warranty : We offer a three-year worry-free warranty and a 60-day money-back guarantee or replacement option. If you have any inquiries or concerns regarding our wireless keyboard and mouse set, please don't hesitate to contact us. Your satisfaction is our top priority."
      }
    },
    {
      "id": "B07WJ5D3H4",
      "name": "Amazon Basics Wired Keyboard, Full-Sized, QWERTY Layout, Black",
      "ratings": 7.306,
      "price": "$20.89",
      "image": "https://m.media-amazon.com/images/I/71ehwfAM4-L.__AC_SY300_SX300_QL70_FMwebp_.jpg",
      "description": "KEYBOARD: The keyboard has hot keys that enable easy access to Media, My Computer, Mute, Volume up/down, and Calculator     EASY SETUP: Experience simple installation with the USB wired connection     VERSATILE COMPATIBILITY: This keyboard is designed to work with multiple Windows versions, including Vista, 7, 8, 10 offering broad compatibility across devices.     SLEEK DESIGN: The elegant black color of the wired keyboard complements your tech and decor, adding a stylish and cohesive look to any setup without sacrificing function.     FULL-SIZED CONVENIENCE: The standard QWERTY layout of this keyboard set offers a familiar typing experience, ideal for both professional tasks and personal use.",
      "details": {
        "brand": "Amazon Basics",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "USB",
        "color": "Black",
        "ram": "N/A",
        "detail_item": "KEYBOARD: The keyboard has hot keys that enable easy access to Media, My Computer, Mute, Volume up/down, and Calculator"
      }
    },
    {
      "id": "B00NLZUM36",
      "name": "Redragon S101 Gaming Keyboard, M601 Mouse, RGB Backlit Gaming Keyboard, Programmable Backlit Gaming Mouse, Value Combo Set [New Version]",
      "ratings": 46.01,
      "price": "$39.99",
      "image": "https://m.media-amazon.com/images/I/71QDJHG1PqL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "🌟PC GAMING KEYBOARD AND GAMING MOUSE COMBO: Includes Redragon RGB Backlit Computer Gaming Keyboard and RGB Backlit Gaming Mouse. ALL-IN-ONE PC GAMER VALUE KIT, Fantastic for Gamers (New Improved Version)     🌟RGB BACKLIT GAMING KEYBOARD; 7 different RGB Lighting modes & effects, 4 backlight brightness levels, adjustable breathing speed. The keycaps offer clear uniform backlighting WIN key can be disabled for gaming. The PC Gaming Keyboard has been ergonomically designed to be a superb typing tool for office work as well. The gaming Keyboard is built to withstand the average liquid spill. The integrated wristrest gives you the comfort you need for marathon gaming sessions     🌟MULTI MEDIA & ANTI GHOSTING; The Gaming Keyboard has 25 conflict-free (n-Key Rollover) 10 Dedicated Multimedia keys plus 12 additional FN+ Multimedia keys (Total 114 keys). Keys are quiet, designed for longevity, and durability delivering precise tactile feedback. Comes with a Full numeric keypad and a gold-plated corrosion-free USB connector for a reliable connection and ultimate Gaming performance     🌟WIRED PROGRAMABLE GAMING MOUSE; Ergonomic Redragon RED Backlit Gaming Mouse up to 3200 DPI (user adjustable 800/1600/2400/3200 DPI), 30G acceleration and Weight Tuning set. Total 6 Buttons of which 5 are programmable. The High-Precision Sensor delivers Pinpoint Accuracy while the Gaming Grade Micro Switches ensure longevity, greater durability, and extreme responsiveness, giving you an even greater edge over your competition     🌟PC GAMING KEYBOARD AND MOUSE COMPATIBILITY: Windows 10, Windows 8, Windows 7, Windows Vista, or Windows XP, Limited Mac OS keyboard support. Works well with all major computer brands and Gaming PCs",
      "details": {
        "brand": "Redragon",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "Usb",
        "color": "Black",
        "ram": "N/A",
        "detail_item": "🌟PC GAMING KEYBOARD AND GAMING MOUSE COMBO: Includes Redragon RGB Backlit Computer Gaming Keyboard and RGB Backlit Gaming Mouse. ALL-IN-ONE PC GAMER VALUE KIT, Fantastic for Gamers (New Improved Version)"
      }
    },
    {
      "id": "B0C9ZJHQHM",
      "name": "Womier S-K80 75% Keyboard with Color Multimedia Display Mechanical Gaming Keyboard, Wired Hot Swappable Keyboard, Gasket Mount RGB Custom Keyboard, Pre-lubed Stabilizer for Mac/Win, Black Kanagawa",
      "ratings": 538,
      "price": "$69.99",
      "image": "https://m.media-amazon.com/images/I/71duf0rTDqL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Vibrant Color Multimedia Screen: The DIY multimedia display screen design in the upper right corner of the keyboard allows you to visualize in custom gif image, caps lock, connection mode, WIN/MAC, system, backlit brightness/speed, RGB mode/color, volume & language and more. Display screen 11°oblique angle height will be more in line with visual habits.     Black Theme Style 75% Gasket Mounted Mechanical Keyboard: The keyboard adopts the classic keycap cherry profile art theme keycaps. Experience maximum comfort while gaming with the S-K80's gasket mount design. The keyboard features an EVA positioning plate and bottom filling for a soft and responsive feel. The gasket mount design enhances stability and reduces typing noise for an immersive gaming experience.     Premium Hot-Swappable Custom Keyboard: The pre-lubed linear switches with south-facing transparent light diffusers provide a comfortable keystroke feeling, an amazing out-of-the-box clean typing sound. The hot swappable PCB of this gasket mounted keyboard is compatible with 3Pin or 5Pin Switches.     Pro Software Customizable Keyboard: The RGB Backlight mode, Macro and Gif image display settings of the keyboard can be fully customizable through the keyboard driver. For users who wish to customize their keyboards, these designs offer more alternatives. ( 'Music Syncing' mode enables rhythmic lighting patterns from music played.)     Ultimate RGB Backlighting: The keyboard has 19 lighting effects as well as 9 lighting colors, in addition to which the brightness and flow rate of the keyboard's lights can be adjusted. This themed keyboard is compatible for both Mac/Win system. The detachable TYPE-C connection provides you with the flexibility to connect various devices, making it an excellent choice for games and daily use.",
      "details": {
        "brand": "N/A",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "Vibrant Color Multimedia Screen: The DIY multimedia display screen design in the upper right corner of the keyboard allows you to visualize in custom gif image, caps lock, connection mode, WIN/MAC, system, backlit brightness/speed, RGB mode/color, volume & language and more. Display screen 11°oblique angle height will be more in line with visual habits."
      }
    },
    {
      "id": "B09NLS9TK4",
      "name": "Computer Keyboard Wired, Plug Play USB , Low Profile Chiclet Keys, Large Number Pad, Caps Indicators, Foldable Stands, Spill-Resistant, Anti-Wear Letters for Windows Mac PC Laptop, Full Size",
      "ratings": 2.036,
      "price": "$15.99",
      "image": "https://m.media-amazon.com/images/I/61s6ZL3Vg3L.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Easy Ultra Fast To Use: The wired computer keyboard is super easy to use and instantly connects and works with any USB device with no drivers required, no interruptions to worry about with dropped connections, and no need to charge or drain batteries.     Responsive Low Profile Chiclet Keys: Provide optimized responsiveness and effortless tactile feedback that remind you the key has been hit. You can type with confidence with shorter keystroke travel so it’s decent to type on for long periods.     Slim, Modern Design: The slim keyboard features a premium matte finish and is easy to carry around when working from home. This keyboard is compact and doesn't take up much space on your desktop, making it perfect for users with a small office space.     Ergonomic: The keyboard angle can be adjusted with the flip-out feet to support your hands in a more ergonomic position, relieving fatigue and ensuring a comfortable typing experience.     Optimize Your Productivity: Boost your workflow and simply how you use your computer with a large number pad, 3 indicator lights and 12 multimedia shortcuts, including video, volume, surfing, email control etc.     Spill-Proof, UV Coating: The keyboard is waterproof and protected from damage caused by accidental spills with a drain hole design on the back. Thanks to the high-quality UV coating, the characters on the keycaps are resistant to wear and tear.     Compatibility: Work fluidly on Windows 7/8/10/11/XP/Vista/Server/Chrome OS/Mac OS/Linux/TV.",
      "details": {
        "brand": "COLIKES",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "USB-A",
        "color": "Black",
        "ram": "N/A",
        "detail_item": "Easy Ultra Fast To Use: The wired computer keyboard is super easy to use and instantly connects and works with any USB device with no drivers required, no interruptions to worry about with dropped connections, and no need to charge or drain batteries."
      }
    },
    {
      "id": "B0BXNGJ2LD",
      "name": "Rii RK907 Ultra-Slim Compact USB Wired Keyboard for Mac and PC,Windows 10/8 / 7 / Vista/XP (Black) (1PCS)",
      "ratings": 812,
      "price": "$9.99",
      "image": "https://m.media-amazon.com/images/I/611G2Fw-4PL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "A plug-and-play USB connection with Low-profile keys give you a quiet, comfortable typing experience     Simple Wired USB Connection,You will enjoy a comfortable and quiet typing experience     The keyboard for business and office working is the budget-friendly keyboard that is built for longer use     Low profile keys for a more comfortable and quiet keystroke, desktop-centric design, splash resistant",
      "details": {
        "brand": "Rii",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "USB, USB-A",
        "color": "RK907-1Pcs",
        "ram": "N/A",
        "detail_item": "A plug-and-play USB connection with Low-profile keys give you a quiet, comfortable typing experience"
      }
    },
    {
      "id": "B098LG3N6R",
      "name": "MageGee Portable 60% Mechanical Gaming Keyboard, MK-Box LED Backlit Compact 68 Keys Mini Wired Office Keyboard with Red Switch for Windows Laptop PC Mac - Black/Grey",
      "ratings": 8.196,
      "price": "$29.99",
      "image": "https://m.media-amazon.com/images/I/618zZ7u3sUL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Mini portable 60% compact layout: MK-Box is a 68 keys mechanical keyboard have cute small size, separate arrow keys and all your F-keys you need, can use it for gaming or work while saving space.     Mechanical red switch: characterized for being linear and smoother, slight key sound has no paragraph sense with minimal resistance, but fast action without a tactile bump feel which makes it easier to tap the keyboard.     Classic charming blue LED backlit: Customize multiple illuminated LED light effects, supports about 15 backlight modes, press Fn + Ins can control it, FN + ←/→ control backlight speed, FN + ↑/↓ control backlight brightness.     Full anti-ghosting keyboard: all 68 keys are no conflict, black grey red mash up design, ergonomic suspension double-color injection keycap, double kickstand feet adjustable typing angle and detachable usb cable, both practical and beautiful.     Extensive compatibility: MageGee MK-Box mechanical keyboards use USB 2.0 connector making it compatible with Windows (2000, XP, ME, Vista, 7, 8), Linux and Mac, plug and play, no drivers or software required.",
      "details": {
        "brand": "MageGee",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "USB",
        "color": "Black/Red Switch",
        "ram": "N/A",
        "detail_item": "Mini portable 60% compact layout: MK-Box is a 68 keys mechanical keyboard have cute small size, separate arrow keys and all your F-keys you need, can use it for gaming or work while saving space."
      }
    },
    {
      "id": "B0CP6BR96G",
      "name": "Corsair K55 CORE RGB Membrane Wired Gaming Keyboard – Quiet, Responsive Switches – Spill Resistance – Ten-Zone RGB – Media Keys – iCUE Compatible – QWERTY NA – PC, Mac – Black",
      "ratings": 12.029,
      "price": "$39.99",
      "image": "https://m.media-amazon.com/images/I/71PePasTVvL.__AC_SY300_SX300_QL70_FMwebp_.jpg",
      "description": "Your Winning Streak Starts Now: Everything you need to start your winning streak is here. Enjoy quiet, responsive keypresses and RGB that makes your gaming sessions shine.     Ten-Zone RGB Backlighting: Ten zones of fully customizable RGB illuminate your desktop with mesmerizing lighting effects.     Convenient Media Controls: Four dedicated media buttons give you the ability to control volume and playback with ease, and Win lock and brightness buttons put extra commands at your fingertips.     300ml Spill Resistance: K55 CORE withstands drink spills, so you can play without worrying about real-life water attacks.     12-Key Rollover with 1,000Hz Polling: Make sure your keyboard keeps up with your best plays and most complex actions without delay.",
      "details": {
        "brand": "Corsair",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "USB-A",
        "color": "Black",
        "ram": "N/A",
        "detail_item": "Your Winning Streak Starts Now: Everything you need to start your winning streak is here. Enjoy quiet, responsive keypresses and RGB that makes your gaming sessions shine."
      }
    },
    {
      "id": "B0B9S83Q9Q",
      "name": "RaceGT Gaming Keyboard, Rainbow Backlit Wired Keyboard 104 Keys Full Size with Wrist Rest, Splash-Proof Design Compatible for Computer PC Laptop Xbox",
      "ratings": 463,
      "price": "$14.99",
      "image": "https://m.media-amazon.com/images/I/61qMeXNAISL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Ergonomic Design with Wrist Rest: Our gaming keyboard is designed with your comfort in mind. The stepped keycap design ensures maximum hand comfort during long hours of gaming or work, while the 7° ergonomic typing angle and wrist support provide added comfort during use. It's perfect for both the office and gaming.     12 Multimedia Functional Keys: Enjoy lightning-fast response times during gaming with our gaming keyboard's 12 multimedia combination keys (FN+F1~F12). Plus, 26 keys can be operated simultaneously without conflict. The lock/unlock WIN key ensures a smoother gaming experience.     LED Backlit Light Up Keyboard: Choose from two light-up modes and three brightness levels for a personalized experience. Use ☼ to turn the backlight on or off, FN+☼ for dynamic backlighting, Fn+PgUp/PgDn to adjust brightness, and Fn+ +/- to adjust the speed of dynamic backlighting. Please note that the light color cannot be changed as it is not RGB.     Reliable Performance & Wide Compatibility: Our gaming keyboard is compatible with Windows 10, 8, 7, Vista, or XP, with limited support for Mac OS keyboards. It works well with all major computer brands and gaming PCs.     imely and Responsible After-Sales Service: We provide 24-hour online technical support and a three-month free replacement after-sales service. If you have any questions or concerns, please don't hesitate to contact us.",
      "details": {
        "brand": "RaceGT",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "USB-A",
        "color": "KJQ902-black",
        "ram": "N/A",
        "detail_item": "Ergonomic Design with Wrist Rest: Our gaming keyboard is designed with your comfort in mind. The stepped keycap design ensures maximum hand comfort during long hours of gaming or work, while the 7° ergonomic typing angle and wrist support provide added comfort during use. It's perfect for both the office and gaming."
      }
    },
    {
      "id": "B07ZWK2TQT",
      "name": "Logitech ERGO K860 Wireless Ergonomic Qwerty Keyboard - Split Keyboard, Wrist Rest, Natural Typing, Stain-Resistant Fabric, Bluetooth and USB Connectivity, Compatible with Windows/Mac,Black",
      "ratings": 7.386,
      "price": "$49.99",
      "image": "https://m.media-amazon.com/images/I/810Hp0H32BL.__AC_SY300_SX300_QL70_FMwebp_.jpg",
      "description": "Wireless range:10 m (33-ft) wireless range     Improved Typing Posture: Type more naturally with a curved, split keyframe and reduce muscle strain on your wrists and forearms thanks to the sloping keyboard design     Pillowed Wrist Rest: Curved wrist rest with memory foam layer offers typing comfort with 54 per cent more wrist support; 25 per cent less wrist bending compared to standard keyboard without palm rest     Perfect Stroke Keys: Scooped keys match the shape of your fingertips so you can type with confidence on a wireless keyboard crafted for comfort, precision and fluidity     Adjustable Palm Lift: Whether seated or standing, keep your wrists in total comfort and a natural typing posture with ergonomically-designed tilt legs of 0, -4 and -7 degrees     Ergonomist Approved: The ERGO K860 wireless ergonomic keyboard is certified by United States Ergonomics to improve posture and lower muscle strain     Familiar Features: Conveniently connect with the USB receiver or Bluetooth, customise Fn key use, and enjoy the quiet keys, full-size layout and CAPS LOCK indicator",
      "details": {
        "brand": "Logitech",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "Bluetooth",
        "color": "Black",
        "ram": "N/A",
        "detail_item": "Wireless range:10 m (33-ft) wireless range"
      }
    },
    {
      "id": "B0BGH9FQHZ",
      "name": "Wireless Mechanical Keyboard,Triple-Mode 2.4G/USB-C/Bluetooth Gaming Keyboard with RGB Backlit,Efficient Numeric Pad,Red Switches,94 Keys Metal Base PBT Compact Quiet Wired Keyboard for PC Mac iPad",
      "ratings": 92,
      "price": "$24.99",
      "image": "https://m.media-amazon.com/images/I/71D31cGp0+L._AC_SY300_SX300_.jpg",
      "description": "【3 Connection Options】The RisoPhy wireless gaming keyboard has three connectivity options – 2.4GHz, Bluetooth, and wired. This allows seamless switching between devices. When gaming, users can effortlessly switch between 2.4G and BT5.0 modes without the hassle of cords. In addition, the keyboard includes a rechargeable USB-C cable for traditional wired mode. You can also connect up to different devices simultaneously, making it ideal for multi-device setup in the office environment.     【Smoother and Quieter Red Switches】Our mechanical keyboard is equipped with linear red mechanical switches,which could be faster action with minimal resistance without a tactile bump feel, providing a smooth quiet mechanical stroke experience.Perfect for office typing and gaming without disturbing anyone.Plus,the ultra-durable PBT-engineered keycaps provide crystal clear uniform backlight and a longer lifespan.     【94 Keys Compact Design & Offset Arrow Keys】Unlike the full-sized keyboard, our wireless keyboard saves more desk space but keeps the numeric pad which is essential, providing greater productivity for daily working and gaming than the 60% percent keyboard.12 multimedia key shortcuts allow you to quickly access calculator/media/volume/email.Plus,our numeric keypad is independent,you don't need to press any keys to lock/unlock it,which is very convenient.     【Software Support & Immersive Rgb Lighting】Up to 20 kinds of light effects such as SOLID COLOR, streamer,horse racing,and neon to match your game style and desktop layout.16.8 million colors and 4 levels of brightness and speeds for choice.All the light effect parameters can be customized with the attached software,giving you the best lighting experience and improving your nighttime typing accuracy.[The actual light effects will amaze you more than the pictures]     【Extreme Ergonomics 】This gamer keyboard adopts a scientific stair-up keycap design that keeps your arms in the most natural state to minimize hand fatigue for long-time use.It also comes with 2 strong foldable rear kickstands to offer a more comfortable typing.",
      "details": {
        "brand": "RisoPhy",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "Bluetooth, 2.4G, USB-C",
        "color": "Gray",
        "ram": "N/A",
        "detail_item": "【3 Connection Options】The RisoPhy wireless gaming keyboard has three connectivity options – 2.4GHz, Bluetooth, and wired. This allows seamless switching between devices. When gaming, users can effortlessly switch between 2.4G and BT5.0 modes without the hassle of cords. In addition, the keyboard includes a rechargeable USB-C cable for traditional wired mode. You can also connect up to different devices simultaneously, making it ideal for multi-device setup in the office environment."
      }
    },
    {
      "id": "B07WV5WN7B",
      "name": "Amazon Basics 2.4GHz Wireless Keyboard with Numeric Keypad, Quiet and Compact US Layout (QWERTY), Black, Modern",
      "ratings": 819,
      "price": "$22.45",
      "image": "https://m.media-amazon.com/images/I/61QILB-OgXL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Compact, fully-functional wireless (non-bluetooth) QWERTY keyboard for home, office, or remote work     Sound-dampened keys makes working in quiet environments less disruptive     Includes numeric key pad and 12 multimedia hot keys     Powered by 2 AAA batteries; transmits data securely via USB receiver with 128-bit AES encryption     Plug-and-play design does not require drivers or complicated set up; compatible with Windows 7, 8, and 10     Backed by an Amazon Basics 1-year limited warranty",
      "details": {
        "brand": "Amazon Basics",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "USB only (Non-Bluetooth)",
        "color": "Black",
        "ram": "N/A",
        "detail_item": "Compact, fully-functional wireless (non-bluetooth) QWERTY keyboard for home, office, or remote work"
      }
    },
    {
      "id": "B07FC94XMC",
      "name": "V2020 Pink Wireless Keyboard with Round Keycaps,2.4GHz Dropout-Free Connection,Long Battery Life,Cute Wireless Moues for PC/Laptop/Mac(Pink)",
      "ratings": 4.774,
      "price": "$38.99",
      "image": "https://m.media-amazon.com/images/I/51Er34YKMsL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "A fusion of retro style and modern design: The inspiration of these cute rounded keys come from vintage typewriters offering you visual enjoyment and retro feeling to type. The mini Optical mouse is with modern ergonomic design,DPI adjustable(800-1200-1600).The combo will bring you a nostalgic feeling with the eye-catching retro aesthetic.     Powerful&Reliable 2.4GHz wireless connection:2.4GHz signal delivers up to a range of 28 feet connection that allows you to work with your PC from a distance. One small Nano receiver (USB 2.0) connects both the mouse and keyboard,high speed rate of return allows the combo to ensure their stable and smooth transmission without delay and frame skip,hence to enhance your typing experience.     Convenient Hotkeys: 13 Easy-to-reach function keys provides a shortcut to your music,emails,multimedia control,web,etc.For instance,you can play the music you want by simply press the Fn+Esc.     Longer battery life design: both keyboard and mouse turn into Power-save mode automatically,click any key or button to wake-up within seconds.Each of them runs on one AA battery (included).Low battery indication shows in the top right corner,when the battery is dying,the keyboard's low battery indication light will remind you to replace the battery.     Wide Compatibility: Compatible with operating systems(USB 2.0 port,require no special software or drivers)---Windows or Mac OS,Work perfectly with PC,Laptop,Smart TVand more.",
      "details": {
        "brand": "SADES",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "Bluetooth, infrared, Radio Frequency",
        "color": "white pink",
        "ram": "N/A",
        "detail_item": "A fusion of retro style and modern design: The inspiration of these cute rounded keys come from vintage typewriters offering you visual enjoyment and retro feeling to type. The mini Optical mouse is with modern ergonomic design,DPI adjustable(800-1200-1600).The combo will bring you a nostalgic feeling with the eye-catching retro aesthetic."
      }
    },
    {
      "id": "B07D34L57F",
      "name": "Arteck 2.4G Wireless Keyboard Stainless Steel Ultra Slim Full Size Keyboard with Numeric Keypad for Computer/Desktop/PC/Laptop/Surface/Smart TV and Windows 10/8/ 7 Built in Rechargeable Battery",
      "ratings": 28.547,
      "price": "$34.99",
      "image": "https://m.media-amazon.com/images/I/615wODNPYJL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Easy Setup: Simply insert the nano USB receiver into your computer and use the keyboard instantly.     Ergonomic design: Stainless steel material gives heavy duty feeling, low-profile keys offer quiet and comfortable typing.     6-Month Battery Life: Rechargeable lithium battery with an industry-high capacity lasts for 6 months with single charge (based on 2 hours non-stop use per day).     Ultra Thin and Light: Compact size (16.9 X 4.9 X 0.6in) and light weight (14.9oz) but provides full size keys, arrow keys, number pad, shortcuts for comfortable typing.     Package contents: Arteck Stainless 2.4G Wireless Keyboard, nano USB receiver, USB charging cable, welcome guide, our 24-month warranty and friendly customer service.",
      "details": {
        "brand": "Arteck",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "USB Wireless, USB-C",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "Easy Setup: Simply insert the nano USB receiver into your computer and use the keyboard instantly."
      }
    },
    {
      "id": "B09DKQWTNC",
      "name": "AULA F2088 Typewriter Style Mechanical Gaming Keyboard Blue Switches,Rainbow LED Backlit,Removable Wrist Rest,Media Control Knob,Retro Punk Round Keycaps,USB Wired Computer Keyboard",
      "ratings": 2.171,
      "price": "$48.99",
      "image": "https://m.media-amazon.com/images/I/71XcWqobDVL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Retro Typewriter Style Round Keycaps: Mechanical blue switch offers a quicker and springier response, crisp click sound, precise tactile feedback for ultimate gaming performance. Double-shot injection molded vintage steampunk round keycaps for clear backlight and extreme durability. The stepped floating keycap fit your fingertips perfectly for precise positioning, prevent fatigue and wrong typing. Comes with keycap puller for easy keycaps cleaning     Multimedia and Backlight Control Knob: This wired mechanical keyboard effortlessly controls media thanks to its dedicated media control keys. Quick-access buttons for media volume, backlight effect, music play, pause, switch. You can switch 19 different lighting effects or adjust the backlit brightness and speed. And you can create 3 customized backlight as you like. Long press knob for three seconds to switch between media and lighting modes     Metal Panel and Magnetic Wrist Rest: The computer keyboard panel is made of top-grade aluminium alloy material, with matte-finish texture, sturdy and robust enough to protect it from scratch. The ergonomic ABS palm rest provides firm support that alleviates pressure on your wrist from gaming at an elevated angle. The surface has a smooth and comfortable touch that enhances the feeling of the keyboard. USB connector for a reliable connection and ultimate gaming performance     104 Keys Anti-Ghosting Programmable: This mechanical gaming keyboard features Anti Ghosting Technology which ensures your simultaneous keystrokes register the way you intended, allow multi-keys to work simultaneously with high speed. Each key is controlled by independent switch, let you enjoy high-grade games with fast response, boosting your performance! The PC Gaming Keyboard has been ergonomically designed to be a superb typing tool for office work as well     Stylish Durable and Wide Compatibility: Modern and sleek design with superior performance. High low key layout with suspended round key fits fingers effectively, help reduce hand fatigue, aluminum alloy metal panel, matte texture, sturdy and robust, protect it from scratch. Support PC Mac Laptop, Tablet, Desktop computer, suitable for Windows 7/8/10/XP/Vista, Linux and Mac OS systems. USB wired conection, plug and play! No drivers or softwares are required",
      "details": {
        "brand": "AULA",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "USB",
        "color": "Black-blue switches",
        "ram": "N/A",
        "detail_item": "Retro Typewriter Style Round Keycaps: Mechanical blue switch offers a quicker and springier response, crisp click sound, precise tactile feedback for ultimate gaming performance. Double-shot injection molded vintage steampunk round keycaps for clear backlight and extreme durability. The stepped floating keycap fit your fingertips perfectly for precise positioning, prevent fatigue and wrong typing. Comes with keycap puller for easy keycaps cleaning"
      }
    },
    {
      "id": "B0CZM2F674",
      "name": "FOPETT Wireless Keyboard and Mouse Combo - 2.4G Full-Sized Cute Colorful Retro Keyboard with Round Keycaps 104 Keys Typewriter Keyboard for Laptop/Windows/PC - Green Colorful",
      "ratings": 3.114,
      "price": "$39.99",
      "image": "https://m.media-amazon.com/images/I/71uHfbLcM2L.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Keyboard and Mouse Warranty : We offer a three-year worry-free warranty and a 60-day money-back guarantee or replacement option. If you have any inquiries or concerns regarding our wireless keyboard and mouse set, please don't hesitate to contact us. Your satisfaction is our top priority.     Stable 2.4G Wireless Connection Cute Wireless Keyboard : Enjoy a powerful wireless connection with a range of up to 10 meters (393.7 inches) for the keyboard and mouse combo. they utilize a shared Nano receiver, conveniently stored at the bottom of the mouse, plug and play.eliminating the need for additional software installation.keeping your desk clean. keyboard size 17.5 x 5.3 x 1 inch with 104 keys. mouse size is 3.9 x 1.5 x 1 inch. keyboard net weight: 1.6LB, mouse net weight: 0.15LB.     Full Size Wireless Keyboard and Mouse : Thanks to the silent micro-motion technology, the mouse clicks are nearly silent, eliminating bothersome knocking sounds that could disturb you and your family. the cordless mouse DPI levels (800/1000/1200) for fast and precise cursor control, all while maintaining a quiet operation. whether you're working or playing, you'll never have to worry about disturbing others' rest.     Wireless Keyboards Ergonomic Design : The keyboard is designed with a tilt angle,comfortable typing position，the wireless mouse features a sweat-resistant and skin-friendly finish, with a contoured shape that allows for hours of comfortable work. If you encounter any issues with our product, whether it's exceeding Amazon's return time or receiving a defective item, please reach out to us via Amazon email as your first point of contact. we are committed to providing you with satisfactory solutions.     Wireless Mouse Wide Compatibility : Our wireless computer keyboard is 12 function keys for quick access to music, volume, mail, and more (please note that the hotkeys may not be fully compatible with Mac systems). This keyboard mouse combo is compatible with various operating systems, including Windows XP/ME/Vista/7/8/10/11. It works seamlessly with devices that have a USB slot, such as PCs, laptops, MacBooks, desktops, Chromebooks, and even Smart TVs.     Colorful Keyboard Shared Receiver : A USB receiver simultaneously drives the keyboard and mouse, enabling wireless transmission with a stable and delay-free signal,2.4G wireless transmission technology, supporting multiple computer types.the design incorporates splash resistance, with a waterproof conductive film that allows liquid to flow out from within the keyboard membrane. The mouse requires one 1.5V AA battery (included), while the keyboard requires one 1.5V AA battery (included).",
      "details": {
        "brand": "FOPETT",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "Usb",
        "color": "Lovely Green",
        "ram": "N/A",
        "detail_item": "Keyboard and Mouse Warranty : We offer a three-year worry-free warranty and a 60-day money-back guarantee or replacement option. If you have any inquiries or concerns regarding our wireless keyboard and mouse set, please don't hesitate to contact us. Your satisfaction is our top priority."
      }
    },
    {
      "id": "B0C4Y4SS2N",
      "name": "Wireless Keyboard and Mouse, Keyboard Mouse Combo, 2.4 GHz Wireless Full-Sized Typewriter Keyboard with Round Keycaps, Keyboard for Windows, Computer, Desktop, PC, Laptop (MilkTea)",
      "ratings": 399,
      "price": "$38.99",
      "image": "https://m.media-amazon.com/images/I/61rBn3v1DkL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "【 Wireless Keyboard Mouse Combo】The inspiration for these cute rounded keys comes from vintage typewriters offering you visual enjoyment and a retro feeling to type. With colorful key caps, make you be distinctive in the office and work full of fun.     【Full-Size keyboard with Detachable Round Keycaps】The typewriter keyboard wireless has pink retro round keys and the silent click of the quiet mice will allow you to do your job without disturbing others. The mini mouse is with modern ergonomic design, Fixed DPI :1200. All circle buttons can be disassembled, put in water to clean.     【Plug and Play】One USB 2.4GHz wireless receiver for keyboard and mouse, does not need any extra software, super easy to use. All you have to do is plug the USB receiver and then give them seconds to install automatically.     【Durability Battery Life】Both cute keyboard and mouse wireless turn into Power-save mode automatically, click any key or button to wake-up within seconds. Each of them runs on one AA battery (Not Included). Low battery indication shows in the top right corner, when the battery is dying,the keyboard's low battery indication light will remind you to replace the battery.     【WIDE COMPATIBLE】The typewriter keyboard and mouse wireless are perfectly compatible with Windows 10 / 8 / 7 / XP/ Vista operating system (USB 2.0 port). The wireless keyboard mice combo work perfectly with PC, Mac, Desktop, Laptop, Notebook, iPad, Chrome-Book, Computer, Smart TVs and more.     【Gift】The colorful keyboard and mouse wireless with gorgeous gift package for colleagues/ friends/ birthday/ Christmas/ New Year gift. You can used it by yourself or as a gift to friends, lovers, children, etc.",
      "details": {
        "brand": "FOPETT",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "Usb",
        "color": "MilkTea",
        "ram": "N/A",
        "detail_item": "【 Wireless Keyboard Mouse Combo】The inspiration for these cute rounded keys comes from vintage typewriters offering you visual enjoyment and a retro feeling to type. With colorful key caps, make you be distinctive in the office and work full of fun."
      }
    },
    {
      "id": "B0CMR1JTM9",
      "name": "FD Wireless Keyboards and Mouse Combo - 2.4GHz USB Cordless, Cute Wireless Keyboard Round Keys, Quiet and Slim Set for Laptop, Computer, TV and Mac - Blue Pale Green Colorful",
      "ratings": 4.169,
      "price": "$29.99",
      "image": "https://m.media-amazon.com/images/I/719GMPBxU9L.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "☆ Mouse and Keyboard Fashion & Quiet: Enhance your typing experience with our sleek keyboard and mouse set featuring full-sized 96 round keycaps. The glossy and smooth edge technology adds a touch of elegance. The low-profile silent keys ensure a comfortable and smooth typing experience.Keyboard Dimensions: 14.9 x 4.9 x 1.1 inch; Mouse Dimensions: 4.1 x 2.4 x 1.4 inch.     ☆ Wireless Keyboard and Mouse Long Battery Life: Say goodbye to frequent battery changes. Our wireless keyboard and mouse are designed to maximize battery life. They automatically enter sleep mode when idle for 5 minutes and can be easily awakened by clicking any button. Enjoy up to 6 months of battery life (AA & AAA Batteries included).     ☆ keyboard and mouse Reliable 2.4GHz Wireless Connection: Experience a stable and uninterrupted connection with our reliable 2.4GHz wireless technology. Simply plug the tiny USB Nano receiver into your computer's USB port, and you're ready to go. The 2.4GHz signal ensures a strong connection within a range of up to 10 meters.     ☆ Keyboards Hot Keys: Take control of your multimedia experience with the 12 easy-to-reach function keys. Adjust your music and video playback, search the web, or manage your email with just a click. This feature-rich keyboard is perfect for entertainment, school, and work.     ☆ Cute Wireless Keyboard Universal Compatibility: Our keyboard and mouse combo is compatible with various operating systems, including Windows 2000/ME/XP (*64)/Vista/7/8/10, Mac OS X (V10.4 above), and Android. It works seamlessly with a wide range of devices such as Macbooks, desktops, Chromebooks, PCs, laptops, computers, smart TVs, and more. Please note that this set uses a USB connection and is not compatible with devices that only have Type C ports. An adapter is required for such devices.     ☆ Keyboard and Mouse Wireless Note: The Macbook Pro and other devices with only Type C ports require an adapter to work with this keyboard mouse combo.     ☆ Colorful Keyboard Worry-free Guarantee: FD offers a 36-MONTH AFTER-SALE SERVICE, ensuring you peace of mind. If you encounter any issues with the keyboard and mouse combo, please don't hesitate to reach out to us. FD is dedicated to fulfilling your requirements. To contact us, follow these steps: 1.Click on our store name, \"FD Tech.\" 2.Select \"Ask a question\" to get in touch.",
      "details": {
        "brand": "FD",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "Usb",
        "color": "96 Keys Blue Pale Green Colorful",
        "ram": "N/A",
        "detail_item": "☆ Mouse and Keyboard Fashion & Quiet: Enhance your typing experience with our sleek keyboard and mouse set featuring full-sized 96 round keycaps. The glossy and smooth edge technology adds a touch of elegance. The low-profile silent keys ensure a comfortable and smooth typing experience.Keyboard Dimensions: 14.9 x 4.9 x 1.1 inch; Mouse Dimensions: 4.1 x 2.4 x 1.4 inch."
      }
    }
  ]
}