{
  "totalProducts": 16,
  "products": [
    {
      "id": "B0BXYPGKX6",
      "name": "Lenovo 300 Wireless Mouse – Computer Mouse for PC, Laptop with Windows – Ambidextrous Design – 2.4 GHz Nano USB Receiver – 12 Month Battery Life",
      "ratings": 259,
      "price": "$11.99",
      "image": "https://m.media-amazon.com/images/I/5154mpGektL._AC_SX450_.jpg",
      "description": "Enhance Your On-the-Go Productivity: Introducing the Lenovo 300 Wireless Compact Mouse – your ultimate travel companion designed for professionals on the move. Ideal for business travelers, presenting executives, and individuals seeking heightened control and flexibility, this compact mouse is a must-have accessory to elevate your work style.     Pocket-Friendly Portability: Experience unmatched convenience with the Lenovo 300 Wireless Compact Mouse's compact design. Slip it effortlessly into your pocket or laptop bag, ensuring that wherever you go, enhanced control and precision are right at your fingertips. Embrace a clutter-free, organized lifestyle while maintaining top-notch productivity.     Precision at Your Command: Boasting an optical sensor with 1000 DPI resolution, this compact mouse delivers precision like never before. Seamlessly navigate through documents, presentations, and creative projects with unparalleled accuracy, enhancing your overall work efficiency and control.     Battery Life That Lasts: Bid farewell to battery concerns with the Lenovo 300 Wireless Compact Mouse. Equipped with a single AA battery, this powerhouse ensures a remarkable battery life of up to 12 months . Say goodbye to the hassle of frequent battery replacements and stay focused on what truly matters – your tasks, presentations, and projects.     Versatile Performance Anywhere: No matter where your journey takes you, the Lenovo 300 Wireless Compact Mouse adapts seamlessly to your needs. Its ergonomic design ensures comfort during prolonged use, while its wireless capabilities grant you freedom from tangled cords. Experience a responsive and intuitive interface, ensuring that precision and control are always within reach.",
      "details": {
        "brand": "Lenovo",
        "color": "Frost Blue",
        "size": "N/A",
        "material": "N/A",
        "fitType": "N/A",
        "careInstructions": "N/A"
      }
    },
    {
      "id": "B015NBTAOW",
      "name": "TECKNET Wireless Mouse, 2.4G Ergonomic Optical Mouse, Computer Mouse for Laptop, PC, Computer, Chromebook, Notebook, 6 Buttons, 24 Months Battery Life, 2600 DPI, 5 Adjustment Levels",
      "ratings": 65.292,
      "price": "$8.49",
      "image": "https://m.media-amazon.com/images/I/71tqvuHgIlL._AC_SY355_.jpg",
      "description": "Compact Design, Travel Friendly - With the dimension of 4.09*2.68*1.49 in, this compact mouse provides more portability and a better travel experience. Only compatible with USB-A Port Devices.     Ergonomic Design, Comfort Grip - The contoured shape of this mouse is ergonomically designed to fit the natural curve of your hand, ensuring lasting comfort and productivity. Featuring rubber side-grips, it offers added thumb support for a superior working experience.     Advanced Optical Tracking - Featuring 5-level adjustable DPI (800/1200/1600/2000/2600), this mouse provides high-performance precision and smart cursor control on most surfaces. ( Glass surface is Not included )     24 Months Battery Life - Combined with a power-saving mode and on/off switch, this efficiently engineered mouse grants you up to 24 months of battery life.     Plug and Play - Simply plug the USB-A mini-receiver into your Windows, Mac, Chrome OS, or Linux computer and enjoy seamless connectivity up to 49 feet.     Notice - Please be aware that the AAA batteries are not included. The USB receiver is stored at the back of the mouse.",
      "details": {
        "brand": "TECKNET",
        "color": "Purple",
        "size": "N/A",
        "material": "N/A",
        "fitType": "N/A",
        "careInstructions": "N/A"
      }
    },
    {
      "id": "B004YAVF8I",
      "name": "Logitech M185 Wireless Mouse, 2.4GHz with USB Mini Receiver, 12-Month Battery Life, 1000 DPI Optical Tracking, Ambidextrous PC/Mac/Laptop - Swift Gray",
      "ratings": 33.728,
      "price": "$13.98",
      "image": "https://m.media-amazon.com/images/I/5181UFuvoBL._AC_SY450_.jpg",
      "description": "Plug-and-play wireless: Get a reliable connection from a convenient nano receiver that stays in your computer     1-year battery life: Go for a full year without a battery change (Battery life may vary based on user and computing conditions)     Logitech reliability: Made by the global leader for mice and backed by a 3-year limited hardware warranty     Contoured shape: Gives you more comfort and control     For Windows and Mac computers: No software or setup hassles-start using your mouse right away",
      "details": {
        "brand": "Logitech",
        "color": "Swift Gray",
        "size": "N/A",
        "material": "N/A",
        "fitType": "N/A",
        "careInstructions": "N/A"
      }
    },
    {
      "id": "B09HM94VDS",
      "name": "Logitech MX Master 3S - Wireless Performance Mouse, Ergo, 8K DPI, Track on Glass, Quiet Clicks, USB-C, Bluetooth, Windows, Linux, Chrome - Graphite - With Free Adobe Creative Cloud Subscription",
      "ratings": 6.592,
      "price": "$99.99",
      "image": "https://m.media-amazon.com/images/I/61ni3t1ryQL._AC_SY450_.jpg",
      "description": "Any-surface tracking - now 8K DPI: Use MX Master 3S cordless computer mouse to work on any surface - even glass (1) - with the upgraded 8000 DPI sensor with customizable sensitivity.     Introducing quiet clicks: MX Master 3S Bluetooth mouse introduces Quiet Clicks - offering the same satisfying feel but with 90% less click noise. Sensor Technology: Darkfield high precision.     Install free Logi Options+ App to enable Logi AI Prompt Builder for your Logitech mice and keyboards.     Magspeed scrolling: A computer mouse with remarkable speed, precision, and near silence - MagSpeed scrolling is 90% faster , 87% more precise, and ultra quiet.     Ergonomic design : Work comfortably with a precision mouse featuring a silhouette crafted for a more natural wrist posture and optimally placed thumb controls.     Upgraded customization software : Customize buttons and optimize your workflow with App specific profiles in the improved Logi Options+ app.     FLOW cross-computer control : Work seamlessly on multiple computers or laptops, and transfer text, images, and files – between Windows & macOS.",
      "details": {
        "brand": "Logitech",
        "color": "Graphite",
        "size": "N/A",
        "material": "N/A",
        "fitType": "N/A",
        "careInstructions": "N/A"
      }
    },
    {
      "id": "B0BLFB5RRD",
      "name": "Glorious Gaming Model I 2 Wireless Gaming Mouse - Hybrid 2.4Ghz & Bluetooth, 75g Superlight, 9 Buttons (2 Swappable), RGB, PTFE Feet, MMO/MOBA/FPS, Long Battery Life, Side Thumb Rest - White",
      "ratings": 473,
      "price": "$99.99",
      "image": "https://m.media-amazon.com/images/I/71xiXXyUZBL._AC_SX355_.jpg",
      "description": "Ultralight Ergonomic Mouse: The Glorious Model I 2 Wireless takes the fan-favorite ergonomic design from the original version and is lighter and more comfortable for gamers than ever. This next-gen edition features a new split-button design and 80M-rated switches combine to deliver consistently crisp clicks, no matter where they’re pressed.     9 Programmable Button: By assigning commonly used actions to the mouse’s buttons, gamers can both react quicker and reduce risk of strain by not having to reach across their keyboard. This MMO/MOBA mouse features 2 programmable layers to assign actions to, allowing up to 16 configurations. Easily switch between layers by clicking the Action Button.     Cutting-Edge Technology: The optimized BAMF 2.0 optical sensor is packed with new enhancements. Configure your gaming mouse to reach up to 26,000 DPI, 650 IPS, and 1,000Hz Polling. Motion Sync Technology synchronizes the mouse’s movements with the PC’s on-screen cursor for the most precise real-time tracking. Two of the mouse’s buttons are magnetic and swappable with different shapes for added comfort.     3 Ways to Play and Incredible Battery Life: The Model I 2 has three connectivity options: choose from 2.4GHz Wireless (110 hours of battery*), Bluetooth 5.2 LE (210 hours of battery*), or in wired mode to play while charging. *Battery life measured with RGB off.     Guarantee: The Model I 2 comes with 2-Year Manufacturer Warranty.",
      "details": {
        "brand": "Glorious",
        "color": "Matte White",
        "size": "N/A",
        "material": "N/A",
        "fitType": "N/A",
        "careInstructions": "N/A"
      }
    },
    {
      "id": "B0CSPJP35M",
      "name": "Lenovo Bluetooth Silent Mouse (WL300) - 5 Button Computer Mouse with Silent Left & Right Click – Sculpted Grip, Microsoft Swift Pair, Up to 1600 DPI (Grey)",
      "ratings": 279,
      "price": "$19.99",
      "image": "https://m.media-amazon.com/images/I/517+8YaZ+gL._AC_SY450_.jpg",
      "description": "Sleek and Compact: Compact and lightweight, this mouse is ideal for on-the-go professionals and is powered by a single AA battery. Its design eliminates the hassle of tangled cables, providing the freedom to work in various environments     Uncompromised Quality: Built to withstand extensive use, the left and right buttons are engineered to last up to 3 million clicks. The scroll wheel is designed to endure up to 300,000 cycles, ensuring long-lasting durability and consistent performance     Sculpted Grip Bluetooth Mouse: Experience all-day comfort with a sculpted grip that conforms to your hand's natural contours, providing ergonomic support for extended periods of use. Effortlessly pair your device with Bluetooth 5.0 and Microsoft Swift Pair technology     Smooth Navigation: Maximize your workflow with a 5-button mouse featuring left click, right click, scroll click, forward, and backward buttons, coupled with an anti-slip scroll wheel. The precise optical sensor and 3-level DPI adjustment caters to various tasks, offering 800, 1200, and 1600 DPI     Silent Efficiency: Designed to work seamlessly on different surfaces such as wood, leather, fabric, paper, and resin, the WL300 offers silent left, right, and scroll wheel buttons, allowing for efficient and quiet operation",
      "details": {
        "brand": "Lenovo",
        "color": "WL300 Grey",
        "size": "N/A",
        "material": "N/A",
        "fitType": "N/A",
        "careInstructions": "N/A"
      }
    },
    {
      "id": "B0CHNVBBLF",
      "name": "SM900 White Wired Gaming Mouse with Honeycomb Shell,12800 DPI,7 Programmable Buttons,Lightweight Gaming Mice Ergonomic Computer Wired Mouse Gaming for Win/PC/Mac/Laptop Gamer",
      "ratings": 440,
      "price": "$14.99",
      "image": "https://m.media-amazon.com/images/I/61wmkh+azPL._AC_SY355_.jpg",
      "description": "6 Levels Adjustable DPI:SM900 is a powerful gaming mouse with excellent performance,It supports 6 levels adjustment DPI up to 12800.Rolling Rate max to 1000Hz,According user's preference setup different DPI and Rolling Rate suitable for games, office and many occasions     4 Mode Switch:SM900 wired mouse supports 4 modes switch, default 1 office mode and 3 gaming modes.Gaming modes need setup by macro software, according to the user's gaming preferences setup different button functions     Support Custom and Macro Program:SM900 lightweight wired mouse supports macro settings, user can reset the mouse buttons, DPI,modes, lighting effects.Customize personalized gaming mouse according to user preferences.This mouse is widely supported Windows 7,8,10,XP,,VISTA,MAC OS, etc, The USB interface is plug and play     3 Sided Honeycomb Shell design: SM900 Wired mouse more breathable, more sweat-absorbent and more comfortable!!!The gaming mouse is made of high quality ABS material and designed with ergonomic hollow perforated housing, Ergonomic Design reduce the weight and make the mouse more flexible and easier to be used for a long time without fatigue, and also enhance the heat dissipation features, very comfortable to use     14 RGB Rainbow Backlight:SM900 pc gaming mice has adjustable RGB lights that can be set to different effects according to user preferences. The brilliant lighting effects provide illumination in dark environments also increases the fun of using",
      "details": {
        "brand": "SOLAKAKA",
        "color": "white",
        "size": "N/A",
        "material": "N/A",
        "fitType": "N/A",
        "careInstructions": "N/A"
      }
    },
    {
      "id": "B0C6QQCDR5",
      "name": "Amazon Essentials Disney | Marvel | Star Wars Men's Sherpa-Lined Pullover Hoodie Sweatshirt",
      "ratings": 230,
      "price": "$25.68",
      "image": "https://m.media-amazon.com/images/I/71jdXMr4W+L._AC_SX342_.jpg",
      "description": "N/A",
      "details": {
        "brand": "N/A",
        "size": "N/A",
        "material": "N/A",
        "fitType": "N/A",
        "careInstructions": "N/A"
      }
    },
    {
      "id": "B005EJH6Z4",
      "name": "Amazon Basics 2.4 Ghz Wireless Optical Computer Mouse with USB Nano Receiver, Black",
      "ratings": 57.555,
      "price": "$9.75",
      "image": "https://m.media-amazon.com/images/I/61YQeAUIboL._AC_SY450_.jpg",
      "description": "Smooth, precise and affordable wireless optical 3-button mouse with USB nano receiver for laptop, desktop and netbook PCs     2.4 GHz wireless (not Bluetooth) provides a powerful, reliable connection     Nano-receiver stays in the PC USB port or stows conveniently inside the wireless mouse when not in use (note: Receiver is stored within the mouse from production and needs to be removed upon setup)     Compatible with Windows 2000, XP, Vista, 7, 8, and 10     Easy installation - refer to user manual for instructions",
      "details": {
        "brand": "Amazon Basics",
        "color": "Black",
        "size": "N/A",
        "material": "N/A",
        "fitType": "N/A",
        "careInstructions": "N/A"
      }
    },
    {
      "id": "B005EJH6RW",
      "name": "Amazon Basics Responsive and Precise 3-Button Wired USB Computer Mouse with Scrolling and Tracking, Single, Black",
      "ratings": 84.458,
      "price": "$7.19",
      "image": "https://m.media-amazon.com/images/I/61Mzk2NljxL._AC_SY450_.jpg",
      "description": "Computer mouse for easily navigating a computer interface; click, scroll, and more     USB-A wired connection; if existing device only supports USB-C, an additional adapter will be required     High-definition (1000 dpi) optical tracking ensures responsive cursor control for precise tracking and easy text selection     3 buttons offer effortless fingertip control     Plug-and-go ready for instant use     Compatible with Windows and Mac OS     Product Dimensions: 4.3 x 2.4 x 1.4 inches (LxWxH) with 4.9-foot cable",
      "details": {
        "brand": "Amazon Basics",
        "color": "Black",
        "size": "N/A",
        "material": "N/A",
        "fitType": "N/A",
        "careInstructions": "N/A"
      }
    },
    {
      "id": "B094PS5RZQ",
      "name": "Razer DeathAdder Essential Gaming Mouse: 6400 DPI Optical Sensor - 5 Programmable Buttons - Mechanical Switches - Rubber Side Grips - Classic Black",
      "ratings": 11.987,
      "price": "$20.99",
      "image": "https://m.media-amazon.com/images/I/8189uwDnMkL._AC_SY355_.jpg",
      "description": "HIGH-PRECISION 6,400 DPI OPTICAL SENSOR — Offers on-the-fly sensitivity adjustment through dedicated DPI buttons (reprogrammable) for gaming and creative work     DURABLE MECHANICAL SWITCHES — Supports up to 10 million clicks, backed by a 2 year warranty     RIDGED, RUBBERIZED SCROLL WHEEL FOR MAXIMUM ACCURACY — Small, tactile bumps increases grip and allows for more controlled scrolling in high-stakes gaming situations     5 PROGRAMMABLE BUTTONS — Allows for button remapping and assignment of complex macro functions through Razer Synapse     #1 SELLING PC GAMING PERIPHERALS BRAND IN THE U.S. — Source — Circana, Retail Tracking Service, U.S., Dollar Sales, Gaming Designed Mice, Keyboards, and PC Headsets, Jan. 2019- Dec. 2023 combined",
      "details": {
        "brand": "Razer",
        "color": "Classic Black",
        "size": "N/A",
        "material": "N/A",
        "fitType": "N/A",
        "careInstructions": "N/A"
      }
    },
    {
      "id": "B0C4XXH2FV",
      "name": "Logitech MX Master 2S Bluetooth Edition Wireless Mouse – Use on Any Surface, Hyper-Fast Scrolling, Ergonomic, Rechargeable, Control Up to 3 Apple Mac and Windows Computers - Graphite",
      "ratings": 532,
      "price": "$69.79",
      "image": "https://m.media-amazon.com/images/I/519XaWc6D6L._AC_SY450_.jpg",
      "description": "With Logitech Flow, seamlessly control up to three computers with one mouse and copy-paste text, images and files between them.(1)     Darkfield High Precision tracking gives you flawless control virtually anywhere – even on glass(2) with up to 4,000 DPI     Just plug MX Master 2S into your computer using the micro-USB charging cable and get enough power for a full day of usage in three minutes only. A full charge can last up to 70 days.(3)     Scroll through long documents or web pages faster and easier with the speed-adaptive scroll wheel that auto-shifts from click-to-click to hyper-fast scroll and side-to-side scrolling with a stroke of your thumb.(4)     The perfectly crafted, hand-sculpted shape (5) supports your hand and wrist in a comfortable, natural position. Enjoy fine-motion control and a fluid experience thanks to well-positioned buttons and wheels.",
      "details": {
        "brand": "Logitech",
        "color": "graphite",
        "size": "N/A",
        "material": "N/A",
        "fitType": "N/A",
        "careInstructions": "N/A"
      }
    },
    {
      "id": "B098S48QWM",
      "name": "VssoPlor Wireless Mouse, 2.4G Slim Portable Computer Mice with Nano Receiver for Notebook, PC, Laptop, Computer (Black and Gold)",
      "ratings": 22.375,
      "price": "$7.98",
      "image": "https://m.media-amazon.com/images/I/51dsuumz6HL._AC_SY355_.jpg",
      "description": "LOW POWER CONSUMPTION: Intelligent sleep mode can better extend battery life. It will enter auto sleep mode if you don't use it for 5 minutes to save battery and need to click it, the mouse will enter working mode again     STABLE CONNECTION: 2.4 GHz wireless provides stronger anti-interference ability, a faster transmission speed and a more reliable connection, working distances can up to 10 m, and high DPI can make it track more smoothly over most surfaces     WIDE COMPATIBILITY:Well compatible with Windows7/8/10/XP, Vista, Mac OS X 10.4 etc. Fits for desktop, laptop, PC, Macbook and other devices     ERGONOMIC & COMPACT DESIGN: USB-receiver stays in your PC USB port or stows conveniently inside the wireless mouse when not in use. The lightweight and simple features make the mouse perfect for the journey, office, home     WHISPER & SENSITIVE CLICKING: Smooth frosted surface and quiet clicks can bring a better user experience and free your worry about bothering others and keep you stay focused while working",
      "details": {
        "brand": "VssoPlor",
        "color": "Black and Gold",
        "size": "N/A",
        "material": "N/A",
        "fitType": "N/A",
        "careInstructions": "N/A"
      }
    },
    {
      "id": "B07Y1KKFBH",
      "name": "WisFox 2.4G Wireless Mouse for Laptop, Ergonomic Computer Mouse with USB Receiver and 3 Adjustable Levels, 6 Button Cordless Mouse Wireless Mice for Windows Mac PC Notebook (Grey)",
      "ratings": 5.658,
      "price": "$7.99",
      "image": "https://m.media-amazon.com/images/I/714+t9HR4GL._AC_SY355_.jpg",
      "description": "▶[COMFORTABLE ERGONOMIC DESIGN] WisFox Wireless Mouse is really well-built and still feels very light, with a clean design and sleek aesthetic. Contoured Shape for the ultimate comfort of use. Sweat-Resistant Coating to further elevate your experience. All in all, this is a comfortable, functional and satisfying laptop mouse for chromebook, home, work, or travel.     ▶[3 DPI LEVELS & 6 BUTTONS] 3 Adjustable DPI Settings, 800, 1200 and 1600. This computer mouse gives precision tracking on just about any surface, with a DPI button helping to change the sensitivity on the fly. Extra 2 Side Buttons ideal for both work and gaming. Plug and play directly with A RECEIVER STORED IN THE BATTERY COMPARTMENT, no any driver needed!     ▶[HIGH DURABILITY & STABLE SINGAL] 5 Million Times Keystroke Test to guarantee superb durability of this cordless mouse, together with advanced 2.4GHz wireless technology to ensure strong accurate connection to your computer, as well as a longer working distance of 33 feet. Easy and convenient. Go ahead, and enjoy being more productive with the USB mouse!     ▶[AUTO SLEEP MODE & SYMMETRIC DESIGN] Being impressively easy to use, this wireless mouse for chromebook also keeps energy efficiency in mind. It will enter auto power-saving mode after 1 minute of idling, or sleep mode after 8 minutes of idling. Double click to wake the ergonomic mouse up. Symmetric design makes it suitable for both right- and left-hander.     ▶[WIDE COMPATIBILITY & SERVICE] This wireless mice is highly compatible with Windows 7/8/10/XP, Vista 7/8, Linux, etc. Works well with laptop, desktop, PC, MacBook and other devices. WisFox is proud to offer 12-month warranty for every our product as well as 24/h service to all our customers. If you have any question, free feel to contact us for help!",
      "details": {
        "brand": "WisFox",
        "color": "Grey",
        "size": "N/A",
        "material": "N/A",
        "fitType": "N/A",
        "careInstructions": "N/A"
      }
    },
    {
      "id": "B0CZM4K4WG",
      "name": "FOPETT Wireless Keyboard and Mouse Combo - 2.4G Full-Sized Cute Colorful Retro Keyboard with Round Keycaps 104 Keys Typewriter Keyboard for Laptop/Windows/PC-Yellow Colorful",
      "ratings": 3.114,
      "price": "$39.99",
      "image": "https://m.media-amazon.com/images/I/71NUBdIaVaL._AC_SY355_.jpg",
      "description": "Keyboard and Mouse Warranty : We offer a three-year worry-free warranty and a 60-day money-back guarantee or replacement option. If you have any inquiries or concerns regarding our wireless keyboard and mouse set, please don't hesitate to contact us. Your satisfaction is our top priority.     Stable 2.4G Wireless Connection Cute Wireless Keyboard : Enjoy a powerful wireless connection with a range of up to 10 meters (393.7 inches) for the keyboard and mouse combo. they utilize a shared Nano receiver, conveniently stored at the bottom of the mouse, plug and play.eliminating the need for additional software installation.keeping your desk clean. keyboard size 17.5 x 5.3 x 1 inch with 104 keys. mouse size is 3.9 x 1.5 x 1 inch. keyboard net weight: 1.6LB, mouse net weight: 0.15LB.     Full Size Wireless Keyboard and Mouse : Thanks to the silent micro-motion technology, the mouse clicks are nearly silent, eliminating bothersome knocking sounds that could disturb you and your family. the cordless mouse DPI levels (800/1000/1200) for fast and precise cursor control, all while maintaining a quiet operation. whether you're working or playing, you'll never have to worry about disturbing others' rest.     Wireless Keyboards Ergonomic Design : The keyboard is designed with a tilt angle,comfortable typing position，the wireless mouse features a sweat-resistant and skin-friendly finish, with a contoured shape that allows for hours of comfortable work. If you encounter any issues with our product, whether it's exceeding Amazon's return time or receiving a defective item, please reach out to us via Amazon email as your first point of contact. we are committed to providing you with satisfactory solutions.     Wireless Mouse Wide Compatibility : Our wireless computer keyboard is 12 function keys for quick access to music, volume, mail, and more (please note that the hotkeys may not be fully compatible with Mac systems). This keyboard mouse combo is compatible with various operating systems, including Windows XP/ME/Vista/7/8/10/11. It works seamlessly with devices that have a USB slot, such as PCs, laptops, MacBooks, desktops, Chromebooks, and even Smart TVs.     Colorful Keyboard Shared Receiver : A USB receiver simultaneously drives the keyboard and mouse, enabling wireless transmission with a stable and delay-free signal,2.4G wireless transmission technology, supporting multiple computer types.the design incorporates splash resistance, with a waterproof conductive film that allows liquid to flow out from within the keyboard membrane. The mouse requires one 1.5V AA battery (included), while the keyboard requires one 1.5V AA battery (included).",
      "details": {
        "brand": "FOPETT",
        "color": "Lovely Coffee",
        "size": "N/A",
        "material": "N/A",
        "fitType": "N/A",
        "careInstructions": "N/A"
      }
    },
    {
      "id": "B085611S5Q",
      "name": "Mouse Pad 12.6×10.8×0.08 inches Premium-Textured Non-Slip Rubber Base Mouse Mat Mousepad for Office & Home, Black (2 Pack)",
      "ratings": 561,
      "price": "$5.99",
      "image": "https://m.media-amazon.com/images/I/815fbZ+8t9L._AC_SY355_.jpg",
      "description": "【Ultra-smooth Surface】Made of Premium-Textured cloth mousepad ensures smoother mouse control and pinpoint accuracy.     【Non-slip rubber base】Non-Slip rubber base keeps mouse pad firmly in place, preventing slipping.     【Washable Design and Fade Prevent】Machine washable, liquid stains can be cleaned and won't fade with repeated cleaning.     【Perfect Sizing】320 millimeter x 270 millimeter x 2 millimeter / 12.6 inch x 10.8 inch. Ideal size for office & home.",
      "details": {
        "brand": "TNY",
        "color": "2 Pack",
        "size": "N/A",
        "material": "N/A",
        "fitType": "N/A",
        "careInstructions": "N/A"
      }
    }
  ]
}