{
  "totalProducts": 22,
  "products": [
    {
      "id": "B09B8W5FW7",
      "name": "Amazon Echo Dot (5th Gen) with clock | Compact smart speaker with Alexa and enhanced LED display for at-a-glance clock, timers, weather, and more | Cloud Blue",
      "ratings": 75.251,
      "price": "$34.99",
      "image": "https://m.media-amazon.com/images/I/81wmtcLUSAL._AC_SY300_SX300_.jpg",
      "description": "Our best sounding Echo Dot yet – Enjoy an improved audio experience compared to any previous Echo Dot with Alexa for clearer vocals, deeper bass and vibrant sound in any room.     Enhanced LED display – Stay on track with an improved LED display that shows the time, weather, alarms, and song titles at a glance.     Alexa is your personal assistant – Ask Alexa for news, weather, timers, smart home controls, and more to make your day easier and more productive.     All your music and content – Stream all your favorites from Amazon Music, Apple Music, Spotify, and others or via Bluetooth for throughout your home.     Voice-controlled smart home – Control compatible lights, locks, fans, and more with just your voice or create routines triggered by motion sensors.     Designed to protect your privacy – Amazon is not in the business of selling your personal information to others. Built with multiple layers of privacy controls, including a mic off button.     Do more with device pairing – Fill your home with music using compatible Echo devices in different rooms, create a home theater system with Fire TV, and extend wifi coverage with a compatible eero network so you can say goodbye to drop-offs and buffering.     Climate pledge friendly – We considered sustainability in the design of this device with 100% recyclable packaging, 100% post-consumer recycled polyester yarn, and 55% post-consumer recycled plastics.",
      "details": {
        "brand": "N/A",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "Our best sounding Echo Dot yet – Enjoy an improved audio experience compared to any previous Echo Dot with Alexa for clearer vocals, deeper bass and vibrant sound in any room."
      }
    },
    {
      "id": "B0CC5J2H8R",
      "name": "AKCISOT Wall Clock, Modern Small Wall Clocks Battery Operated 8 Inch, Silent Non-Ticking Analog Classic for Office, Home, Bathroom, Kitchen, Bedroom, School(Black)",
      "ratings": 7.182,
      "price": "$7.99",
      "image": "https://m.media-amazon.com/images/I/61trMedTU6L.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Easy to See: Designed with big numerals by AKCISOT.     Keep Time Accurate: AKCISOT clock movements undergo thorough testing before being offered for sale.     Silent: Features AKCISOT's quiet sweep movement.     Simple Design: Presents a clean clock face by AKCISOT.     What You Get: An AKCISOT wall clock and two hooks.",
      "details": {
        "brand": "AKCISOT",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "A_black",
        "ram": "N/A",
        "detail_item": "Easy to See: Designed with big numerals by AKCISOT."
      }
    },
    {
      "id": "B0CD2B2Z9B",
      "name": "JALL 16\" Large Digital Wall Clock with Remote Control, Dual Alarm with Big LED Screen Dispaly, 8 RGB Colors, Auto DST, Temperature for Living Room, Bedroom, Desk Decor, Mounted, Gift for Elderly",
      "ratings": 1.812,
      "price": "$43.99",
      "image": "https://m.media-amazon.com/images/I/71KpvgBXwiL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "【16-inch Large Colorful Display】Width: 15.35 inches. Height: 5.11 inches. It has a 16\" large screen, with up to 8 colors, including 4 pure colors and 4 RGB colors. Allow you to read clearly from any angles, far distance. Especially user friendly for the elderly. It's also a nice decorative stuff for your room.     【Modern Night Light】With the night light at the bottom, it will provide a warm atmosphere for your living room. It can also light up the room so that you don't need to turn on the light when you go to toilet at night.     【Do both for Wall Mounted and Desktop】It can be hung on the wall or just elegantly stand on the desktop. Operate through remote control.     【Auto DST & Auto Brightness】It will automatically change DST time in March and November. You don't have to remember to change the time anymore. Also, it's preset a light sensor to change its displaying brightness, make it comfortable for human eyes at any time.     【Suitable for different places, people】It fits perfectly for living room, garage, office, warehouse, classroom, farmhouse, gym, kitchen and any other places. Ideal gift for family and the elderly.     【Have to Plug-in】It's NOT battery operated. It must work with 5V/2A power adapter and 11.5 feet cable cord (included). There's a memory battery inside so it will remember your setting even it's disconnected.",
      "details": {
        "brand": "JALL",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "Black",
        "ram": "N/A",
        "detail_item": "【16-inch Large Colorful Display】Width: 15.35 inches. Height: 5.11 inches. It has a 16\" large screen, with up to 8 colors, including 4 pure colors and 4 RGB colors. Allow you to read clearly from any angles, far distance. Especially user friendly for the elderly. It's also a nice decorative stuff for your room."
      }
    },
    {
      "id": "B0D93S4GT4",
      "name": "Wall Clock Silent Non-Ticking Wooden Clocks Battery Operated 8 Inch Small Country Retro Rustic and Beach Style Decorative for Kitchen, Home, Bathroom, Bedroom (Blue)",
      "ratings": 82,
      "price": "$7.99",
      "image": "https://m.media-amazon.com/images/I/716j3XNiAFL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "① [SUPER SILENT] - Equipped with high quality sweeping movement-non ticking/accurate timekeeping. Also it will give you absolutely silent environment all the day     ② [EASY TO USE] - It is easy to use, include put the batteries or set the time or hand it! It runs on 1 AA low-output carbon battery (Not Included), it is very easy to set the time with a small \"wheel\" on the back     ③ [EASY TO READ] - Black hour, minute hands, plastic special copper case, vintage/retro design, large numbers against, easy viewing and pleasing to the eye, the glass will keeps dust away from dial and give you a beautiful clocks.     ④[Good Gift] - A perfect choice for christmas gift,children's day gift,bridal gift, anniversary gift, mothers day gift,fathers day gift, birthday present, holiday gift etc.Share this beautiful wall clock with the ones you love.     ⑤ AFTER SALES SERVICE - One year warranty and 30-day policy of free return and exchange. If you have any questions about this item, please contact us immediately, we will help you.",
      "details": {
        "brand": "KECYET",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "A_blue",
        "ram": "N/A",
        "detail_item": "① [SUPER SILENT] - Equipped with high quality sweeping movement-non ticking/accurate timekeeping. Also it will give you absolutely silent environment all the day"
      }
    },
    {
      "id": "B0CDWYP42R",
      "name": "Wall Clock, Modern 8 Inch Battery Operated Wall Clocks, Silent Non Ticking Small Analog Clock for Living Room, Office, Home, Bedroom, Kitchen, Bathroom(Black)",
      "ratings": 1.622,
      "price": "$7.99",
      "image": "https://m.media-amazon.com/images/I/61GPjfMkgyL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Simplicity - Rohioue's Sipmle Wall Clock Lineup.     See Easily - Rohioue's Wall Clocks are all large numbers for seniors.     Durable and Practica -- The Material of Rohioue's Clocks all from leading suppliers in the industry.     Classic Design - Rohioue's wall clocks are classic and decorative for all rooms.     Nice Gift - Rohioue's wall clocks are exquisitely packaged, as beautifully as a gift.",
      "details": {
        "brand": "Rohioue",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "A_black",
        "ram": "N/A",
        "detail_item": "Simplicity - Rohioue's Sipmle Wall Clock Lineup."
      }
    },
    {
      "id": "B08XDV4PPS",
      "name": "Sharp Digital Alarm with AccuSet - Automatic Smart Clock, Never Needs Setting - Great for Seniors, Kids, and Everyone who Doesn't Want to Set a Clock! Silver Case with Green LEDs",
      "ratings": 8.058,
      "price": "$18.99",
      "image": "https://m.media-amazon.com/images/I/71pMNEvEyuL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "AccuSet Automatic Time Set - The clock is pre-programed with the time so there is no need to worry about setting buttons. Just select your time zone at the bottom of the clock and turn on the DST if applicable. Plug the clock in to an approved electrical source.     Quick Daylight Savings Time (DST) Adjustment - For quick adjustment for Daylight Savings Time, slide the DST switch at the bottom of the clock to ON to add and hour (+1 hr.). For Standard Time slide switch to OFF to subtract an hour (-1 hr.)     High/Low Dimmer control - Adjust the display brightness to your liking with the high or low dimmer control.     Back up Battery -The button cell battery CR2032 is pre-installed and is used for the back up battery and the time settings. It is in a screw-secured cabinet at the bottom of the clock. This battery will last for several years.     Time Zone Selection - The default time zone is Eastern Standard Time. Before you plug in the set your time zone on the bottom of the clock.",
      "details": {
        "brand": "Sharp",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "Black - Green Led",
        "ram": "N/A",
        "detail_item": "AccuSet Automatic Time Set - The clock is pre-programed with the time so there is no need to worry about setting buttons. Just select your time zone at the bottom of the clock and turn on the DST if applicable. Plug the clock in to an approved electrical source."
      }
    },
    {
      "id": "B0D7P42S4P",
      "name": "Wall Clock Silent Non-Ticking Modern Clock Battery Operated 8 Inch Small Classic Analog Decorative for Kitchen, Living Room, Office, Bedroom, Bathroom (Black)",
      "ratings": 172,
      "price": "$6.99",
      "image": "https://m.media-amazon.com/images/I/61NDr17hbOL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "1 - See Easily: Roymnie's wall clocks are all large and black numbers against the white clock face. So it's very easy to see.     2 - Silent: Roymnie wall clock sweeping movement.     3 - Keep Time Accurate: Roymnie clock movements undergo thorough testing before being offered for sale.     4 - Great Quality: Made from eco-friendly materials, Roymnie wall clock is durable.     5 - Battery Powered: Powered by 1 AA battery (Not Included)",
      "details": {
        "brand": "Roymnie",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "A_black",
        "ram": "N/A",
        "detail_item": "1 - See Easily: Roymnie's wall clocks are all large and black numbers against the white clock face. So it's very easy to see."
      }
    },
    {
      "id": "B081757TF8",
      "name": "Sharp Atomic Analog Wall Clock - 12\" Silver Brushed Finish - Sets Automatically- Battery Operated - Easy to Read - Easy to Use– Modern Design and Style",
      "ratings": 3.101,
      "price": "$34.99",
      "image": "https://m.media-amazon.com/images/I/71gZ049-X3L.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "ATOMIC ACCURACY: The Atomic clock has a built-in receiver that automatically synchronizes itself with the WWVB radio broadcast by the US Government’s National Institute (NIST) in Fort Collins, Colorado. The Atomic Clock will always be accurate to within one second as it receives daily WWVB updates.     AUTOMATICALLY SETS: Clock resets regularly by radio-control to match the US Atomic Clock in Colorado and adjusts automatically for daylight savings time     BRUSHED SILVER FRAME: Brushed frame adds style and longevity to any decor     BATTERY OPERATED - (Requires 1 x AA batteries - not included)     EASY TO READ - EASY TO USE: Simple, easy to read style fits any decor and is easy to read - perfect for any room in the house: den, office, kitchen, kids room, garage",
      "details": {
        "brand": "Sharp",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "Silver / White",
        "ram": "N/A",
        "detail_item": "ATOMIC ACCURACY: The Atomic clock has a built-in receiver that automatically synchronizes itself with the WWVB radio broadcast by the US Government’s National Institute (NIST) in Fort Collins, Colorado. The Atomic Clock will always be accurate to within one second as it receives daily WWVB updates."
      }
    },
    {
      "id": "B0B91ZDR4N",
      "name": "Bernhard Products Black Wall Clock Silent Non Ticking - XL 18 Inch, Set of Two Quality Quartz Battery Operated Round Easy to Read Home/Office/Classroom/School",
      "ratings": 1.442,
      "price": "$84.99",
      "image": "https://m.media-amazon.com/images/I/81nL5yXsGUL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Set of 2 extra large wall clocks 18 inch. Large black bold Arabic numerals against white face creates easy viewing from a distance and every angle. Precise quartz movements guarantee accurate time     Silent non-ticking mechanism with a sweeping second hand movement. Enjoy a quiet environment!     Sturdy plastic frame 1.75\" deep. Glass cover protects dial and can easily be leaned with a cloth. Red second hand for extra clarity     Easy to read from any angle. Ideal for adults, seniors and children. The perfect wall clock for an office, school classroom, living room, gym, bedroom, master bathroom and any room in your home or business     Simple hanging on a nail or hook. Durable yet lightweight. Uses 1 \"AA\" battery - not included (Note: Plus side of your battery should be inserted first) 1-year manufacture warranty",
      "details": {
        "brand": "Bernhard Products",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "Black",
        "ram": "N/A",
        "detail_item": "Set of 2 extra large wall clocks 18 inch. Large black bold Arabic numerals against white face creates easy viewing from a distance and every angle. Precise quartz movements guarantee accurate time"
      }
    },
    {
      "id": "B08M5VG7XH",
      "name": "Digital Alarm Clock, with 5.5\" Large LED Time Display, Adjustable Alarm Volume, 6 Level Brightness, Alarm Settings, USB Charger, Temperature Detect, Snooze, Clocks for Bedroom, Bedside, Desk, Black",
      "ratings": 7.137,
      "price": "$15.29",
      "image": "https://m.media-amazon.com/images/I/61viwI1DSiL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "【Upgraded Big Screen Display】- Experience the luxury of a 5.5\" High Resolution Digital Alarm Clock that spells out the time, date, and temperature clearly. The illuminated LED digits ensure visibility even from a distance, allowing you to effortlessly check the time without straining your eyes.     【Adjustable Alarm Brightness】- With our revolutionary 6 Brightness Levels ranging from 5% to 100%, you have complete control over the alarm clock's brightness. No need to worry about the brightness being too intense to disrupt your sleep or too dim to read the time. Find the perfect balance that suits your preferences.     【Adjustable Alarm Volume】- Say goodbye to jarring wake-ups! Our alarm clock offers 8 adjustable sounds that can be set between 30-85 DP, allowing you to wake up to your preferred level of audio stimulation. And with the easy snooze function, simply press the top button for an extra 9 minutes of snooze.     【Easy Operate】- Designed for simplicity, our alarm clock features a big and clear display, 12-hour / 24-hour format, and provides indoor temperature information. It's perfect for kids, seniors, and the elderly, guaranteeing a stress-free experience when setting the time and alarm.     【USB Charging Port and Battery Backup】- Conveniently charge your smartphones, tablets, or other 5V electronic devices with the built-in USB charging port. The clock also features a backup button battery, ensuring that it keeps the time even during power outages. Please note that the clock must be powered using the power cable.",
      "details": {
        "brand": "JALL",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "5.5\" Black",
        "ram": "N/A",
        "detail_item": "【Upgraded Big Screen Display】- Experience the luxury of a 5.5\" High Resolution Digital Alarm Clock that spells out the time, date, and temperature clearly. The illuminated LED digits ensure visibility even from a distance, allowing you to effortlessly check the time without straining your eyes."
      }
    },
    {
      "id": "B015E5U424",
      "name": "AcuRite Large Digital LED Oversized Wall Clock with Date and Temperature, Perfect for Home or Office (75127M), 14.5-Inch, Red",
      "ratings": 7.275,
      "price": "$51.49",
      "image": "https://m.media-amazon.com/images/I/61mItKANqQL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Easy-to-Read, Bold 4.25-Inch LED Digits: High-contrast screen allows for easy viewing at a glance or across any room     Versatile Placement Options: Use the integrated hang holes on the back of this LED light clock or the fold-out kickstand for easy placement, proving it isn’t just a digital wall clock!     Powered by a 9-Foot Power Adapter (required): Added length allows for placement anywhere in the room, with the excess able to be reeled into the integrated cord storage area on the back of this digital clock LED     Battery Operated Backup: Preserves the date and time in this digital wall clock in the event of any power outages, making this the perfect LED light clock for when storms roll in     Perfect Anywhere: Large wall LED clock for the gym, living room, or us as the ideal garage clock",
      "details": {
        "brand": "AcuRite",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "Red",
        "ram": "N/A",
        "detail_item": "Easy-to-Read, Bold 4.25-Inch LED Digits: High-contrast screen allows for easy viewing at a glance or across any room"
      }
    },
    {
      "id": "B0002WZRJK",
      "name": "La Crosse Technology Wall Clock, Plastic, 14-inch Dia. (WT-3143A) (WT-3143A-INT)",
      "ratings": 3.6,
      "price": "$39.99",
      "image": "https://m.media-amazon.com/images/I/71yoyiMJ6wL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Sold as 1 Each.     Black-case plastic wall clock. Automatically updates for daylight saving time (on/off option). 1-year manufacturer limited warranty.     Utilizes quartz movement mechanism. Four time zones: Eastern, Central, Mountain, Pacific. WARNING: This product can expose you to chemicals including styrene, which is known to the State of California to cause cancer. For more information go to: www.P65Warnings.ca.gov..     Runs on one AA alkaline battery (not included). Automatically sets to exact time.     White dial with black Arabic numbers. Features atomic time with optional manual setting.",
      "details": {
        "brand": "La Crosse Technology",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "Black",
        "ram": "N/A",
        "detail_item": "Sold as 1 Each."
      }
    },
    {
      "id": "B089ZFZGTM",
      "name": "Sharp Digital Alarm Clock – Black Case with Red LEDs - Ascending Alarm Grows Increasing Louder, Gentle Wake Up Experience, Dual Alarm - Battery Back-up, Easy to Use with Simple Operation",
      "ratings": 7.646,
      "price": "$12.99",
      "image": "https://m.media-amazon.com/images/I/61hwrn3efFL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "EASY TO USE DIGITAL ALARM CLOCK WITH DUAL ALARM - This clock has been designed with absolute simplicity in mind and is very easy to operate. Perfect for adults, children, teens, seniors and the elderly.     EASY TO SET DUAL ALARM - Set one for weekdays and the other for weekend!     ASCENDING ALARM VOLUME - The ascending alarm begins sound faintly and then grew increasingly louder for gently wake up without being awakened abruptly     ALARM BATTERY BACK UP (requires 2x AA battery, sold separately) Sleep with confidence knowing that your alarm will continue to function even in the event of a power outage. The display will be lit after power is restored.     EASY TO READ ILLUMINATED RED LED DIGITS - Easy to Read Red Numbers on the clock are very clear with extra bright quality, See from across the room or even without glasses in the middle of the night!",
      "details": {
        "brand": "Sharp",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "Black - Red Led",
        "ram": "N/A",
        "detail_item": "EASY TO USE DIGITAL ALARM CLOCK WITH DUAL ALARM - This clock has been designed with absolute simplicity in mind and is very easy to operate. Perfect for adults, children, teens, seniors and the elderly."
      }
    },
    {
      "id": "B01N03CW3F",
      "name": "Westclox Large Digital Wall Clock Battery Operated with Temperature Date and Day of Week with Alarm | Modern Digital Desk Clock for Office Kitchen Bedroom or Living Room | Black",
      "ratings": 671,
      "price": "$18.18",
      "image": "https://m.media-amazon.com/images/I/71UMPKq3YmL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Digital Clock Wall or Desk Stable - Rest assured with our wall clock digital display with easy to use alarm and snooze with easy to read day date temperature and second displays with a sleek design     Simple and Dependable - Our digital wall clock large display is reliable and easy to read and use that can be hung on the wall in seconds but also has the ability to stand on a desk or nightstand     5 Star Features - Say hello to large number digital clock with date and day of week plus seconds and temperature that even has an alarm with snooze button making ideal for any room in your home     Important Information - This wall digital clock is 16\"W x 4\"H and runs on 2 AA batteries and weighs a light 10.4 ounces so try it today and see why Westclox is a leading name in clock making     Industry Leader - We are proud to be a trusted name in all things timekeeping including vintage and modern digital clocks for wall and desks since 1884 because we know how important time can be",
      "details": {
        "brand": "Westclox",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "Black",
        "ram": "N/A",
        "detail_item": "Digital Clock Wall or Desk Stable - Rest assured with our wall clock digital display with easy to use alarm and snooze with easy to read day date temperature and second displays with a sleek design"
      }
    },
    {
      "id": "B08DRBTPGY",
      "name": "WallarGe Night Light Wall Clock for Bedroom - Silent Lighted up Wall Clock Glow in The Dark, Battery Operated for Living Room/Kitchen, Easy to Read Large Digital Display, 12 Inch",
      "ratings": 4.244,
      "price": "$29.99",
      "image": "https://m.media-amazon.com/images/I/61hc3q7-ieL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Wall Clocks Battery Operated - This wall clock required 1 \"AA\" battery for clock movement and 3 “AA” batteries for energy saving light sensor. The light sensor and the clock movement operate independently, easy to use. (Batteries not included)     Adjustable Brightness Smart Light - The clock is equipped with a high quality smart light sensor, so it will automatically turn on or off the night light depending on the surrounding light brightness. It is available in 3 levels of brightness: Off-Low-High.     Silent Wall Clock, Non-Ticking - These wall clocks use superior precise quartz movement to make sure true silence and accuracy time with the smooth second hand. You no longer have to worry about its annoying clicking noises at night.     Excellent Clocks for Living Room Decor - Modern design and practical house decorations, suit for living room, kitchen, backyard, garage, office, gym and so on. It come with 1 hook for easy hanging.     12” Clock Dial,1” Bold Numbers - Large white dial against white bold numbers creates easy viewing, add adjustable night lights, mate it easy to read the time from across the room both day and night.",
      "details": {
        "brand": "WallarGe",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "Black",
        "ram": "N/A",
        "detail_item": "Wall Clocks Battery Operated - This wall clock required 1 \"AA\" battery for clock movement and 3 “AA” batteries for energy saving light sensor. The light sensor and the clock movement operate independently, easy to use. (Batteries not included)"
      }
    },
    {
      "id": "B003KWX0MU",
      "name": "Bulova Dalton Chiming Pendulum Table Clock - Walnut Finish - Gold-Tone Accents",
      "ratings": 478,
      "price": "$95.13",
      "image": "https://m.media-amazon.com/images/I/8171oN-qu3L.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Walnut Finish     Polished Goldstone Bezel     Westminster Melody On The Hour",
      "details": {
        "brand": "Bulova",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "Walnut Brown",
        "ram": "N/A",
        "detail_item": "Walnut Finish"
      }
    },
    {
      "id": "B07PFGG8C9",
      "name": "JALL Digital Alarm Clock, with Wooden Electronic LED Time Display, Dual Alarm, 2.5-inch Cubic Small Mini Wood Made Electric Clocks for Bedroom, Bedside, Desk, Black",
      "ratings": 11.402,
      "price": "$14.99",
      "image": "https://m.media-amazon.com/images/I/61BMamIXqFL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "【Dual Alarm Setting】- Updated version. Rise and shine with up to 2 alarms, ensuring you and your partner never miss a beat. Bid farewell to delays and wake up on time. Plus, enjoy the convenience of setting weekday / weekend / everyday mode for alarm activatio.     【Stylish Wooden Design for Décor】- Witness the epitome of elegance in an alarm clock. Not just a timekeeper, it's a magnificent addition to your bedroom decor. Its stylish appearance and versatile functions make it an ideal gift for kids too.     【Multiple Brightness Level Adjustable】- Customize your clock's brightness, from a soft glow to a brighter display. Perfect for nighttime use, without straining your eyes.     【Mini 2.5-inch Compact Size】- With its compact 2.5-inch size, it frees up your desktop space while providing easy-to-read time display even from a distance.     【Power Cord Operated】- No batteries required Wave goodbye to battery replacements. Our clock comes with a USB-powered charger, ensuring consistent and reliable operation without the hassle of changing batteries.",
      "details": {
        "brand": "JALL",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "Black",
        "ram": "N/A",
        "detail_item": "【Dual Alarm Setting】- Updated version. Rise and shine with up to 2 alarms, ensuring you and your partner never miss a beat. Bid farewell to delays and wake up on time. Plus, enjoy the convenience of setting weekday / weekend / everyday mode for alarm activatio."
      }
    },
    {
      "id": "B01HONVHZ2",
      "name": "Bernhard Products Black Wall Clock Silent Non Ticking 10 Inch Quality Quartz Battery Operated Round Easy to Read Home/Office/Kitchen/Classroom/School Clock Sweep Movement",
      "ratings": 28.31,
      "price": "$9.97",
      "image": "https://m.media-amazon.com/images/I/81os6R4wnNL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "10 Inch clock. Large black bold numbers against white face background creates easy viewing. Precise Quartz movements guarantee accurate time     Silent non-ticking mechanism with sweeping movement. enjoy a quiet environment!     Sturdy plastic frame and glass lens make it easy to clean and keeps dust away from dial     The perfect wall clock for an office, classroom, bedroom, bathroom, shop, gym or any room in your home of business     Lightweight and easy to hang. Powered by 1 \"AA\" battery - not included. 12 Months Manufacture Warranty",
      "details": {
        "brand": "Bernhard Products",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "Black",
        "ram": "N/A",
        "detail_item": "10 Inch clock. Large black bold numbers against white face background creates easy viewing. Precise Quartz movements guarantee accurate time"
      }
    },
    {
      "id": "B0B4VB8MZM",
      "name": "TROCOTN 10 Inches Calendar Clock Dementia Clock Large Display Alarm Clock with Auto DST for Seniors, 5 Display Modes Large Font Digital Clock with Custom Alarms Day Date Clock Wall Clock(White)",
      "ratings": 1.788,
      "price": "$39.99",
      "image": "https://m.media-amazon.com/images/I/61aggCD4UfL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "HD Display Function: This unique 10-inch high-resolution digital calendar clock display uses large, bold letters to clearly spell out the time, time of day, day of the week, month, and date - no confusing abbreviations. The adapter cable is approximately 150 cm (59 inches) long and the clock does not run on batteries.     Easy to Use: Easy to set up, plug and play, automatic daylight saving time, automatic dimming, 8 languages, 5 color display, easy to read. It can be hung on a wall (using its rear mount hole), or stood on a table, nightstand, shelf or desk,office, kitchen, living room, bedrooms, school, nursing station, garage, bar ......No matter which you choose, you can see the time, date, and day of the week very well.     12 Sets of Custom Alarms: The alarm mode is easy to set, single alarm, every day, weekdays only, or weekends only. The clock has 14 alarm labels, suitable for seniors and family daily life.     Auto Dimming: The day clock automatically dims at 7:00 pm and brightens at 7:00 am, perfect for use in the bedroom. Users can also choose a fixed brightness for use in other locations.     5-color display: It can be easily viewed even in less than ideal lighting conditions, and can display the time with the living room decoration, which is very beautiful. The color clock is a color display, which is suitable for the elderly.     Great for seniors :The packaging and manual do not contain words such as \"dementia\" and \"memory loss\", Great clock with attractive design---easy to read, it's Great for seniors.",
      "details": {
        "brand": "TROCOTN",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "White",
        "ram": "N/A",
        "detail_item": "HD Display Function: This unique 10-inch high-resolution digital calendar clock display uses large, bold letters to clearly spell out the time, time of day, day of the week, month, and date - no confusing abbreviations. The adapter cable is approximately 150 cm (59 inches) long and the clock does not run on batteries."
      }
    },
    {
      "id": "B010DZYJ08",
      "name": "Flex Timer - Gym Edition - Bluetooth App-Controlled Wall Mounted 23\" LED Gym Clock with Large 4.0\" Digits for Crossfit, Tabata, HIIT, EMOM, MMA, Boxing, Interval Training, Circuits, Workouts",
      "ratings": 159,
      "price": "$299.00",
      "image": "https://m.media-amazon.com/images/I/61LRqFlk1+L._AC_SY300_SX300_.jpg",
      "description": "[GREAT FOR ALL GYMS AND WORKOUTS] - Use the Flex Timer in your home gym, garage gym, CrossFit box, commercial/chain gym, high school, team workout facility, boxing or MMA studio, and so much more. With 11 main timer modes (including Standard Count Up/Down, Round, Interval, Tabata, EMOM, Work-to-Rest Ratio, Multi-Segment, and Laps/Stopwatch) and various sizes of crystal clear LED displays, there is a Flex Timer for everyone!     [UNMATCHED IN CUSTOMIZABILITY] - The Flex Timer allows for extreme personalization so you can fine-tune the settings to your personal needs by changing the length of your rest or work intervals, the number of intervals, programming additional rest periods, repeating common structures, and much more. The Flex Timer goes above and beyond the competition so you can too.     [SIMPLE TO USE APP] - Connect quickly and reliably to your Flex Timer via Bluetooth with almost any iOS or Android device. Quickly choose a recently-used timer, an old favorite, or select a pre-made workout and customize it to your needs. Our customers rave about the ease of use and reliable connection that let’s them focus on their workout and not the timer.     [SYNCS WITH YOUR BLUETOOTH SPEAKERS/HEADPHONES] - Your interval cues can be played through your speakers alongside your music. The Flex Timer will automatically fade your music in and out so that you don’t miss your interval cue and can get back to working out. Or, simply use the built-in buzzer to stay on top of your workout.     [LINK YOUR FLEX TIMERS TOGETHER] - The Flex Timer app wirelessly synchronizes the timer across multiple Flex Timer displays. Great for competition timing, larger gyms, or gyms with multiple rooms. Additionally, you can cast your timer onto a TV monitor using ChromeCast or AppleTV.",
      "details": {
        "brand": "GymNext",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "4.0\" Blue/Red",
        "ram": "N/A",
        "detail_item": "[GREAT FOR ALL GYMS AND WORKOUTS] - Use the Flex Timer in your home gym, garage gym, CrossFit box, commercial/chain gym, high school, team workout facility, boxing or MMA studio, and so much more. With 11 main timer modes (including Standard Count Up/Down, Round, Interval, Tabata, EMOM, Work-to-Rest Ratio, Multi-Segment, and Laps/Stopwatch) and various sizes of crystal clear LED displays, there is a Flex Timer for everyone!"
      }
    },
    {
      "id": "B0DKSXXD56",
      "name": "Personalized Hair Salon Decor, Wall Clock with Custom Name, Hairdresser Gifts, Beauty Salon Barbershop Decor for Hairdresser Hair Stylist, Barber Supplies, Barber Accessories",
      "ratings": null,
      "price": "$17.99",
      "image": "https://m.media-amazon.com/images/I/81Fgp+OZq7L._AC_SY300_SX300_.jpg",
      "description": "Personalized Wall Clock - Custom made wall hanging clock, there are three colors available for you to choose from: black, white, and beige. Just click 'Customized Now', then add your name to get a unique hair salon clock. And the clock has two materials to choose from, wood or metal. We recommend metal clocks more because they are harder and less fragile. You can also choose the material according to your needs     Unique Hair Salon Decor - Embracing the essence of hairstyle artistry, the wall clock is adorned with charming hairdressing motifs. These captivating designs pay homage to the hairstylist's creativity and passion, making it a meaningful decoration for any salon or hairstyle space     Barber Accessories - The special wall clock from premium materials, ensuring that the clock remains durable and functional piece in any hair salon or studio     Barber Accessories - The special wall clock from premium materials, ensuring that the clock remains durable and functional piece in any hair salon or studio     Perfect Hairdresser Gifts - The personalized hairdresser gifts wall clock makes an ideal gift for hairdressers, hairstylists, and salon owners. Present this personalized clock as a meaningful gift during hairstylist appreciation days, birthdays, anniversaries, or upon successful completion of hairstyle courses",
      "details": {
        "brand": "JeathFea",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "Black",
        "ram": "N/A",
        "detail_item": "Personalized Wall Clock - Custom made wall hanging clock, there are three colors available for you to choose from: black, white, and beige. Just click 'Customized Now', then add your name to get a unique hair salon clock. And the clock has two materials to choose from, wood or metal. We recommend metal clocks more because they are harder and less fragile. You can also choose the material according to your needs"
      }
    },
    {
      "id": "B07TX3GNGK",
      "name": "Betus Digital Travel Alarm Clock - Foldable Calendar Temperature Timer LCD Clock with Snooze Mode - Large Number Display, Battery Operated - Compact Desk Clock(Silver, No Backlight)",
      "ratings": 8.567,
      "price": "$8.55",
      "image": "https://m.media-amazon.com/images/I/61a2YR++JXL._AC_SY300_SX300_.jpg",
      "description": "Multiple Features - A clock that satisfies all you need. Large font display makes it bold and easy to read. Not only does it tell the date, time, and temperature, but also it has features with alarm clock and timer.     Portable And Elegant - A minimized size of 3 x 3.4 x 0.5 inches. compact and lightweight for easily pack or toss into your purse. Collapsible with a stable stand, perfect size for a travel clock.     Easy Operated - Please note to update the year before setting the correct day. (Press the set button three times to get to the year). You can watch the video instruction on the detail page or read the instruction on the description part to easily set with more features.     Indispensable Daily Tool - Help you to get daily information quickly, then you can pick the clothes to wear today with no hurry. It takes no more than a few minutes to figure out the setup instructions. Note: this clock doesn't feature the backlight.     Commitment - We stand behind our products! All our products are covered for 1 year.",
      "details": {
        "brand": "Betus",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "Silver",
        "ram": "N/A",
        "detail_item": "Multiple Features - A clock that satisfies all you need. Large font display makes it bold and easy to read. Not only does it tell the date, time, and temperature, but also it has features with alarm clock and timer."
      }
    }
  ]
}