{
  "totalProducts": 19,
  "products": [
    {
      "id": "B003O2S03K",
      "name": "ASUS G73JH-A3 Republic of Gamers 17-Inch Gaming Laptop - Black",
      "ratings": 8,
      "price": "$1,790.13",
      "image": "https://m.media-amazon.com/images/I/81a9lSPHhHL.__AC_SY300_SX300_QL70_FMwebp_.jpg",
      "description": "Intel i7-720QM (1.60GHz Quad-Core)     8GB DDR3 1066MHz, 4 SODIMM Sockets, up to 8GB     1TB (500G 7200RPM x2) HDD; Blue-Ray Disk Combo Drive; 802.11 b/g/n (According to cust., manufacturer states it doesn't come with 4 GB SSD)     ATI 5870 Graphics with 1G GDDR5; Windows Home Premium 64-bit Operating System     17.3-Inch Full HD (1920x1080) LED Display; 2.0M Webcam; Gaming Backpack and Mouse",
      "details": {
        "brand": "ASUS",
        "operatingSystem": "Windows 7 Home Premium 64-bit",
        "hard_disk": "1 TB",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "Black",
        "ram": "8 GB",
        "detail_item": "Intel i7-720QM (1.60GHz Quad-Core)"
      }
    },
    {
      "id": "B0CWKT7CWK",
      "name": "Replacement Screen 13.3\" for MacBook Air 13-inch Retina A1932 2018 Year (Model: EMC 3184 MRE82LL/A MVH82LL MREA2 MREC2 MREE2 MREF2 MRE92) Full LCD Screen Display Assembly (Rose Gold)",
      "ratings": 3,
      "price": "$179.99",
      "image": "https://m.media-amazon.com/images/I/71z1lmrYkHL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "This screen is suitable: Only For A1932(2018).You can do this by flipping your laptop over and finding a tab at the bottom that contains device information. If you are unable to confirm the model of your machine when placing an order, you can send us a message to inquire     Fix Screen Issues: Can be used for display damage, repair cracked, broken, pixel distortion, LCD dead, color error problems, screen malfunction and other problems, make your device brand new     High quality screen: The screen is made of original display, original camera, 60HZ support, original driver link board, original quality aluminum. Strictly QC make sure every single screen has worked normally before shipment     Easy Installation: Our screen replacement is user-friendly with a detailed manual and video guide.Please keep in mind that disconnect the power supply before installation     Package Includes: 1x LCD screen replacement(a complete upper part but not a complete laptop.LCD and back cover and cable and webcam and Back light), 1x installation guide, 1x tool kit (screwdrivers, pry tool, spudger, tweezers)     Note:When you've installed the replacement screen, the Notebook Computers may not boot until you plug in the power supply. After installation, reconnect power and activate the screen. For any issues, free to reach us anytime",
      "details": {
        "brand": "N/A",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "This screen is suitable: Only For A1932(2018).You can do this by flipping your laptop over and finding a tab at the bottom that contains device information. If you are unable to confirm the model of your machine when placing an order, you can send us a message to inquire"
      }
    },
    {
      "id": "B071YZMV4Q",
      "name": "ASUS ZenBook 3 Deluxe Ultraportable Laptop, 14\" Full HD , Intel Core i7-7500U, 16GB RAM Processor, 512GB NVMe SSD, Windows 10 Pro, Royal Blue, UX490UA",
      "ratings": 81,
      "price": " ",
      "image": "https://m.media-amazon.com/images/I/71A9JjEruBL.__AC_SY300_SX300_QL70_FMwebp_.jpg",
      "description": "Crafted from premium aerospace-grade aluminum to create a body that is less than half an inch thin weighs only 2.4 lbs     Latest 7th-generation Kaby Lake Intel Core i7-7500U Processor 2.7 GHz (Turbo to 3.5 GHz) Cooled by copper-alloy heat pipe and liquid-crystal-polymer fan     12.5\" Full HD display with 178° viewing angles encased in Corning Gorilla Glass 5. Ultra-slim bezel at only 7.46mm     All-day 46Whr Li-Polymer battery providing up to 9 hours of battery life. Features fast charging: charge to 60% in only 49 minutes     Windows 10 Professional. Built-in fingerprint sensor for enhanced security and one-touch log n using Windows Hello feature",
      "details": {
        "brand": "ASUS",
        "operatingSystem": "Windows 10 Pro",
        "hard_disk": "512 GB",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "UX490UA-XS74-BL",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "Royal Blue",
        "ram": "16 GB",
        "detail_item": "Crafted from premium aerospace-grade aluminum to create a body that is less than half an inch thin weighs only 2.4 lbs"
      }
    },
    {
      "id": "B0D87SSR67",
      "name": "Laptop, 15.6 Inch laptops, 8GB DDR4 256GB SSD Laptops with Celeron Quad Core Processor (up to 2.5 GHz), 7000 mAh, Webcam, Mini HDMI, Type-C, 2.4/5.0G WiFi(Slim)",
      "ratings": 7,
      "price": "$188.99",
      "image": "https://m.media-amazon.com/images/I/61iJfVrIbdL.__AC_SY300_SX300_QL70_FMwebp_.jpg",
      "description": "Efficient Memory Expandable Storage: Based on 8GB Ram memory and 256GB SSD storage, the laptop computers allows you save massive daily files, transfer data and load software rapidly. Our laptops also supports 512 GB TF card expansion. You can connect what you want through interfaces. Fast wireless WiFi 5.0 and Bluetooth 4.2, 2xUSB 3.0, Mini HDMI, Micro SD card Slot, Type-C port , TF card slot.     Powerful configuration: The laptop computers with Celeron N4000 processor, turbo frequency up to 2.6 GHz. You can smoothly run programs, applications and browser tabs.The laptop brings you noiseless heat dissipation without fans but heat dissipation hole. Dust Filter can effectively prevent dust from entering the computer.     Beautiful Large Display：The 17 inch laptop come with IPS display features stunning FHD resolution (1920 x 1080 pixels). With true-to-life colors and incredible contrast, the narrow-edge display of SGIN laptop definitely feast your eyes. The text is sharp and clear, and the colors are more vivid. Also it enable you enjoy photos, movies and games in high quality.     Long Lasting Battery: Equipped with a 8000 mAh rechargeable battery, the laptops suffices for all-day business activities or continuous classes, lasting up to 8 hours and providing up to 8 hours of battery life, convenient for travel.     Worry-free Service: SGIN provides you comprehensive service and gets you free from any worry with 1 year warranty period. If you have any questions, please contact us and we will give you prompt response to help you solve the problem.",
      "details": {
        "brand": "Naclud",
        "operatingSystem": "11",
        "hard_disk": "256 GB",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "Naclud-M15P",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "8 GB",
        "detail_item": "Efficient Memory Expandable Storage: Based on 8GB Ram memory and 256GB SSD storage, the laptop computers allows you save massive daily files, transfer data and load software rapidly. Our laptops also supports 512 GB TF card expansion. You can connect what you want through interfaces. Fast wireless WiFi 5.0 and Bluetooth 4.2, 2xUSB 3.0, Mini HDMI, Micro SD card Slot, Type-C port , TF card slot."
      }
    },
    {
      "id": "B0CM3N62W7",
      "name": "AEEZO Laptop Computer, 15.6 inch Laptop, 1366 * 768 IPS Display, Intel Celeron N5095 Processors,8GB DDR4 256GB SSD, Large Battery Capacity, 2.4G/5G WiFi, Bluetooth 4.2, Mini-HDMI",
      "ratings": 21,
      "price": "$189.99",
      "image": "https://m.media-amazon.com/images/I/81a8YWSjrhL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "⚡【High-performance Laptop】AEEZO laptop is pre-installed with Windows 11 system, which is safer and faster than the previous Windows system. Equipped with a Intel Core N5095 processor, the main frequency is up to 2.9GHz, without lag. Help your devices run smoothly and reliably with the powerful, consistent wireless signal of Wi-Fi 2.4G/5G and Bluetooth 4.2 to handle all your tasks.     ⚡【15.6 inch Excellent View】This 15.6-inch laptop has a 1366 * 768 IPS screen with an aspect ratio of 16:9, 5.5 mm narrow bezels, and excellent color gamut. The laptop offers a higher pixel density, resulting in sharper, more detailed image visuals. Equipped with a 5000mAh lithium battery, the battery life is up to 5 hours. It has long battery life and solid performance.     ⚡【Large Storage Computer】This laptop is equipped with 8GB DDR4 RAM, which can run multiple applications and browser tabs smoothly at the same time, making it able to efficiently handle multiple programs and tasks at the same time. 256GB SSD memory provides fast boot and fast data transfer, and supports 512GB TF card to provide ample storage space for your documents, media files and other data.     ⚡【Convenient & Portable Design】Our ultra-thin and lightweight laptop is designed for portability. 2cm slim body, 1.65KG lightweight. Equipped with a numeric keypad, ideal for working with data. With Mini-HDMI, headphone jack, USB 3.0 x2, USB-Type C, TF card slot to meet the needs of life and work.     ⚡【Reliable After-sales Service】All AEEZO laptops are subjected to 200 hours of machine aging tests before shipping to ensure that each laptop works perfectly. We're so confident in our laptop computers on clearance, that we offer ONE-year limited warranty.",
      "details": {
        "brand": "AEEZO",
        "operatingSystem": "Windows 11 Home",
        "hard_disk": "256 GB",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "AZC-S156",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "Gray",
        "ram": "8 GB",
        "detail_item": "⚡【High-performance Laptop】AEEZO laptop is pre-installed with Windows 11 system, which is safer and faster than the previous Windows system. Equipped with a Intel Core N5095 processor, the main frequency is up to 2.9GHz, without lag. Help your devices run smoothly and reliably with the powerful, consistent wireless signal of Wi-Fi 2.4G/5G and Bluetooth 4.2 to handle all your tasks."
      }
    },
    {
      "id": "B0DFYZPDRV",
      "name": "Laptop, 17.3 Inch Laptops Computer, 4GB DDR4 128GB SSD Notebook with Celeron Quad-Core Processor (up to 2.5 GHz), Webcam, Mini HDMI, USB3.2 * 2, Type-C, 8000mAh(Black)",
      "ratings": 6,
      "price": "$849.99",
      "image": "https://m.media-amazon.com/images/I/611BDi68wvL.__AC_SY300_SX300_QL70_FMwebp_.jpg",
      "description": "Efficient Performance: Equipped with 4GB high-speed DDR4 memory, 128GB SSD storage and faster, smoother and energy-efficient performance, this laptop can easily handle complex tasks. Supports the extension of the TF card of 512 GB and the 512 GB SSD can be replaced with a maximum SSD of 1 TB.     Powerful configuration: Equipped with the Celeron J4105 processor, turbo frequency up to 2.5 GHz. With a 17 inch screen laptop, the colours of the 17 inch laptop are fuller, more vibrant and simple, the details are clear and reliable and the viewing angle is wide. Create exceptional visual effects.     Lightweight and Thin: Equipped with a 8000 mWh lithium-ion battery, long battery life. It has a long battery life and reliable performance. It is the perfect choice for you if you want to enjoy your lifestyle on the go. The slim case weighs only 1.85 kg and is only 2 cm thick so you can carry it all day without any problems.     Multifunctional interface: fast connection with Bluetooth 4.2 and fast WiFi via dual band WiFi, equipped with Type-C x1, Mini HDMI x1, headphone jack 3.5 mm x1, USB 3.2 x2, microSD slot x1. The many multi-function ports of the laptop meet the requirements of life and work.     Worry-free customer service: from date of purchase, we have a 365 day service. If you have any questions, please feel free to contact us. We will reply you within 12 hours to help you solve the problem.",
      "details": {
        "brand": "Naclud",
        "operatingSystem": "Windows 11",
        "hard_disk": "128 GB",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "Naclud-M17",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "Black",
        "ram": "4 GB",
        "detail_item": "Efficient Performance: Equipped with 4GB high-speed DDR4 memory, 128GB SSD storage and faster, smoother and energy-efficient performance, this laptop can easily handle complex tasks. Supports the extension of the TF card of 512 GB and the 512 GB SSD can be replaced with a maximum SSD of 1 TB."
      }
    },
    {
      "id": "B0D4YRWFHJ",
      "name": "USB C to HDMI 2.1 Adapter (8K@60Hz,4K@120Hz/60Hz), Tpye C to HDMI Converter Compatible with Thunderbolt 3/4, USB 3.1/4 for iPhone 15 Series, MacBook Pro/Air, Tablets, Laptops, Galaxy S24",
      "ratings": 23,
      "price": "$21.99",
      "image": "https://m.media-amazon.com/images/I/61ZBVhMoQbL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Vivid 3D Effect Video Synchronization: The USB C to HDMI 2.1 adapter supports resolutions up to 8K 60Hz and is backwards compatible with 4K@120Hz/60Hz, 2K@165Hz/144Hz/120Hz to avoid visual fatigue caused by low refresh rates. Expandable/mirrorable to a larger screen for a crystal clear visual experience. Supports Dynamic HDR, DSC, HDCP 2.2&2.3, 3D, 8K UHD, Dolby Atmos and more. (Note: Only supports unidirectional transmission from USB C to HDMI)     Wide Range of Compatibility: Type C to HDMI adapter is compatible with all USB C devices on laptops, tablets and smartphones that support \"DP Alt Mode\" and Thunderbolt 3/4 ports; compatible with MacBook Pro 2023, MacBook Air 2023, iMac Pro 2021/2023, Mac Mini 2023, supports M1/M2 devices, Surface Pro 7, Surface Laptop 3/4, Chromebook x360, Dell XPSPS S22/S23/S24, etc. (Note: Mac OS does not support 8K due to its own limitations)     USB C to HDMI Ultra HD Adapter: with this adapter, your Type C devices can watch sports events, movies, video games and photos/albums directly on HDMI-equipped monitors/TVs/projectors, never miss the game's highlights and your favorite TV shows again. This means you won't be bothered by unstable WIFI and bad TV signal problems anymore. (Please make sure your device supports video transfer function and use HDMI 2.1 or above connection cable. Hub/Docking connection is not supported.)     Exquisite Craftsmanship, The Best Materials: Every detail of THANDBLE adapter has been carefully designed to perfection. Gold-plated connectors ensure secure, high-speed data transmission without interference. One-piece molding ensures an unbreakable connection, and the aluminium housing dissipates heat efficiently for longer use. The nylon braid maximises the service life of the cable and provides maximum safety for your long-term use.     Important: ① Please note whether your USB C source device port supports video transmission or DP Alt mode (you can usually see the DP logo next to the port) ② It is not bi-directional, and only supports uni-directional USB C source signals to HDMI displays.③ Make sure that your output device and display device support 8K resolution and connect the adapter with an HDMI2.1 cable, otherwise it will affect the display effect. (If you are not sure, please contact us, we are happy to help you!)     24 Months Warranty: THANDBLE is committed to introducing affordable, exquisite design of high quality products, we exclusively provide 24 months warranty, the best customer service and professional technical support, if you have any questions please contact us in time, we will respond quickly within 12 hours to ensure your shopping experience long-term satisfaction.",
      "details": {
        "brand": "N/A",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "Grey",
        "ram": "N/A",
        "detail_item": "Vivid 3D Effect Video Synchronization: The USB C to HDMI 2.1 adapter supports resolutions up to 8K 60Hz and is backwards compatible with 4K@120Hz/60Hz, 2K@165Hz/144Hz/120Hz to avoid visual fatigue caused by low refresh rates. Expandable/mirrorable to a larger screen for a crystal clear visual experience. Supports Dynamic HDR, DSC, HDCP 2.2&2.3, 3D, 8K UHD, Dolby Atmos and more. (Note: Only supports unidirectional transmission from USB C to HDMI)"
      }
    },
    {
      "id": "B0CM5F449J",
      "name": "Laptop Computer, Traditional Laptop Computer, 16GB DDR4 512GB SSD, Celeron Quad-Core Processors, 15.6\" 1080P FHD Laptops, 38000mWh Battery, WiFi, Type-C, TF Card, Mini-HDMI",
      "ratings": 97,
      "price": "$259.99",
      "image": "https://m.media-amazon.com/images/I/6136DhV0BRL.__AC_SY300_SX300_QL70_FMwebp_.jpg",
      "description": "🚀【HIGH PERFORMANCE LAPTOP】Maypug 15.6 inch laptop uses powerful Intel Celeron N5095 processor, frequency up to 2.9GHz, no latency, and powerful and faster than normal processors on the basic frequency. Equipped with the latest pre-installed Windows 11 system which is far more safer and faster than previous Windows systems. The perfect combination of performance, power consumption, and helps your device run smoothly and reliably to handle all your tasks.     🚩【LARGE SORAGE SAPCE COMPUTER】Maypug Laptop is equipped with 16GB DDR4 and 512GB high-speed SSD which lets you use it without a problem even with multi programs open. Provides huge space for efficient operation of the most complex application and multimedia. An expandable TF card slot supports maximum 512GB TF card expansion and extensive interfaces such as HDMI, 2xUSB 3.0, USB Type-C, etc. Ensures you of an enough space to create and store more of your world.     💻【15.6\" BIG SCREEN NEWEST LAPTOP】Maypug 15.6 inch laptops with 1920*1080 high resolution screen provides you with a sharp and clear text and images. The 16:9 ratio expands the vertical space of the screen, showing more content, providing a comfortable visual experience and greater efficiency when browsing web pages or documents.     👜【CONVENIENT AND PORTABLE DESIGN】Maypug laptops are designed with an ultra-thin case ensures of a stylish and innovative look, and excellent portability. 2cm slim body, 1.62KG lightweight. What’s more, this business and home laptop features an advanced 38000WH rechargeable battery life of up to 8 hours. It is very convenient and portable for business trip or traveling. Suitable for daily work and play, it is the first choice for business, offices or students     💯【365 DAYS LIMITED WARRANTY】Maypug has strict standard for all stages of production to ensure the quality of our 2024 new laptops. All laptop computers are subjected to 200 hours of machine aging tests before shipment to make sure each frame is working flawlessly. We offer ONE-year limited warranty. Any questions about our Maypug laptops, please contact us for an easy solution or a fast replacement!",
      "details": {
        "brand": "Maypug",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "1080p",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "Bluetooth, Wi-Fi, USB, HDMI",
        "color": "Gray",
        "ram": "N/A",
        "detail_item": "🚀【HIGH PERFORMANCE LAPTOP】Maypug 15.6 inch laptop uses powerful Intel Celeron N5095 processor, frequency up to 2.9GHz, no latency, and powerful and faster than normal processors on the basic frequency. Equipped with the latest pre-installed Windows 11 system which is far more safer and faster than previous Windows systems. The perfect combination of performance, power consumption, and helps your device run smoothly and reliably to handle all your tasks."
      }
    },
    {
      "id": "B0CYNV9L79",
      "name": "Laptop Computer,15.6 inch 1366 * 768 IPS FHD Display, Install Windows 11, 8GB RAM 256GB SSD, Intel Celeron Quad-Core N5095 Processors, USB 3.0, Bluetooth 4.2, 2.4/5G WiFi,",
      "ratings": 28,
      "price": "$199.99",
      "image": "https://m.media-amazon.com/images/I/61RCs3fSUCL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "This laptop boasts an Intel Celeron N5095 Processor, a 4-core CPU with a turbo frequency up to 2.9GHz. It outperforms typical processors due to its enhanced speed and reduced latency. This superior combination of high performance and lower power consumption ensures smooth and reliable operation, effectively managing a variety of tasks.     Featuring 8GB DDR4 RAM and a 256GB high-speed SSD, this notebook facilitates seamless multitasking even with numerous programs running concurrently. Its storage capacity accommodates complex applications and multimedia effortlessly. Additionally, the expandable TF card slot supports up to a 256GB TF card, while multiple interfaces guarantee sufficient space for your data storage needs.     The 15.6-inch laptop display offers a rich viewing experience with its 1366*768 full HD resolution and 16:10 aspect ratio. Boasting a 93% screen-to-body ratio and an IPS-level wide-view FHD panel with anti-glare coating, it minimizes unwanted glare and reflections, allowing you to concentrate on your tasks without distractions.     The Chicbuy laptop integrates a cooling system design and a high-density 5000mWh polymer lithium battery, supporting up to 6 hours of battery life. Ideal for day-long business activities or continuous classes, this thin and lightweight laptop, weighing only 4 pounds, offers exceptional portability.     The Chicbuy laptop is equipped with four stereo speakers, ensuring an immersive sound experience. Its connectivity options include Bluetooth 4.0, dual-band Wi-Fi (2.4G/5G), a Type-C port, Micro Mini-HDMI, a 3.5mm headphone jack, 2 USB 3.0 ports, a Micro TF slot, and a fast charger DC port. These features enhance its multifunctional capabilities and connectivity options for various devices and peripherals.",
      "details": {
        "brand": "Chicbuy",
        "operatingSystem": "11",
        "hard_disk": "256 GB",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "C-S156",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "Gray",
        "ram": "8 GB",
        "detail_item": "This laptop boasts an Intel Celeron N5095 Processor, a 4-core CPU with a turbo frequency up to 2.9GHz. It outperforms typical processors due to its enhanced speed and reduced latency. This superior combination of high performance and lower power consumption ensures smooth and reliable operation, effectively managing a variety of tasks."
      }
    },
    {
      "id": "B0D8VYN34R",
      "name": "jumper Laptop Comuter 14 Inch, 12GB RAM 256GB SSD, Quad Core Celeron J4105 CPU(Up to 2.5GHz), FHD 1920x1080 Display, Dual Speakers, 35.52WH Battery, Windows 11 Laptops, Type-C, Mini HDMI, Gray, 16:9.",
      "ratings": 16,
      "price": "$499.99",
      "image": "https://m.media-amazon.com/images/I/81k6ptN5avL.__AC_SY300_SX300_QL70_FMwebp_.jpg",
      "description": "Portable laptop is equipped with 11th Celeron J4105 CPU, Quad-Core Quad-Threading with 1.5GHz base frequency and up to 2.5Ghz RWD, and Windows 11 operating system to provide you with precise computing power and smooth processing capability.     Laptop computer has built-in HD Graphics 600, which provides you with clear and layered image processing capabilities, and is paired with a 14-inch FHD anti-glare screen with 1920x1080 pixels, which widens the vertical space of the screen in a 16:9 screen ratio, providing you with amazing visual effects.     12GB RAM laptop is paired with a 256GB SSD and up to 256GB expandable TF card, high-speed memory runs smoothly loading your files and streaming media, large storage space so you no longer worry about space, rest assured to store your important documents.     Computer laptop is equipped with dual-band WiFi (2.5+5G), adapted to the 802.11AC band, and self-adapted to BT4.0, which allows you to easily link to the Internet and Bluetooth devices. Coupled with a large touchpad and an ergonomic keyboard, you can experience a comfortable typing experience and accelerate office efficiency. With a thickness of only 1.5cm and a weight of only 1.25KG, the lightweight body of the Ultrabook is designed to be easy for you to carry around.     The notebook is equipped with multiple device ports, equipped with ports USB3.0*1,USB2.0*1,Mini HDMI*1,Type-C*1,3.5MMDCharging Port*1(12V/3A),TF Card Slot*1,3.5MM Headphone Jack*1, multiple device ports to realize more possibilities. Equipped with two stereo speakers,35.52wh battery, front 0.2MP webcam, and long standby time, it allows you to make video calls or enjoy audio and video entertainment to your heart's content.",
      "details": {
        "brand": "jumper",
        "operatingSystem": "Windows 11",
        "hard_disk": "256 GB",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "Ezbook S5",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "12 GB",
        "detail_item": "Portable laptop is equipped with 11th Celeron J4105 CPU, Quad-Core Quad-Threading with 1.5GHz base frequency and up to 2.5Ghz RWD, and Windows 11 operating system to provide you with precise computing power and smooth processing capability."
      }
    },
    {
      "id": "B071ZL3996",
      "name": "ASUS VivoBook Thin and Light Gaming Laptop, 15.6\" Full HD, Intel Core i7-7700HQ Processor, 16GB DDR4 RAM, 256GB SSD+1TB HDD, GeForce GTX 1050 4GB, backlit Keys - M580VD-EB76",
      "ratings": 305,
      "price": " ",
      "image": "https://m.media-amazon.com/images/I/61y0rypJIOL.__AC_SY300_SX300_QL70_FMwebp_.jpg",
      "description": "Powerful 7th Generation Intel Core i7-7700HQ quad-core 2.8GHz (Turbo up to 3.8GHz), standard voltage for full performance     15.6\" Full HD color rich, anti-glare display and NVIDIA GeForce GTX 1050 4GB graphics for flawless visuals and portable gaming     15\" wide and 0.8\" ultra thin chassis for a portable & slim footprint; Illuminated keyboard; Harman/Kardon certified audio; Dual-fan thermal design     Lightning-fast dual band 802.11ac Wi-Fi keeps you connected through any congestion or interference     16GB DDR4 RAM and 256GB M.2 SATA3 SSD + 1TB HDD combo for balanced speed and storage capacity; Windows 10; Comprehensive connections with USB 3.1 Type-C (Gen1), USB 3.1 Type-A, USB 2.0, & HDMI. 178 degree wide-view technology",
      "details": {
        "brand": "ASUS",
        "operatingSystem": "Windows 10",
        "hard_disk": "1000 GB",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "ASUS VivoBook",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "Gold",
        "ram": "16 GB",
        "detail_item": "Powerful 7th Generation Intel Core i7-7700HQ quad-core 2.8GHz (Turbo up to 3.8GHz), standard voltage for full performance"
      }
    },
    {
      "id": "B0D8VZS2JY",
      "name": "jumper Laptop, 12GB LPDDR4 RAM, 512GB SSD ROM, 14 Inch 1080p FHD IPS Screen, Windows 11 Laptops Computer with Celeron Quad-Core Processor, UHD Graphics 600, Dual Stereo Speaker, Portable.",
      "ratings": 16,
      "price": "$229.99",
      "image": "https://m.media-amazon.com/images/I/71YhqXPCmRL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "【 Large storage capacity 】 This laptop comes with 12GB LPDDR4 and 512GB high-speed SSD, which makes it no problem even when opening multiple programs. It offers high capacity for efficient operation of the most complex applications and multimedia. In addition, the expandable TF card slot supports up to 256GB TF card expansion, and the extensive interface ensures you have enough space to store more of the world.     【Premium Graphics Enjoyment】14 inch FHD (1920 x 1080) laptop computers with 16:9 aspect ratio and narrow bezels. The traditional laptop computers have vivid colors, showing you high-quality, clear and lifelike images. Immerse yourself in a wider, more captivating view on a 14 inch narrow bezel notebook computer screen. jumper laptop allows you to enjoy the ultimate viewing feast.     【Inte Powerful Processor】This compact and lightweight laptop is powered by the Intel Celeron J4105 Processor, frequency of up to 2.5GHz. Jumper S5 laptop computer is equipped with the latest version of GMS certified-Windows 11 operating system, which is safer and faster than previous systems. The perfect combination of high performance and lower consumption helps the notebook computer to run smoothly and reliably to handle all your tasks.     【Portable Design】 The slim computer weighs only 1.24 kg and is only 1.5cm thick so you can carry it all day without any problems. Equipped with a 4800mA lithium-ion battery, long battery life. It has a long battery life and reliable performance. It is the perfect choice for you if you want to enjoy your lifestyle on the go.     【Convenient】 Fast connection with Bluetooth 4.0 and fast WiFi via dual band WiFi, equipped with Mini HDMI x1, headphone jack 3.5 mm x1, USB 3.0, microTF slot x1. The many multi-function ports of the laptop meet the requirements of life and work.",
      "details": {
        "brand": "jumper",
        "operatingSystem": "Windows 11",
        "hard_disk": "512 GB",
        "screenSize": "N/A",
        "resolution": "1080p",
        "modelName": "EZbook S5",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "12 GB",
        "detail_item": "【 Large storage capacity 】 This laptop comes with 12GB LPDDR4 and 512GB high-speed SSD, which makes it no problem even when opening multiple programs. It offers high capacity for efficient operation of the most complex applications and multimedia. In addition, the expandable TF card slot supports up to 256GB TF card expansion, and the extensive interface ensures you have enough space to store more of the world."
      }
    },
    {
      "id": "B0DD7KQ24J",
      "name": "ACEMAGIC Laptop, Windows 11 Laptop Computer,16GB DDR4 512GB SSD, Quad-Core N95 Processor(Up to 3.4GHz), 15.6\" IPS 1080P PC,180° Open Angle,Long Battery Life,Metal Shell,WiFi, BT5.0, USB3.2, Type_C",
      "ratings": 9,
      "price": "$359.99",
      "image": "https://m.media-amazon.com/images/I/71EtvqghpkL.__AC_SY300_SX300_QL70_FMwebp_.jpg",
      "description": "【Efficient Performance】 ACEMAGIC Laptop featuring the latest processor (4 cores/4 threads, 6MB cache, up to 3.4GHz). Its performance is far moere than 30% better than others, providing more powerful multitasking capabilities and stronger graphics processing performance. ACEMAGIC traditional laptop is designed to elevate your computing experience.     【16GB RAM & 512GB ROM】 Featuring 16GB of DDR4 RAM and a speedy 512GB M.2 SSD, this traditional laptop computer offers a 50% performance boost compared to DDR3-equipped machines and ensures seamless system operation while accommodating your personal files. Support expand your storage with a 128GB TF card. The 512 GB SSD can be replaced with a maximum SSD of 2TB to provide you with ample space to record and store your files/favorites.     【15.6\" Immersive Visuals】 This 15.6 inch laptop features an innovative thin-bezel display that provides more usable onscreen space for FHD 1080P viewing. It also enables a larger screen to fit into a smaller chassis, giving you a laptop with a more compact footprint. Built-in clear front camera centered above the screen frame, take pictures or make video calls at any time. Its 38Wh long battery life gives you the flexibility to work or play anywhere for 5 hours.     【No Latency Connection】 The laptop computer designed with HDMI Type A X 1, USB2.0 X 1, USB3.2 X 2, Type_C(Data) ×1, 3.5mm Headphone jack X 1, 128GB TF Card Socket X 1, Type_C DC Jack X 1. AX15 laptop pc comes with 802.11ac WiFi for speeds up to three times faster than 802.11n, providing high-speed transmission and download. Bluetooth 5.0 for easy and stable connection of additional devices within range.     【ACEMAGIC Care For You】 This slim laptop will easily slip into a backpack to be taken anywhere you need to go with a flat hinge allowing the laptop to 180°. The metal body is designed to withstand pressure and collision. We offer unlimited technical support and 12 months of repair for customers. If you have any questions in use, please do not hesitate to reach out to us.",
      "details": {
        "brand": "ACEMAGIC",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "AX15",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "【Efficient Performance】 ACEMAGIC Laptop featuring the latest processor (4 cores/4 threads, 6MB cache, up to 3.4GHz). Its performance is far moere than 30% better than others, providing more powerful multitasking capabilities and stronger graphics processing performance. ACEMAGIC traditional laptop is designed to elevate your computing experience."
      }
    },
    {
      "id": "B0CGXB6LGL",
      "name": "HP 2023 Newest 14\" Ultral Light Laptop, for Students and Business, Intel Quad-Core N4120, 4GB RAM, 128GB Storage (64GB eMMC+64GB Micro SD), USB-A&C, Wi-Fi, Webcam, HDMI, 1 Year Office 365, Win11 S",
      "ratings": 19,
      "price": "$239.99",
      "image": "https://m.media-amazon.com/images/I/81Q17SHHpcL.__AC_SY300_SX300_QL70_FMwebp_.jpg",
      "description": "【Processor】The Intel Quad-Core Processor(up to 2.6GHz) brings the perfect combination of features to make you unstoppable. With 4MB of L3 cache, 4 cores and 4 threads are ready to handle all your work.     【Display】With the 14-inch micro-edge anti-glare HD display, your entertainment just got pushed to the very edge. Get expansive, ‎1366 x 768 (HD) resolution, vibrant images with awesome colors, and intuitively control your PC right from the screen.     【Upgraded】Up to 16GB RAM significantly increases performance, and up to 192GB Storage has no moving parts, resulting in faster start-up times and data access, no noise, and reduced heat production and power draw on the battery.     【Graphics】Smoothly stream content and play your favorite games with Intel UHD Graphics 600. Impressive performance for creating, gaming, and entertainment. A new level of graphics performance and crisp, stunning visuals – with the convenience of a thin and light laptop.     【Windows 11 Home in S Mode】From a rejuvenated Start menu, to new ways to connect to your favorite people, news, games, and content, Windows 11 Home in S Mode is the place to think, express, and create in a natural way.",
      "details": {
        "brand": "HP",
        "operatingSystem": "Windows 11 S",
        "hard_disk": "128 GB",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "HP Laptop",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "Snowflake White",
        "ram": "4 GB",
        "detail_item": "【Processor】The Intel Quad-Core Processor(up to 2.6GHz) brings the perfect combination of features to make you unstoppable. With 4MB of L3 cache, 4 cores and 4 threads are ready to handle all your work."
      }
    },
    {
      "id": "B0D9P7Z33B",
      "name": "SAMSUNG 15” Galaxy AI Book4 Edge PC Laptop Computer, Snapdragon X Plus Processor, Live Captions, FHD LED Anti-Glare Display, Long-Lasting Battery, 2024 Version, NP750XQA-KB2US",
      "ratings": null,
      "price": "$899.99",
      "image": "https://m.media-amazon.com/images/I/61E7wn7WEGL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "REVOLUTIONARY PROCESSING POWER: Unleash power-packed performance with SnapdragonX Plus. Discover new possibilities in how you create, communicate, and play in an all-new PC experience with a processor built for Galaxy AI.     CONNECT WITH LIVE CAPTIONS: When you never miss a word, you never miss a beat. Like the conversation in your video calls. Or the dialogue in your movies. If there are spoken words, Live Captions can turn them into English subtitles in real-time.     DISPLAY: See it all in stunning detail on a spacious 15.6\" display that reduces glare.     BATTERY LIFE + SUPER FAST CHARGING: Power your AI experience with a long-lasting battery and recharge quickly with Super Fast Charging.",
      "details": {
        "brand": "SAMSUNG",
        "operatingSystem": "Windows 11 Home",
        "hard_disk": "512 GB",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "Galaxy Book4 Edge",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "Sapphire Blue",
        "ram": "16 GB",
        "detail_item": "REVOLUTIONARY PROCESSING POWER: Unleash power-packed performance with SnapdragonX Plus. Discover new possibilities in how you create, communicate, and play in an all-new PC experience with a processor built for Galaxy AI."
      }
    },
    {
      "id": "B0731JXL49",
      "name": "ASUS ROG Zephyrus Thin & Light Gaming Laptop, 15.6” Full HD 120Hz, Intel Core i7-7700HQ Processor, NVIDIA GeForce GTX 1070 8GB, 16GB DDR4, 256GB PCIe M.2 SSD, Windows 10 Professional – GX501VS-XS71",
      "ratings": 304,
      "price": " ",
      "image": "https://m.media-amazon.com/images/I/81DfBAQzSdL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Ultra-thin and ultra-light with a thickness of only 0.7\" (with the lid closed) and weighing only 4.9 lbs     Next-generation gaming performance with NVIDIA GeForce GTX 1070 8GB GDDR5 *(with Max Q Technology) graphics     7th Gen Intel Core i7-7700HQ 2.8GHz Processor (Turbo up to 3.8GHz)     Quiet and cool featuring ROG Active Aerodynamic System which improves airflow by up to 40% and reduces temperatures by up to 20% compared to conventional cooling. *Actual cooling performance varies due to system and environmental conditions     High refresh rate 120Hz wide view Full-HD display with NVIDIA G-SYNC technology. With HDMI 2.0, you can connect to 4K TVs at 60Hz     RGB Gaming Keyboard featuring ASUS Aura technology. Adjust the QWER and WASD clusters separately to adapt to MOBA and FPS titles.     Windows 10 Professional Pre-Installed     Fast SSD and RAM: featuring 256GB PCIe Gen3 x4 NVMe M.2 SSD & 16GB DDR4 2400MHz. 802.11ac 2x2 Wi-Fi",
      "details": {
        "brand": "ASUS",
        "operatingSystem": "Windows 10 Pro",
        "hard_disk": "256 GB",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "ASUS Rog Zephyrus",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "Black",
        "ram": "16 GB",
        "detail_item": "Ultra-thin and ultra-light with a thickness of only 0.7\" (with the lid closed) and weighing only 4.9 lbs"
      }
    },
    {
      "id": "B0D4PJ54FK",
      "name": "ACEMAGIC 2024 Newest Laptop,17.3-Inch FHD Display Laptop with Quad Core-12th Alder Lake N97(Up to 3.6GHz), 16GB RAM 512GB ROM Business Laptop Computer, 6000Mah Battery,Silver",
      "ratings": 24,
      "price": "$399.99",
      "image": "https://m.media-amazon.com/images/I/71lcWQPAtOL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "【Powerful Capabilities】 ACEMAGIC AX17 Laptop computer powered by latest 12th generation Alder Lake N97 processor (4C/4T, 6MB Cache,12W, base frequency 1.7GHz, up to 3.6GHz, 7 Lithography), performance is much higher than Celeron N5095 or Pentium N5030. Built-in 16GB DDR4 and 512GB SSD for more powerful multitasking capabilities.     【Immersive IPS Display】This 17.3 inch laptop computer features an innovative thin-bezel display that provides more usable onscreen space for immersive FHD viewing. It also enables a larger screen to fit into a smaller chassis, giving you a laptop with a more compact footprint. Built-in front webcam centered above the screen frame, take photos or video calls at any time.     【Long Battery Life】 Take this laptop pc with you anywhere without bringing the power adaptor. Its 6000Mah long battery life gives you the flexibility to work or play anywhere for 5 hours. Equipped with cooling fans to ensure continuous work while minimizing noise, so you won't be distracted while working on spreadsheets or watching movies.     【No Latency Connection】The windows 11 laptop designed with HDMI Type A X 1, USB3.2 X 3, Type_C(Only Data) ×1, 3.5mm Headphone jack X 1, 128GB TF Card Socket X 1, DC Jack X 1. It comes with 802.11ac WiFi for speeds up to three times faster than 802.11n, providing high-speed transmission and download. Bluetooth 5.0 for easy and stable connection of additional devices within range.     【ACEMAGIC Care For You】 This laptop is designed with a metal casing to resist pressure and impact. Thin and light enough to slip easily into a backpack and take it with you wherever you need to go. We offer lifetime technical support and 12 months quality warranty for customers. If you have any questions about laptops, please feel free to contact us.",
      "details": {
        "brand": "ACEMAGIC",
        "operatingSystem": "Windows 11",
        "hard_disk": "512 GB",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "AX17",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "Silver",
        "ram": "16 GB",
        "detail_item": "【Powerful Capabilities】 ACEMAGIC AX17 Laptop computer powered by latest 12th generation Alder Lake N97 processor (4C/4T, 6MB Cache,12W, base frequency 1.7GHz, up to 3.6GHz, 7 Lithography), performance is much higher than Celeron N5095 or Pentium N5030. Built-in 16GB DDR4 and 512GB SSD for more powerful multitasking capabilities."
      }
    },
    {
      "id": "B0CH1472BR",
      "name": "Laptop Computer, Traditional Laptop Computer, 16GB DDR4 512GB SSD, Intel Celeron Quad-Core Processors, 15.6\" 1080P FHD Laptops, 38000mWh Battery, WiFi, Type-C, TF Card, Mini-HDMI",
      "ratings": 82,
      "price": "$329.99",
      "image": "https://m.media-amazon.com/images/I/61f8XWOUeZL.__AC_SY300_SX300_QL70_FMwebp_.jpg",
      "description": "🚀【HIGH PERFORMANCE LAPTOP】Maypug 15.6 inch laptop uses powerful Intel Celeron N5095 processor, frequency up to 2.9GHz, no latency, and powerful and faster than normal processors on the basic frequency. Equipped with the latest pre-installed Windows 11 system which is far more safer and faster than previous Windows systems. The perfect combination of performance, power consumption, and helps your device run smoothly and reliably to handle all your tasks.     🚩【LARGE SORAGE SAPCE COMPUTER】Maypug Laptop is equipped with 16 GB DDR4 and 512GB high-speed SSD which lets you use it without a problem even with multi programs open. Provides huge space for efficient operation of the most complex application and multimedia. An expandable TF card slot supports maximum 512GB TF card expansion and extensive interfaces such as HDMI, 2xUSB 3.0, USB Type-C, etc. Ensures you of an enough space to create and store more of your world.     💻【15.6\" BIG SCREEN NEWEST LAPTOP】Maypug 15.6 inch laptops with 1080P high resolution screen provides you with a sharp and clear text and images. The 16:9 ratio expands the vertical space of the screen, showing more content, providing a comfortable visual experience and greater efficiency when browsing web pages or documents.     👜【CONVENIENT AND PORTABLE DESIGN】Maypug laptops are designed with an ultra-thin case ensures of a stylish and innovative look, and excellent portability. 2cm slim body, 1.65KG lightweight. What’s more, this business and home laptop features an advanced 38000mWH rechargeable battery life of up to 8 hours. It is very convenient and portable for business trip or traveling. Suitable for daily work and play, it is the first choice for business, offices or students.     💯【365 DAYS LIMITED WARRANTY】Maypug has strict standard for all stages of production to ensure the quality of our 2023 new laptops. All laptop computers are subjected to 200 hours of machine aging tests before shipment to make sure each frame is working flawlessly. We offer ONE-year limited warranty. Any questions about our Maypug laptops, please contact us for an easy solution or a fast replacement!",
      "details": {
        "brand": "Maypug",
        "operatingSystem": "Windows 11",
        "hard_disk": "512 GB",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "Silver",
        "ram": "16 GB",
        "detail_item": "🚀【HIGH PERFORMANCE LAPTOP】Maypug 15.6 inch laptop uses powerful Intel Celeron N5095 processor, frequency up to 2.9GHz, no latency, and powerful and faster than normal processors on the basic frequency. Equipped with the latest pre-installed Windows 11 system which is far more safer and faster than previous Windows systems. The perfect combination of performance, power consumption, and helps your device run smoothly and reliably to handle all your tasks."
      }
    },
    {
      "id": "B0CLGB6ZH8",
      "name": "HP Stream 14\" HD BrightView Laptop, Intel Celeron N4120 Processor, 8GB RAM, 64GB Storage, Intel HD Graphics, Webcam, 1 Year Office 365, Pink, Windows 11 S, 32GB Hotface USB Card",
      "ratings": 300,
      "price": "$279.00",
      "image": "https://m.media-amazon.com/images/I/61PpSLdUnKL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "【Upgraded】Seal is opened for upgrade only, 1-Year warranty on Upgraded RAM/SSD from SnowBell, and an original 1-Year Manufacturing warranty on remaining components.【14\" Brightview Micro-edge Display】Ready for unparalleled immersion with a micro-bezel screen. 【Lightweight Chassis and Sleek Design】Measuring 12.76 x 8.86 x 0.71 inches and weighing just 3.24 pounds, the HP Stream 14 is designed ultraportable to play a part in your workflow anywhere.     【Intel Celeron N4120 Processor】Seamless multitasking and smooth performance are like a breath. Featured with a 1.1 GHz base frequency, and up to 2.6 GHz burst frequency, this laptop is powerful enough even for your busiest days. 【Integrated Intel UHD Graphics】Acting with an integrated UHD GPU, a journey of stunning visuals, vibrant colors, and immersive movies begins anytime, anywhere.     【8GB RAM】The high-speed RAM ensures faster data processing, seamless multitasking, and improved responsiveness that keeps you in the flow.【64GB eMMC】An embedded multimedia card provides reliable flash-based storage. Provides massive storage space to store your documents, photos, files and more.     【HP 720p HD Camera with Integrated Digital Microphone】To be seen and heard in your perfect condition. Enjoy high quality video calls, virtual meetings and online interactions to keep in touch with your connections.     【Windows 11 S included】With Windows 11, leverage a fresh new feel and tools that make it easier to be efficient, it has what you need for whatever's next. 【Ports】2 x USB 3.0 Type A Ports, 1 x USB 3.0 Type C Ports, 1x Headphone Jack, 1x SD Card Reader, 1x AC Smart Pin.【1-year-free Microsoft 365 Personal】Take your productivity and work mobility to the next level with the Microsoft 365 Office Suite (1-year subscription included). Pink. Bonus 32GB Hotface USB Card.",
      "details": {
        "brand": "HP",
        "operatingSystem": "Windows 11 S",
        "hard_disk": "64 GB",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "‎HP Stream",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "Pink",
        "ram": "8 GB",
        "detail_item": "【Upgraded】Seal is opened for upgrade only, 1-Year warranty on Upgraded RAM/SSD from SnowBell, and an original 1-Year Manufacturing warranty on remaining components.【14\" Brightview Micro-edge Display】Ready for unparalleled immersion with a micro-bezel screen. 【Lightweight Chassis and Sleek Design】Measuring 12.76 x 8.86 x 0.71 inches and weighing just 3.24 pounds, the HP Stream 14 is designed ultraportable to play a part in your workflow anywhere."
      }
    }
  ]
}