{
  "totalProducts": 19,
  "products": [
    {
      "id": "B01MG1KFQK",
      "name": "Dell XPS Thin and Light Laptop - 15 15.6\" 4K Touch Display, Intel Core i7-7700HQ, 16 GB RAM, 1 TB SSD, GTX 1050, Aluminum Chassis, Silver - XPS9560-7369SLV-PUS - Gaming",
      "ratings": 47,
      "price": " ",
      "image": "https://m.media-amazon.com/images/I/61xcNgZ6FTL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "7th Generation Intel Core i7-7700HQ Quad Core Processor (6M cache, up to 3.8 GHz)     16GB DDR4-2400MHz up to 32GB (additional memory sold separately)     1TB PCIe Solid State Drive, No Optical Drive     15.6-inch 4K Ultra HD (3840 x 2160) InfinityEdge touch display     Windows 10 Home 64-bit English     NOTE: Refer the User Manual from the Technical Specification before use which is highly recommended.",
      "details": {
        "brand": "Dell",
        "operatingSystem": "Windows 10",
        "hard_disk": "512 GB",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "MacBook Pro",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "Silver",
        "ram": "16 GB",
        "detail_item": "7th Generation Intel Core i7-7700HQ Quad Core Processor (6M cache, up to 3.8 GHz)"
      }
    },
    {
      "id": "B0CJ4XMN32",
      "name": "HP Newest 14\" Ultral Light Laptop for Students and Business, Intel Quad-Core N4120, 8GB RAM, 192GB Storage(64GB eMMC+128GB Ghost Manta SD), 1 Year Office 365, Webcam, HDMI, WiFi, USB-A&C, Win 11 S",
      "ratings": 117,
      "price": "$269.99",
      "image": "https://m.media-amazon.com/images/I/81rXd6t7A+L._AC_SX300_SY300_.jpg",
      "description": "【14\" HD Display】14.0-inch diagonal, HD (1366 x 768), micro-edge, BrightView. With virtually no bezel encircling the display, an ultra-wide viewing experience provides for seamless multi-monitor set-ups     【Processor & Graphics】Intel Celeron N4120, 4 Cores & 4 Threads, 1.10 GHz Base Frequency, Up to 2.60 GHz Burst Frequency, 4 MB Cahce, Intel UHD Graphics 600, Handle multitasking reliably with the perfect combination of performance, power consumption, and value     【RAM & Storage】Upgraded to 8GB high-bandwidth DDR4 Memory (2400 MHz), Adequate high-bandwidth RAM to smoothly run multiple applications and browser tabs all at once. 64GB high-speed eMMC Storage for your office and webinar needs     【Ports】1 x USB 3.1 Type-C ports, 2 x USB 3.1 Type-A ports, 1 x HDMI, 1 x Headphone/Microphone Combo Jack, and there's a microSD slot     【Windows 11 Home in S mode】You may switch to regular windows 11: Press \"Start button\" bottom left of the screen; Select \"Settings\" icon above \"power\" icon;Select \"Activation\", then Go to Store; Select Get option under \"Switch out of S mode\"; Hit Install. (If you also see an \"Upgrade your edition of Windows\" section, be careful not to click the \"Go to the Store\" link that appears there.)",
      "details": {
        "brand": "HP",
        "operatingSystem": "Windows 11 Home",
        "hard_disk": "64 GB",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "HP",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "Rose Gold",
        "ram": "8 GB",
        "detail_item": "【14\" HD Display】14.0-inch diagonal, HD (1366 x 768), micro-edge, BrightView. With virtually no bezel encircling the display, an ultra-wide viewing experience provides for seamless multi-monitor set-ups"
      }
    },
    {
      "id": "B0CWKZRXDJ",
      "name": "Replacement Screen 13.3\" for MacBook Air 13-inch Retina A1932 2018 Year（ Model：EMC 3184 MRE82LL/A MVH82LL MREA2 MREC2 MREE2 MREF2 MRE92 ） Full LCD Screen Display Assembly (Silver)",
      "ratings": 3,
      "price": "$179.99",
      "image": "https://m.media-amazon.com/images/I/71idtYshETL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "This screen is suitable: Only For A1932(2018).You can do this by flipping your laptop over and finding a tab at the bottom that contains device information. If you are unable to confirm the model of your machine when placing an order, you can send us a message to inquire     Fix Screen Issues: Can be used for display damage, repair cracked, broken, pixel distortion, LCD dead, color error problems, screen malfunction and other problems, make your device brand new     High quality screen: The screen is made of original display, original camera, 60HZ support, original driver link board, original quality aluminum. Strictly QC make sure every single screen has worked normally before shipment     Easy Installation: Our screen replacement is user-friendly with a detailed manual and video guide.Please keep in mind that disconnect the power supply before installation     Package Includes: 1x LCD screen replacement(a complete upper part but not a complete laptop.LCD and back cover and cable and webcam and Back light), 1x installation guide, 1x tool kit (screwdrivers, pry tool, spudger, tweezers)     Note:When you've installed the replacement screen, the Notebook Computers may not boot until you plug in the power supply. After installation, reconnect power and activate the screen. For any issues, free to reach us anytime",
      "details": {
        "brand": "N/A",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "N/A",
        "detail_item": "This screen is suitable: Only For A1932(2018).You can do this by flipping your laptop over and finding a tab at the bottom that contains device information. If you are unable to confirm the model of your machine when placing an order, you can send us a message to inquire"
      }
    },
    {
      "id": "B0D4YRWFHJ",
      "name": "USB C to HDMI 2.1 Adapter (8K@60Hz,4K@120Hz/60Hz), Tpye C to HDMI Converter Compatible with Thunderbolt 3/4, USB 3.1/4 for iPhone 15 Series, MacBook Pro/Air, Tablets, Laptops, Galaxy S24",
      "ratings": 23,
      "price": "$21.99",
      "image": "https://m.media-amazon.com/images/I/61ZBVhMoQbL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Vivid 3D Effect Video Synchronization: The USB C to HDMI 2.1 adapter supports resolutions up to 8K 60Hz and is backwards compatible with 4K@120Hz/60Hz, 2K@165Hz/144Hz/120Hz to avoid visual fatigue caused by low refresh rates. Expandable/mirrorable to a larger screen for a crystal clear visual experience. Supports Dynamic HDR, DSC, HDCP 2.2&2.3, 3D, 8K UHD, Dolby Atmos and more. (Note: Only supports unidirectional transmission from USB C to HDMI)     Wide Range of Compatibility: Type C to HDMI adapter is compatible with all USB C devices on laptops, tablets and smartphones that support \"DP Alt Mode\" and Thunderbolt 3/4 ports; compatible with MacBook Pro 2023, MacBook Air 2023, iMac Pro 2021/2023, Mac Mini 2023, supports M1/M2 devices, Surface Pro 7, Surface Laptop 3/4, Chromebook x360, Dell XPSPS S22/S23/S24, etc. (Note: Mac OS does not support 8K due to its own limitations)     USB C to HDMI Ultra HD Adapter: with this adapter, your Type C devices can watch sports events, movies, video games and photos/albums directly on HDMI-equipped monitors/TVs/projectors, never miss the game's highlights and your favorite TV shows again. This means you won't be bothered by unstable WIFI and bad TV signal problems anymore. (Please make sure your device supports video transfer function and use HDMI 2.1 or above connection cable. Hub/Docking connection is not supported.)     Exquisite Craftsmanship, The Best Materials: Every detail of THANDBLE adapter has been carefully designed to perfection. Gold-plated connectors ensure secure, high-speed data transmission without interference. One-piece molding ensures an unbreakable connection, and the aluminium housing dissipates heat efficiently for longer use. The nylon braid maximises the service life of the cable and provides maximum safety for your long-term use.     Important: ① Please note whether your USB C source device port supports video transmission or DP Alt mode (you can usually see the DP logo next to the port) ② It is not bi-directional, and only supports uni-directional USB C source signals to HDMI displays.③ Make sure that your output device and display device support 8K resolution and connect the adapter with an HDMI2.1 cable, otherwise it will affect the display effect. (If you are not sure, please contact us, we are happy to help you!)     24 Months Warranty: THANDBLE is committed to introducing affordable, exquisite design of high quality products, we exclusively provide 24 months warranty, the best customer service and professional technical support, if you have any questions please contact us in time, we will respond quickly within 12 hours to ensure your shopping experience long-term satisfaction.",
      "details": {
        "brand": "N/A",
        "operatingSystem": "N/A",
        "hard_disk": "N/A",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "N/A",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "Grey",
        "ram": "N/A",
        "detail_item": "Vivid 3D Effect Video Synchronization: The USB C to HDMI 2.1 adapter supports resolutions up to 8K 60Hz and is backwards compatible with 4K@120Hz/60Hz, 2K@165Hz/144Hz/120Hz to avoid visual fatigue caused by low refresh rates. Expandable/mirrorable to a larger screen for a crystal clear visual experience. Supports Dynamic HDR, DSC, HDCP 2.2&2.3, 3D, 8K UHD, Dolby Atmos and more. (Note: Only supports unidirectional transmission from USB C to HDMI)"
      }
    },
    {
      "id": "B0DB1MWKWW",
      "name": "ACEMAGIC Laptop Computer Powered by Intel N95 Processor, 16GB DDR4 RAM 512GB SSD Laptop with 15.6 inch FHD, WiFi, BT5.0, Type_C, Business Home PC",
      "ratings": 9,
      "price": "$359.99",
      "image": "https://m.media-amazon.com/images/I/71ekMQLXobL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "【POWERFUL PEFORMANCE】 ACEMAGIC AX15 Laptop powered by latest Intel 12th generation Alder Lake N95 processor (4C/4T, 6MB Cache, base frequency 1.7GHz, up to 3.4GHz). The performance of N95 (10nm) is much higher than Pentium N5030 or Celeron N5095. Integrated Intel UHD graphics up to 1200MHz, with stronger graphics processing capability, easy to realize your multi-tasking.     【15.6” IMMERSIVE VISUALS】This 15.6 inch laptop features an innovative thin-bezel display that provides more usable onscreen space for immersive viewing. It also enables a larger screen to fit into a smaller chassis, giving you a laptop with a more compact footprint. Built-in 720P front camera centered above the screen frame, take pictures or make video calls at any time.     【16GB RAM & 512GB ROM】The notebook comes with 16GB DDR4, which has more space and is faster than DDR3-equipped machines by 50%. Built-in 512GB M.2 SSD, enough storage to ensure smooth system while saving more personal files. Support expansion of 128GB TF card. Pre-installed Windows 11 out of the box and ready to use after initial system setup.     【THIN AND DURABLE DESIGN】This slim laptop is only 3.75Ibs and 0.66 inches thin, meaning it will easily slip into a backpack to be taken anywhere you need to go. Metal design of AD shell, pressure-resistant and anti-collision. A cleverly designed 180° lay-flat hinge on the laptop makes it easy to share content or collaborate with friends.     【ACEMAGIC CARE FOR YOU】The package contains AX15 laptop x 1, power adapter x 1, instruction manual x 1. ACEMAGIC offer lifetime technical support and 12 months quality protection for customers. If you have any questions about laptops, we will serve you within 12 hours.",
      "details": {
        "brand": "ACEMAGIC",
        "operatingSystem": "Windows 11",
        "hard_disk": "512 GB",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "AX15",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "Grey",
        "ram": "16 GB",
        "detail_item": "【POWERFUL PEFORMANCE】 ACEMAGIC AX15 Laptop powered by latest Intel 12th generation Alder Lake N95 processor (4C/4T, 6MB Cache, base frequency 1.7GHz, up to 3.4GHz). The performance of N95 (10nm) is much higher than Pentium N5030 or Celeron N5095. Integrated Intel UHD graphics up to 1200MHz, with stronger graphics processing capability, easy to realize your multi-tasking."
      }
    },
    {
      "id": "B07XL4JHXR",
      "name": "SAMSUNG Galaxy Chromebook 4 11.6” 64GB Laptop Computer w/ 4GB RAM, Gigabit WiFi, HD Intel Celeron Processor, Compact Design, Military Grade Durability, US Version, Silver",
      "ratings": 4.27,
      "price": "$599.99",
      "image": "https://m.media-amazon.com/images/I/71zVjr-snpL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "JUST YOUR SIZE: Compact, light design with an 11.6-inch display and full-sized keyboard and trackpad     MILITARY-GRADE DURABILITY: Samsung Chromebook 4 is made to handle bumps and drops     ULTRA-FAST CONNECTIVITY: With a lightning-fast Gigabit Wi-Fi connection, stream videos or download massive files quickly     ADVANCED SECURITY: Multiple layers of built-in virus protection ensure you always have the latest security protection     POWER THROUGH THE DAY: 12.5 hours² of battery life, and a battery that quickly recharges over USB-C charger     GOOGLE ASSISTANT ENABLED: Use your voice to make a request and Google Assistant will get it done     Meets eight military-grade (MIL-STD-810G) standards including: transit drop, vibration, high temperature, temperature shocks, freezing, dust, humidity, low pressure. ²A Measured according to Google Scenario (Power Load Test) criteria. (Tested Product Specifications: Intel Celeron Processor N4000 / 4GB Memory / 32GB eMMC). Battery life may vary depending on network environment, usage patterns and other factors",
      "details": {
        "brand": "SAMSUNG",
        "operatingSystem": "Chrome OS",
        "hard_disk": "64 GB",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "Chromebook 4",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "Silver",
        "ram": "4 GB",
        "detail_item": "JUST YOUR SIZE: Compact, light design with an 11.6-inch display and full-sized keyboard and trackpad"
      }
    },
    {
      "id": "B083Z8K6D9",
      "name": "ASUS ZenBook Duo UX481 14” FHD NanoEdge Bezel Touch, Intel Core i7-10510U, 16GB RAM, 1TB PCIe SSD, GeForce MX250, Innovative ScreenPad Plus, Windows 10 Pro - UX481FL-XS74T, Celestial Blue",
      "ratings": 411,
      "price": " ",
      "image": "https://m.media-amazon.com/images/I/814LADIi8NL.__AC_SY300_SX300_QL70_FMwebp_.jpg",
      "description": "ScreenPad Plus: 12.6 inch matte touchscreen, giving your endless way to optimize your multitasking experience by extending the screen or split windows and apps on both displays     14 inch Full HD NanoEdge touchscreen glossy main display     Latest 10th generation Intel Core i7-10510U Processor (8M Cache, up to 4.9 GHz) with NVIDIA GeForce MX250     Detachable palm rest, sleeve and ASUS active stylus pen included     Fast storage and memory featuring 1TB PCIe NVMe SSD with 16GB RAM",
      "details": {
        "brand": "ASUS",
        "operatingSystem": "Windows 10 Pro",
        "hard_disk": "1 TB",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "ZenBook Pro Duo",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "Celestial Blue",
        "ram": "16 GB",
        "detail_item": "ScreenPad Plus: 12.6 inch matte touchscreen, giving your endless way to optimize your multitasking experience by extending the screen or split windows and apps on both displays"
      }
    },
    {
      "id": "B0CVBJ8FGG",
      "name": "SAMSUNG 14\" Galaxy Book4 Pro Business Laptop, Wi-Fi PC Computer, Windows 11 PRO, Intel Core 5 Ultra 125H / 16GB / 512GB, 3K AMOLED Touchscreen, 2024 Model, NP944XGK-KG2US, Moonstone Gray",
      "ratings": 32,
      "price": "$1,449.99",
      "image": "https://m.media-amazon.com/images/I/6131ZgIFn1L.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "POWER FOR YOUR MOST PRODUCTIVE DAYS: Galaxy Book4 Pro models come with a new Intel Core Ultra 7 processor 155H or Intel Core Ultra 5 processor 125H with a higher-performance Intel ARC graphics & newly added AI neural processing unit (NPU)     POWERFUL. LIGHT. AMAZINGLY SLIM: Galaxy Book4 Pro is the epitome of portability and the lightest in our all-new Galaxy Book4 Series; 16” Thickness: 12.5mm, Weight: 3.44 lbs; 14\" Thickness: 11.6mm, Weight: 2.71 lbs     BRACE YOURSELF FOR THE ULTIMATE SCREEN EXPERIENCE: Tackle your workday on a spacious 14\" or 16\" Dynamic AMOLED 2X touchscreen; New anti-reflective screen with Vision Booster reduces glare and improves picture clarity in bright lighting conditions     A PACKED BATTERY FOR YOUR STACKED DAYS: Achieve your goals – and more – with a long-lasting battery that goes the distance; 16”: 76Wh (Typical) 65W Adapter; 14”: 63Wh (Typical) 65W Adapter     OUR MOST ADVANCED GALAXY BOOK SECURITY YET: Bring your business ideas to life with our most advanced Galaxy Book security available; Secured Core PC and now secured by Knox to help protect your enterprise data from attacks below the OS layer     HIGH-QUALITY CALLS. UNHINDERED PRODUCTIVITY: Collaborate seamlessly on video calls with a high-quality FHD camera, AKG Quad speakers with Dolby Atmos, and studio-quality dual microphones with bi-directional AI noise canceling     SEAMLESS WORKFLOW: Sync this laptop with other Galaxy devices for a new level of productivity; Pair it with your Samsung smartphone to effortlessly sync files and call and text from your laptop ¹; Also, use your Samsung Tab as a 2nd screen     512GB & 1TB OF BUILT-IN STORAGE: Have the files you need to succeed with up to 512GB and 1TB of built-in storage³ plus up to 2TB of expandable storage⁴",
      "details": {
        "brand": "SAMSUNG",
        "operatingSystem": "Windows 11 Pro",
        "hard_disk": "512 GB",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "GB4 Pro 14”",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "Moonstone Gray",
        "ram": "16 GB",
        "detail_item": "POWER FOR YOUR MOST PRODUCTIVE DAYS: Galaxy Book4 Pro models come with a new Intel Core Ultra 7 processor 155H or Intel Core Ultra 5 processor 125H with a higher-performance Intel ARC graphics & newly added AI neural processing unit (NPU)"
      }
    },
    {
      "id": "B091B7K5R4",
      "name": "Lenovo Thinkpad X1 Carbon G9 14\" Laptop i5-1135G7 16GB 256GB SSD W10P-New",
      "ratings": 6,
      "price": "$789.77",
      "image": "https://m.media-amazon.com/images/I/51CkdTinIZL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "i5-1135G7, Quad-core (4 core), 2.40 GHz     Iris Xe Graphics     256GB SSD     16 GB LPDDR4x",
      "details": {
        "brand": "Lenovo",
        "operatingSystem": "Windows 10 Pro",
        "hard_disk": "512 GB",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "Thinkpad X1 Carbon G9",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "Black",
        "ram": "16 GB",
        "detail_item": "i5-1135G7, Quad-core (4 core), 2.40 GHz"
      }
    },
    {
      "id": "B0D21LH2SK",
      "name": "jumper Laptop, 16 Inch FHD IPS 1200p Screen, Quad Core CPU, 4GB LPDDR4 RAM 128GB ROM, Office 365 1-Year Subscription, Windows 11 Computer with Numeric Keypad, 4 Stereo Speakers, WiFi.",
      "ratings": 26,
      "price": "$399.99",
      "image": "https://m.media-amazon.com/images/I/81Dr+87AZGL._AC_SX300_SY300_.jpg",
      "description": "【16\" Full-View HD Screen】Enjoy a vibrant visual experience on the 16 Inch Full HD IPS display with a resolution of 1920 x 1200 pixels. A stunning 16 : 10 widescreen display with 93% screen-to-body ratio gives you morespace to watch movies, edit photos, or brows the web.     【4-Core 4-Thread Powerful CPU】Jumper Laptop with the Quad-core powerful processor, 4GB DDR4 RAM and 128GB Storage built-in, so experience smooth multitasking and responsive performance, whether you're working on documents, streaming videos, or running applications. Besides, it equipped with a separate SSD and TF card expansion slot that supports 1TB M.2 SSD and 256GB TF expansion.     【1 Year Office-365 Subscription】 S5MAX Laptop comes with a 1 year licence of office 365 pre-installed, for all your daily computing needs. An ideal laptop for basic home use and kids school work with Word、Excel、PowerPoint、Outlook、OneNote.     【Four Stereo Speakers】 This Ultrabook comes with four high quality stereo speakers for a more immersive sound experience, and the large screen with stereo speakers makes watching videos as immersive as it is.     【One Year Warranty】We provide 1 year warranty for customers who buy this product. Do more with greater peace of mind thanks to 365 days warranty service. If you have any questions, please feel free to contact customer service. We will answer your questions and solve your problems within 24 hours.",
      "details": {
        "brand": "jumper",
        "operatingSystem": "Windows 11",
        "hard_disk": "128 GB",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "EZbook S5Max",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "Black",
        "ram": "4 GB",
        "detail_item": "【16\" Full-View HD Screen】Enjoy a vibrant visual experience on the 16 Inch Full HD IPS display with a resolution of 1920 x 1200 pixels. A stunning 16 : 10 widescreen display with 93% screen-to-body ratio gives you morespace to watch movies, edit photos, or brows the web."
      }
    },
    {
      "id": "B0DKZ9DCDX",
      "name": "ITS-LAPTOP-MAC-DEV-16-M3P",
      "ratings": null,
      "price": "$9,999.99",
      "image": "https://m.media-amazon.com/images/I/71Od6OCgI3L.__AC_SY300_SX300_QL70_FMwebp_.jpg",
      "description": "Powerful Performance: Equipped with the latest M3 Pro chip, this MacBook Pro delivers lightning-fast processing speeds for seamless multitasking and demanding applications.     Retina Display: Enjoy stunning visuals with the vibrant Retina display, offering exceptional color accuracy and crisp details for an immersive viewing experience.     Long-Lasting Battery: With up to 20 hours of battery life, this MacBook Pro keeps you productive on the go without frequent recharging.     Thunderbolt Connectivity: Featuring multiple Thunderbolt ports, you can easily connect high-performance peripherals, external displays, and fast data transfer devices.     Sleek and Portable: Crafted with a slim, lightweight design, this MacBook Pro is highly portable, allowing you to work efficiently wherever you go.",
      "details": {
        "brand": "Generic",
        "operatingSystem": "macOS 12 Monterey",
        "hard_disk": "512 GB",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "MacBook Pro",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "Black",
        "ram": "36 GB",
        "detail_item": "Powerful Performance: Equipped with the latest M3 Pro chip, this MacBook Pro delivers lightning-fast processing speeds for seamless multitasking and demanding applications."
      }
    },
    {
      "id": "B0DGQNXK7T",
      "name": "Laptops, 8GB DDR4 512GB SSD, 17.3 Inch Laptop Computer, Notebook with Celeron Processor(up to 2.8 GHz), 8000mAh, Webcam, Type-C, USB3.2 * 2, Dual WiFi, Mini HDMI(Gray)",
      "ratings": 24,
      "price": "$849.99",
      "image": "https://m.media-amazon.com/images/I/61Wh1Kws7lL.__AC_SY300_SX300_QL70_FMwebp_.jpg",
      "description": "Efficient Memory Expandable Storage: Based on 8GB Ram memory and 512GB SSD storage, the laptop computers allows you save massive daily files, transfer data and load software rapidly. Our laptops also supports 1TB TF card expansion. You can connect what you want through interfaces. Fast wireless WiFi 5.0 and Bluetooth 4.2, 2xUSB 3.0, Mini HDMI, Micro SD card Slot, Type-C port , TF card slot     Powerful configuration: The laptop computers with Celeron N4020C processor, turbo frequency up to 2.8 GHz. You can smoothly run programs, applications and browser tabs.The laptop brings you noiseless heat dissipation without fans but heat dissipation hole. Dust Filter can effectively prevent dust from entering the computer     Beautiful Large Display：The 17.3 inch laptop come with IPS display features stunning FHD resolution (1920 x 1080 pixels). With true-to-life colors and incredible contrast, the narrow-edge display of Naclud laptop definitely feast your eyes. The text is sharp and clear, and the colors are more vivid. Also it enable you enjoy photos, movies and games in high quality     Long Lasting Battery: Equipped with a 8000 mAh rechargeable battery, the laptops suffices for all-day business activities or continuous classes, lasting up to 8 hours and providing up to 8 hours of battery life, convenient for travel     Worry-free Service: Naclud provides you comprehensive service and gets you free from any worry with 1 year warranty period. If you have any questions, please contact us and we will give you prompt response to help you solve the problem",
      "details": {
        "brand": "Naclud",
        "operatingSystem": "Windows 11",
        "hard_disk": "512 GB",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "Naclud-M17PRO",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "Gray",
        "ram": "8 GB",
        "detail_item": "Efficient Memory Expandable Storage: Based on 8GB Ram memory and 512GB SSD storage, the laptop computers allows you save massive daily files, transfer data and load software rapidly. Our laptops also supports 1TB TF card expansion. You can connect what you want through interfaces. Fast wireless WiFi 5.0 and Bluetooth 4.2, 2xUSB 3.0, Mini HDMI, Micro SD card Slot, Type-C port , TF card slot"
      }
    },
    {
      "id": "B0BT711BTC",
      "name": "SAMSUNG 14\" Galaxy Book3 Pro Business Laptop Computer/Windows 11 PRO / 16GB / 1TB, 13th Gen Intel® Core™ i7 processor, Intel® Evo™ platform, Lightweight, 2023 Model, NP944XFG-KC1US, Graphite",
      "ratings": 109,
      "price": "$1,478.91",
      "image": "https://m.media-amazon.com/images/I/61NJFoSS0rL.__AC_SY300_SX300_QL70_FMwebp_.jpg",
      "description": "Intel Core i7 2.20 GHz processor provides lightning fast speed and peak performance for the toughest of tasks and games     With 16 GB of memory, users can run many programs without losing execution     The 14\" 2880 x 1800 screen provides a great movie watching experience     Career-accelerating speed: Newest 13th-gen Intel Core processor. Stream webinars and video conferences with ease.",
      "details": {
        "brand": "SAMSUNG",
        "operatingSystem": "Windows 11 Pro",
        "hard_disk": "1 TB",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "Galaxy Book3 Pro",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "Graphite",
        "ram": "16 GB",
        "detail_item": "Intel Core i7 2.20 GHz processor provides lightning fast speed and peak performance for the toughest of tasks and games"
      }
    },
    {
      "id": "B0B2D75KT3",
      "name": "HP Newest 14\" Ultral Light Laptop for Students and Business, Intel Quad-Core N4120, 8GB RAM, 128GB Storage(64GB eMMC+64GB Ghost Manta SD), 1 Year Office 365, Webcam, HDMI, WiFi, USB-A&C, Win 11 S",
      "ratings": 65,
      "price": "$289.99",
      "image": "https://m.media-amazon.com/images/I/8199vwvMqVL.__AC_SY300_SX300_QL70_FMwebp_.jpg",
      "description": "【14\" HD Display】14.0-inch diagonal, HD (1366 x 768), micro-edge, BrightView. With virtually no bezel encircling the display, an ultra-wide viewing experience provides for seamless multi-monitor set-ups     【Processor & Graphics】Intel Celeron N4120, 4 Cores & 4 Threads, 1.10 GHz Base Frequency, Up to 2.60 GHz Burst Frequency, 4 MB Cahce, Intel UHD Graphics 600, Handle multitasking reliably with the perfect combination of performance, power consumption, and value     【RAM & Storage】8GB high-bandwidth DDR4 Memory (2400 MHz), Adequate high-bandwidth RAM to smoothly run multiple applications and browser tabs all at once. 64GB high-speed eMMC Storage for your office and webinar needs     【Ports】1 x USB 3.1 Type-C ports, 2 x USB 3.1 Type-A ports, 1 x HDMI, 1 x Headphone/Microphone Combo Jack, and there's a microSD slot     【Windows 11 Home in S mode】You may switch to regular windows 11: Press \"Start button\" bottom left of the screen; Select \"Settings\" icon above \"power\" icon;Select \"Activation\", then Go to Store; Select Get option under \"Switch out of S mode\"; Hit Install. (If you also see an \"Upgrade your edition of Windows\" section, be careful not to click the \"Go to the Store\" link that appears there.)",
      "details": {
        "brand": "HP",
        "operatingSystem": "Windows 11 Home",
        "hard_disk": "64 GB",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "HP",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "Rose gold",
        "ram": "8 GB",
        "detail_item": "【14\" HD Display】14.0-inch diagonal, HD (1366 x 768), micro-edge, BrightView. With virtually no bezel encircling the display, an ultra-wide viewing experience provides for seamless multi-monitor set-ups"
      }
    },
    {
      "id": "B0D97S42HH",
      "name": "ACEMAGIC Laptop Computer, Traditional Laptop Computer(Up to 3.4GHz), 16GB DDR4 512GB SSD, 15.6 inch 1080P FHD Laptop,Windows 11 Laptop with Metal Shell,WiFi, BT5.0, Speaker",
      "ratings": 8,
      "price": "$359.99",
      "image": "https://m.media-amazon.com/images/I/71LSGdmSK8L.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "【POWERFUL CAPABILITIES】 ACEMAGIC AX15 laptop powered by latest 12th generation Alder Lake N95 processor (4C/4T, 6MB Cache,15W, base frequency 1.7GHz, up to 3.4GHz, Lithography), performance is much higher than Celeron N5095 or Pentium N5030. Also built-in 16GB DDR4 and 512GB SSD for more powerful multitasking capabilities.     【IMMERSIVE IPS DISPLAY】This 15.6 inch laptop computer features an innovative thin-bezel display that provides more usable onscreen space for immersive FHD viewing. It also enables a larger screen to fit into a smaller chassis, giving you a laptop with a more compact footprint. Built-in front webcam centered above the screen frame, take photos or video calls at any time.     【NO LATENCY CONNECTION】The laptop computer designed with HDMI Type A X 1, USB2.0 X 1, USB3.2 X 2, Type_C(Data) ×1, 3.5mm Headphone jack X 1, 128GB TF Card Socket X 1, Type_C DC Jack X 1. Notebook computer comes with 802.11ac WiFi, providing high-speed transmission and download. Bluetooth 5.0 for easy and stable connection of additional devices within range.     【LONG BATTERY LIFE】 Take this laptop pc with you anywhere without bringing the power adaptor. Its 38Wh long battery life gives you the flexibility to work or play anywhere for 5 hours. Equipped with cooling fans to ensure continuous work while minimizing noise, so you won't be distracted while working on spreadsheets or watching movies.     【ACEMAGIC CARE FOR YOU】 This slim laptop will easily slip into a backpack to be taken anywhere you need to go. With a flat hinge allowing laptop to 180°. The metal body is designed to withstand pressure and collision. We offer lifetime technical support and 12 months quality warranty for customers. If you have any questions in use, please feel free to contact us.",
      "details": {
        "brand": "ACEMAGIC",
        "operatingSystem": "Windows 11",
        "hard_disk": "512 GB",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "AX15",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "Gray",
        "ram": "16 GB",
        "detail_item": "【POWERFUL CAPABILITIES】 ACEMAGIC AX15 laptop powered by latest 12th generation Alder Lake N95 processor (4C/4T, 6MB Cache,15W, base frequency 1.7GHz, up to 3.4GHz, Lithography), performance is much higher than Celeron N5095 or Pentium N5030. Also built-in 16GB DDR4 and 512GB SSD for more powerful multitasking capabilities."
      }
    },
    {
      "id": "B0CCRMZDJ3",
      "name": "ApoloSign Windows Laptop, 12GB RAM, 512GB SSD(Expandable 1T) 15.6-inch Laptop Computer, 1080P FHD Display, Intel Jasper Lake N5095, Up to 2.8GHz Slim Computer with 2.4G/5G WiFi, 2 Speakers-Gray",
      "ratings": 46,
      "price": "$259.99",
      "image": "https://m.media-amazon.com/images/I/71SKrnHs6LL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "[Powerful Performance]: Featuring an Intel Jasper Lake N5095 processor and 12GB of RAM, this laptop delivers exceptional speed and multitasking capabilities, perfect for work and entertainment.     [Large Storage Capacity]: Store your files, documents, and media with ease using the generous 512GB SSD, ensuring fast data access and ample space for your content.     [Vivid Full HD Display]: Enjoy crystal-clear visuals on the 15.6\" Full HD IPS display, making movies, presentations, and browsing a visual delight.     [Windows 11]: Pre-installed with Windows 11, you'll have access to the latest features and a user-friendly interface, enhancing your computing experience.     [Long-Lasting Battery]: Stay productive on the go with up to 6 hours of battery life, ideal for working or streaming without interruptions.",
      "details": {
        "brand": "ApoloSign",
        "operatingSystem": "Windows 10 Home",
        "hard_disk": "512 GB",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "NJP1561P",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "Gray",
        "ram": "12 GB",
        "detail_item": "[Powerful Performance]: Featuring an Intel Jasper Lake N5095 processor and 12GB of RAM, this laptop delivers exceptional speed and multitasking capabilities, perfect for work and entertainment."
      }
    },
    {
      "id": "B0BT3KH7F3",
      "name": "MSI Stealth 15 15.6\" FHD 144Hz Gaming Laptop: Intel Core i5-13420H, RTX 4060, 16GB DDR5, 512GB NVMe SSD, USB-Type C, Cooler Boost Trinity+, Win11 Home: Core Black A13VF-038US",
      "ratings": 1.049,
      "price": "$1,125.96",
      "image": "https://m.media-amazon.com/images/I/71EciZeClTL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "Supercharged Process: The 13th Gen. Intel Core i5 processor delivers the ultimate immersive experience in gameplay, multi-task work and productivity.     Simplistic Design: Enjoy the latest generation Windows 11 Home for your everyday needs. *MSI recommends Windows 11 Pro for business use.     Beyond Fast: The NVIDIA GeForce RTX 4060 GPU powered by the Ada architecture unleashes the full glory of ray tracing, which simulates how light behaves in the real world.     FHD Display: The 15.6\" 16:9 144Hz display delivers fast refresh rate for better immersive experience     High-Speed Data: Thunderbolt 4 and DDR5-4000 memory for the fastest data transfer, system speed and responsiveness.",
      "details": {
        "brand": "MSI",
        "operatingSystem": "Windows 11 Home",
        "hard_disk": "512 GB",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "Stealth 15 A13VF-038US",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "16 GB",
        "detail_item": "Supercharged Process: The 13th Gen. Intel Core i5 processor delivers the ultimate immersive experience in gameplay, multi-task work and productivity."
      }
    },
    {
      "id": "B0C3P346B4",
      "name": "Razer Blade 16 Gaming Laptop: NVIDIA GeForce RTX 4080-13th Gen Intel 24-Core i9 HX CPU - 16\" Dual Mode Mini LED (4K UHD+ 120Hz & FHD+ 240Hz) - 32GB RAM - 1TB SSD - Windows 11 - Chroma RGB - Mercury",
      "ratings": 101,
      "price": "$2,999.99",
      "image": "https://m.media-amazon.com/images/I/71TPIY0nmeL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "NVIDIA GEFORCE RTX 4080 GRAPHICS: Packed for pure performance with 1.50 gPD (Graphics Power Density) and delivers up to 35% more graphic power per inch than any other 16 inch gaming laptop.Connectivity Technology : Bluetooth 5.3     13TH GEN INTEL CORE I9 13950HX PROCESSOR: From full-blown AAA gaming to full-on content creation, run resource-intensive tasks flawlessly with the most powerful mobile processor leveraging desktop-grade silicon     NEXT GEN DUAL-MODE MINI LED DISPLAY: Switch between ultra-sharp 4K for creative work and ultra-fast refresh rates for silky-smooth gameplay, backed by 1K nits peak brightness and 100% DCI-P3 color accuracy     16 INCH DISPLAY IN A 15 INCH BODY: Built with similar chassis dimensions to a typical 15” gaming laptop, it's just as ultra-portable yet offers even more screen real estate—a solution that’s the best of both worlds     ULTRA-COMPACT GAN CHARGER (UP TO 330W): Stay ready to go with a charger that’s not only faster and more power-efficient than standard adapters but also up to 60% smaller     ANODIZED ALUMINUM UNIBODY: CNC-milled from a single aluminum block, the chassis achieves optimal strength-to-weight ratio and is anodized with a matte black finish for a smooth, scratch-resistant surface",
      "details": {
        "brand": "Razer",
        "operatingSystem": "Windows 11",
        "hard_disk": "1 TB",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "Blade 16",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "Mercury",
        "ram": "32 GB",
        "detail_item": "NVIDIA GEFORCE RTX 4080 GRAPHICS: Packed for pure performance with 1.50 gPD (Graphics Power Density) and delivers up to 35% more graphic power per inch than any other 16 inch gaming laptop.Connectivity Technology : Bluetooth 5.3"
      }
    },
    {
      "id": "B0D4TXHWVH",
      "name": "jumper Laptop, 12GB DDR4 RAM 256GB SSD, 2.9GHz Quad-Core N5095 Processor, 15.6 inch 1080p FHD IPS Screen, 38Wh Battery, Dual Stereo Speakers, Numeric Keypad, USB3.0, Type-C.",
      "ratings": 5,
      "price": "$499.99",
      "image": "https://m.media-amazon.com/images/I/71kK-LPVT7L.__AC_SX300_SY300_QL70_FMwebp_.jpg",
      "description": "-11th Gen 4-Core Processor- This traditional computer uses a powerful Celeron N5095 Processor with a turbo frequency up to 2.9GHz, more powerful and faster than normal processors on the basic frequency without latency. The perfect combination of high performance and lower consumption helps the notebook computer to run smoothly and reliably to handle all your tasks.     -12GB+256GB+512GB Expansion- The notebook is equipped with 12GB DDR4 and 256GB high-speed SSD which lets you use it without a problem even with multi programs open. It provides large capacity for efficient operation of the most complex application and multimedia. Besides, an expandable TF card slot supports maximum 512GB TF card expansion and extensive interfaces can ensures you of an enough space to store more of your world.     -15.6 Inch 1080P FHD Screen- jumper S7 laptop computer is equiped with 15.6-inch FHD 1080p IPS high-definition screen is designed for vibrant images and incredible detail. It can let you get more comfortable watching or working , while achieving eye protection effect. You'll get immersive, brilliant colors and great clarity during a movie, e-learning, or video meeting.     -Portable and Durable- The slim case weighs only 3.5-pound and is only 0.78-inch thick so you can carry it all day without any problems. Equipped with a 38Wh/7.6V 5000mA lithium-ion battery, long battery life. It has a 6-8h long battery life and reliable performance. It is the perfect choice for you if you want to enjoy your lifestyle on the go.     【Multifunctional Connection Design】Dual stereo speakers allow you to immerse yourself in the most realistic sound. Equipped with fast connection to Bluetooth 4.2 and dual-band Wi-Fi(2.4G/5G) fast wireless. Type-C port x 1, Mini HDMI × 1, 3.5mm headphone jack x 1, USB 3.0 port x 2, Micro TF slot x 1, fast charger DC port.",
      "details": {
        "brand": "jumper",
        "operatingSystem": "Windows 11",
        "hard_disk": "256 GB",
        "screenSize": "N/A",
        "resolution": "N/A",
        "modelName": "EZbook S7",
        "special_feature": "N/A",
        "cellularTechnology": "N/A",
        "connectivity": "N/A",
        "color": "N/A",
        "ram": "12 GB",
        "detail_item": "-11th Gen 4-Core Processor- This traditional computer uses a powerful Celeron N5095 Processor with a turbo frequency up to 2.9GHz, more powerful and faster than normal processors on the basic frequency without latency. The perfect combination of high performance and lower consumption helps the notebook computer to run smoothly and reliably to handle all your tasks."
      }
    }
  ]
}