[
  {
    "id": "B0C762Y69D",
    "name": "Apple 2023 MacBook Air Laptop with M2 chip: 15.3-inch Liquid Retina Display, 8GB Unified Memory, 512GB SSD Storage, 1080p FaceTime HD Camera, Touch ID. Works with iPhone/iPad; Space Gray",
    "ratings": 2.219,
    "price": "N/A",
    "image": "https://m.media-amazon.com/images/I/81xW62KXNhL.__AC_SY445_SX342_QL70_FMwebp_.jpg",
    "description": "IMPRESSIVELY BIG, IMPOSSIBLY THIN — The 15-inch MacBook Air makes room for more of what you love with a spacious Liquid Retina display. The durable 100 percent recycled aluminum enclosure is strikingly thin and light.     SUPERCHARGED BY M2 — Get more done faster with a powerful 8-core CPU, 10-core GPU, and up to 24GB of unified memory.     UP TO 18 HOURS OF BATTERY LIFE — Go all day with the power-efficient performance of the Apple M2 chip. (Battery life varies by use and configuration. See apple.com/batteries for more information.)     SPACIOUS, BEAUTIFUL DISPLAY — The high-resolution, 15.3-inch Liquid Retina display features 500 nits of brightness, P3 wide color, and support for one billion colors for vibrant images and incredible detail. (The display on the 15-inch MacBook Air has rounded corners at the top. When measured as a standard rectangular shape, the screen is 15.3 inches diagonally; actual viewable area is less.)     SILENT DESIGN — MacBook Air features a fanless design that runs completely silent, no matter the task.     SIMPLY COMPATIBLE — With thousands of apps optimized for Apple silicon, all your favorites are lightning fast in macOS, including Microsoft Excel and PowerPoint, Adobe Creative Cloud, and Google Workspace. And free software updates keep things running smoothly and securely. (Apps are available on the App Store. Title availability is subject to change.)     ADVANCED CAMERA AND AUDIO — Look sharp and sound great with a 1080p FaceTime HD camera and three-mic array. Immerse yourself in movies and music with a six-speaker sound system and Spatial Audio.",
    "details": {
      "brand": "Apple",
      "operatingSystem": "Mac OS",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "MacBook Air",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "Space Gray"
    }
  },
  {
    "id": "B0DFF7W3SQ",
    "name": "Apple 14\" MacBook Pro: Apple M3 Pro chip with 11?core CPU and 14?core GPU, 512 SSD - Space Black",
    "ratings": null,
    "price": "$13.59",
    "image": "https://m.media-amazon.com/images/I/51d3jJNbnhL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "Advanced M3 Pro Chip built on 3-nanometer technology for unmatched performance     Up to 22 hours of battery life for superior professional portability     World's best laptop display with Extreme Dynamic Range (XDR) and Liquid Retina XDR     Hardware-accelerated ray tracing for realistic gaming graphics     Magic Keyboard with Touch ID for secure and easy access",
    "details": {
      "brand": "Apple",
      "operatingSystem": "Mac OS",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "Apple 2023 MacBook Pro Laptop M3 Pro",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "Space Black"
    }
  },
  {
    "id": "B0B3C76P69",
    "name": "2022 Apple MacBook Pro Laptop with M2 chip: 13-inch Retina Display, 8GB RAM, 512GB ​​​​​​​SSD ​​​​​​​Storage, Touch Bar, Backlit Keyboard, FaceTime HD Camera. Works with iPhone and iPad; Space Gray",
    "ratings": 1.326,
    "price": "N/A",
    "image": "https://m.media-amazon.com/images/I/61L5QgPvgqL.__AC_SY445_SX342_QL70_FMwebp_.jpg",
    "description": "SUPERCHARGED BY M2 — The 13-inch MacBook Pro laptop is a portable powerhouse. Get more done faster with a next-generation 8-core CPU, 10-core GPU and up to 24GB of unified memory.     UP TO 20 HOURS OF BATTERY LIFE — Go all day and into the night, thanks to the power-efficient performance of the Apple M2 chip.     SUSTAINED PERFORMANCE — Thanks to its active cooling system, the 13-inch MacBook Pro can sustain pro levels of performance, so you can run CPU- and GPU-intensive tasks for hours on end.     BRILLIANT DISPLAY — The 13.3-inch Retina display features 500 nits of brightness and P3 wide colour for vibrant images and incredible detail.     HD CAMERA AND STUDIO-QUALITY MICS — Look sharp and sound great with a FaceTime HD camera and three-mic array.     VERSATILE CONNECTIVITY — Two Thunderbolt ports let you connect and power high-speed accessories.     EASY TO USE — Your Mac feels familiar from the moment you turn it on, and it works seamlessly with all your Apple devices.",
    "details": {
      "brand": "Apple",
      "operatingSystem": "Mac OS",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "MacBook Pro",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "Space Gray"
    }
  },
  {
    "id": "B0CQSY56F8",
    "name": "Apple MacBook Pro 16.2\" with M3 Max Chip (Late 2023) - Space Black, 16-Core / 40-Core, 64GB, 2TB SSD",
    "ratings": 3,
    "price": "$16.96",
    "image": "https://m.media-amazon.com/images/I/51cGynjGGVL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "Up To 22 Hours Of Battery Life - Go all day thanks to the power-efficient design of Apple silicon. MacBook Pro delivers the same exceptional performance whether it's running on battery or plugged in     Responsive Unified Memory And Storage - Up to 128GB (M3 Max) of unified memory makes everything you do fast and fluid. Up to 8TB (M3 Max) of superfast SSD storage launches apps and opens files in an instant     Brilliant Pro Display - The 16.2\" Liquid Retina XDR display features Extreme Dynamic Range, 1000 nits of sustained brightness for stunning HDR content, up to 600 nits of brightness for SDR content, and pro reference modes for doing your best work on the go     Fully Compatible - All your pro apps run lightning fast-including Adobe Creative Cloud, Apple Xcode, Microsoft 365, SideFX Houdini, MathWorks MATLAB, Medivis SurgicalAR, and many of your favorite iPhone and iPad apps. And with macOS, work and play on your Mac are even more powerful. Elevate your presence on video calls     Advanced Camera And Audio - Look sharp and sound great with a 1080p FaceTime HD camera, a studio-quality three-mic array, and a six-speaker sound system with Spatial Audio",
    "details": {
      "brand": "Apple",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "1080p",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "Wi-Fi, USB",
      "color": "N/A"
    }
  },
  {
    "id": "B0DHVRD4H3",
    "name": "ACEMAGIC Laptop Computer with Intel N95 Windows Laptop 16GB DDR4 512GB M.2 2280 SSD Traditional Laptops 15.6-inch IPS FHD Windows11 WIFI5 BT5.0 HDMI Type-C USB Home Laptops Office Laptops Mini Laptop",
    "ratings": 6,
    "price": "$359.99",
    "image": "https://m.media-amazon.com/images/I/71a9qqA0GiL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "【Powerful Peformance】 ACEMAGIC AX15 Laptop powered by latest Intel 12th generation Alder Lake N95 processor (4C/4T, 6MB Cache, base frequency 1.7GHz, up to 3.4GHz). ACEMAGIC laptops makes it easy to qualify for your PC work and online surface which have amazing loading and processing power for a smoother laptop used experience     【Huge Capacity Storage】ACEMAGIC laptop computer comes with 16GB DDR4, which can reduce read latency of memory data and improve CPU utilization. Built-in 512GB M.2 SSD, enough storage to ensure smooth system while saving more personal files. Pre-installed Windows 11 operating system out of the box and ready to use after initial system setup. Acemagic windows laptop offers fast startup and loading of applications, as well as a large amount of storage space for your various files     【15.6-inch IPS Screen】Acemagic laptop computer features an innovative thin-bezel display that provides more usable onscreen space for immersive viewing. AX15 laptops integrates with Intel UHD Graphics delivers to strong graphics processing like a rich level of image detail which can watch online videos like HBO, Netflix. Also, editing pictures are with no difficulty     【Rich Interfaces & Wireless Connectivity】 Traditional laptop computers offers a variety of connectivity options, including HDMI, Type-C and USB ports. You can easily connect to various devices and peripherals to expand your capabilities. Mini laptop equipped with WiFi5 & Bluetooth 5.0 which offer strong wireless signal, fast wireless connections, and reliable transmission speed     【Portable Design & Durable】Acemagic laptop computers compact design makes it easy to carry with you wherever you go. Also, you can enjoy the benefits of a powerful laptop without the bulk of a traditional desktop. acemagic laptop are built with high-quality components and designed to handle heavy workloads and deliver consistent performance and longevity. We offer lifetime technical support and 12 months repair for customers",
    "details": {
      "brand": "ACEMAGIC",
      "operatingSystem": "Windows 11",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "AX15",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "Gray"
    }
  },
  {
    "id": "B0DDWR2FWL",
    "name": "LEIRUI 80Gbps for Thunderbolt 5 Cable 8K@60Hz 4K@540Hz/144Hz USB C to USB C Monitor Video Display Cable 240W PD Fast Charging USB4 V2 Cable for iPhone 15 Thunderbolt 4 Docking eGPU MacBook (1 FT)",
    "ratings": 23,
    "price": "$22.99",
    "image": "https://m.media-amazon.com/images/I/31hJV7-8BOL._SY445_SX342_QL70_FMwebp_.jpg",
    "description": "Full functions USB C to USB C Cable: Compatible with Thunderbolt 5 cable is leveraging the latest USB4 V2, DisplayPort 2.1 and PCI Express Gen 4 standards to boost performance while maintaining outstanding simplicity and reliability. Full for all Thunderbolt 4, USB4 devices, while also being fully backward compatible with USB 2.0 / 3.0, USB 3.2 Gen 1 Gen 2 / USB 3.2 Gen 2x2 and Thunderbolt 3 devices     80Gbps High Speed USB-C Data Cable: Built on USB-IF standards, USB4 V2 cable compatible with Thunderbolt 5 cable It will deliver 80 Gbps of bi-directional bandwidth, and with Bandwidth Boost it will provide up to 120 Gbps for the best display experience, providing outstanding display and data connections. USB C Thunderbolt 5 cable will meet the high bandwidth needs of content creators and gamers     Dual 8K or 6K USB-C Video Monitor Cable: UHD 8K crystal-clear USB C display cable for content creators, gamers and professionals. Support a 4k@540Hz high-resolution displays and low-latency visuals while working with increasingly larger video and data files. Also support dual 8K/6K@60Hz or triple 4K@144Hz displays.This provides up to 3x more video bandwidth than Thunderbolt 4, and up to 50% more video bandwidth than DisplayPort 2.1 (UHBR20)     240W PD Fast Charging USB-C to USB-C Cable: USB4 V2 cable compatible with Thunderbolt 5 support delivering up to 240W(48V/5A) of power. USB Power Delivery 3.1 enables quick charging of even the most demanding notebooks. Backward compatible with 100W, 140W, 180W in Extended Power Range(EPR). It is ready to provide you with enough power at any time. Equipped E-Marker chip for safety, stability, and battery protection. Support PD 3.1, QC 4.0, FCP, AFC fast charging technology     Wide Compatibility: Full for Thunderbolt 5/4/3, USB-C devices. It is perfectly suited for iPhone 15 Pro/15 Pro Max, 2016+ MacBook Pro, 2017+ Mac, 2017+ Mac Pro, 2020+ M1 MacBook Air, Surface Pro 7/8/9, Windows laptops and PCs, docking stations, external SSD, hard drives, eGPU, ChromeBook and more. [Lifetime Warranty] We’re so confident in our cables. Not for half a year, not for 18 months, but for an entire lifetime",
    "details": {
      "brand": "LEIRUI",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "N/A"
    }
  },
  {
    "id": "B0DFDSHXC5",
    "name": "Apple 14\" MacBook Pro: Apple M3 Pro chip with 12?core CPU and 18?core GPU, 1TB SSD - Space Black",
    "ratings": null,
    "price": "$39.99",
    "image": "https://m.media-amazon.com/images/I/51-zW4QXQHL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "Advanced M3 Pro Chip built on 3-nanometer technology for unmatched performance     Up to 22 hours of battery life for superior professional portability     World's best laptop display with Extreme Dynamic Range (XDR) and Liquid Retina XDR     Hardware-accelerated ray tracing for realistic gaming graphics     Magic Keyboard with Touch ID for secure and easy access",
    "details": {
      "brand": "Apple",
      "operatingSystem": "Mac OS",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "Apple 2023 MacBook Pro Laptop M3 Pro",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "Space Black"
    }
  },
  {
    "id": "B0BYXRL3Y2",
    "name": "Apple MacBook Air 13.6\" with Liquid Retina Display, M2 Chip with 8-Core CPU and 10-Core GPU, 16GB Memory, 512GB SSD, 35W Dual USB-C Power Adapter, Starlight, Mid 2022",
    "ratings": null,
    "price": "$27.99",
    "image": "https://m.media-amazon.com/images/I/61-MaPX0vBL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "MacBook Air is strikingly thin and brings exceptional speed and power efficiency     M2 chip starts the next generation of Apple silicon, with even more of the speed and power efficiency of M1     Can get more done faster with a more powerful 8-core CPU     Create captivating images and animations with 10-core GPU     M2 is built using an enhanced second-generation 5-nanometer technology",
    "details": {
      "brand": "N/A",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "N/A"
    }
  },
  {
    "id": "B0D22S611G",
    "name": "140W USB C Charger Block, 8-Port USB C Fast Charging Station, 65W USB C Laptop Charging Hub Compatible with iPhone, MacBook, Galaxy, iPad,and More (K44, Black)",
    "ratings": 27,
    "price": "$49.99",
    "image": "https://m.media-amazon.com/images/I/61rKpfKjzhL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "[8-in-1 USB-C Fast Charger] With a total of 8 ports, including USB-A and USB-C, this usb a and usb c charging block is a true powerhouse.Total power output up to 140w , ensuring fast and efficient charging for all your devices. And thanks to the latest Gallium Nitride (GaN) technology, this gan charger is not only powerful but also compact, making it the perfect companion for all your charging needs. Say goodbye to slow charging and hello to convenience with our usb fast charger.     [Safety USB C Charging station]Our NanoPulse Monitoring detects current variations in mere nanoseconds, ensuring immediate response to any potential issues, safeguarding both the fast charger station and your devices.This ensures maximum charging safety by providing protection against over-current, over-voltage, short-circuit, and overheating. Your devices are safeguarded at all times, allowing you to charge with peace of mind.     [Universal Compatibility]The usb c charger block supports a broad range of charging protocols (PPS, PD3.0, QC4+, and more). Seamlessly powers over 1,000 devices from smartphones to laptops, ensuring you'll always have the right charge.     [Perfect for Travel] With its compact and portable design, this charging station doubles as a travel charger for multiple devices is ideal for on-the-go use, road trips, and family outings. It ensures you have ample ports for all your devices.Say goodbye to carrying multiple chargers,our multiple charger station ensures you have ample ports for all your devices.Don't let limited outlets slow you down – choose our Travel-Friendly usb charger station and stay powered up wherever you go.     [Package Inclusions] Along with the usb charging hub (with 8 ports), you'll receive a user guide, an unmatched 24-month protection, and lifelong technical support.",
    "details": {
      "brand": "Nubeno",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "Black"
    }
  },
  {
    "id": "B0CYBX6LYS",
    "name": "HP 14\" Laptop Stream Ultral Light for Students and Business, Quad-core Intel Celeron Processor, 16GB RAM, 256GB Storage (128GB eMMC+128GB Ghost Manta SD Card), 1 Year Office 365, HDMI, Win 11",
    "ratings": 1.943,
    "price": "$299.99",
    "image": "https://m.media-amazon.com/images/I/61F8tAynu6L.__AC_SY300_SX300_QL70_FMwebp_.jpg",
    "description": "【Processor & Graphics】Intel Celeron N4120, 4 Cores & 4 Threads, 1.10 GHz Base Frequency, Up to 2.60 GHz Burst Frequency, 4 MB Cahce, Intel UHD Graphics 600, Handle multitasking reliably with the perfect combination of performance, power consumption, and value     【14\" HD Display】14.0-inch diagonal, HD (1366 x 768), micro-edge, BrightView. With virtually no bezel encircling the display, an ultra-wide viewing experience provides for seamless multi-monitor set-ups     【RAM & Storage】Upgraded to 16GB high-bandwidth DDR4 Memory (2400 MHz), Adequate high-bandwidth RAM to smoothly run multiple applications and browser tabs all at once. 128GB high-speed eMMC Storage for your office and webinar needs. With 128GB Ghost Manta SD Card.     【Ports】1 x USB 3.1 Type-C ports, 2 x USB 3.1 Type-A ports, 1 x HDMI, 1 x Headphone/Microphone Combo Jack, and there's a microSD slot     【Windows 11 Home in S mode】You may switch to regular windows 11: Press \"Start button\" bottom left of the screen; Select \"Settings\" icon above \"power\" icon;Select \"Activation\", then Go to Store; Select Get option under \"Switch out of S mode\"; Hit Install. (If you also see an \"Upgrade your edition of Windows\" section, be careful not to click the \"Go to the Store\" link that appears there.)",
    "details": {
      "brand": "HP",
      "operatingSystem": "Windows 11",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "HP",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "Natural Silver"
    }
  },
  {
    "id": "B0DLHBYRPS",
    "name": "Apple 2024 MacBook Pro Laptop with M4 chip with 10‑core CPU and 10‑core GPU: Built for Apple Intelligence, 14.2-inch Liquid Retina XDR Display, 16GB Unified Memory, 512GB SSD Storage; Space Black",
    "ratings": null,
    "price": "N/A",
    "image": "https://m.media-amazon.com/images/I/61-oTP1X4rL.__AC_SY445_SX342_QL70_FMwebp_.jpg",
    "description": "SUPERCHARGED BY M4 — The 14-inch MacBook Pro with M4 chip gives you spectacular performance in a powerhouse laptop built for Apple Intelligence.* With all-day battery life and a breathtaking Liquid Retina XDR display with up to 1600 nits peak brightness, it’s pro in every way.*     CHAMPION CHIP — The M4 chip brings spectacular speed and capability to blaze through everyday activities and multitask across multiple productivity and pro apps.     BUILT FOR APPLE INTELLIGENCE—Apple Intelligence is the personal intelligence system that helps you write, express yourself, and get things done effortlessly. With groundbreaking privacy protections, it gives you peace of mind that no one else can access your data—not even Apple.*     ALL-DAY BATTERY LIFE — MacBook Pro delivers the same exceptional performance whether it’s running on battery or plugged in.     APPS FLY WITH APPLE SILICON — All your favorites, including Microsoft 365 and Adobe Creative Cloud, run lightning fast in macOS.*     IF YOU LOVE IPHONE, YOU’LL LOVE MAC — Mac works like magic with your other Apple devices. View and control what’s on your iPhone from your Mac with iPhone Mirroring.* Copy something on iPhone and paste it on Mac. Send texts with Messages or use your Mac to answer FaceTime calls.*     BRILLIANT PRO DISPLAY — The 14.2-inch Liquid Retina XDR display features 1600 nits peak brightness, up to 1000 nits sustained brightness, and 1,000,000:1 contrast.*",
    "details": {
      "brand": "Apple",
      "operatingSystem": "Mac OS",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "MacBook Pro",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "Space Black"
    }
  },
  {
    "id": "B0CM5MF262",
    "name": "Apple 2023 MacBook Pro Laptop M3 Max chip with 14‑core CPU, 30‑core GPU: Built for Apple Intelligence, 16.2-inch Liquid Retina XDR Display, 36GB Unified Memory, 1TB SSD Storage; Space Black",
    "ratings": 343,
    "price": "N/A",
    "image": "https://m.media-amazon.com/images/I/61IGpeq9QEL.__AC_SY445_SX342_QL70_FMwebp_.jpg",
    "description": "SUPERCHARGED BY M3 — With an 8-core CPU and 10-core GPU, the Apple M3 chip can help you blaze through everyday multitasking and take on pro projects like editing thousands of photos or 4K video.     BUILT FOR APPLE INTELLIGENCE — Apple Intelligence helps you write, express yourself, and get things done effortlessly. It draws on your personal context while setting a brand-new standard for privacy in AI. Coming in beta this fall.     UP TO 22 HOURS OF BATTERY LIFE — Go all day thanks to the power-efficient design of Apple silicon. The MacBook Pro laptop delivers the same exceptional performance whether it’s running on battery or plugged in. (Battery life varies by use and configuration. See apple.com/batteries for more information.)     FULLY COMPATIBLE — All your pro apps run lightning fast — including Adobe Creative Cloud, Apple Xcode, Microsoft 365, Medivis SurgicalAR, and many of your favorite iPhone and iPad apps. And with macOS, work and play on your Mac are even more powerful. Elevate your presence on video calls. Access information in all-new ways. And discover even more ways to personalize your Mac.     ADVANCED CAMERA AND AUDIO — Look sharp and sound great with a 1080p FaceTime HD camera, a studio-quality three-mic array, and a six-speaker sound system with Spatial Audio.     CONNECT IT ALL — This MacBook Pro features a MagSafe charging port, two Thunderbolt / USB 4 ports, an SDXC card slot, an HDMI port, and a headphone jack. Enjoy fast wireless connectivity with Wi-Fi 6E (in countries and regions where 6E is supported) and Bluetooth 5.3. Supports one external display.     ADVANCED SECURITY — Every Mac comes with industry‑leading encryption, robust virus protections, and a powerful firewall system. And free security updates help keep your Mac protected.",
    "details": {
      "brand": "Apple",
      "operatingSystem": "Mac OS",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "MacBook Pro",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "Space Black"
    }
  },
  {
    "id": "B0CX251F4X",
    "name": "Apple 2024 MacBook Air 15-inch Laptop with M3 chip: Built for Apple Intelligence, 15.3-inch Liquid Retina Display, 8GB Unified Memory, 256GB SSD Storage, Backlit Keyboard, Touch ID; Starlight",
    "ratings": 823,
    "price": "N/A",
    "image": "https://m.media-amazon.com/images/I/71NPEI1B9wL.__AC_SY445_SX342_QL70_FMwebp_.jpg",
    "description": "LEAN. MEAN. M3 MACHINE — With a powerful 8-core CPU and up to 10-core GPU, the blazing-fast MacBook Air with M3 chip is a superportable laptop that sails through work and play.     BUILT FOR APPLE INTELLIGENCE—Apple Intelligence is the personal intelligence system that helps you write, express yourself, and get things done effortlessly. With groundbreaking privacy protections, it gives you peace of mind that no one else can access your data—not even Apple.*     PORTABLE DESIGN — Lightweight and under half an inch thin, so you can take MacBook Air anywhere you go.     UP TO 18 HOURS OF BATTERY LIFE — Amazing, all-day battery life so you can leave the power adapter at home.     MORE ROOM FOR WHAT YOU LOVE — The 15.3-inch Liquid Retina display supports 1 billion colors.     LOOK SHARP, SOUND GREAT — Everything looks and sounds amazing with a 1080p FaceTime HD camera, three mics, and six speakers with Spatial Audio.     APPS FLY WITH APPLE SILICON — All your favorites, from Microsoft 365 to Adobe Creative Cloud, run lightning fast in macOS.",
    "details": {
      "brand": "Apple",
      "operatingSystem": "Mac OS",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "MacBook Air",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "Starlight"
    }
  },
  {
    "id": "B0CM5JV26D",
    "name": "Apple 2023 MacBook Pro Laptop M3 Pro chip with 11‑core CPU, 14‑core GPU: Built for Apple Intelligence, 14.2-inch Liquid Retina XDR Display, 18GB Unified Memory, 512GB SSD Storage; Space Black",
    "ratings": 642,
    "price": "N/A",
    "image": "https://m.media-amazon.com/images/I/61RJn0ofUsL.__AC_SY445_SX342_QL70_FMwebp_.jpg",
    "description": "SUPERCHARGED BY M3 — With an 8-core CPU and 10-core GPU, the Apple M3 chip can help you blaze through everyday multitasking and take on pro projects like editing thousands of photos or 4K video.     BUILT FOR APPLE INTELLIGENCE — Apple Intelligence helps you write, express yourself, and get things done effortlessly. It draws on your personal context while setting a brand-new standard for privacy in AI. Coming in beta this fall.     UP TO 22 HOURS OF BATTERY LIFE — Go all day thanks to the power-efficient design of Apple silicon. The MacBook Pro laptop delivers the same exceptional performance whether it’s running on battery or plugged in. (Battery life varies by use and configuration. See apple.com/batteries for more information.)     BRILLIANT PRO DISPLAY — The 14.2-inch Liquid Retina XDR display features Extreme Dynamic Range, 1000 nits of sustained brightness for stunning HDR content, up to 600 nits of brightness for SDR content, and pro reference modes for doing your best work on the go. (The display has rounded corners at the top. (Measured diagonally, the screen is 14.2 inches. Actual viewable area is less.)     FULLY COMPATIBLE — All your pro apps run lightning fast — including Adobe Creative Cloud, Apple Xcode, Microsoft 365, Medivis SurgicalAR, and many of your favorite iPhone and iPad apps. And with macOS, work and play on your Mac are even more powerful. Elevate your presence on video calls. Access information in all-new ways. And discover even more ways to personalize your Mac.     ADVANCED CAMERA AND AUDIO — Look sharp and sound great with a 1080p FaceTime HD camera, a studio-quality three-mic array, and a six-speaker sound system with Spatial Audio.     CONNECT IT ALL — This MacBook Pro features a MagSafe charging port, two Thunderbolt / USB 4 ports, an SDXC card slot, an HDMI port, and a headphone jack. Enjoy fast wireless connectivity with Wi-Fi 6E (in countries and regions where 6E is supported) and Bluetooth 5.3. Supports one external display.",
    "details": {
      "brand": "Apple",
      "operatingSystem": "Mac OS",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "MacBook Pro",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "Space Black"
    }
  },
  {
    "id": "B0CPNBBXFR",
    "name": "Apple MacBook Pro 16.2\" with Liquid Retina XDR Display, M3 Max Chip with 16-Core CPU and 40-Core GPU, 128GB Memory, 4TB SSD, Space Black, Late 2023",
    "ratings": 6,
    "price": "$29.99",
    "image": "https://m.media-amazon.com/images/I/51Sk9QLje9L.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "Supercharged by M3 Max     Up to 22 hours of battery life     Responsive unified memory and storage     Brilliant Pro Display     Advanced camera and audio",
    "details": {
      "brand": "Apple",
      "operatingSystem": "Mac OS",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "MacBook Pro",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "Space Black"
    }
  },
  {
    "id": "B0CM5JV268",
    "name": "Apple 2023 MacBook Pro Laptop M3 chip with 8‑core CPU, 10‑core GPU: Built for Apple Intelligence, 14.2-inch Liquid Retina XDR Display, 8GB Unified Memory, 512GB SSD Storage; Space Gray",
    "ratings": 449,
    "price": "N/A",
    "image": "https://m.media-amazon.com/images/I/61lsexTCOhL.__AC_SY445_SX342_QL70_FMwebp_.jpg",
    "description": "SUPERCHARGED BY M3 — With an 8-core CPU and 10-core GPU, the Apple M3 chip can help you blaze through everyday multitasking and take on pro projects like editing thousands of photos or 4K video.     BUILT FOR APPLE INTELLIGENCE — Apple Intelligence helps you write, express yourself, and get things done effortlessly. It draws on your personal context while setting a brand-new standard for privacy in AI. Coming in beta this fall.     UP TO 22 HOURS OF BATTERY LIFE — Go all day thanks to the power-efficient design of Apple silicon. The MacBook Pro laptop delivers the same exceptional performance whether it’s running on battery or plugged in. (Battery life varies by use and configuration. See apple.com/batteries for more information.)     BRILLIANT PRO DISPLAY — The 14.2-inch Liquid Retina XDR display features Extreme Dynamic Range, 1000 nits of sustained brightness for stunning HDR content, up to 600 nits of brightness for SDR content, and pro reference modes for doing your best work on the go. (The display has rounded corners at the top. (Measured diagonally, the screen is 14.2 inches. Actual viewable area is less.)     FULLY COMPATIBLE — All your pro apps run lightning fast — including Adobe Creative Cloud, Apple Xcode, Microsoft 365, Medivis SurgicalAR, and many of your favorite iPhone and iPad apps. And with macOS, work and play on your Mac are even more powerful. Elevate your presence on video calls. Access information in all-new ways. And discover even more ways to personalize your Mac.     ADVANCED CAMERA AND AUDIO — Look sharp and sound great with a 1080p FaceTime HD camera, a studio-quality three-mic array, and a six-speaker sound system with Spatial Audio.     CONNECT IT ALL — This MacBook Pro features a MagSafe charging port, two Thunderbolt / USB 4 ports, an SDXC card slot, an HDMI port, and a headphone jack. Enjoy fast wireless connectivity with Wi-Fi 6E (in countries and regions where 6E is supported) and Bluetooth 5.3. Supports one external display.",
    "details": {
      "brand": "Apple",
      "operatingSystem": "Mac OS",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "MacBook Pro",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "Space Gray"
    }
  },
  {
    "id": "B0CRJ1FSKS",
    "name": "Apple MacBook Pro 16.2\" with M3 Max Chip (Late 2023) - Space Black, 16-Core / 40-Core, 128GB, 4TB SSD",
    "ratings": 1,
    "price": "$21.99",
    "image": "https://m.media-amazon.com/images/I/51cGynjGGVL.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "Up To 22 Hours Of Battery Life - Go all day thanks to the power-efficient design of Apple silicon. MacBook Pro delivers the same exceptional performance whether it's running on battery or plugged in     Responsive Unified Memory And Storage - Up to 128GB (M3 Max) of unified memory makes everything you do fast and fluid. Up to 8TB (M3 Max) of superfast SSD storage launches apps and opens files in an instant     Brilliant Pro Display - The 16.2\" Liquid Retina XDR display features Extreme Dynamic Range, 1000 nits of sustained brightness for stunning HDR content, up to 600 nits of brightness for SDR content, and pro reference modes for doing your best work on the go     Fully Compatible - All your pro apps run lightning fast-including Adobe Creative Cloud, Apple Xcode, Microsoft 365, SideFX Houdini, MathWorks MATLAB, Medivis SurgicalAR, and many of your favorite iPhone and iPad apps. And with macOS, work and play on your Mac are even more powerful. Elevate your presence on video calls     Advanced Camera And Audio - Look sharp and sound great with a 1080p FaceTime HD camera, a studio-quality three-mic array, and a six-speaker sound system with Spatial Audio",
    "details": {
      "brand": "Apple",
      "operatingSystem": "N/A",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "1080p",
      "modelName": "N/A",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "Wi-Fi, USB",
      "color": "N/A"
    }
  },
  {
    "id": "B0D97Z5VTL",
    "name": "ACEMAGIC Laptop, Windows 11 Laptop Computer,16GB DDR4 512GB SSD, Quad-Core N95 Processor, 15.6\" IPS 1080P PC,180° Open Angle,Long Battery Life,Metal Shell,WiFi, BT5.0, USB3.2, Type_C",
    "ratings": 141,
    "price": "$323.98",
    "image": "https://m.media-amazon.com/images/I/71331gmRd1L.__AC_SX300_SY300_QL70_FMwebp_.jpg",
    "description": "16GB RAM & 512GB ROM: Featuring 16GB of DDR4 RAM and a speedy 512GB M.2 SSD, this traditional laptop computer offers a 50% performance boost compared to DDR3-equipped machines and ensures seamless system operation while accommodating your personal files. Support expand your storage with a 128GB TF card. The 512 GB SSD can be replaced with a maximum SSD of 2TB to provide you with ample space to record and store your files/favorites.     Efficient Performance: ACEMAGIC Laptop featuring the latest processor (4 cores/4 threads, 6MB cache, up to 3.4GHz). Its performance is far moere than 30% better than others, providing more powerful multitasking capabilities and stronger graphics processing performance. ACEMAGIC traditional laptop is designed to elevate your computing experience.     15.6\" Immersive Visuals: This 15.6 inch laptop features an innovative thin-bezel display that provides more usable onscreen space for FHD 1080P viewing. It also enables a larger screen to fit into a smaller chassis, giving you a laptop with a more compact footprint. Built-in clear front camera centered above the screen frame, take pictures or make video calls at any time. Its 38Wh long battery life gives you the flexibility to work or play anywhere for 5 hours.     No Latency Connection: The laptop computer designed with HDMI Type A X 1, USB2.0 X 1, USB3.2 X 2, Type_C(Data) ×1, 3.5mm Headphone jack X 1, 128GB TF Card Socket X 1, Type_C DC Jack X 1. AX15 laptop pc comes with 802.11ac WiFi for speeds up to three times faster than 802.11n, providing high-speed transmission and download. Bluetooth 5.0 for easy and stable connection of additional devices within range.     ACEMAGIC Care For You: This slim laptop will easily slip into a backpack to be taken anywhere you need to go with a flat hinge allowing the laptop to 180°. The metal body is designed to withstand pressure and collision. We offer unlimited technical support and 12 months of repair for customers. If you have any questions in use, please do not hesitate to reach out to us.",
    "details": {
      "brand": "ACEMAGIC",
      "operatingSystem": "window11",
      "memoryStorageCapacity": "N/A",
      "screenSize": "N/A",
      "resolution": "N/A",
      "modelName": "AX15",
      "wirelessCarrier": "N/A",
      "cellularTechnology": "N/A",
      "connectivity": "N/A",
      "color": "Grey"
    }
  }
]